{
  "video_id": "u0XrMkBOzNc",
  "url": "https://www.youtube.com/watch?v=u0XrMkBOzNc",
  "title": "Senate Day 33 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 33,
  "video_date": null,
  "duration_minutes": 136,
  "summary": "Here is a structured markdown summary of the Georgia Senate Day 33 of the 2025 Session session:\n\n**Overview**\nThe session featured the introduction of several new bills and resolutions, as well as committee reports on previously introduced legislation. There was discussion of procedural matters and recognitions of visiting students and a congressman.\n\n**Key Actions**\n- **HB 111**: No description provided\n- **HB 111**: No description provided\n- **HR 42**: No description provided\n- **SB 1**: No description provided\n- **SB 331**: No description provided\n- **SR 311**: No description provided\n\n**Bills Introduced (First Reading)**\n- SB 340: To provide for a new charter for the city of Tybee Island\n- SB 341: No description provided\n- SB 342: Related to retirement\n- SB 343: To amend code section related to children and families\n- SB 344: Related to state government\n- SB 345: Related to state government\n- SB 346: Related to state government\n- SR 410: Resolution urging action on transportation\n- SR 413: Resolution, no description provided\n- SR 414: Resolution related to transportation\n- HB 637: Related to state and local government\n- HB 732: Related to state and local government \n- HB 734: Related to state and local government\n- HB 735: Related to state and local government\n- HB 737: Related to state government\n- HB 738: Related to state government\n- HB 739: Related to state government\n- HB 741: Related to state government\n\n**Notable Moments**\n- The Senate President recognized various visiting students and a congressman.\n- There was discussion of procedural matters, including dispensing with the reading of the journal.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum or attendance details provided.\n\n**Adjournment**\nThe transcript does not indicate when the session adjourned or the date of the next session.",
  "transcript": "Good morning everyone. Good morning. The time for convene has arrived. The Senate will come to order. All on authorized visitors, please exit the chamber. I recognize the serum from the six. Good morning, Mr. President. Hope you're doing great today. We've got some people from all over the state visiting us today. Good to see my congressman here. Mr. President, I'm a little concerned. The president pro Tim is making a power play here. I just want you to notice I don't I didn't put a bucky's bag on my desk. I'm more of a Jones petroleum guy. Yeah. Yeah. I'm making notes for you. There's little thing going there. They've got a key in the bag. I'm a little disappointed. But Mr. President, we got the one from down around the Cordelia area. Got me. Like I said, I only get a Jones petroleum. Okay, good deal. Good deal. I need I like you. I got to be real chairman, didn't it? Anyway, I just want to say the senator from horse dicks. What does 45th? The center from the 45th has been very busy. He's got a lot of pages today very proud of him. At Dunwoody, Georgia, we have Matthew Basera from D'Aquila. We have Jalen Crystal from Auburn. We have the senator from the 45th daughter, Berkeley Dixon. From portal, we have Lee Draughtie from Decatur, Sophia Garate Blair from Huston. We have Katie and Glazer from Buford. We have Addison Green and Phoebe Harper from D'Aquila, Bella Hube from Huston, Aila Husby from Brazleton, Christian, Calarical from Hampton, Desiree Lawson from Huston Reese Love Lady from a from Macon Elijah Maddox from Huston. We have Derek McCollum from D'Aquila, Maddox Rodville from the great city of Moaberry. We have Brady Rudnik from Rome. We have our friend Matt Sawhill's daughter, Caroline Sawhill from Peachtree City, my neighbor. We have Aniston Spivey. We also have the Congressman here from Peachtree City from Stockbridge, Malik Street from Atlanta, Jillian Swini from Millageville, Caleb Williams and from Mill Creek, Veronica Nenece. Y'all give these pages a big round of applause. We appreciate them being here to do the people's business here in the Georgia State Senate. Mr. President, today is the 33rd of the day. There are no coincidences. I just want to tell you look forward to a great day today. All right, Senator. Thank you for doing that, Senator. Greatly appreciate it. Yeah, you got something else. Sorry, Mr. President. I move that we dispense with the reading of the journal. It has been read and found in the journal. Chair here is none of the reading of the journal is dispensed with. There's objections. Confirmation of the journal. Chair here is none and the journal is confirmed. All senators have bills and resolutions introduced. Please bring them to the Secretary's desk. First reading references the Senate bills. Mr. Secretary. Senate Bill 340 by Senator Watson. The first to be entitled to amend an act to provide for a new charter for the city of the Thaibe Island, approve April 20th. State and local government. Senate bill 341 by Senator Tilley. The 19th and others bills. We in town and acting. Thank you. Senate bill 342 by Senator Albers 56 and others. Retirement. Senate bill 343 by Senator Hatch. The 50th and others bills. We in town and act to amend. Code section. Children and family. Senate bill 344 by Senator Kennedy. The state of the state of the government. Senate bill 345 by Senator Kennedy. The state of the government. Senate bill 346 by Senator Jackson. State of the government. Senate resolution 410 by Senator Ork. The 36th and others. Resolution urging. Transportation. Senate resolution 413 by Senator Kennedy. The 18th and others. Resolution. Senate resolution 414 by Senator Kennedy. The 18th. Transportation. Mr. President, I complete the order. First read. Riverses and House bills. House bill 637 by Representative Cummings. State and local government. House bill 732. Representative Township. State and local government. House bill 734. Representative Hagan. State and local government. House bill 735. Representative Hagan, 156. The bill is between Senate and local government. House bill 737. The state of the state of the government. House bill 738 by Representative Crowley. The state of the government. House bill 739. The part of the 1 of 7 and others. The bill is between the 2 and 9. The state of the government. House bill 741 by Representative P.T. The 166. The state of the government. Mr. President, I complete the order. Secretary reports of standing committees. Mr. President, the senate can be on children and families. That's had our own consideration for the following legislation. I just struck from each port to the same back to the senate with the final recommendation. Senate resolution 310. Do pass. House bill 253. Do pass. House bill 340. Do pass. House bill 433. Do pass. We submit it. Senate Kirkpatrick. Secretary Sacken. District chairman. Governor secretary pursuant to senator old. Point says that hereby give notice I want you to say my minority port to be read along with the majority port of House bill 340 which is passed by the committee on children and families on March 18, 2025 since early senate parks. Mr. President, the senate command. Economic development and tourism has had our own consideration for legislation. I struck from each port to the same back to the senate with the final recommendation. House bill 216. Do pass. House bill 233. Do pass by. House bill 339. Do pass. House bill 454. Do pass. House bill 455. Do pass. House bill 466. Do pass. House bill 718. Do pass. We submit it. Senate Beach of the 21st district chairman. Governor secretary pursuant to senator old. Point 6. I hear by give notice I introduce a minority port to be along with the majority port of House bill 354 which is passed by the committee on economic development and tourism on March 19, 2025 since early senate mallow. Mr. President, the senate command. The senate has had our own consideration for legislation and struck from each port to the same back to the senate with the final recommendation. Senate resolution 386. Do pass. House bill 134. Do pass. House bill 144. Do pass. House bill 153. Do pass. House bill 445. Do pass. House bill 652. Do pass by. Subtítus, five minutes and a house bill or 50 second district chairman. Governor secretary pursuant to senator old. Two additional point six. I hear by give notice I will introduce a minority port is right along with the Georgia port of senate resolution 386 which is passed by the committee on finance on Wednesday, March 19, 2025 since early senate mallow. Mr. President, the senate command. Gov. oversight has had our own consideration for legislation and struck from each port to the same back to the senate with the final recommendation. House bill 113. Do pass by. Subtítus, four, four, five. Do pass by. Subtítus, five minutes and a harboring the sixth district chairman. Mr. President, the senate command. Entrance and labor has had our own consideration for legislation and struck from each port to same back to the senate with the final recommendation and asked for 94 do pass by committee. Subtítus, nine, six. Subtítus, five minutes and a walker 20th district chairman. Mr. President, the senate command. Entrance and labor has had our own consideration for legislation and struck from each port to same back to the senate with the final recommendation. House bill 85 do pass. Subtítus, seven, two, two, two, two, two, two, two, two, pass. House bill 325 do pass. House bill 327 do pass. House bill 384 do pass. House bill 3530 do pass. House bill 535 do pass. Subtítus, five minutes and a stricken low 40th district chairman. Mr. President, the senate command. Natural resources in the environment has had our own consideration and struck from each port to same back to the senate with the final recommendation. House bill 115 do pass. House bill 143 do pass. House bill 331 do pass. House bill 432 do pass. House bill 443 do pass by committee sub-situ. House bill 444 do pass. House bill 491 do pass. So, so I believe submitted. Senator Anderson, the 21th district chairman. Mr. President, the senate command and public safety has had our own consideration for the final legislation and struck from each port to same back to the senate with the final recommendation. House bill 208 do pass by committee sub-situ. Subtítus, seven minutes and an albors of 56 district chairman. Mr. President, Sen. Camián, regulated and introducing utilities that's head of under-increderation, following legislation and the struck means for the same act to the Senate with the following recommendation. Haswell 148, due pass, Haswell 155, due pass, Haswell 232, due pass by Subzuzou, Haswell 579, due pass. So, at 30 minutes and a council of the 36th district chairman. Mr. President, Sen. Camián rules, that's head of under-increderation, the following legislation, as the struck means for the same act to the Senate with the following recommendation. First of all, to send us rule 2-1.10b, the Committee on Rules, as referred to following legislation from the general calendar. Senate resolution 323 to the Committee on Rules, or strictly submitted, and the brass of the 6th district chairman. Mr. President, Sen. Camián, state institutions and property has had under-increderation, the following legislation, as the struck means for the same act to the Senate with the following recommendation. House of Resolution 121, due pass, Haswell 254, due pass, Haswell 303, due pass, Subzuzou, Haswell 579, and a harborson of the 15th district chairman. Mr. President, Sen. Camián, state and little governmental operations general, has had under-increderation, the following legislation as the struck means for the same act to the Senate with the following recommendation. House of Resolution 309, due pass, Haswell 513, due pass, Haswell 516, due pass, Haswell 647, due pass, Subzuzou, in this minute, Senator Dixon, the 45th district chairman. Mr. Secretary, pursuant to the Senate, rule 2-1.6, I hear by a given notice that I will use a minority part to read along with the majority part of Haswell 647, which is passed by the Committee on state and little governmental operation general, on March 19th, 2025, since they are at least in our Mallow. Mr. President, the state and little governmental operations, that's head under-increderation, the following legislation, as the struck means to support the same act to the Senate with the following recommendation. Senate Bill 331, due pass, Haswell 593, due pass, Senate Abels 330, due pass, Subzuzou, Senate Bill 333, due pass, Senate Abels 334, due pass, Senate Abels 335, due pass, Senate Abels 336, due passed. House of Spirit, had 68, due pass, aku, at least a minute, Senator Dixon, the 45th district chairman. Mr. President, Psychologist and Transportation, has had under-increderation, the following legislation, as the struck means for the same act to the Senate with the following recommendation. Hagesbo-14, due pass, Haswell o' 16, due pass, Heızboll 55, let you want, due pass, do pass by sub two, Haskell 555, do pass by sub two. Mr. Wathley, some minutes and a dose of all the 27 district chairman. Mr. President, Senate committee on veterans military and Homeland Security is at an orchestration, the foreign legislation is strictly to port the same act to the Senate with the foreign recommendation, Haskell 53 do pass by sub two, Haskell 108 do pass. So, select police minutes and a pane of the fit for district chairman. In the presence of secretary pursuant to Senate rule two, which one point six, I hereby give notice that I will introduce a minority reports, played along with Jordy Perot, Haskell 1 away, which is passed by the committee on veterans military and Homeland Security on March 19, 2025, since the early center of wicks and is present that completes the order. Secretary Rebells and resolutions for the second time. Senate resolution 283 by senator beach to the 21st and others, joint study committee on high restrictions surrounding Georgia airports, create House Bill 58, Senate of Richardson, 125th and others, aviation adoption of local ordinances, resolution regulations or policies that are strict, the flight of unmanned aircraft systems over mass public gatherings, authorized House Bill 156, for approved Jones to the 25th and others transportation department of authority over best supports provide House Bill 164 by represent and makes the 178th and others highway bridges and ferries allowable variance for weight limitations upon a vehicle or load repeal automatic repeal from provisions, House Bill 190, some are a reserve Hawkins of the 27th and others insurance health care providers respond to a prior review agents or utility review entities attempt to discuss the patient's care detailed the effort House Bill 348 by represent of the layman's to the 112th and others insurance expand lines of insurance or re insurance in which a limited purpose subsidiary and captive insurance company main gauge has before so you can represent the column of the 30th and others state employees health insurance include high deductible health plans Mr. President I complete the order. It is now time for the morning roll call recognize the center from the 33rd. Thank you Mr. President and good morning y'all asking an admiss consent to excuse the senators from the 35th and 44th for business inside the Capitol without objects and the center from the 35th and 44 are excused any other motion to excuse. Secretary will call the roll senator signify your presence by voting the Ace switch who we got. Senator from the 43rd. Thank you Mr. President I rise ask unanimous consent to excuse the senator from the 26th. That objection center from the 26th. Thank you. Any other motions. Senator from the 33rd again. Forty what? I ask unanimous consent to excuse the senator from the 40th for business outside the Capitol. That objection center from the 40th is excused any other motions. Senator from 22nd. Yes sir Mr. President unanimous consent to excuse the senator from the 44th and 41st for business outside the Capitol. That objection center from the 44th and 41st for the objects and aren't excused. Senator from the 15th. Thank you Mr. President. I ask unanimous consent to excuse the senator from the 10th. That objection center from the 10th is excused. All right. Thank you Mr. Chair. Call the roll senator signify your presence by voting the Ace switch. Secretary Unlocked Machine. Secretary Unlocked Machine. It is now time for our morning devotion. All senators please take your seats and cease all conversation. I ask that the doorkeeper secure the chamber at this time and we cut out all on this very chatter. I recognize the senator from the 19th to lead us in our pledge and introduce our chaplain of the day. Thank you Mr. President. I would like to extend for the pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God and the visible liberty and justice for all. And now to the Georgia flag. A pledge allegiance to the Georgia flag to the principals for which it stands. Members this my honor to introduce you to the pastor of the day, Pastor Brad Waters. He is from first Baptist church in Hazelhurst, Georgia. Brad was raised in Tucker and in the year 2000 he was called from the business world into ministry at the age of 30 years old. After answering God's call Brad served as the pastor of churches in Rutledge and in Monroe. He is currently the senior pastor at the first Baptist church as I said in Hazelhurst where he is faithfully served for the past 13 years. He is passionate about sharing the gospel of Christ and sharing it wherever he goes and with whomever he comes in contact with. He has been married to his wife Cheryl for the past 31 years and they have two children who paged with us earlier this year. John Lesley who you will see down there. And Catherine, who reminded me that tomorrow is down syndrome day and in honor of that we need to all make sure we wear our crazy socks. I am sure the senator from the 49th will remind us of that as well. Pastor Waters if you don't mind please come and bring us our invocation. Thank you senator Tillery, Governor Jones. I am the governor of the county of the county. I realize this is a sacrificial work that you men and women do and on behalf of our community and the communities around us we are very grateful. I want to say without taking into the time please remember Cat Stand Up and I want everybody to see you. Most beautiful girl in the room. Tomorrow is world down syndrome day and we would ask you where your crazy socks as we celebrate Cat and her community of friends the world is a much better place with cats in it. I think about that this morning. I think about one particular verse that God laid upon my heart for this time together this morning. It is a verse that if you have been in Sunday school or you have been in church or just been around pretty much life in general you know what John 316 says. It says for God so loved the world that he gave is only but gotten son. It is whoever believe it in him should not perish but have everlasting life. You know as we think about those words that is the sweetest words that ever fall from heaven to human ears. We recognize in 25 words we find out all we need to know about God and all we need to know about man. All of his glory all of his grace all of his goodness is wrapped up and packed in that one simple verse Luther called it a miniature Bible. Some have said that it's so simple a child can understand it is so complex. Theologian cannot explain it. It is truly without question the greatest verse that has ever been given to mankind. You see it tells three simple things to us this morning. It tells us first of all about the everlasting God. He is the source that is for God. You recognize he is the infinite God of creation in the beginning God created. Hebrews says God who at sundry times and diverse men are spoken times past of the fathers by the prophets. That is this creator God. He is an infinite creator God but more than that this verse teaches us that he is the intimate God of salvation. That means that he came on a specific purpose. So he is the everlasting God. The God who has no beginning has no end. You see that love that he loves us with. It never commenced and never will end. He is the everlasting God. The second thing it tells us is about an overwhelming love. You see that overwhelming love is the strength. The strength of this verse is found in two words. So love. You know I could say this morning and you would probably join with me. We say we love cat and we love our citizens that you represent and that I represent as a pastor. When you add that little word so that is a load bearing verb and it gives strength to that phrase so love. If I say I love you and then I turn and say I so love you that is a different type of love. God loves us and he so loves us. There is nothing that can describe that. You see today that love is an indescribable love. It is powerful. That love is an individual love. It is personal. That love is an initiated love. It is proactive but I believe the best part of this is that love is an inviting love. It is persuasive. When we read into it we recognize in a loveless world there is love that comes from one source and that is God and it is an overwhelming love and it is strong. It is a strong love like no other. When we think about it there is a third thing that we must look at. Not always there in everlasting God he is the source. An overwhelming love and that is the strength. I believe that there is one part of this verse that we cannot overlook. There is a perishing world and that is the scope. You say who does God love today? He loves you. He loves me. He loves the world. He is not a God who is a respecter of persons. He is an omniscient God. He is an omnipresent God. I will say to you this morning he is an omnipresent God. He loves and he sends that love toward us. Here we find the subject, the meaning of what this verse really means. It means that he is the one who loves. He loves the world and its entirety. What is the subject? Well it is found right here. Who so ever will. You say you are a who so ever will today. God loves you. He went to Calvary and died on the cross and shed his blood. In that he took care of our sin problem. He was buried in a bar of tomb and raised again the third day and from that he took care of our death problem. So you see Jesus Christ as the savior of not just a few and not just some but for the whole world. And anyone that will call upon his name, that is the subject. And I want to say to you the greatest news I can tell you in closing this morning is this. He is a wonderful savior. He is a wonderful savior and his name is Jesus. He is the same yesterday, today and forever. The Bible says we have seen and do testify that God sent the Saint Jesus to be the savior of the world, the whole world. As I think about this verse this morning, there is enough gospel in John 316 to save the world if they just believe it. If you believe it today, he will save you. If you are trusting him today, he will forgive you and he will give you eternal life and everlasting life. Because the Bible says who so ever believe it than him should not perish but have everlasting life. I think about a physician friend of mine, a dear friend, who his life had kind of run upon the rocks. And he found himself on a Saturday night sleeping in his office on his sofa. And he woke up on Sunday morning with his head kind of foggy and not really knowing which way to turn. And in his office there he turned the television on. And he looked on that television on an NFL football game. And in the end zone of that football game there was a man with a neon wig. And he had a giant piece of poster board. And that poster board said John 316. And he said I had no idea what that was. I had never heard that in my life. All I knew was that it was maybe a reference to the Word of God. And he said, there he turned and on the credenza in that lobby was a Gideon Bible. And he picked that Gideon Bible up and he said to me almost an hour to find this John 316. And he said when I found John 316, I read it. And it changed my life forever. Christ Jesus came in and friend when Jesus comes, homes are changed and lives are rearranged. Everything's different when Jesus passes by. For God so loved the world that He gave His only begotten Son. And whosoever believed within Him should not perish but have everlasting life. Would you pray with me this morning? Father, thank you. For this time that we've had will we thank you for the strongest, most powerful, sweetest first. Lord that you've sent to lost in dying man. Father, we thank you this morning for this Senate chamber and the ones that occupied. God, I pray for wisdom and Lord for discernment. Lord, that they would be like the sons of Issaacar. Lord, they'd not just know the times but they would know what to do about the times. And Father, I pray you, God, they're every step. And Lord, God, they're every decision. Thank you for this opportunity this morning to tell the old story one more time. Jesus be with us as we go through this day and we ask it in that strong, powerful, mighty and majestic name, which is above every name, the name of Jesus. Amen. Thank you. you you you you you you you you you\n\nIf I could have everyone's attention real quick, please. I can have everyone's attention. We always like to introduce and recognize our congressional delegation, the men and women that come down here and speak to us, the folks who are serving and watching DC on our behalf. We have a very special guest today, good friend of mine. He and I share the same high schools, our own mom and we're both Wilbert Academy graduates, Brian Hells from Peachtree City, Georgia, but as all, and went to college out in California at Pepperdion University. And he's always, ever since graduating from Pepperdion, he's always had a service heart. He's really always poured himself back into public service. He had the opportunity to work in the first Trump administration back in 16 and continued to work alongside President Trump after he left office in 2020 and then back into office in 2024. But opportunity came along that journey, an opportunity for him to run for Congress in his own backyard presented itself and he jumped on that opportunity and he won the decisive race of this past election cycle and he is now representing us and the people of West Georgia and in Congress right now and he's doing a wonderful job. We're glad to have him. He is really, really making some big inroads there in Washington, D.C. and we're loved to hear the update on what's going on with him, but we really appreciate him being here and coming to speak to us this chamber. So please give a warm welcome to Congressman Brian Jack. Thank you. Thank you. Well, thank you very much, Lieutenant Governor, as he mentioned, we're both graduates of Woodward Academy and for those in the gallery, I want you all to know, our Lieutenant Governor was quite the athlete. He was eight years ahead of me at Woodward, but the legend of Bert Jones persisted even when I was there. He went on to be the co-captain of the 2002 SEC Championship winning Georgia Bulldogs football team and I'm incredibly grateful for your support when I launched my campaign for Congress. When you run for Congress, you know who your friends are. He endorsed me on day one and it's something for which I will always be grateful. But before I begin, I would be remiss if I didn't acknowledge and I'd like to also offer a round of applause for someone very special to many of you in the chamber. He is my best friend. He helped run my campaign and I'd like to put on the record, which something that happened just about a month ago. He was nominated by our 47th president to serve as the Assistant Secretary of the Interior for Indian Affairs, Mr. Billy Kirkland. Congratulations. And I just know that if I had mentioned Senator Beech's name just then, the applause of been twice as loud. So I'm very grateful to have time with you all today. I wanted to speak to the Senate because for me, the Georgia Senate has always been the cradle of leadership in Georgia. Mr. Lieutenant Governor, you may know, but the last five governors of our state started their careers here in the state Senate. Among your membership as a former congressman, Mr. Burns, who decided he wanted to get a promotion and ran for the state Senate instead of Congress where I served today and our 39th president, Jimmy Carter, may he rest in peace, started his career in this very chamber. So it's no surprise that many of you are considered the next leaders of Georgia. Many of you have been talked about for different leadership opportunities in just a couple years' time. So I want to take the opportunity to visit with you all today to share with you what I've been up to in these first few months that I've been able to serve the people of Georgia and Congress. I proudly served as Bert noted, Georgia's third congressional district. We've got 15 counties and I overlap with many of you. But my journey with the state Senate started before I ran for Congress. As Lieutenant Governor noted, I worked for President Trump for nine years before I got elected to Congress. I worked in his White House from the very first to very last day of his administration. And therein, I had an opportunity to work with some of y'all. Senator Alvers came to see me a couple times. We worked on some deregulation issues. I got to know my home county state senator, Marty Harbin, incredibly well during that time. And I really enjoyed the opportunity to build a relationship with Senator Beach. President Trump often asked about you and really appreciate the relationship we were all able to build. When I ran for Congress, I had an opportunity to start building a relationship to the state senators whose constituencies now overlap with mine. And I'd like to first acknowledge your rules committee chairman, Mr. Brass. Matt Brass on my first week took me to a breakfast with some county leaders in Calvita County and thereafter he took me to the College of Career Academy, which it really serves as a model for the state and trying to ensure that children coming up that want different types of career paths were able to adapt to the modern workforce. So I'm very grateful for the opportunity to visit with you during that time. Senator Robertson and I probably were together every day toward the stretch. It seemed like every time we were at an event in Harris County or Muscogee County, we were always together. Senator Kennedy kindly opened his doors to me and Macon during my runoff and I'm very grateful for that. And I especially enjoyed the opportunity to build a relationship with Senator Beardin. We talked mostly about sports, not about politics, and I'm incredibly grateful for this opportunity to serve alongside you. But I wanted to today just use as an anecdote, the relationship I have with Senator Marty Harbin, my home county senator, because I think it serves as an opportunity to learn how best we can work together at the state and federal level. After my nomination and I should note Senator Harbin endorsed me in my runoff, incredibly grateful. And I'm very grateful for my nomination. He mentioned to me that there's a company in Griffin, whose headquarters is awesome Petri City in my hometown, and he said they've got a problem with the federal government. It's something you should know about. You're a candidate now, but you should come and learn about it. So Senator Harbin and I went over to a company called Renai, America Corporation, and Griffin, Georgia. Their headquarters is in Petri City, but in Griffin, about three or four years ago, they started manufacturing or started the assemblage of non-condensing tankless water heaters. It's a very specific type of water heater that's built in Griffin, Georgia. And they were concerned, this is last July, they were concerned about a regulation that the Department of Energy was considering that would adjust the efficiency standards and effectively put out a business, the type of water heater that they're manufacturing in Griffin. So Marty and I had a chance to go over, and when the doors open at Renai, America, a former state senator who served with Senator Harbin, Perry McGuire, a wonderful guy who served in this chamber from 93 to 97, welcomed us. He works for Renai now, and he walked us through this issue, and he said, this is something that needs to be on your radar. Fast forward to November. I get elected, President Trump gets elected, and they reach back out. Senator Harbin re-engages that conversation because we got to solve this issue. There's a regulation coming down the pipe. It's a federal reg that could put out a business company that manufactures water heaters and employees three to four hundred of our constituents in this specific area. So I had an opportunity to connect them with some of the Department of Energy people coming in during the transition, but we decided we needed legislative relief. I'm just a freshman congressman, so it takes some time to get your feet wet, but I went to work on it immediately. And there's often times when the President sees change hands, Congress can use this tool called the Congressional Review Act, and it enables us to repeal any regulation that administration enforces within a 60 legislative day window. So it happens that the regulation that came down on Raniah America that would have put it out of business fell within that window just a few weeks ago. So I worked my tail off to make sure we could put this on the legislative calendar, and I'm proud to report and working with the people across my conference in Congress, and likewise, people from Rani. We were able to spend an entire legislative day, or legislative afternoon, I should say, passing a bill in the House to repeal this regulation, we got 11 Democrats to make it a bipartisan solution to a federal regulation that would have put out of business for 100 people in my congressional district. And I am incredibly proud of that, but that relationship started because a member of this body engaged me, someone running for office, or you could engage any of the members that represent you, and said, we've got an issue here at home that you've got to fix, use your tools to fix it for us. And that's exactly the type of effectiveness and efficiency that my entire delegation, everyone that represents you, wants to bring to this specific 119th Congress. I don't want to speak much longer, but I do want to close by saying that that's the nature of what we're trying to do here. We share constituencies, we share the same problems. Many folks reach out to you all with problems that I can address, and likewise, Senator Harbin, we've got to work on that 74-54 interchange. People will reach out in my hometown about problems that fall within your domain. But the long and short of it is, we all have servant-shards. We all put our name on the ballot because we want to solve problems for our constituents, and I am so proud to have the opportunity to represent the incredible people of Georgia's third congressional district in Congress. Thank you all very, very much. Thank you. Thank you. We always, in joy, having our physicians come down, our doctors of the day come down, and we like to recognize them for volunteering their time to come to the Capitol. And for that pleasure today, I will call on the Senator of the 55th to introduce our doctor of the day. Thank you, Mr. President. Colleagues, I am so honored today to introduce Dr. Dominic Mack, a professor of family medicine who serves as the Director of National Center for Primary Care at Morehouse School of Medicine. And he has the great wisdom to bring his glory with him today. I want to acknowledge her, Sister Wanda, would you stand? I acknowledge her. Thank you. Without further ado, I present to you Dr. Dominic Mack. He's making great strides in research and policy, information technology, substance of youth prevention, health services, research and policy. Ladies and gentlemen, I am so honored to present, without further ado, Dr. Dominic Mack. Dr. Mack. Thank you, sir. Thank you. Great. Thank you, Senator Mangum. And the great work you do. I'd like to start with some thank you. This is indeed an honor to be here today. But first of all, I want to thank you all for the great work that you do. We do a lot of work with federal and state funding and in this community urban and rural. And we really appreciate your recognition of the need for health and urban and rural Georgia. And we thank you for the resources that you provide for us. So thank you to never wanted you for that. I also want to thank have some of our team here. I represent more high school of medicine. Dr. Valerie Montgomery Rice, I think she was down here last week to speak to some of you all. I have our team here from the National Center for Primary Care. That's upstairs and really appreciate them supporting me. I couldn't do the great work that we do together without this wonderful team. And thank Megan for facilitating this. She works with some of you. She's our director of our policy. So I really want to thank them. But thank Dr. Rice for support. This is also our physician assistant day. With Pendula Dawson, Dr. Dawson here with her team. And you see our physician assistants running around the Capitol. But I want to thank God for this career that I've had and the opportunity that really got me here. And God gave me an angel. And that angel has been my advisor for 30 years. The love of my life. Juan de Mac, I wouldn't be here without her. I might be in the doctor's office, but I might be sweeping the floor. So I really thank her. She's really been with us. It's our third anniversary this year. So thank you, Juan. I love you better. So now I'll be brief. I'm not going to be up here long. I just want to say something. I'm from Augusta, Georgia, born and raised. And I was really inspired to become a physician. When my mother actually made me go down to a neighbor's house and help take care of this child with cerebral palsy. The child's name was Walter. Little Walter. My sister and I, we were helped with the daily exercises for this child. That child died. But down the street a little further was a physician, an African-American physician. We had about two in Augusta, Georgia, Dr. Griffin, the other was Dr. Brown. And during that time, he really inspired me to look into healthcare. And it was also a mother and a father, but especially a mother who told me I would be a physician when I didn't even know what a physician was. So anyway, I just want to say I've had the opportunity to work in federally qualified health centers in the academic setting, on the full-profit setting. And one thing I found out as a physician, people come to you for pain and discomfort, mostly. It might be preventative care, but pain and discomfort. When somebody's in pain, they won't help. It doesn't matter who that is. And we're here to provide that care for them. So I went in by saying thank you for all the work you do. And as I always tell students and people that I work with, whoever you take in care, when you ever think about a patient or somebody who needs help a medical care, think about someone who's in pain. Think about your mother. Think about your cousin. Think about your uncle. Think about that face on that person. Whether you treat them or whether you're voting on a bill, and think about what would you want for that person. So I really applaud the work that you all do, continue to do it. And thank you so much. It's an honor to be here. God bless. And I thank God for this career. All right. All right. Thank you. Thank you. Thank you. Thank you. Let's see if I cancan. I can Love it. We'll send it to you later. Thank you. Father Gr guerrilla. Father Gr guerrilla. We're here to ask you what we will. Well, really, if you can share, if you can say, well, so much and if your lovely babies will kneel down and respect your babies. Thank you. So no matter what you think, they will feel like things get worse. They may get worse, but there's a little stuff. They may need extra food for these kids. Why? The kids are busy. They will need packages. very special group of young ladies here behind me here. The Brookwood High School swimming championship teams. Secretary, read the resolution, please. The Senate resolution of the rear three by Senator Marit the ninth and others, a resolution congratulating the Brookwood High School girls, swimming dive team for warning the 2025 GHA Class 6A State Swimming and Diving Championship and further purposes. Whereas excellent performance, spear teamwork and extraordinary resilience, made this team a spectacular once observed throughout the season and is fitting finale to its remarkable 2020-25 campaign. The team captured its second consecutive state title with a decisive 427 to 269 victory over run up Harrison. And therefore, we are resolved by the Senate that members of this body can graduate to Brookwood High School girls, swimming dive team for winning the 2025 GHA Class 6A State Swimming and Diving Championship and send best wishes for their continued success and resolution three or four by Senator Marit the ninth and others. Resolution congratulating the Brookwood High School boys, swimming dive team for winning the 2025 GHA Class 6A State Swimming and Diving Championship and further purposes. Whereas excellent performance, spear teamwork and extraordinary resilience, made this team a spectacular once observed throughout the season and is fitting finale to its remarkable 2020-25 campaign. The team captured its eighth state championship with a commanding 409 to 293 lead over its close to competitor Walton. And therefore, we are resolved by the Senate that members of this body can graduate to Brookwood High School boys, swimming dive team for winning the 2025 GHA Class 6A State Swimming and Diving Championship and extend best wishes for their continued success. Mr. President, the complete seawater. Is there objection to adoption of resolutions here here, son, and the resolution is adopted? I recognize the senator from the night speaks in resolution. Well, thank you, Mr. President. Good morning, everyone. Today, it is my privilege to highlight both the girls, and boys, swim, and dive programs at Brookwood High School, located right in the heart of my district, the great and wonderful Gwinnett County. These two teams won both one, the 6A championships last month. And we are celebrating them today here at the Gold Dome. We have their coach. Coach Willie is how I heard the news called. Here alongside with the four swimmers who scored on the state level. We have Haley Margaret Addison and Ben. Yes, I'm sitting right. Okay. For those of you who may not know, Brookwood has the best swim program in the entire state of Georgia. This program has an incredible legacy that extends back decades. This is the girl's second consecutive state championship. And they have won the Gwinnett County title for 10 years in a row. They have won the state title nine times in the past 30 years. And they have won the county title 25 times in the past 30 years. With the boys winning state this year, this makes it their eighth state title in the past 30 years. The special thing about this is this is the first time since 2019, where both the girls and the boys team from Brookwood, both won a state title in the same year. This has only been done six times in our state history. And Brookwood is responsible for three of those times. I mean, this is just an incredible group of young people who work very hard to maintain excellence both inside and outside the swimming pool. I can't wait to see what their future holds for them. It is my pleasure to honor them. The rest of the team is up there in the gallery today. Please join me in welcoming them. Come on team. Go ahead and stand up. So proud. I'm just so proud. And I'm congratulating Coach Willie and all of his team. And thank you for welcoming them to this chamber. And with that, we're going to hear from a few of these young folks. We have Addison Curtis, Hayley Dobson, Margaret Cohen, and Theon Wynn. And they're just going to come up and say a few words. So thank you all for giving them your time. And thank you for helping me honor them today. Good morning. I'm Margaret Cohen, a captain at Brookwood High School, or for Brooklyn Swin Dive. And I just want to start by thanking everyone for this opportunity. It's been an honor to not only help lead this amazing group of athletes, but be able to be a part of the journey as well. It's with great pleasure that I've been able to stand alongside such a team that I can call family as well. So go Broncos. Hi. Good job. Good job. Good job. Good job. Good job. Hi, I'm Hayley Dobson, and I'm also a captain. As Margaret said, we are so grateful to be standing here right now. It's incredible to see the payoff of hard work, dedication, and so much talent amongst our athletes. That is the reason that we can say we are one of six public schools in Georgia's history who has swept both the girls and boys' state championship, that being a double for us, has been an honor to lead these athletes. And I'm beyond proud of each of them. They will continue to do amazing things and go Broncos. All right. Great job. Good job. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, Senator. Senator Rosalusian, 18. Senator Anderson, 24th. And others. A resolution congratulating Terry Holder, and his daughter, who is the senior career, and the exceptional record of 583 in baseball coaching, and 13th in Georgia State history for the first baseball coach in Georgia, and the first baseball year long span earning five titles at Evans High School, and three at Greenbrier High School, and where Terry Holder further served as the first head football coach at Greenbrier High School with player for appearances each year, and where Terry Holder has previously been inducted into three prestigious hall of fame to Georgia Athletic Coaches Association, GACA, the Georgia Dugout Club, and the Bruton Parker College Athletic Hall of Fame. Now, therefore, be resolved by the Senate, the members of this body, congratulate Terry Holder upon the grand occasion of his induction into the Georgia Sports Hall of Fame and the most sincere best wishes for continued health and happiness. Mr. President, that completes the order. Here's the objection to the adoption resolution. Terry here's not a resolution. I want to recognize Mr. Terry Holder, who was just introduced into the Georgia High School Hall of Fame last week. There must be something in the air, and that part of the wood is down in Columbia County, because we were just, we just had the current team from Harlem here, who was going to be celebrating. And there's soon to be Thursday, title in the row. And Mr. Jimmy, the coach down there has always been a big winner, and just across town here in Evans and a couple other schools. Greenbrier, Mr. Terry Holder was holding down the other end of the county. So I bet there was probably some pretty good matchups there. But it's a pleasure to have him, and I recognize Senator from the 24th to speak to the resolution. Senator? Thank you, Mr. President. Well, you just about gave my speech. But anyway, just it is truly an honor to have another legend here today. Terry Holder was just inducted into Georgia State, the Sports Hall of Fame, and making only three gets inducted in the year. In 1989, he was ranked the third national best baseball team at Evans High School. Terry Holder has met, has changed so many young men's lives. We also, he had, he coached a gentleman that went pro named Todd Green. He's now his coaching with Arizona, and he played for the Angels. He was a catcher, and he was able, his most famous catch was when he called the ball that our president, George W. Bush threw in after 9 or 11. Anyway, Terry Holder's touched many, many lives. He's won eight state championships in baseball, and both him and Jimmy Lewis, both come from Columbia County.\n\nAnd by now we do know, you all realize we do know how to play baseball. But at this time I'm going to give him his resolution. And once again I'm going to show you all how to do a resolution. Mr. Terry Holder, come here and give us a few words. Well, I'm certainly very humbled by receiving this proclamation from the State of Georgia. And then to send it today. We set this with great admiration. And this represents a lot of coaches that have worked with me and certainly a lot of the fine young men that have played for our high schools. But we would like to thank you very much for this honor. Thank you. Secretary, read the caption. Senator Resolution 356 by Senator Beach to the 21st and others. Resolution honoring the life and memory of Steve Mench and for other purposes. Or as the State of Georgia mourns the loss of one of its most distinguished citizens with the passing of Steve Mench on December 6, 2024. And whereas as a pivotal figure in Georgia's film and television industry, he played a vital role in advocating for the tax credits to establish the state as a premier destination for film production, significantly contributing to Georgia's economic growth. And whereas during his remarkable career, he oversaw the creation of development of multiple studios, culminating as a final role as president and general manager of studio operations at Tyra Perry Studios. And we're seeing further serve the film industry as a member of the Governor's Advisory Committee on a film, Music and Digital Entertainment, Chair of the Georgia Screen Entertainment Coalition. Board member of both arts now incorporated in the Atlanta Jewish Film Festival and president of the Georgia Production Partnership. Now therefore be it resolved by the Senate that members of this body join in honoring the life and memory of Steve Mench and express the deepest and most sincere gratitude to his passing, Mr. President, that completes the order. Here's the objection to adoption of the resolution. Chair here is none of the resolution that he is adopted. Reganized Senator from the 28th. Mr. President, I am joined by the Senator from the 6th, the 16th, and the 28th. And today we are here to honor the life and memory of Mr. Steve Mench. His family is in the gallery, Steve's family, and several members of Tyler Perry Studios are in the gallery. I know his wife Dan Nelia, son Charles, daughter's Adelina, and Josephine are up here. Would you all stand? Thank you. As chair of economic development, I was fortunate to go to Tyler Perry Studios several times and get to know Steve and work with him on how we're going to grow our film industry. Steve was president of Tyler Perry Studios, and he was passionate about Georgia being number one in film production. And we've done that. And I want to say, Mench actually means good guy, and Steve was truly a good guy. His other love besides film was aviation. He was so proud of earning his pilot's license in 2020. He was proud of his plane. He showed me several pictures of his plane the last time I was out at the studios. But what Steve loved the most and was so proud of was his family. Last time I was at Tyler Perry Studios with him, we went to the replica of the White House and we sat in the Oval Office and he told me all about his family. He talked about his children, his wife, and one of the stories he told me, he said, he named the tail number on his plane 720 DP because he called his wife DP. So he named it after his wife DP. His family was everything to Steve, and we lost Steve way too soon. We touched several lives and made a difference in people's lives and our community. We will miss Steve. I would now like to ask the senator from the six to say a few words. Thank you. I just wanted to really briefly talk about the last time I spent the last moments I had with Steve. We had, first meeting, I came out for a tour of Tyler Perry Studios and you could just really see his passion for really everything he was involved in, his family especially aviation. But film was truly, the man loved it. We talked about the work for side of it and so I decided to invite him and Frank Patterson who's ever at Trilleth and the three of us went down to the Arcovaging Career Academy in Newton that Congressman Jack had just mentioned earlier. Wanted them to see what we were doing in film, to build the work force, to build the next generation of people in film. It really Steve and both Frank were just both truly blown away by what we were already doing and you could just hear him, the passion that he had, the excitement he had about the future of film and the state of Georgia and really in this country as a whole. I think Steve, I think the family for lending him to us and to this state to carry out that passion and just thank him for all the many things he did for such a great industry for this state. So, Mitch family, thank you so much, Tyler Perry Studio, family, thank you so much. Steve, just a great American and great asset to this state. Now the center from 28. Thank you. I am overjoyed to be a part of celebrating the life of a global leader in entertainment. Yes, I had an opportunity also to meet Steve Mints many, many times on my different times that I went to the Tyler Perry Studio. Today is really fitting because today is Georgia Film Day at the Capitol and it's been representative long-tran and Kim Scofield and Dexter Sharper who's been in many of the Tyler Perry films and Kim Scofield's daughter works with the Tyler Perry Studios. And so it's really fitting today that we stand here to honor this great man because you know the success of all of the hard work shows and all the things that he did in the Georgia Film Proos with the local businesses and supportive communities across the state from Atlanta to Savannah and everywhere in between. Our state offices, diverse locations and skill labor and welcoming environment for the filmmakers. And Steve did just that. They didn't just have the actors and the people, the cameramen, but so many other professions have been honored to go in the Tyler Perry Studios. I would like to present the highest honor that we can give a citizen in this whole state of Georgia. And it will, it reads State of Georgia, Secretary of State, Brad Brassenberger, and do here by public proclaim, post-humansly, that Steve Mints as a outstanding Georgia citizen and may this outstanding citizen be afforded every courtesy as a goodwill ambassador from the state of Georgia as he walks through the heavens. We will forever keep you in our hearts and appreciate your service for your community and this great state. I want to thank our Lieutenant Governor and all of and definitely Senator from the 21st and all the other Senators who stand right here today. We want to present this to the family and I hope they'll come down so we can hand it to you personally. Stand up again and let's get a hand clap. One more time. This wife, this daughter, his son. Thank you very much. Thank you again. I'm in this consent. Does any Senator wish rise on a point of personal privilege? I'm now, I will recognize the Senator from the 17th on a point of personal privilege. But before the Senator from the 17th gets up here, I want to take a moment because I know she's going to recognize the ladies of Spelman College who are here with us today because it is Spelman College today. But I know they come with us with heavy hearts right now. About a month ago, I think you all might have read about a couple that drowned in Lake O'Coney. Lake O'Coney Lake over in East Georgia. I knew Gary Jones, a young man who was killed or drowned and his fiance, John Joycelin Wilson. I believe was an employee at Spelman and for everything I heard from the Jones family who were Atlanta residents here that she was a wonderful, wonderful lady. And so I'm going to make it, I'm going to Gary Jones's funeral tomorrow, this right here. And if we could at this time before the Senator takes away, because we all stand and have a moment of silence for Mr. Gary Jones and Mr. Joycelin Wilson from Spelman. Thank you. We're going to have a soon from those 17. Thank you very much, Mr. President. Good morning, colleagues. I'm here to announce that today at Spelman College, they at the Georgia State Capitol, the first day of spring. Spelman College, a historically black college and global leader in the educational women of African descent, is dedicated to academic excellence in the liberal arts and sciences. In U.S. news and world report, college rankings for 2024 and 2025, Spelman College has ranked as the number one HBCU for 18 years in a row. Spelman is the number one top performer in social mobility, number eight as the best learning community, number 16 in most innovative schools, and number four as one of the best liberal arts colleges. And that is just the name of fuel of our top 50 rankings. The college is led by the interim president and former board chair of trustees, Ms. Rosalind Brewer. I would also like to recognize a Spelman freshman who made the news recently in Miss Camorra, Freedland, who was a 16-year-old high school student when she completed her first solo flight and cross-country solo flight to become the youngest black female in New York State's history to earn her private pilot's license. She plans to earn her commercial pilot's license and she hopes she is an inspiration to other black girls to reach for the skies and earn her pilot's license too. Please raise your hand. Give up your hand. I am proud to say that my office in the capital is Spelman strong and in addition to legislator us in the Senate and House, we have several students and alumni serving as staffers, interns, and lobbyists. I am proud to be a member of the class of 1970 and I have joined in me today, representatives from the Atlanta Metro Chapter of the National Alumni Association of Spelman College. My administrative assistant, Karen Thompson, class of 1988 and the intern, Ms. Janice Shaw, a junior at Spelman, are here today in a personal point. My sister, Carolyn Davenport, who is a golden girl, the class of 1969, a former Pan-American flight attendant, and retired teacher from Clayton County Public Schools. Colleagues, please join me in welcoming the latest of Spelman College. To the side here we have Ms. Crystal Sidbury, the Atlanta Chapter President of the National Alumni Association. Also Ms. Karen Wood, advocate of Social Justice Chape for the chapter. Ms. Renee Wilson is the South Eastern Regional Coordinator of the National Association and Ms. Gamara Freeman, class of 2027, the youngest African-American female pilot in the United States. Raise your hand again. So latest of Spelman in the gallery, please stand and receive our welcome to you. Thank you so much for being here. Mr. President, I yield the way. I thank you. All right. Thank you, Senator, and thank you, ladies of Spelman and all the people here representing Spelman College. Thank you for being here today. I recognize Senator from the 18th. Thank you, Mr. President. Good morning, colleagues. So today I rise with some enthusiasm that's usually reserved for when you spot the smiling beaver, and he's actually in the chamber with us this morning. Of course, I'm talking about Bucky's. Today is Bucky's day at the Capitol. You know, it's not just a great gas station, but it's the only place where you can fill up your tank, get a brisket sandwich that would make your grandmother jealous, walk out with a cooler and a rocking chair, and enough beaver nuggets to last a lifetime. I am very pleased to tell you that the first Bucky's that was placed in the state was in Houston County, and in my district on the south end of my district, and another Bucky's is coming to my district as well, and the northern end of my district in Monroe County. So this is a great business, and we've got several folks with the Bucky's organization that are here on the wall over that are here in the Capitol today, and to say hello. They also are known for some of the cleanest restrooms in America. Seriously, there are actual awards for this, and they win these awards. And they represent something greater, though, and that's one of the reasons Monroe County is excited about having their next location be in Monroe County just south of Versailles, because it represents economic growth. It represents job creation, and they are known for their community investment wherever they go with successful locations in Water Robbins, Calhoun, and Brunswick, which is on the drawing board and underwork or underway rather, and Monroe County that's coming. Bucky's continues to bring its economic development to Georgia wherever they can. The location that's going to be in Monroe is going to be one where particularly proud of, it's going to be a 74,000 square foot facility that's going to represent Tuver 200 full-time jobs. They're not just setting up in Georgia, they are committed to development in Georgia, and we are grateful to have them, so colleagues. Let's give a warm welcome, a good warm Georgia welcome to the folks from the leadership team of Bucky's that are here for the day for the state. And if you hadn't tried any Bucky's Nugget yet, well, today is the day to try them, and if you need your picture with Bucky, he's right over there. Let's give a welcome to these folks here. We're glad to have you all with us, and thank you, Mr. President, I yield the will. Recognize Senator from six. Recognize Senator from nine. Thank you, Mr. President. I have a couple of announcements to make. First of all, I want to welcome the mayor of Grayson, which is where I live in the 99th, of course. Mayor Allison from Grayson is here today to visit us. Y'all welcome Mayor Allison. First of all, I want to recognize JYJC this morning. JYJC, welcome, is over 100 young Georgia's, including a dozen students from Shiloh High School in Snellville who are joining us in the capital today to share their vision for a brighter future here in Georgia. This youth takeover is hosted by the Georgia Youth Justice Coalition, that is JYJC. It is a youth led collaborative dedicated to giving young Georgia's a seat at the table in our democracy. You've seen the incredible young people from Georgia, youth justice coalition nearly every day for the last three legislative sessions, bringing dozens of young people into the capital to take part in the work of policy making and to make their voices heard as part of the civic engagement process. You may not know, what you may not know is that the Georgia Youth Justice Coalition now includes over 10,000 members from 97 counties in Georgia. And last year, JYJC knocked on more than 238,000 doors and made more than 285 phone calls to encourage young voters of all ages, the CASA ballot in support of issues young Georgians care about. Issues like affordable housing, public transportation, public education, health care, gun safety, climate change, and the promise of a future where all young Georgians have the freedom to learn, the freedom to feel safe, and the freedom to beat themselves regardless of race, gender or sexual orientation or immigration status. Today's youth takeover is put on in partnership by the Georgia Youth Justice Coalition Action, ACLU of Georgia, collective renaissance Georgia, Georgia Conservation of Voters, Georgia Latino Alliance for Human Rights, Ponder Latinx, Asian American Advocacy Fund, and the Human Rights Campaign of Georgia. I know some of these incredible young people up in the gallery, I think, or they're floating around here. There they are, they're up here in the corner. Welcome, welcome you all. So thank you all for welcoming our next generation of Georgia leaders. Ms. President, I yield well. I recognize the Senator from six. Glad you joined this Senator. Sorry, Mr. President, I was wallowing around the chamber today. Moving a little slow today, the two ferry kept me up last night, but today is my middle child Archie. Archibald Walker Brass, we'll call him Archie, says 10th birthday. So happy birthday Archie. I yield the way. Tell him I said happy birthday Senator. I'm going to have a center from the 30 second. Thank you, Mr. President. This is a women's history moment. And I wanted to just remind you all about Dr. Lyle of Denmark. She was the world's oldest practicing pediatrician until she retired at the age of 103. After 73 years in practice, she ended up living to be 114 years old. And she was a co-developer of the pertussis vaccine. She was born in Portal, Georgia, which I have to confess. I don't know where that, oh, Senator, you're going to tell me where that is later. Okay, Senator from the 23rd. She went to Tiff College in Forsyth. And she went to medical school at MCG. She was the third woman in MCG's medical school class. And then she did a residency at Grady. And in fact, was the first physician on staff at Eglston Hospital when it opened. She lived independently in her home and coming until she was 106. And now there's actually a new Forsyth County high school that was named after her and is located near her former home. So she's an inspiration and a super-sensitariat. And hopefully all of us will have, leave a legacy as great as hers. Thank you, Mr. President, I yield the well. We're going to have a center from the 12th.\n\nit's not sent to the thank double thank you colleagues on February 6 on my very long drive home. I was abruptly interrupted by a reporter. The reporter never asked about Southwest Georgia's highest unemployment rate in the state. The reporter didn't ask about the lowest educational proficiency rates in modern history found in our schools. The reporter did not ask or inquire about some of the worst healthcare outcomes, did not ask about closed hospitals or lack of EMS service, no Medicaid expansion. And on February 6 in this very chamber, almost three hours of unbelievable debate was dedicated to SB1, which impacts less than 0.001 percent of Georgia's population. And again on day 32, yet another lengthy debate took place right here in this august body that had absolutely no substance or import to my constituents or the other 55 districts. For the meantime, over 1,750,000 public school children in the state of Georgia suffer from academic malfeasance along with continuous learning loss. For most citizens, this does not make for interesting reading, not quite our fancy headlines stuff. Frankly, I thought the reporter missed an opportune time to elicit answers to the greatest of the number one threat to the number one place to do business. The threat my friends is an inferior education. That is the greatest threat to Georgia's economy. The undereducated unprepared workforce is exactly what you get without high achieving quality schools and quality educators. But pausing briefly, I want to salute the senator from the fourth who has tirelessly championed educational issues to improve public education, especially around literacy. Thank you, senator from the fourth. You are amazing. Let's begin with Georgia's pre-K program. It is widely known that students who attend pre-K are far better prepared for kindergarten and four-year-olds who do not attend Georgia's pre-K programs. I just remember that kindergarten is not compulsory, but making it so would definitely increase the chances of student achievement throughout this state, higher achievement. When will we make kindergarten compulsory? I want all of our pre-K slides address the rise in absenteeism in our schools, transform and transfer low-performing graduates into pathways that meet their employable needs. When will teacher education programs produce more quality educational leaders and school personnel? Recently, the global partnership for education lists the following as the top pre-eminent educational systems in the world. South Korea, Canada, Japan, Luxembourg, Ireland, Russia, Lithuania, the United Kingdom, the Netherlands, and Norway. My friends and colleagues, each day that we ignore the fragile state of the educational system in Georgia, we commit economic suicide. One million 750,000 public school children need our attention. They need us. I am frightened for our children. They will be our economic barriers whether they are prepared or not. They will be our economic change agents. Let's put the adults back in the room and get this right for our children. They are our future Georgians. Thank you, Mr. President, and I'll let you all the well. Thank you, Senator. Right now, Senator, from the 55th. Ladies and gentlemen, a rise today in this August body to address following up on my distinguished colleague from South Georgia, the impact of shutting down the U.S. Department of Education on Georgia students. The proposed shutdown of the U.S. Department of Education presents a direct direct to students in Georgia, particularly in my district district 55. Education is not just a policy issue. It's the foundation of economic growth, workforce development, and social mobility. Without federal oversight and funding Georgia public schools and higher education institutions, we all suffer devastating consequences. For example, federal funding contribution. Georgia's public schools receive over 2 billion annually in federal funding, representing 16.1% of the state's total education budget. Title 1 programs. Over 1,300 Georgia schools receive Title 1 grants, serving nearly 60% of the state's K through 12 students. Special Education support. The individuals with disabilities at IDEA allocates over 380 million annually to ensure Georgia students with disabilities receive necessary services. Pale grants and higher education impact. Nearly 300,000 Georgia college students depend on pale grants and federal student loans to afford higher education. Some of us come like myself. I didn't come from a wealthy family. I didn't have money to go to college. But here I am. Not only did I go to college, I went to Divinity School, I went to law school, and I am in this school. Thank you. Laws of critical federal education funding. If Department of Education is dismantled, Georgia would lose substantial funding that indirectly impact low income students, students with disabilities, higher education, K through 12 impact, schools in district 55 across Georgia will allow Title 1. Special Education programs, higher education and workforce reduction, increase educational inequity. Urban versus rural divide. Georgia's rural schools will allow already faced funding challenges. The Laws of Federal Support will further widen the gap between urban and rural education quality and needless to say the erosion of civil rights protections. We know our history. We know Brown versus Board of 1954. Office of civil rights at the Department of Education invites investigates those challenges. But the greatest economic impact is our businesses reluctance to invest. Companies choose locations based on availability of an educated workforce. The decline in education quality could deter major corporations from expanding, particularly in Georgia. We remember Montgomery versus Atlanta, the Taylor two cities, the reputation of Montgomery with separate segregation now segregation forever versus Atlanta, a city to visit a hate. We must bring that closer back and leave no child left behind. We can no longer afford to be 38th right now in literacy rate. I looked it up. We were not in the top 10 anymore. What will happen now when we get rid of the Department of Education? We must not allow Russia to be 21. We cannot allow Cuba to be more literate than the United States of America. We cannot allow third graders to be the measure of how many jails we are going to build based on their literacy rate. My colleagues, we cannot allow country to go down the hill. Mr. President, I yield the well. We cannot allow education to be lost in the United States of America. I yield the well. Thank you, Senator. Mind all senators. You got a three minute time limit. I'll let the last two go over. So I won't get started on that train. I'm going to train right now. So three minutes. So but thank you, Senator, for your points, personal privilege. I recognize the center for 38th. Good morning, colleagues. And happy first day of spring. It is very clear that we would not be able to do the work that we do without the teams that are working behind the scenes for us from our administrative assistance to our chiefs of staff and other staff members. I just wanted to take a second to recognize my chief of staff, Blake Robinson, product of Valdosta, Georgia and graduate of Georgia Southern University and current student at Georgia State University today is his birthday. So I just wanted to give him a birthday shout out and recognize him and thank him for all the work that he does to make sure that I can do the work that I do for the great Senate District 38. So I just wanted to do that. And thank you all and have a good rest of your day. And Mr. President, I yield the well. I recognize Senator for the 28th. Thank you. They saved the best for last. So thank you very much. Mr. President and senators. I stand with other members of the Maples and delegation who has and the Cobb County who have been representing all of Cobb County for a long time. So I was very grateful when I learned that I had some of Cobb County in my new district. And first I was all upset until I start meeting the great people who have I have joined to work with. And I stand with the Senator from the 35th. 33rd, 37th, 32nd and 56th are also part of our delegation. So we're here today to talk about the little bag that's on your desk, the brown bag. And that is Maples and Day at the Capitol. We have Mayor Michael Owens. We have all the council persons, councilman TJ Ferguson. We have councilman Ron Davis, councilmember, councilmember Dami Ola Doppel, Keisha Jeffcoat, Patricia Ouch, and Deborah Henderson. We also have the city manager Bill Tinks and TJ Copeland, chief of staff to the mayor and the principal of Pervilworks who had the children here with us for a long, long time, a couple of times this year. So we thank all of them for being here. And did I miss anything? So thank you, thank you for being here today. We are glad that you are a brand new city with a brand new senator. And I'm glad to honor to serve you. Thank you Mr. President. How are you all the way? All the people on the show. Oh wait, wait, wait. We got people upstairs that are from from from stand stand. All of our Maples and family that are still here. Let's give them a warm welcome. Thank you very much for being here. Thank you Senator. I recognize the senator from the 45th. Thank you Mr. President. I rise today as many of you heard as we start off today. I have 12 pages here. I don't know if that's a record or not. I have a couple of them. One of them is my middle daughter, Berkeley and her friend Phoebe that are here with us today. But then I've also got the other 10 pages. Six of them are kids from all 10 of them are from milk creek high school, which is in my district in Gwinnett County. Six of them have special needs, wide ranging special needs. And then there's four of them here that they're that are their mentors in high school and getting to see them interact with their mentors. And especially and you know how they they've handled themselves here on the floor today being our pages. Just wanted to get up and recognize each and every one of them. As many of you know Martha who's in the Pro Tem office who has Down syndrome that is currently attending Georgia Tech. These children. There's a lot of needs from from their waivers for once they they age out at 22 and I could go on and on and on and on and get into details there. But we need to help out this population. They're very productive citizens and they don't need to be forgotten. They need to be included in the classroom. Their social skills is very important as many of you know the ability to have good social skills to build an app is essential in life for success. And these kids are doing great things. Just wanted to recognize them. Got five of them at the back of the room now in here with us. And then we've also got their assistant principal up in the gallery from milk creek high school. And if you all would please stand we also have one of the councilman from the city of Moaberry here with us today as well. Thank you. Thank you, Mr. President. I yield well. I'm going to send it from 31st. Thank you, Mr. President. I'll be very brief. Just want to give a shout out to Mrs. McRoy six grade social studies class across her middle school in Dallas, Georgia. They are watching us literally right now to understand how this body and the Senate works to the kids and Mrs. McRoy here watching right now. Just understand that this is the upper chamber. This is the chamber that makes the best laws in this building. And to those kids make sure you listen and pass your tests and this macro I give you. And look forward to seeing you all around Dallas sometime soon. So God bless and thank you. We're going to send from 35th. We're going to send from the 40 first. Thank you, Mr. President. Good morning, colleagues. I rise today because a year ago while we were debating legislation in this body, I got a phone call that a baby boy had been born in Indiana, Indianapolis, Illinois. And he happened to be the biological brother of Reese, the first child that we welcomed him to our home a little bit about nine months before. And so we got the phone call around 5 p.m. while we were still debating on this floor. And I immediately left. And thanks to such a huge support group of folks, my wife and I were able to drive overnight to Indiana and pick up our baby boy, Calil. So I rise today to wish him a happy first birthday, but also to offer so much gratitude to the members of this body. The senator, he used to be the rules chairman actually carried my bill on this floor the very next day because I could not be here. But the outpouring of support that my family received from this body is absolutely incredible as we welcome the second child into our home in less than one year. So thank you all and happy birthday to Clill. And he's a good looking little man to have you birthday to him. From the 35th. I'm a president. I rise colleagues to recognize an important organization in Metro Atlanta. It is Latina leads, which is a nonprofit that empowers Latina girls ages eight to 16 to become active leaders in their communities through programs focused on leadership, self esteem, financial literacy, entrepreneurship values and well being. And they were founded by two amazing folks here joining us in this chamber. Ellie Kayaso, Maria Alejandra Bastidas are the founders of this great organization. Colleys, let's welcome them as they join us here. And we are also joined by participants of the great organization and their family members who join us in the gallery. But are also I want to recognize three Latinas that are in elementary, middle and high school here. Valentina Isabella and Vanessa who are here with us. So welcome. Thank you all so much. And congratulations to for everything that y'all do. Thank you. President, I you the well. Good job. Good job. Glad to have each and every one of you here. Does any other Senator wish rise on a point of personal privilege? You have before you a consent calendar of privilege resolutions. Does any senator wish to remove resolution from the consent calendar? Is there objections to the adoption of the resolution of this consent calendar? Chair here's on and resolution. The consent calendar is adopted. Senator from the 13th, what purpose do you ask? Thank you, Mr. President. I ask unanimous consent that Senate resolution 391 be withdrawn from the Committee of Banking and Finance institutions and be recommitted to the committee on rules. Secretary Reed, the motion. The resolution through 91 by Senator Alverson 56 and others resolution creating the Senate study committee on artificial intelligence and digital currency and for other purposes. Mr. President, I complete the order. Here's your objection. What objects and motion granted? Recognize the center from the 29th. Mr. President, I ask unanimous consent that SR 311 be withdrawn from the Committee on H and HS and be recommitted to the committee on rules. Secretary Reed, the motion. Senator resolution 311 by Senator Robertson 29th and others resolution creating the Senate study committee on recovery residences and for other purposes. Mr. President, I complete the order. Here's your objection. Objects and motion granted. Recognize the center from the 26th. Mr. President, I'd like to ask that the rules be suspended in order for two local bills that the senator from the 26th serves. Senator, we need to be read and we need the captions of the bills so we can read them. I got them in my hand. Just bring them up here so we can read the caption. Secretary Reed, the motion. Excuse me. Senator Bill 348 by Senator Lucas, the 26th. The bill is being telling not to amend and act creating a board of county commissioners of Hancock County approved October 5th, 1885 as amended particularly by an act of May 6th, 2013. The bill is being changed to description of the commissioner districts, driver definitions and inclusions, driver continuation and office of current members, driver related matters, driver effective dates, your bill, the booking laws and other purposes. Senate bill. Senator Lucas, the 26th. Mr. President, I police the order. Do you have a local consent calendar? Mr. President, Senator Dickson of the 45th and others, the bill is being sent to the senate. Secretary Reed, the caption. Senate bill. Senator Dickson of the 45th and others, the bill is being telling not to amend and act creating an establishment and join airport authority for the city of Winder and the county of Barrow approved March 25th, 1958 as amended particularly by an act of March 28th, 1986 and an act of March 16th, 1989 to provide for the assets and liabilities that are out through the booking, booking laws and further purposes. Mr. President, I can please the order. Mr. President, I have a question. Mr. President, I have a question. Mr. President, I have a question. Mr. President, I have a question.\n\non the past of the bill the a's are future one the nays are zero this bill haven't on the local consent calendar haven't received a record constitutional majority is there for path so now we're going to set out 331 from the center from the 45th Secretary Reid the caption and the amendment please. Senate Bill 331 by Senator Dixon of 45th and others built to be an actual appeal in act creating an established and joint airport authority for the city of Winder the county of Barrow move March 25th 1958 as amended particularly by an act to move March 28th 1986 and an act to move March 16th 1989 to arrive for the assets and liabilities that are out to real convocating laws and for other purposes Mr. President Senkim A. S. C. a little governmental operations recommends that this bill do pass is welcome to this minute Senator Dixon chairman Mr. President Senator Dixon the 45th offers to following amendment number one to amend Senate Bill 331 by inserting after authority on line 17 the following provided however the not thejamin automatically resolve by inserting after a authority on line 22 the following Provided however the Barrow County Airport authority shall remain in existence for the limited purpose of transferring assets to the barrel county after which the barrel county Airport authority shall automatically resolve dissolve Mr. President. I can be see order We're gonna have center from the 45th Thank you, Mr. President SB331 it's a local bill having to do with Barrow County and the airport authority Essentially what the request is is for the airport authority to be dissolved and then the controlled airport be taken over by the Barrow County Commission The intent is is is the airport is in I guess a deferred maintenance the runway has some issues The FBO has leaked she has to go outside to turn the lights on there's a lot of things that need to be updated on the airport It's an overflow airport for for Athens so it becomes very busy And so what the the county commission would like to do would be to take dissolve the airport authority and then be able to put T-splots money that would come up for a vote In November so they could start making improvements to the airport the reason for the one change is there was some of the hangars out there That are being leased they've got long ground leases. They wanted their their leases to be honored So simply not dissolving their port authority till the assets are completely transferred made all parties happy And that's the reason for the one change mr. President be happy to answer any questions are all yield to well Yeah, no question, sir. Thank you mr. President. I yield to well Does any of the senator would speak for against the measure? Chair here's none is there objections to the previous question being ordered chair here's none previous question is ordered questions on the adoption of amendment number one Option amendment number one There's no objection. Maybe number one is adopted Is there objection to agrees the board committee which is favorable to the passes of the bill chair here's nine for the committee Is agreed to is there objection to the main question being ordered chair here's none main question is ordered Questions on the passes of the bill as amended all those the favor of the bill will vote. Yeah, all opposed nay secretary a lot of machine Right now for the night what purpose you rise parliamentary inquiry statement choir is it true mr. President? This is not a mulberry bill Those are what she speaks You All the vans of the bill the a's are 64 the days are zero this bill having received the ricks that constitute from majority therefore pass as amended You Thank you, Mr. President. I'm asked for unanimous consent that the following bills and resolutions be in gross at this time. House bill 111, House bill 112, and HR 42. Secretary, read the cards. House bill 111 by Representative Hong, the 113rd and others, Bill Smith, Title 9, to men, Arthur II, Chapter 7, Title 48, the official credit of Georgia annotated, will get in position, rate computation, exemptions and credits, relative to income tax success to reduce the rate of tax to write related matters, to provide effective date and applicability to bill and for lifting laws and further purposes. House bill 112 by Representative McDonald, the 26th and others, Bill Smith, Title 9, to men, Chapter 7, Title 40, the official credit of Georgia annotated, will get income tax to write for the one-time tax credit for individual taxpayers who filed income taxes through turns for the 2023 and the 2024 taxable years to provide for definitions for right related matters for right for effective date to appeal to the lifting laws for other purposes. House resolution 42, by Representative Gamble, the 15th and others, the resolution, by Governor Brian P. Kimms, Executive Order Numbers, 10.01, 24.02, 10.08, 24.01, and 10.15, 24.01, suspending the collection of multiple and diesel fuel taxes and further purposes. Mr. President, I can please see the order. Is the objection. I recognize Senator from the feet of the third. What purpose do you rise? Thank you, Mr. President. I ask under 6-8.4 that the question be divided by removing HB111. Is there objections to the Senate from the 53rds? No objection. All right. So each one of these will be voted on separately. All right. So the question is on engrossment for HB111. All right. The question is, Senator from the 53rd, what purpose do you rise? Point of order, Mr. President. Is there going to be an opportunity to speak on this motion of engrossment before the vote? Absolutely the well-jour. Thank you, Mr. President. Thank you, Mr. President. I ask to separate HB111 on this engrossment vote. As I believe this is a great opportunity to lower the income tax more than a tenth of a percentage point. Now, the law already states that we're going to lower the income tax by a tenth of a percentage point. But what this bill does is it brings out one more tenth of a percentage point. So now we're at two tenths of a percent in the income tax. What I would like to do is lower the income tax by a whole point. And I would be willing to offer the amendment to this legislation to make that one point. It's a great opportunity in our state as doge is coming around to find one percent of cuts when it comes to our income tax. That's only about 20 percent of the total revenue that our income tax brings in. You know, cuts are always a little hard. But fasting is also a good thing. We're kind of like drug addicts. We just want to keep spending money. And until we take some serious effort in lowering the income tax by a whole percentage point and not two tenths of a percentage point, I don't think we're going to get very far. Because at two tenths of a percentage point, I've talked about this many times at the well. It's going to take until I'm the youngest center in this room, tell them about 80 years old before we fully repeal the income tax. My Republican colleagues repealing the income tax is one of the most popular things polling across our state right now. We as a Republicans have the majority in this legislature to pass a full percentage point and not two tenths of a percentage point. You know, it's like when you're fasting, I learned the other day that the doctors in this room may coordinate with this. But after you've fasted for about 16 hours, your body goes into this apothecity. Where basically your body is going and finding all the broken and bad things and using that for energy. And if we repeal a full point of our income tax, that's going to force us to find out and get rid of those bad things in our budget. And this is a prime opportunity to do that because the big budget hasn't come in over to the Senate yet for us to vote on it. So we've still got an opportunity to clean up all those bad things. And that's the reason why I would ask that you vote no on engrossing House Bill 111. Thank you, Mr. President, how you'll forgive any questions. You do have a Senator, do you have a question or you just want to speak? You have no question, Senator. All right, thank you, Mr. President. Senator from the second. Thank you, Mr. President. Colleagues this morning, I rise objection to the engrossment of HB 111. As we have heard from many Georgians that are struggling with the cost of insurance. If you look at our state budget, we collect $750 million in the insurance premium tax. And instead of reducing the insurance premium tax, it would give immediate relief to hardworking Georgians that pay and bear the cost of insurance, we're reducing the income tax rate. But that's not what they're asking us to do. They're asking us to work to lower their insurance premiums. And so, Mr. President, I am a no on the engrossment of HB 111 because we could do two things at the same time. And I believe that we can walk and chew gum because we need to make sure that the folks that are asking us for the relief, we deliver the relief they're asking for. I've never gone to the doctor, Mr. President, and gotten the doctor to write me a prescription for what actually wouldn't hurt me. And so, if we continue on this course, Mr. President, we'll continue to write prescriptions for our patients that we've never seen talked to and or treated and said, what I did give you that. Let's do what the folks are asking us to do and that's the law of the cost of insurance premiums. And with that, Mr. President, you're the well. Thank you, Senator. So, posture now is we're going to vote for engrossment of HB 111. And that motion was reasonably made by the majority leader and all those in favor of motion to engross will vote yay, oppose nay, Secretary-in-Lawton Machine. The motion to engross, the yeas are 30, the nays are 24, and the motion has prevailed. Now the motion is now for engrossing House Bill 112 or HR 42s. Any Senator, we should speak for against these measures here and there. All those in favor of engrossment will vote yay, all opposed nay, Secretary-in-Lawton machines. Senator from the 41st work purpose off. on the motion to engross the A's are 32 the N's are 20 and the motion to engross the O's hands prevail. Senator from the 41st what are the farthest your eyes. Mr. President I ask for unanimous consent that Senate rules 3 1.2 and 4-2.1 A be suspended to allow for the first reading and assignment of a local bill. Is the objection without objections Secretary read the caption. Senate Bill 350 by Senator Jackson, the 41st and others, he builds me town and act to amend and act providing for the compensation of certain county officers and officials of the Cap County approved March 31st, 1976, as amended to serve as the compensation of certain judges, judicial officers and county officers to make and for forming changes related to court names changed by general laws, arrived related matters, arrived for effective days, for building and flicking laws and for other purposes. And the state will be on that. All right, we're on to the rules calendars, which today means we're gonna take a break for about 45 minutes, so y'all gonna get some lunch, and so we'll stand at ease, and then we'll hit the rules calendar and we'll get back. So I know the pro-tum has lunch ready for the members. I think he's got them set up in the any room. So y'all enjoy lunch, we'll be back in about 45 minutes or an hour. Thank you.",
  "updated_at": "2026-02-13T14:21:45.134127+00:00"
}