{
  "video_id": "U3Q4LPWxxn8",
  "url": "https://www.youtube.com/watch?v=U3Q4LPWxxn8",
  "title": "Legislative Day 6 | 2024 Session | 1/22/2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": 6,
  "video_date": null,
  "duration_minutes": 140,
  "summary": "Here is a structured summary of the Georgia Legislative Day 6 | 2024 Session | 1/22/2024 session:\n\n**Overview**:\nThe session included the introduction of several new bills, routine legislative procedures, and a morning devotion by Reverend James Woodall.\n\n**Key Actions**:\n**SB 338**: Reported out of committee with a minority report filed.\n\n**Bills Introduced (First Reading)**:\n- SB 354: To exempt certain persons from cosmetology and barbering licensure requirements\n- SB 355: Relating to campaign finance\n- SB 356: Relating to real estate\n- SB 357: Omnibus health and human services bill\n- SB 358: To remove the Secretary of State from the State Election Board\n- SB 359: Relating to transportation\n- SB 367: Relating to capital outlay funds for education\n\n**Notable Moments**:\n- Reverend James Woodall provided the morning devotion, speaking on \"Blessings for the Journey\".\n- Several senators were excused for business outside the Capitol.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum present, with excused absences for several senators.\n\n**Adjournment**:\nThe session adjourned. The next session date was not provided.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you we is their objections to the Spencing of the Reading of the Journal. Chair here is none the reading of the Journal is dispensed with. Is their objections to the confirmation of the Journal. Chair here is none and the Journal is confirmed. All senators who have bills and resolutions to introduce, please bring them to the Secretary's desk. First reading and references of Senate bills and resolutions. Mr. Secretary. Senate Bill 354 by Senator Walker of the 20th and others. A bill to be entitled to amend chapter 10 of Title 43 of the OCEGA, relating to cosmologist and barbers. So as to exempt them from licensure persons. Regulate the industries. Senate Bill 355 by Senator Robertson of the 29th and others. A bill to be entitled to amend Article 1 of chapter 2 of Title 21 of the OCEGA, related to Senate Bill 356 by Senator James of the 34th and others. A bill to be entitled to amend chapter 3 of Title 44 of the OCEGA, relating to... Judiciary. Senate Bill 357 by Senator James of the 35th and others. A bill to be entitled to amend Title 31, 33, 43 and 45 of the OCEGA. Health and human services. Senate Bill 358 by Senator Burns of the 23rd and others. A bill to be entitled to amend subpart 1 of part 1 of Article 2 of chapter 2 of Title 21 of the OCEGA, relating to the state election board. So as to remove the Secretary of State from the board to authorize... Ethics. Senate Bill 359 by Senator Robertson of the 56th and others. Senate Bill 359 by Senator James of the 68th and others. A bill to be entitled to amend Title 32 of the OCEGA, relating to... Judiciary. Senate Bill 367 by Senator Sigmund of the 4th and others. A bill to be entitled to amend Title 32 of the OCEGA, relating to Capitol Outlay Funds. Education and union. That completes your Mr. President. First reading of House bills and resolutions. The Secretary will read communications from the Governor requesting Senate confirmation of his appointments to the Judicial Qualifications Commission. Dear Secretary Cook, the appointment included below requires Senate confirmation. This appointment is submitted pursuant to Senate Rules 3-3.1 ex-sequentia. If we can provide with you with any additional information to assist your office in the confirmation process, please let us know. Executive Order 06-13-2301 regarding the reapportionment of the honorable Bob Barr of Cobb County as a member of the Judicial Qualifications Commission for a term of office ending June 30th, 2027. Thank you for your assistance, sincerely Brian Kemp. That completes your Mr. President. Thank you Mr. Secretary. Presented to the Rule 3-3.1, the appointment is referred to the Committee on assignments. Secretary will read reports of standing committee. Mr. President, the Senate Committee on Rules has had a consideration in the following legislation and has instructed me to report the same back to the Senate with the following recommendation that Senate bill 151 do pass. Senate Resolution 122 do pass. Senate Resolution 323 do pass by substitute. Senate Resolution 344 do pass by substitute. Respectfully submitted. Senate revered to the 28th District Chairman. It is now time for the morning roll call. Right after this. Mr. President, the Senate Committee on State and Local Governmental Operations has had a consideration in the following legislation as instructed me to report the same back to the Senate with the following recommendation. And that Senate bill 338 do pass. Additionally, do your Secretary could please accept this letter as timely notice of my intention to file a minority report for Senate bill 338, which the Senate Committee on State and Local Government pass out of committee on Friday, January 12th to 2024. Thank you. Gloria Butler. That completes your Mr. President. Secretary Reed, resolutions for a second time. Senate bill 205 by Senator Williams of the 25th and others. Funeral directors and embolmers. Reinstatement of lapsed funeral directors license. Change provisions. That completes your Mr. President. Now it's time for the morning roll call. Are there any most of the excuse I recognize senator from the 33rd? Thank you, Mr. President. Good morning all. As unanimous consent to excuse the senators from the 35th, 38th, and 40th for business outside the Capitol. That objection, senators from the 35th, 38th, and 40th, are excuse. Are there any other motions to excuse hearing none? We got it. We're going to have Senator from 23rd. All right, questions. The Senate to excuse the senator from the 32nd for a business outside the Capitol. That objection, senator from the 32nd, is excuse. We're going to have Senator from the 33rd again. Thank you, Mr. President. I ask unanimous consent to excuse the senator from the 34th for business outside the Capitol. Without objection, Senator from 34th is excuse. Any other motions to excuse? All right, without objection, the secretary will call the roll senators. Please signify your presence by voting the A-switch. Section 21, Lightning Machines. It is now time for our morning devotion. All senators, please take your seats and see all conversation. I would ask that the doorkeeper secure the chamber at this time. It's my pleasure to recognize a good senator from the 33rd district of the purpose of leadness in our pledge and introducing our Chaplain of the Day. Senator? I pledge allegiance to the flag of the United States of America and to their public who would disband on the nation under God, indivisible, who would have been the best of us for long. Now the Georgia flag. I pledge allegiance to the Georgia flag of the United States of America and to their public who would disband on the nation under God.\n\nThank you, Mr. President, my fellow senators, colleagues, friends, and y'all. I'm here to introduce the past of the day, James Woodall, who currently serves as a public policy associate of the Southern Center for Human Rights and is the former State President of the Georgia NAACP. He chairs the Georgia Multi-Faith Initiative to end mass incarceration and effort founded by the Reverend Dr. Ralph Raphael Warnock in 2019. He is also the co-author alongside Dr. Mark Ellingsen of the new book, which looks at how evolution and faith challenge racial adultery. He is an alumnus of the Southern University and has a Bachelor of Arts in Political Science. And he also has a degree from Morehouse School of Religion at the Inter-denominational Theological Center, that's where he got his Masters of Divinity. James also served as an intelligence analyst for the United States Army for eight years. He has been named to Georgia's Southern's 40 under 40, an alumnus of the year in 2020 was named the 2021 and 2022 Atlanta 500 leader by Atlanta Magazine. James is a fellow of the second class of the Civil Society Fellowship, a partnership of ADL in the Aspen Institute and a member of the Aspen Global Leadership Network. He is the proud husband of Brooke Harrison and the proud father of James Doose, Wood All the Second, and he's a good standing reverent at Pleasant Grove Missionary Baptist Church in May, Red of Georgia, and now I introduce to you our past of the day Reverend James Wood All. Good morning to the Lieutenant Governor to Senator Red to the members of the Georgia State Senate. I bring you greetings on behalf of my senior pastor, the Reverend Doctor, Sammy J. Dow. And the scripture for this morning will be found in Numbers 6 verses 22 through 27. And for the benefit of brevity, I won't read them, but I would ask that you reflect over them later today. For just a few moments, I would like to speak from the subject blessings for the journey. I want to take this moment to pour into your life as you go about your various ways. You see a journey is when you are traveling from one place or one season to another. And as we live, we find that our journeys often lead us through streams of joy and waves of success, but also they can bring tides of darkness and pain. You see, don't just take my word for it, though we live in a day where the children of Israel were in the wilderness of Sinai and God was speak to Moses, instructing him to speak a blessing over them as they would be reminded of God's hand over them amid such chaos. Scripture reads, like this, the Lord bless you and keep you. The Lord makes His face to shine upon you and be gracious to you. The Lord lift up His countenance upon you and give you peace. You see that word that caught me in that text was blessed. You see that word blessed is a greeting that is often found amidst our daily interactions. Anytime somebody sneezes, what do we say? Bless you. This act, this word of blessing is one of wishing God's favor and goodness upon others and even upon yourself. Jesus is very kind of declaration to let us people know that they as well for us this morning are blessed. You see that word blessed doesn't transform the very world that you are living in whether it is you personally or the community around you. I would question whether it's a blessing at all. You see Walter Brugamon describes this confirmation as a reorientation by the word of God. He says the real God is the one who can invert life from terror to bone is from sorrow to joy. That transformative power jeopardizes all gestures of equilibrium in our idolatrous images of God as the great stabilizer of the status quo. You see God calls for us to love and to care for people because how can we love Jesus when we have never seen yet the spirit and walk over people who we see every single day. You see this blessing of confirmation, reorientation, but also we have in the text a blessing of preservation. The verse says the Lord bless you and keep you. You see this word of keeping that God being a sustainer. Remember who's writing this? He's been written by Moses and is to be passed down to Aaron and Aaron is to say these words over the congregation of Israel. The Lord bless you and keep you. Not only listening to that, the one who is writing it and pronouncing it, but also it's important to know the one to receive it that they would understand that the Lord blesses and keeps. They would go back to the blessing of Isaac and Jacob. I will bless you to do heaven and all the vegetation of the earth and the agriculture and the wine and I will bless those that bless you and curse those that curse you. The Lord blesses and keeps. And so we go from the confirmation of the word to the reorientation and preservation of the word. But now we get to illumination. The Lord would speak to Moses and then said, the Lord make his face shine upon you. Don't miss this. It is the Lord who causes the Lord's face to shine. I imagine Moses at this point in God's declaration that he would cause a part of Exodus 34. He was reflecting on what he was written about when he would come down from the mountain top and that the skin on his face was shining with light because he had come face to face with God. And we had came down and the people would start to bow and worship God because they saw God in Moses. Here's a question I asked that you investigate today. When was the last time you left this chamber? Went into a restaurant or went onto your job after the session ended. The people wanted to know who's God you served because they said that you started to look like God God's self. Our faith pushes us past our present situations to promote us towards a promise that allows for us to see the higher calling and to press towards the mark that allows for us to shine all around us every day and every night. And I get excited just thinking about the Lord's face shining upon me. And so the scripture says, I will give you peace. As I close, I'm reminded that peace in the Old Testament means completeness, soundness, well being of the total person, this peace of God is given and confirmed or in the traditional Jewish language that you shalom. You see this is beautiful because we believe in the possibility of the impossible. We are being urged this moment this morning to keep holding on to a faith that assures us that God is still in control. Because you know we are in a place where people don't believe of a blessing of a God who keeps in a God who shines in a God who gives peace. But the reality is that there is a word for them who don't believe in a word for us here today too. I don't know what I'm going to face all week long or in my house or on my job or at my child's school or even on the street when we leave, but I know I need the Lord to bless me. I know I need the Lord to keep me. I know that whether the ethical issues of our country and our community will ever be resolved or what will come of the injustices of this world, but then I think about the grace of God. When I can't sleep at night and when trouble is on every side, I just simply pray, God grant me peace. I need peace, a peace that surpasses all understanding. So as I close for the last time, I want to profess that you are indeed blessed. Your journeys are blessed. Not because you are a state legislator or because wherever you are founding yourself in the world, but because that wherever you are, God is also. And so as we move forward in the next seasons and the next days ahead, I ask that you simply walk in that light to know that God is with you and that God has promised to bless and to keep you and to shine in and through you and most importantly to give you peace. May we pray. The God of our weary years, the God of our silent tears, the God who has brought us this far along the way. We simply pause this morning to say thank you. Thank you for your wonderful grace. Thank you for your matchless love. Thank you for your marvelous patience. We know that whenever you call men and women to declare your word, you run the risk of putting treasure into earthen vessels, but God, we know that you put it there so that the excellence of your power might be of the inout of us. So show yourself excellent again. We love you. We honor you for us in the name of all things divine and most importantly in the name of sweet baby Jesus. We say it done and it is so. In the name of Jesus we do pray and we all set together. Amen. It is always a pleasure to introduce our doctors of the day and we've got a good one here with us today and I'd like to call on the senator from the 48th or 46 to introduce the doctor of the day. Thank you, Mr. President. Good morning ladies and gentlemen. My honor to introduce my friend Dr. Rustin McAllister, Doctor of Emergency Medicine from O'Coney County, Georgia. His kids have gone to school with mine, raised our children all together through the school system there in O'Coney County. He graduated from Gainesville High School back in 1978. Then he attended the University of Georgia, graduated in 1983 and went to medical school at the University of South Carolina in Charleston, graduating there in 1985. He actually graduated in 1989, did an internship at Greenville Memorial Hospital worked in their emergency room for a couple years there. They moved to Jackson, Mississippi where he finished his emergency medicine residency, then settled down in Watkinsville, Georgia where he has been a very valuable member of our community of various esteemed and wonderful doctor. So it's my pleasure to introduce you to my friend Dr. Rustin McAllister. Dr. Rustin McAllister. Dr. Rustin McAllister. Dr. Rustin McAllister. Dr. Rustin McAllister. Thank you all for letting me come today. I hope that you don't need me today, but you're welcome to make a social call. And if you do need me, I'm there. Thank you all so much. Thank you all very much. I appreciate it. Thank you all so much. I appreciate it. We have some special guests here today. I ask the Secretary to read the resolution. Senate Resolution 449 by Senator S. Davis of the 6th. A resolution recognizing and commending the Atlanta Vibes professional women's indoor volleyball team and for other purposes. Whereas the Atlanta Vibes is Atlanta's premier professional women's indoor volleyball team and a founding member of the Pro-Voluball Federation. And now therefore be it resolved by the Senate that the members of the spotty recognize and commend the Atlanta Vibes professional women's indoor volleyball team for contributing to the city's monumental and professional sports landscape and providing a platform for world class women's indoor volleyball athletes. That completes the order, Mr. President. Is there objection to the adoption of the resolution? Chair here is done. The resolution is adopted. I recognize the senator from the 6th district. Find senator from Buckhead to introduce our special guest today. Thank you, Mr. President. Good morning, colleagues. It is my honor for the very first special presentation of this session to be in recognition of an organization that is making history across this region and across this state. The Atlanta Vibes professional women's indoor volleyball team is making their debut here in Atlanta on February 1st. And it is the first women's indoor volleyball team in Georgia in Atlanta. And if you all don't know, women's volleyball is the number one sport for girls in the United States. And they recently broke a world record by having an impressive 92,000 attendees in Amahaw in a game and a match that occurred just a few months ago. The Atlanta Vibes will make its first official introduction to the city on August 4th, 2023 in Atlantic Station. I was honored to be there to attend. And the decision to bring this team to Atlanta was rooted in the desire to contribute to the region's monumental professional sports landscape and to provide a platform for world-class women's indoor volleyball athletics. Miss Colleen Craig, a prominent business woman and founder and managing partner of Rally Sports Management, emerged as the visionary leader and the franchise's first-ever team owner, and most importantly, she's a constituent. Colleen and her team have done a great job of bringing this exciting team to Metro Atlanta while they are called the Atlanta Vibes. They will be playing their matches in Gwinnett County. So it has a reach across the Metro area. And we look forward to this team bringing to the state some championships, but not only that, but contributing to the development of the game here in Georgia and to inspiring more people to play this great sport of volleyball. With that, I'd like to welcome Colleen Craig and Teresa Winsle up here to the podium. Thank you. Thank you, Senator Estevez, Lieutenant Governor and members of this chamber. I'm sure some of you knew that fact that volleyball was a number one team sport, but I bet you if you raised your hand almost everyone out here has touched a volleyball at some point. Might have been Jim Class, might have been a company picnic, but almost all of us have touched a sport at some point in their career. It has been chosen by the female athletes as the number one team sport and number one or number two team sport in the country in high school in 42 of 50 states. And up until now, we've not had a platform for them to showcase their skills. We talk about inclusion, we talk about creating platforms, and now we have the opportunity to do it. These athletes now will be salary. They will be making $60,000 a year so they can live on that wage, which is the first time that's being provided. There are seven cities in this inaugural season, as we mentioned, we have our home opener on February 1st and it will be nationally broadcast. So we're really leaning into this and we hope you guys continue to support us in that way. And what you did today was not just validate a resolution. This is actually making history. We don't have other support networks, so we are relying on the community to step forth for us as a female driven sport. So thank you for that. This is creating an ecosystem. If many of you have children, family members out there that have played volleyball, you've been down to Georgia World Congress Center during Big South, you've seen the ecosystem, the economic drivers that springs and the sponsorships that springs. So again, thank you for that. The vibe, if you want to know, you mentioned the vibe comes from an outreach program we did and it was a suggestion from the community. And what the vibe means is the intersection of fashion, sports, entertainment and culture. So you bring your vibe to the game, we're going to bring ours that defines Atlanta. So we are really leaning into that and appreciate that. I know there's some girl dads out there that are not sure what to do with this sport or when their daughter chose volleyball. Now you have a path and a platform for them to look up to and the girl moms out there as well. So thank you again for having us here. We appreciate it and we hope to see you February 1st. Please feel free to reach out at any time. Thank you. Thank you. Thank you. Are there any unanimous concerns? Does any Senator wish rise on a point of personal privilege? I recognize the Senator from the 28th, we'll point personal privilege. Thank you, Mr. President. Today I rise on a point of personal privilege. I want to welcome the Georgia speech language pathologist and Georgia Academy of audiology to the Senate today and to the legislature. These speech pathologists and audiologists work statewide to help individuals with hearing, speech, swallowing disorders and balanced disorders to live a better quality of life. And as someone who has been diagnosed with Barrett, the suffocates and having swallowing issues and someone who has also had an occasional balance disorder, maybe I might have had one on Friday on my birthday. Certainly appreciate their great work. They're in the gallery today. If y'all please give them a warm Senate welcome. We appreciate all y'all doing look forward to meeting with you throughout the day. Thank y'all for being here. Recognize the Senator from the 21st, we'll point of personal privilege. Thank you, Mr. President. Fellow Senators, I come before you today to discuss what I'm calling prosecution for personal profit. I'm going to say that one more time. Prosecution for personal profit. Every member of this Senate body should be deeply troubled by the actions of the Fulton County District Attorney and the stain it has put on Fulton County and the state of Georgia. Let's look at the facts surrounding Fahni Willis and Nathan Wade. Again, Mr. Wade has never prosecuted a felony case, yet Ms. Willis calls him a legal superstar poor judgment. Two, Mr. Wade files for divorce the day after he was hired by Ms. Willis. Three, their accusations of a romantic relationship between Ms. Willis and Mr. Wade. Four, Mr. Wade has been paid $654,000 as far in the case. Ms. Willis was siphoning money to her romantic partner for them to take lavish trips to Napa Valley, Miami, a Caribbean cruise, and many other trips and fine dining dinners. All of these trips were made before any of the indictments and she should have disclosed she was taking these trips with Mr. Wade, her romantic partner, Quitt Prokwo. Number five, in court filings and Mr. Wade's divorce case, the public has been made aware of credit card transactions that show the expenses of the trips I just spoke of between Mr. Wade and Ms. Willis. Fellow senators, I submitted a request this morning to the Inspector General Nigel Lange to investigate if there were any state funds involved in these lavish trips. I believe that Ms. Willis has lost the trust and confidence from the public to continue in this case. I believe at the very least she should be disqualified from the case. And I really now believe with the scheme of prosecution for personal profit coming to light that all of these cases should be dismissed. I believe by being in the relationship with Mr. Wade and not disclosing this relationship to the grand jury, it is resulted in fraud against the court and fraud against the taxpayers of Georgia. In closing, Ms. Willis, do the right thing and dismiss all charges and say, Fulton County, the state of Georgia, and you and Mr. Wade, any more embarrassment because of your poor judgment. Mr. President, I yield the will. I recognize the sender from the ninth who appointed personal privilege. Thank you, Mr. President. I rise today on the anniversary of Roe v. Wade and I rise to speak for the women of Georgia. I speak for the women of color whose voices have been silenced and disregarded by so many generations of legislators before me whose past in life have been dictated by circumstances out of their control.\n\nI rise for the four out of five Black mothers in Georgia who are the breadwinners and cornerstones of their families. I speak for women who need their employers to stay here and do business in the state of Georgia so they can keep providing for themselves and the people they love and for the employers that need the empowered and diverse workforce that make Georgia the best state to do business in. The more we restrict reproductive freedom, the more we tell women, we don't trust them to make decisions and plans for their own families. Instead of treating women like adults, politicians here at the Gold Dome think that they should make medical decisions for us. As if we're not capable of good judgment. Beyond harming the physical and mental well-being of Georgia's women's choice restrictions, it devastates women's economic opportunity. The denial of a woman's reproductive freedom has far too long and far too often become a denial of her right to work and her right to determine her life's direction. According to the Institute for Women's Policy and Research, there is a direct correlation between denying access to abortion and women, particularly women of color. Translucing from a state of economic stability to living in poverty. The denial of access results in a lower high school graduation rates, lower employment rates, and lower wages for women in the workforce over time. Working class women of Georgia who serve as the cornerstone in many of our Georgia families and in our businesses simply cannot afford these types of restrictions. I rise to say that the 2.5 million women in Georgia of childbearing age in their families, I rise to say, excuse me, to the 2.5 million women in Georgia of childbearing age and their families, I trust you to make the right decisions for yourselves and your families. Our Democrats in our caucus trust you and we want to give you the freedom to make your own reproductive decisions. Everyone should trust you because you know what freedoms you need better than the 33 politicians in this body. Last week Governor Kemp said he believes our state is moving in the right direction because we trust our citizens more than we trust the government. Despite the governor's words, it is clear that the majority does not trust the working class women in Georgia to make their own decisions. They certainly don't trust you on reproductive freedom and they never trusted you to organize and demand a fair wage in the benefits you deserve. One year ago today, leader Butler, one year ago, one year ago today, leader Butler introduced SRO. rhetoric of law into law and provisions that have been implemented in the last force of order. It has led to a贏 eigenlijk of law of common law and that does not affect any part of the tyranny of our state and the part of the law of the Greek or the USSR. But the majority doesn't want Georgians voting on reproductive freedom. They've seen all the states that protected abortions right at the ballot box. They know they're out of stat with Georgians and the rest of the country on the issue. So one year ago they put SR-136 in committee and left it there. No hearing, no vote. Why? Because we don't trust Georgians and Georgia women to make decisions. Women in Georgia, Democrats are with you. We're always with you on this issue. We know that you understand what you need far better than any of us in this body. SR-136 puts that trust in our Constitution and guarantees that forced birth on working class women is not an option. So for all Georgians women, I urge my colleague to support SR-136. It's time to trust Georgia's working class. Let's let the people of Georgia not the politicians decide. Mr. President, I'll give you the will. Thank you, Senator. I recognize the Senator from the 39th for a point of personal privilege. Senator from the 39th. Senator from the 39th. I'll see you. I'll see you. I'm doing too many things. Good morning. Thank you, Mr. President. Well, it is always a good day to celebrate the 900,000 Georgians in long-term recovery and honor those lost to opioid and fentanyl poisoning. Last Thursday, over 1,100 individuals gathered at the Capitol for the 16th Addiction Recovery Awareness Day, also known as ARAD. This event signifies both hope and solidarity in the fight against addiction. I want to congratulate Larissa Guerrero, Jeff Bredlove, the Georgia Council for Recovery, and all ARAD partners for orchestrating such an impactful day. We witness people from every corner of Georgia uniting to support peer-led recovery, to stand with survivors of addiction, and to honor the memories of those lost to this devastating disease. It's a poignant reminder that those suffering from addiction, whether it's drugs or alcohol, are not bad people. They are our family, friends, co-workers, and neighbors afflicted by a serious, but manageable disease. As a co-chair of Georgia's working group on addiction and recovery, I'm proud that here in Georgia, we've made considerable progress in recent years. We've empowered the Behavioral Health Reform and Innovation Commission. We've expanded funding for recovery community organizations and addiction recovery support centers, and even brought the Georgia Recovery's license plate into law. These strides, including the historic three Georgia Recovery's campaigns and the transformative HB-1013 law, are testament to our commitment. A special acknowledgement should go to our certified peer specialists, over 1,000 strong in Georgia, who embody the power of recovery. They are pivotal in expanding our peer-led recovery workforce, ensuring accessible medical care and support for all. Our recovery community organizations and addiction recovery support centers funded by this general assembly are life-saving, family restoring, and community strengthening institutions. I'd like to also highlight the pioneering peer-led neonatal intensive care unit at Northeast Georgia Medical Center, a shining example of state and local partnerships supporting whole family recovery. Mark your calendars for the second annual Georgia Recovery's bus tour in September, announced by Commissioner Kevin Tanner, and partnership with the Georgia Council for Recovery, which is set for September. This tour will further unite stakeholders, dismantle stigma, and demonstrate that recovery is real. In closing, let's remember recovery is not just a concept, it is a living breathing reality in Georgia. Together, we can continue to make a difference. Thank you, Mr. President. I yield the well. Thank you, Senator, and thank you for all the hard work you're doing in that space. It's definitely needed, and we greatly appreciate that. Members, I would just remind you that, please be, when you're also the side conversation, please be respectful of the members who are in the well, and also remind members in the well that, be mindful of the time that you're there as well. Anyways, but recognize the senator from the 54th for a point of personal privilege. Thank you, Mr. President. My friends, I know there's been 365 days since the last time I stood here with one of these in my hand, but today is the day. I know the countless sleepless nights have come to an end because today is Dalton Day at the Georgia State Capitol. Just invite you, everyone of you, from four o'clock to six o'clock, Frightening Poe, come down, and they're each and every one of you are going to get this year's rug. So what is this year's rug? Are you ready? Is everybody, is anticipation building up? There we go, let's give a drum roll. Welcome to Georgia. Come on down to the Frightening Poe today. After today, you will have to come to my office to get one, and I might be a little stingy with him. So go down to the Frightening Poe today before the six we'd love to have you. Thank you, Mr. President, I yield the will. All right, all right. This is good day. Good day. Oh, is that mine? Yes. Well, thank you. I appreciate it. Thank you so much. Thank you. It is Dalton Day. It's always a good day. And y'all should I would encourage you to go down to the Depot and thank everyone for the fine carpets here, but also thank City of Dalton and the county there of all the good work they do. For creating jobs and good opportunities for every individual in the area. So I recognize the senator from the 42nd for a point of personal privilege. Thank you, Mr. President. I rise today on the anniversary of Roe versus Wade. Supreme Court decision that held by a 72 majority. That protected a woman's right to privacy and reproductive choice. However, two years ago, the Supreme Court in the DOBS decision decided that the Constitution does not guarantee a fundamental right to reproductive freedom. Thereby dealing a gut punch to hundreds of millions around the country. So reproductive choice is no longer longer under the jurisdiction of the Supreme Court. Now each individual state decides how pregnancy will be regulated. And in legislating whether our state will protect reproductive freedom or deny access to choice and health care, we should reflect on several things. One, the will of the people of Georgia. And the full extent of our fundamental rights. Smack in the middle of this debate is a fundamental right not often discussed enough in this context. It's one that Oglethorpe defined in the original charter when founding our great state. Each of us regardless of religious affiliation or belief holds it dearly and that is freedom of religion. The freedom to practice one's religion of choice without government interference is stated clearly in the First Amendment of the US Constitution. But post-Dobbs, women throughout our state who prioritize a mother's health, physical or mental, over the unborn fetus may be denied their right to religious freedom. For example, Judaism teaches that life is sacred and must be respected and protected. For that reason, when a pregnancy threatens the life of a mother under Jewish law, she must prioritize her own life. But current law here in Georgia only allows abortions when necessary to protect a woman's life. But it would indeed be against a Jewish woman's religion to force her to suffer through a pregnancy that is substantially likely to take her life. Against what our current law can require. Under Jewish law, a mother must also be prioritized when her mental and emotional well-being are at stake. But Georgia's current law says that the emotional and mental suffering a pregnancy may cause cannot be considered by a physician at all. That's wrong. As we've learned, mental health is physical health. Mental and emotional turmoil can cause death, suicide being a leading cause of death according to the CDC, to force a woman to carry and give birth that would cause immense suffering if it would cause immense suffering is immoral and against certain religions laws. Although I myself am not Jewish, like many of you I am a parent. Like some of you I am a woman who has brought two babies into this world. Giving life and raising children is a selfless act. Having to prioritize my own health and well-being over that of my unborn children would have been a gut-wrenching choice. Many of us in that situation would turn to our religious teachings to guide us. The Constitution guarantees we have that right under freedom of religion. We cannot allow one religious view to define and prescribe reproductive health care. Our law protects each citizen's right to religious freedom. And indeed that is the nature of freedom. It doesn't just apply to one person or group. We shall not live in a country in which legislators have the right to teach one religion's precepts and teachings as superior to another. In this moment I urge hearing and thoughtful review of SR-136, a bill that would let Georgians decide the reproductive freedoms for our state constitution. Let's let people of all faiths not just partisan politics decide the freedoms that our state grants its citizens. Thank you Mr. President, I yield the well. Thank you Senator. Record out of the Senator from the 26th, 4-pointed personal privilege. Thank you Mr. President. We are not to get started with this bill. For the Senator who talked about funding will as I support him. You don't know what the circumstances are. You don't know what a woman's going to hear. The reason that I was a case has got somebody to get some wrong. And it's recorded. So let's don't bring that here. We are not in Congress. We are not in Washington. Let's take care of Georgia business and do what we need to do. Thank you Senator. Record out of Senator from the 36th, 4-pointed personal privilege. I'm a former president and good morning colleagues turning off your phone ringer when you're in the well as a smart thing to do. FYI. I rise today to speak along with other colleagues that you've heard already talk about today being the anniversary of Roe vs. Wade, a historic landmark Supreme Court decision that put in place reproductive choice for women. A policy that has been with us for 50 years until some new justices got up on that Supreme Court and throughout 50 years of judicial finding and put women back in a secondary position unable to freely make choices that work for them, their families, between the family, their faith leader and their conscience and their economic conditions as well. This is the anniversary of that historic ruling by the Supreme Court. Laws have consequences. Everything we do down here has consequences. We would be well served to understand in the real world for real people what are the consequences of Georgia's current position with the six-week abortion ban in place. Today on this anniversary I want to share with you for a few minutes the story, a very personal story of a fellow Georgian, a woman I know, a woman who's spent much of her lifetime in this state and shares this story, Al-Qaul or Emma. I share this story because we're seeking to expose the damage that can be done, that is being done and will be done as long as Georgia keeps this six-week ban, abortion ban on our books. It's a sad state of affairs and one that is really causing a lot of women to rethink what they want to do with their voting power. Emma grew up in an educated, affluent suburb. Her parents were well-known members of the community but nobody knew what was going on at home behind closed doors where Emma as a child and a young teen saw her father repeatedly abuse her mother emotionally, mentally and physically. It was commonplace behind closed doors. She grew up in that atmosphere where this secret was hidden from the world and she actually believed that this kind of relationship was normal. It's what she, the household she grew up in. She found herself in a relationship as a young adult with a man of very similar intentions, abusive, controlling. This abuse was even more physical than she had seen in her own home and she began to understand that this wasn't okay. She began to put together the resolve to leave the situation and we all know domestic violence is never okay and victims often believe it's their own fault. They're told by their abuser they bring it on themselves. They deserve to feel the shame and the pain and to be treated in this manner. But Emma decided she'd had enough. She escaped. She in April 2021 she ran as far away as possible but the next very next week she realized she had an early pregnancy. She lived somewhere else where she could get an abortion and she did and severed her ties with that man forever. Understand that when we force a woman who is pregnant to keep a pregnancy that is not in the interest particularly if she's in a physically abusive relationship, we are forcing her into a lifetime relationship with an abuser. Our sexual violence exception does not address that. It's wind addressing actually. And generations of domestic abuse result in generations of women believing that they cannot get out of it. That's why we have worked to invest in better women's shelters and a whole movement to free women from these bonds. Our law on abortion that blocks choices just six weeks after pregnancy is not workable. It's wind addressing. It's useless because I've had two children myself. You don't know it's six weeks that you're even pregnant in many many cases. So I'm asking you like my colleagues to support SR 136 on this issue. Let's see what Georgians think. Let's see what Georgia's women think. Let's see what Georgia families think. Pass SR 126 and we'll have a real chance to get public opinion on Georgia's six week abortion ban. Thank you for your attention. Mr. and I'll yield the well, Mr. President. There are no questions. Senator, thank you for that senator from the 37th recognize senator from 37th for a point of personal privilege. Thank you, Mr. President. Ladies and gentlemen, Senate and Georgians who are watching us today. Come today with somewhat of a heavy heart listening to some of the debate on this floor. But weighty issues bring to our mind clear thinking. I've been thinking about the discussion today about this the scourge that Roe versus Wade brought into our nation in 1973. I think through that window right there. I look to those windows. I see a public hospital. Then on March 18th 1970, a 20 year old mother college student who went to college right here in Atlanta brought me into this world. It's born to a single 20 year old mother before abortion was broadly legal in this country. And because she had no plans to raise me with my birth father, showed grace and laid me into the hands of a 27 year old pastor and his wife who for years and years had cried themselves to sleep at night because they couldn't have kids. They couldn't have children. Layed in their hands and adoption. The beauty of that picture, the beauty of adoption is a gift. It's something that so many Georgians today cannot enjoy. They go to Belarus, they go to Russia, they go to China, they go all around the world to try to find babies somewhere they can adopt a child that they can raise as their own and give love to. Because since the 22nd of January 1973, there have been 62 million. 62 million helpless themselves innocent living distinct human lives that have been torn apart and lost in the scourge of abortion. For every four Americans, one, two, three, four, you see the fingers on my hand, for every four Americans that have been conceived since 1973, one of those four, one of those four have perished in the womb through legalized abortion, one of four. So for every Georgian we have in our communities, for every three Georgians that are alive, there's one that's missing because of the scourge of legalized abortion. How did that come to our country? It wasn't imposed through politics, it slipped in. Do you know where abortion came from for him? Abortion was illegal throughout our history. Abortion was unlawful in every state and it started to slip in in the 1920s and 30s. It was no accident, it wasn't brought in by any church, it wasn't brought in by any faith, it was brought in by a group led by Margaret Sanger who organized something called the Negro Project. And the Negro Project, Push Mar Margaret Sanger and her supporters recognized this. They were trying to push a population control agenda on America, they were virulently racist, it was disgusting, and they reasoned this, and this is published. The reason that the North East liberals could never convince black Americans that abortion was good for them. Their goal was if they can convince the pastors, that they could convince black pastors that abortion was good for the economic opportunities for their congregations and their people, then they could slide in and sell abortion to the minority communities in our nation. The cynicism of Jim Crow racism is what brought abortion to our nation. And the sad reality of that, the sad legacy of that is that abortion clinics have been disproportionately located in our minority communities and the percentages targeted by our liberal roots in our country have focused on minimizing our minority populations over these last 62 years. Mr. President, this is no unwady matter. It's a matter that when we see 62 million helpless living distinct persons who've perished, we recognize it's not religion or Sunday school that cries out. It's science law and common sense. Friends, if we had a TV screen up here, and I had a baby that was eight, nine, ten weeks along inside their mother's belly, and I showed a 40 ultrasound to a group of kindergartners. You asked the kindergartners, what are you guys looking at here? Those kindergartners look at that screen, they say, that's a baby. Baby has a heartbeat, their kindergartners are already at the side of their DNA, their DNA is already set. All they need is a safe place to live in nutrition, and they'll live to ripe old age. Roe versus Wade was imposed on us by 72 opinions of the United States.\n\nCourt. If we think the rulings of the Supreme Court by an overwhelming seven to two opinion on this issue of personhood and who has rights is always right, I would ask you what are that same United State Supreme Court in the same room by the same seven to two opinion decide just one hundred and sixteen short years earlier. Well there's a person who had questioned the event before the court in eighteen fifty six the United States Supreme Court by seven to two overwhelming majority said the grand scouts not a person he's property his life's not worthy of full legal protections that same court but that same seven to two opinion got it wrong in eighteen fifty six and it got it wrong in nineteen seventy three and mr. President as I yield the well I want us to think about the weightiness of our times in this discussion we're not preaching religion here we're teaching science solid law in common sense in all three of those things in form us we recognize the difficult circumstances women find themselves in but as we weigh that with a basic right life of a child I stand with the least among us helpless child that needs this legislature to protect them and I'm proud that this legislature has you'll do well thank you senator remind the members I haven't said anything to the ones who have gone over but there's been a couple of three y'all who've gone over so just don't don't don't make me have to just stop you in the middle of your speech so I recognize the center of the the 10th for a point of personal privilege this president and members of the outrises whether on this joyous occasion to recognize the divine nine today has been declared the divide divine nine day and they are meeting downstairs and there's probably a few upstairs but I wanted to make sure that I explain to everyone in this chamber about the divine nine and yes I'm gonna ask if I can be joined by some of my colleagues who's over here to my right that are members of the divine nine I'm glad you asked me the question well who are the divine nine let me tell you the divine nine are the divine nine was created in the early 19th century as a social Greek organization known as sororities and fraternities they began forming on college campuses across the United States to provide a sense of community and unique opportunities for students these organizations were often highly exclusive in barred membership to students of certain genders or races specifically black students so I started a 20th century a small number of black students came together from many historically black colleges and universities as we know today as HBC use to form their own sororities and fraternities these organizations are known collectively as the National Panellinic Council or as we call them the divine nine each of these organizations were established with unique core values but shared a common goal to educate and uplift the black community from racial inequalities and disparities the divine nine are Afro-Fy Afro fraternity founded in 1906 Cornell University and if there's any members of these organizations please stand as I list your sorority or fraternity Afro-Cafo-Affo sorority founded 1908 Howard University Kappa Afro-Cy fraternity founded 1911 Indiana University which I'm a proud member Omega-Cypher fraternity founded and I know I will be as well founded 1911 Howard University Delta Sigma Beta sorority founded 1913 Howard University Phi Beta Sigma fraternity founded 1914 Howard University Zeta Phi Beta sorority founded 1920 Howard University thank you I sent it over here Sigma Gamma Rose sorority founded 1922 Butler University Senator Jackson I owed it Phi Beta fraternity founded 1963 Morgan State University the divine nine as you can see has played a tremendous contribution to American history on today we celebrate and recognize the divine nine thank you thank you Senator recognize senator from the fifth for Point of Personal Privilege thank you Mr. President I speak today as the senator representing Georgia's most diverse district that's the distinction I wear as a badge of honor as a former president of the United States Georgia's own Jimmy Carter once said we have become a beautiful mosaic different people different beliefs different boring different hopes different dreams as being one who represent this extraordinary extraordinary district I understand that I'm not obligated to respect and to have compassion for their honorable and sincerely held beliefs even they are not my own it is not for me to judge and it's not my job to impose my personal belief or interest upon my constituents my job is to protect their rights and freedoms and to ensure that the Senate respect their views on important issues we have not protected and respected their rights to reproductive freedom in fact we have failed them and they are not happy the anger that is ingest in my district polling over the past year shows most Georgian do not support our current abortion law Georgian do not want this law Georgians want more reproductive freedoms less government interference and the right to make decisions with their doctors it is our duty to allow the people to make this decision for themselves by passing Senate resolution 136 like many immigrants to this country I deeply value the rights and freedoms in our country and state and in Georgia we have always strongly protected the right to privacy we have fiercely guarded the rights of families to determine what the best for themselves in the privacy of their own home without politician interfering in their lives I will not be quiet we endangere this rights and freedom and I will not allow the Senate to deprive my constituency or Georgians across the state of the freedom to leave their lives according to what they believe is right and that is exactly what our current abortion law does we must honor and respect the citizen of Georgia we must honor and respect our state's long tradition and allow Georgian to decide for themselves what is best for them and for their families let's pass as our 36 let the people decide this issue thank you mr. President I yield the world thank you senator recognize senator from the 12th or born personal privilege thank you mr. President and I promise to be extremely brief to my colleagues please do not use blacks as a scapegoat for your ideology or your relationship with females we are tired I've said it a thousand times black women are not the ones that are aborting their babies only and most times it's very difficult to talk them into having abortions and if you don't live in the neighborhood if you don't understand black families and the relationships that we have then please don't try to use rhetoric that is not going to work thank you for listening and please be careful how you use other groups to define your ideology thank you mr. President I leave yield the will thank you senator I recognize a senator from the 47th for a point of personal privilege thank you mr. President I'll be brief you know one of the things that a little levity would help us but I also want to want to make sure I point out that you know I heard something totally unfactual earlier today I heard the president of this body referred to himself as not a really stellar athlete and I thought to myself as a holy crap you don't get to the University of Georgia and play at the University of Georgia football team without being a stellar athlete that just doesn't happen so mr. President I want to correct you on that one but I want most importantly I want to recognize a group from back home I've got the Jackson County leadership group here a great group of 24 high school students and if they would I'd like them to stand up and let's give them a round of applause and a welcome to our senate body you know it's it's we do a lot of important things here and some not so important but I don't think there's anything that's more important than recognizing our future leaders and our youth and I thank you all so much for coming and being with me thank you senator I didn't hear all of what you first said but I I called a little a little glimpse of it and my job up here is to speak the truth at all times and and so so I so when I when I said I wasn't very good I'm in it and so but it iterate all right is anyone else want to have a point of personal privilege I think we got about everybody covered today recognize the senator from the 45th mr. President I move that SB333 with withdrawn from local consent calendar and committed to state and local government general secretary read caption Senate bill 333 a bill by my senator dixon will be 45th and others a bill to be entitled act to incorporate the city of mulberry to provide a charter to provide for legislative findings and further purposes that completes your mr. President senator senator just asked that Senate bill 333 be withdrawn from state and local government and move to state and local government general is that correct okay all right is there objection to that without objection it is granted we we've got a couple of resolutions that come over from the house here um I'm going to let the should be pretty simple but let secretary read the caption house resolution 805 by representative of station of the 1004th be it resolved by the general assembly of Georgia that the honorable chief justice of the supreme court is hereby invited to address a joint session of the house of representatives and the senate at 11 a.m. Wednesday, February 7th, 2024 in the hall of the house of representatives that completes your mr. President recognize the majority leaders speak to the resolution thank you mr. President good morning another lawyer bill here we need to talk about looks like the house has invited us back for another visit so we'll be going over to the house chamber next Wednesday at 11 a.m. to hear an important message from the supreme court justice of Georgia and all the other justices and the district appeals justices well so we'll see you there we'll line up here in the in the senate chamber like we did two weeks ago for the state of the state address and we'll march over to the house chamber and we'll listen to all the good information that they'll be bringing to us on that day mr. President I'll yield the will thank you later is there of juke objection to the adoption resolution chair here's none resolution is adopted secretary read the captions of the next resolution please house resolution 806 a resolution by representative station of the 1004th a resolution to call for the nomination in election of the chairperson of the state election board and for the purposes that completes your mr. President recognize the pro-tam the speech of resolution thank you mr. President good morning colleagues this is not a lawyer bill I know you're happy to hear that on this money morning this is just a joint resolution it calls for the election of the chairperson of the state election board under the code section the chair is elected by the general assembly in the way this works there's a nomination and election done from the house that comes over to us for senate confirmation the resolution before you simply sets the time and place of that election that you'll see online 12 which is this Thursday January 25 at 11 a.m. is set for the time for the election and that will be for the house to make that election and then send it to us for confirmation and a confirming vote happy to answer any questions otherwise mr. President I yield the will sorry but senator you do have a question senator from the 14th thank you mr. President's pro-tam yield yes mr. O'Tam actually think these procedures make perfect sense to me I would be happy to support them my only question is don't these procedures assume that somebody wants that job yes I think that's outside the purview of this resolution though senator but I appreciate the question I understood you have my full support today right prudent thank you I don't know if that makes me nervous or not thank you though I'll yield the will yeah thank you senator the question is on the dots of resolution all those in favor of the adoption of resolution will vote yay oppose nay secretary one lot the machine on the adoption of resolution yes our 51 the nays are zero and the resolution has having received the requisite constitutional majority therefore is adopted you you have for you a consent calendar privilege resolutions does any senator wish to remove a resolution from the consent calendar is the objection to the adoption of the resolution on the consent calendar chair here's none the resolution on the consent calendar is adopted moving on to the rules calendar we have owned the docket today house bill 571 secretary read the caption you house bill 571 by representatives silcox of the 53rd and others a bill between tautenac to amend article eight of chapter six of title 49 of the OCGA relating to all simers and related dementia state plan so as to provide the Georgia all simers and related dementia state plan be updated every four years to provide for a progress support between updates and further purposes if i complete see what our mr. president we're gonna have a senator from thirty seconds speak to the bill you thank you mr. president i'm sure i don't have to tell anybody in this room about the impact of Alzheimer's disease and dementia which affects so many families in Georgia including my own house bill 571 is an agency bill from the department of human services it updates the reporting of the Alzheimer's and related dementia state plan better aligning it with federal law it changes the state plan reporting required by our state statute from three to four years and it also adds a midterm report to the general assembly and the governor every two years so that we'll have up to date data and statistics on this rapidly changing problem this bill passed the house unanimously and is supported by the advocates for Alzheimer's and dementia and i would ask for your favorable consideration if there are no questions i'll yield the well you have no question senator thank you and thank you for all the good work you do in in this arena their senator it is a painful painful disease watch when you have close ones who are affected by it so any other person would speak to the bill is there objection to agree to report the committee which is favorable to the passage of the bill chair here is none the board of the committee is agreed to is there objection to the main question be in order chair here's none the main question is ordered the questions on the passes of the bill all those in favor of the bill vote yay opposed nay secretary will unlock the machine on the passes of the bill the a's are 51 and a's are zero this bill having received requisite constitution majority is therefore passed recognize the senator from the twenty-nine mr. president i moved the senate received from his disagreement to the house substitute s b one five nine and agree to the house substitute the senator's move secretary read the caption senate bill one five nine a bill by senator robert sent of the twenty-ninth and others a bill to be entitled to amend article one of chapter five of title 42 of the obcga relating to general provisions regarding correctional institutions of states and counties so as in prohibit wireless communications and standalone electronic devices behind guard lines and further purposes the house offers the following substitute to senate bill one five nine a bill to be entitled to amend article one of chapter five of title 42 of the obcga relating to general provisions regarding correctional institutions of state and counties so as to revise punishment for reasons relative to prohibited items in possession by inmates and further purposes that completes the order mr. president the senator from the twenty-nine th is moved the senate received from his disagreement to the house substitute s b one five nine and agree to the house substitute speak speak you like speak to this i'm sure right senator i recognize senator from twenty-nine speak to the measure good morning friends and colleagues i'm sure many of you remember this piece of legislation um it's in your notebook peaked page lc 39 38 98 s's in Sierra this legislation dealt with crossing the guard lines of correctional institutions with um contraband primarily focusing on that of the the behavior the illegal behavior of employees and contractors in these institutions you would have to be sleeping under a rock in another country not to realize and not to understand the absolute danger that exists in the Georgia State Department of Corrections today every community has suffered tragedies with the assault and murder of correctional officers and prisoners uh detainees and citizens being held inside of our facilities and a lot of this is facilitated by support from outside a lot of that outside support comes from corrupt correctional officers corrupt contractors and others who have access to sensitive parts of our prisons and jails here in the state of Georgia uh during our debate last year we had some concerns with the word mandatory working with our friends over in the house we have we have stricken that word from the legislation so there is not a mandatory minimum in there um the judges are given the opportunity to split sentences and do the things that they do under their discretion i don't think i have to rehash the hits that have been placed on innocent citizens from inside of prisons i don't have to repeat the story in the a jc last week where an individual made $11 million by running an illegal operation while inside the Georgia Department of Corrections facility i don't have to talk about the trial that's currently ongoing that has brought attention to the corruption danger and violence that occurs inside of our prisons even during that trial individuals that are sworn to uphold the law have violated the law and had to be arrested if we want to get serious if we want to get real serious about keeping our prisons safe keeping our jails safe not only for the men and women that work there but for the men and women who are Georgia citizens who have a right to a safe environment to live in and serve out their sentence or a wait do process then this is the type of legislation that will help push that forward and with that mr. president i'll yield for any questions you do have a question senator i recognize a senator from the second four questions thank you mr. president senator do you you i do you'll sir i know this is a shocker but i'm going to support the legislation today because you took out the mandatory but i do have a question and my question is senator when we look at the warden or superintendents in this legislation to have the ability to give discretion how was that discretion police when sometimes they are part of the very criminal enterprise that is plaguing many of our prisons in this state i think under the new commissioner that we have in uh Georgia department corrections i think we've seen a change on policy and procedure there's been serious talk about the management in the upper part of our prison system because i think you and i both agree if we see a behavior down the chain then there's a reason that behavior is being allowed and that's usually a reflection of leadership and i think under all of us operate under policies and procedures we all have senate rules we all have caucus rules we all have a title 16s title forties and when individual step outside the line we will never create the perfect policy that no one will ever step outside the line but by making these lines as bright and as as clear as possible i think we go a long way in preventing bad behavior and i think this does that and i do want to say this from my heart to the senator from the second i do appreciate your support on this legislation if there are no further questions you have no further questions you can yield the will you have no further questions i'm sorry thank you miss president yield the well i recognize the senator from the 14th to speak to the to the bill i thought we were going to get here by all four i think it's four things from that people i become stronger than before that that kind of thank you miss president oh i'll tell you i never feel further from interstate 16 then when i take a different position the senator from the second on a bill um typically when i'm in groups that mostly have the same composition and i try to be aggravating it's without respect to party so you know here if i'm aggravating it's primarily the majority when i go to dinner like i did the other night with a bunch of democrats i try to be aggravating them so i have to use your talking points to do that um but i was with a bunch of liberals and we were enjoying a nice dinner i was\n\nAnd I said something nice about a Republican, and everybody's head went, huh? And the reason was we were at a Bold Monk Brewery, check it out, great spot, shout out in town, and we were upstairs. And that was the second time I'd ever been to Bold Monk Brewery. And I was remarking to this table of liberals that the first time I'd ever been to Bold Monk Brewery, I was in an event sponsored by another representative Buzz Brockway. You may recall him. He has worked a lot since leaving the house on reentry. And he's part of an organization called Georgia Center for Opportunity that works with people leaving correctional facilities to help facilitate their reentry into society. I'm going to read you their mission statement real quick. A promises is relevant. Removing barriers to ensure that every person, no matter their race, past mistakes, or the circumstances of their birth, has access to a quality education, fulfilling work, and a healthy family life. That is how he punctuates the end of that statement, a healthy family life. Now I want to keep that right here for one second. I oppose the bill, but I want to start with the principles that the Center for the 29th and I share. And again, to use the word shocking, you may not expect me to say these exact words. So I'm going to go ahead and say them. We should all agree that gang activity and free flows of contraband are the single biggest threat to public safety inside the walls of the Georgia Department of Corrections. I'll say it one more time. Gang activity and contraband are the single biggest threat to public safety, the open wound that everybody's dealing with. Because these problems compound themselves, right? They're like a spiral. If cell phones, illegal drugs, weapons, find their way inside the prisons, these are tools that gangs can use to keep their hold on power and create more of the same problems. It just spirals out of control. And then you get the headlines like what we've been seeing. So I think, and this is my opinion, that every Democrat and Republican should agree that that is the single biggest open wound that we are dealing with behind walls in GDC. We also, as we now have an issue with correctional staff in the past, or last five years and numbers, about 250, who have been caught bringing contraband inside the walls. But let's talk about, and the commissioner of corrections who has done a lot for transparency for that organization, Commissioner Oliver, let's talk about the 1,500 people who were caught during the same time, who were civilians outside the walls. Six times, a number of people, civilians who were caught bringing contraband inside the walls as correctional officers. So we got a problem on both sides of the wall. Now, we already have a penalty if you bring stuff in that's two to 10. Judge has discretion to go up to 10 years for the offense we're talking about. That already exists. So think about what this bill does. The only thing this bill does is take the ability of judges away to give a sentence that's lower if that's appropriate. I want to sing the praises of GDC for one second in this very specific regard. They are laser focused on this contraband issue and on figuring out how to stop contraband from getting inside the walls. Let me ask you all a question. Have you all read any coverage on how contraband gets inside the walls? Have you all seen the problem? So there's been some newspaper reporting on hot pockets, right? Putting a cell phone inside hot pockets. But 14,000 cell phones in one year don't get inside GDC exclusively through hot pockets. Where do they come through? Drones, right? Big drones. Drones as big as a couch. I have seen the pictures myself. And if you go ask the commissioner corrections, he'll show you. The pictures of the drones that bring cell phones, drugs, anything you could imagine, right, inside the walls of these prisons, sometimes hundreds at a time. Now, you might think, well, that's probably already illegal. It sure is. But it still happens. And not only does it still happen, the technology that the people outside the walls are using to evade capture is already so sophisticated. We've got technology where we can track where drones are, but not only where the drones are, where their operators are, based on the remote controls they're using to control the drones. But guess what the drone operators do? They do it like a crack pot, set and forget. So they go to the place where they operate the drone, they drop the thing, and run off. But that's still dangerous. And it's so dangerous for them, in terms of capture, that they get paid tens of thousands of dollars by gangs to operate these drones to get stuff inside the walls. So we are talking about extremely sophisticated and tight-knit networks of people who are moving big money, lots of contraband at once, from one side of the walls to the other. That's the policy problem. Why do we have a vacuum of security inside the walls and where these drone operators are operating? I would submit to you this morning, still morning, that it is not because our penalties on this conduct are not high enough. And it's what I just said. They're already high enough. The judge has discretion to use a 10-year sentence if they want. But they haven't been, necessarily in every case. And so I guess we're taking that discretion away. In fact, we don't even know if they've been using that discretion or not. We're just passing a bill to take discretion away. But I want to return briefly to the point about what represented Brockway was doing and how we think about people inside the walls. Nobody is acting like the people inside the walls are angels. And I understand, Senator, from the 12th, we are never going to make it a Ritz Carlton inside those walls. I guarantee you. But we have to think about the fact that these people are coming back. They will leave prison at some point. They will re-enter society. Unless your policy solution is just to make automatic life sentences death penalty on everything, you will be seeing these folks again. And what represented Brockway and a lot of other well-meaning people on both sides of the aisle realizes they've got to be ready. And that means a lot of things. It means technical certifications, work programs inside the walls like we already have. But it also means access to family, emotional supports. It means they need to be able to talk to the outside world. So let me submit something else to you. One of the reasons why we're having such a problem developing the bipartisan consensus we need on how to deal with cell phones is because the same cell phone can be used to face time with an infant child as to coordinate a murder outside the walls. So when you say, let's just take away all cell phones, well, sure, that's one part of the contraband issue. But what are we going to do about the fact that we've got tens of thousands of people who are eventually going to come back to our general society, who are taking away some of the most well-connected access they have to their families. Faces, being able to see, talk to say, I love you say, good night to their family members. So these people have done totally horrific things. It would make my stomach curled to think about it. But they still have family. And they still have to talk to them to maintain the baseline emotional health that they need to be functioning members of society when they leave. Georgia's sort of opportunity, healthy family life. What I think we need, and I think this is way bigger than any policy problem. It's way bigger than any administration, is as a society, we need to ask ourselves, if these prisons are just a place where people are out of sight, out of mind, whether we're scared of them, so we throw them away, and we don't think about what's happening to them, because if we do that, what I submit to you is that we get exactly the circumstances that are motivating this bill. We get people who are left in a vacuum of security who are not historically funding enough, although I give great props to chairman appropriations, I think is a 4% increase plus 3,000 on top for many state employees in GDC. We are working aggressively now to try to resolve this problem that's been accumulating. But if you talk to commissioner corrections, he'll tell you, it's not just the salary, it's also that we're having a hard time recruiting people to the profession in GDC, because they don't see prestige and dignity and profession. Let alone they can get stabbed in the back, walking through a hallway. I mean, let's put that to the side. They don't want to be associated with something that's getting covered by the news is corrupt whatever. This narrative we keep reinforcing about corrupt officers. They want to be respected. They want to feel like a police officer is respected by a community. So there's a cultural shift that needs to happen. And what I submit to you, and this is the part where maybe I don't get everybody is, I think the more you focus on the well-being of the people inside, the more that you think about serving not just the people inside, because you've got to take care of their basic needs, because they're trapped. But also serving the wider community by preparing these people to come back in. The more that the mission becomes a service-oriented mission that's about human wellness more than it is about punishment, that's a mindset, and that's not just people in this room or the administration, that's society, that's everybody. But we have a role to play in that feedback loop, where we don't reinforce the impressions on the nightly news in this chamber that these people have throw away people. That's up to us in part. If we can lead on the mindset that the purpose of these facilities is temporary safety to the public while we make sure people are ready to go back in, and we focus on their basic human needs when we do that, that's when policy starts to move. That's when you get Democrats and Republicans saying, together, let's jam cell phone signals. Let's go to the federal government. Let's tell John Assoff and Rafael Warnoch and our congressional delegation that we would like to tell the FCC that we need cell phone jamming inside these facilities. But the flip of that, the basic human need, is that we have to have free access to phone calls to family. Now that's monitored access, because that's these phones by these vendors that we can monitor, and we know if activity is happening that we don't like. But we have to think about both sides of the problem, the human needs and the public safety needs it's pressing. And if we said that with one voice, that that was the goal, and we need our federal delegation's help, we could start making the changes in the short run that we need for these facilities to be locked down, secure, and not coordinating gang activity that causes problems on the outside. Now that's one of those bipartisan messages where you're losing people on both sides, and your base is not happening necessarily with everything you're saying. But that's a functional solution. So this bill is not about jamming. This bill is not going to solve all our ills. This is just a penalty for contraband. But what I submit to you is not only is this bill worthy of opposition because it takes away judicial discretion and forces maybe some very long probation sentences if they don't want a custodial 10 years. Because if it's 10 years, you got to decide. Is it all probation, all custodial? So either you're throwing them away for 10 years or you're doing 10 years of probation, which our commissioner of community supervision has said anything past two years, three years, doesn't solve the policy problem. And our chairman of judiciary led on terminating probation early because of that. So it takes away judicial discretion. But the bigger issue is that this bill reinforces our collective mindset, our attitude, that the way to solve public safety problems is just to throw people on the other side of the wall. But folks, when we're sending couch-sized drones, y'all have played Red Rover as a kid. You stand in a line on one side. The other side stands in line on the other side. You hold hands. You say, Red Rover, Red Rover, send whoever right over. And then they just come over and join your side. That's all the sentence does. You got people operating drones outside the walls who are going to go just play for the inside the walls team for 10 more years. And in the meantime, we will not have done anything to solve the actual policy problem. I'm grateful for your attention this morning. And I'm happy to talk about this ad nauseam anytime y'all want in the hallways. Mr. President, I yield the well. The senator has yielded. I recognize the senator from second. You're good. OK. Does any other senator which speak for against the bill? Chair here is done. Is there a jack shan? Would you like to close the senator? Senator from 29 closes the bag. Appreciate the comments. I don't know that I've ever heard anything so serious referred to as games of Red Rover. But not just phones are brought in by drones, but other things are brought in by drones. Much, much more dangerous. And it's usually coordinated through officials, employees of the institution. The senator from the 32nd was able to work on legislation get past several years ago to address the drone issue. And in the process of that, we were able to talk to the FAA about cell phone jammers and all the other stuff. The problem you have with the jammers is most of our prisons are located near residential areas, near highways, and other places. And these jammers aren't precise enough just to narrow down into that one little spot. And so a lot of people living in neighborhoods around there, their cell phone service is impacted. People driving up and down, I-16, their cell phone service is confusing and jammed. And plus, the emergency plans within the prisons and within the correctional facilities that the employees lean in to keep them safe a lot of times rest on communication via cell phone. So we run into some issues there. No one in this room disagrees that correctional officers have a tough time. Because, unlike my colleague, I've actually worked in the field. And been inside of a lot of our prisons, spent a lot of time in Jackson and the diagnostic, taking people there, having them evaluated, moving them around. And it's a standard problem. Once DOC raises a standard, which I think under Commissioner Oliver, they will, then you will find a higher quality employee. And that respect comes there. My friends in the back of the room where in a powder blue shirt will tell you that having high standards is the beginning of getting respect. How you wear the uniform, how you present yourself, how healthy you are. But I will tell you this. Somebody asked me a question one time about a correctional officer giving a detainee some tobacco and how bad it is. I said, here's the problem with that. He gives him tobacco. Then that detainee owns that officer from that day forward. Because two days later, he's going to ask for something else. And that officer realizes that he is owned. And then he's going to ask for something else. And these will ask for something else. And it won't be tobacco every day. It'll be a pair of shoes one day. It'll be a knife one day. It'll be a cell phone one day. It'll be something worse another day. He'll ask that officer to do something outside of that institution for him as has been done. And we've seen pictures of the dead bodies of the female former correction officer who was assassinated down South Georgia. We saw the prison in South Georgia that was taken over and the correction officer lost his eye trying to do his job. Cretch's officer should be held to a higher standard. They should be held to the same standard that I was held to. They should be held to the same standard that every trooper, capital officer, GBI agent, and every other post certified law enforcement officer in the state of Georgia is held to. And it's not the regular standard. It's much higher. I appreciate your time. I ask that you please support this legislation and with that Mr. President, I yield the well. We're going to wave it off. OK. Does any other senator wish to speak for against a measure? Chair here is none. And the main question is ordered. Is there objection to the main question be in order? Chair here is none. And the main question is orders. All those in favor of the motion will vote ye. All those opposed nay. Secretary, we'll unlock the machine. Senator from the 14th, what person's the purpose of your rise? Parliamentary agreement. State your inquiry. Mr. President, is it not true that despite the Senator's comments just now, Commissioner Oliver is very clear about his support for advocacy for Jamie at the federal level. Is that not true? But the Senator speaks for what he knows. We're going to send it from the second for what purpose do you rise? Parliamentary agreement, Mr. President. The state you're inquiring. Mr. President, is it not true by me voting yes on this legislation that we can find and compromise with members in our mind on part of women I'd always agree, but we'll agree to disagree and that the majority party could take a lesson in that. I think any time you have bipartisan support on anything, Senator, it's a good day. On the pass of the motion, the A's are 43 and the Nays are 7 and the motion has prevailed. I recognize the majority leader for motion. Thank you, Mr. President. Day 6 has come to an end. I move that the Senate stand adjourned until 10 a.m. Tuesday, January the 23rd. The majority leader has moved that the Senate stand adjourned today and reconvene on Tuesday, January 21st. Secretary, read the announcements. The rules committee will meet immediately upon adjournment in 450. The Transportation Committee will meet at 1 p.m. in mes 1. The government oversight committee will meet at 2 p.m. in 307 of the CLOB. The Health and Human Services Committee will meet at 2 p.m. in 450. The Finance Committee will meet at 3 p.m. in mes 1. The Judiciary Committee will meet at 4 p.m. in room 307 of the CLOB and the Agriculture and Consumer Affairs Committee has been canceled. That completes your turn, Mr. President. I recognize the Senator from the 30th second for announcement. Thank you, Mr. President. You've got to fly around your desk tomorrow's Japan Day at the Capitol. So you'll see a lot of Japanese companies bringing their stuff to show you all when you arrive in the morning. So they'll be out in the street between here and the CLOB. So I hope that you all will stop by and welcome our Japanese companies. Thank you, I yield the well. Thank you, Senator. Any other Senator have announcements like to make? All right, the majority of the leader has moved that Senate stand adjourned to January 21st, 23rd at 10 a.m. All those of favor of the Post will signify by saying aye. All those opposed? No. The aye has clearly haven't. We're adjourned. Thank you.",
  "updated_at": "2026-02-13T16:16:59.065713+00:00"
}