{
  "video_id": "U5lJ8SCA62Q",
  "url": "https://www.youtube.com/watch?v=U5lJ8SCA62Q",
  "title": "Rules Meeting 2026 - Day 13 AM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 13,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Overview:\nThe Georgia Rules Committee meeting on Day 13 of the AM session covered several legislative actions, including a bill related to peer specialists in substance abuse recovery, a bill addressing medical licensing and credentialing, and a bill regarding miniature trucks.\n\nKey Actions:\n**HB 657**: Provides consistency of care and quality of support for persons or families in substance use abuse recovery by defining certified peer specialists and laying out requirements for recovery community organizations.\n**SB 162**: Allows for administrative approval of medical licensing by the Composite Medical Board, and enables hospitals to input credentialing information to allow for statewide credentialing.\n**HB 9573**: The \"miniature truck bill\" was passed out of committee.\n\nBills Introduced (First Reading):\nNone noted in the transcript.\n\nNotable Moments:\n- Representative Martin welcomed a constituent from Alfredo High School to observe the proceedings.\n- There was discussion around issues with the Composite Medical Board's processes for licensing and credentialing medical professionals, and how the proposed legislation aims to address those concerns.\n\nVotes:\nNo recorded votes mentioned, but bills were described as \"passed\" or having \"full support\".\n\nAttendance:\nQuorum was present, with representatives and senators participating in the discussion.\n\nAdjournment:\nThe transcript does not indicate when the meeting was adjourned or the date of the next session.",
  "transcript": "Sorry.\nMorning everybody.\nMorning.\nRep Martin.\n>> Morning everybody. Uh we'll go ahead and\nand start our meeting on recognized\nchairman Newton to open us up with a\nword of prayer.\nThank you, Mr. Chairman. Join with me.\nFather, thank you for the opportunity to\nuh to serve you today as we as we try to\ndo every day. Uh give us wisdom as we do\nthat as we also serve the people of\nGeorgia and our fellow representatives\nand legislators. Thank you for this\ntime. Uh give us wisdom from you in\nJesus name.\nThank you, sir.\nI'd like to recognize Representative\nMartin uh has an announcement he wants\nto make, I think.\n>> Thank Thank you, Mr. Chairman. I just\nwanted uh ask the rules committee if\nthey'd join me in welcoming a\nconstituent down from Alfredo High\nSchool, Miss Holly Magcguire, in the\nback for uh coming down to see uh the\nbusiness of Georgia done today.\n>> Stand up so we can\nGlad to have you visiting today. Thank\nyou. Okay, let's go ahead and begin over\nhere.\n>> Chairman Hagen.\n>> Thank you, Mr. Chairman and committee. I\nhave House Bill 657. It is about halfway\ndown the blue sheet.\nThis bill provides consistency of care\nand quality of support for a person or\nfamily in substance use abuse recovery\nby defining certified peer specialists\nand laying out requirements for recovery\ncommunity organizations.\n>> Okay. Don't see any questions. Thank\nyou,\n>> Senator Huffeller.\n>> Thank you, Mr. Chairman. I've got Senate\nBill 162, which is the next to last one\non the sheet. This is a hold over from\nlast year due to it had turned into\nmultiple subjects and it's restored now\nto its original bill and it's shorter\nbecause appropriations were made to the\nComposite Medical Board that put in a\nnew system that's up and running and\nalready showing major improvements.\nThey're doing a great job over there\nnow. And in the past, it's taken way too\nlong to credential and license our\nphysicians and physician assistants. And\nof course, these come under the\ncomposite medical board. Our nurses come\nunder the secretary of state. So this\nonly can deal with with them on this\nsystem. But so I semi-retired a couple\nof years ago with a spotless record. And\nto work across town, it took me three\nand a half months to get through the\ncredentiing process. And I know people I\nmean I I did a lot faster than some\npeople did, but they had a severe\nshortage of anesthesia staff. and um it\num it's it's certainly been a problem,\nbut because they've done so much work,\nthe bill is shorter now. So, we're only\nlooking at two things in this bill, and\nthe composite medical board agrees.\nOne's to allow for an administrative\napproval. The way it is right now, if\nthe board were to meet today, and your\npaperwork's in tomorrow, then you can't\nwork until the board meets again on\nMarch 5th. And this would allow them to\nadministratively approve it, get them\nworking, and then the the full board can\ncome um ratify it later on. The second\nitem, which has the full support of the\nGeorgia Hospital Association, will allow\nfor hospitals to input credentiing\ninformation and would allow for uh\nindividuals to be credentialed\nstatewide.\nUm, and this may need some additional\nsoftware and it's going to be subject to\nappropriation. So, we've actually\nalready done this for our medical\nstudents. They were spending hundreds of\ndollars getting credentialed at every\nhospital they went to. Dr. Paul Brock,\nwho's a general surgeon and he's the\ndean of the Northwest Georgia campus,\ndid this, set this up. It's it's\nworking. And that's why I refer to this\nas the Paul Brock Act because he went\nahead and did it. And um this will be\nable to get people out almost\nimmediately to help out when somebody's\nout on disability, pregnancy leave,\nwhatever. you know, quite often the\nbaby's a couple of months old before you\ncan get somebody credentialed um to work\nin that facility. Um\nso that's that's the the bill and\ncertainly entertain any questions.\n>> We do have a question, Chairman Powell.\n>> Thank you to my friend. You know, you\nbring this up about the composite board.\nI've been talking about this for quite a\nwhile. We passed some bills a year or\ntwo, session or two back. asked by the\ngeneral assembly, signed by the\ngovernment to give shortterm\nprescription rights to APAs and PAs\nunder doctor's protocol.\n>> But yet here we are a session or two\nafter they have passed and there's still\na hold up because the composite board\nhasn't passed the rules and rigs and it\nsounds to me like there's other issues\nthat's going on over there\n>> there there are emergency procedures in\nplace and I think those happen in some\ncases. Um but two things they didn't\nhave the um the software in place to do\nthis and the second thing is um the\ndelay from when the board can meet can\nsometimes happen to that. But the the\nbigger issue here that wasn't dealt with\nin that and that was some some good\nmeasures is that the hospitals when we\nget the the software ready can input\ntheir credentiing information in there.\nAnd so it'll be a one-stop shopping now\ninstead of the hospital doing their work\nand the composite medical board doing\ntheir work. It'll all be together. And\nif you're credentialed in this hospital\nand and everything's in place, you can\nimmediately go on and work at another\nhospital that needs you then without\ngoing through an emergency process. It\nsounds like the issue that you've got\nand the one that I mentioned that we\nhave some issues with the composite\nboard. It may may or may not be all\ntechnology based, but I'd like to talk\nto you offline.\n>> Sure. to give your advice\n>> and and I advice.\n>> I I will, but I I will say that the new\ndirector has made major strides now. I I\nthink we're down to about 30 days now\nwhen it used to be many many months. Um\nbut this would get it down to uh you\nknow potentially instantaneously. We've\ndone this with the medical students of\nAugusta and um Paul Brock did and it's\nworking great for the students. Once we\nsaw that, we said, \"Well, let's go ahead\nwith the PAS and the and the positions.\"\n>> Okay. Thank you. I have another\nquestion. Secretary Kelly.\n>> Thank you, Mr. Chairman. Chairman\nHoseller, thank you for being with us.\nWhen you speak to the credentiing piece\nhere, you mean only allowing the\nprovider to have access to the hospital\nfacility to practice. This doesn't have\nany relationship to the credentiing\nthrough the insurance companies or the\npayers for that aspect. Correct.\n>> Correct. This you know that the medical\nboard composite medical board license\nyou the hospital credentials you this\nsoftware upgrade when we put it in place\nwill allow the hospitals to put input in\nand then they will be credentialed in\nthat facility. And um I know both the\nthe CEOs of the hospitals in Rome want\nthis as soon as we can do it to help out\nwith the shortage they've got. They'll\nbe credentialed immediately in both\nfacilities and can use people at both\nplaces or any other hospitals.\n>> Thank you,\n>> Senator. Do they have another question?\nUh whip park.\n>> Yes, sir. Thank you, Mr. Chairman.\nSenator Huffeller, thank you for the\nbill. Um as I'm just reviewing um the\ncommittee substitute on line 27 um it's\npermissive with respect to certain\nparameters for the recommended system.\nIt's a may not a shall. Is there\nintentionality around there?\n>> We didn't want to force any hospital to\nsay you have to do this but they can put\neventually when this is implemented they\ncan put any information they want into\nthis system and it will allow them to do\nit. So you're right it's not it doesn't\nforce anybody to do it but I can tell\nyou they all want it. Thank you, sir.\n>> Thank you, Senator. I know many of us\nhave had some calls and concerns about\nthe licensing and the protocol and and\nthe credentiing and everything and Thank\nyou. I don't see any other questions.\nThank you, sir.\n>> Thank you,\nRepresentative Clifton.\n>> Thank you, Mr. Chairman. Uh I will be uh\nbrief. We're looking at uh HB 9573 from\nthe bottom. Um this is the miniature\ntruck bill. We passed this out of the\nhouse last year um almost with unanimous\nconsent. Uh it got to the Senate and had\nsome additions added on to it. Um and\ntherefore because of that the governor\ndecided that he did not like some of\nthose additions. Uh through the process\nof all of this, uh the governor's office\nhas told us they do support the bill the\nway that we had written it and would\nsupport um getting it all the way\nthrough.\n>> Whip Park has a question for you.\n>> Thank you, Mr. Chairman. Uh, represent\nClifton, thank you for the bill. The one\nquestion I had was\n>> So, yes, if the this bill would allow um\nthese vehicles to be driven on county\nand city roads unless marked. So, if the\ncounties and cities decide they do not\nwant them, they would be um need to I'm\nnot going to be specific on how they\nwould do it, but they would need to\ncommunicate that so that they would not\nbe allowed to be driven.\nI\n>> I would leave that up to the locals on\nhow they want to decide to inform people\nthat they don't want these on there. I\nwould assume a a road sign would\ndefinitely be one way that they could go\nabout that route.\n>> Leader Fistration has a question.\n>> Thank you, Mr. Chairman. Representative\nClifton, it feels like we've taken this\nmini truck issue up year after year\nafter year after year. With respect to\nthe question that was just asked, is\nthis any different in any way than the\nlegislation that's been feels like\nregularly passed by this body over the\nlast few years? And um we're just trying\nto trying to get done this year.\n>> Yes, sir. There was one number changed\non this bill and it went from 2025 to\n2026 if the bill passes. Everything else\ngoes back to the original language.\n>> So this is the same measure which has\nbeen repeatedly passed overwhelmingly by\nthe Georgia House.\n>> Yes, sir.\n>> Thank you.\n>> Okay. Don't see any other questions.\nThank you.\n>> Thank you, Chairman McDonald.\n>> Thank you, Mr. Chairman. Uh I have two\nbills. if if I can present them both,\nsir. Uh first bill, it's HB944.\nIt's on the front page about 3/4 of the\nway down. This is just a federal\nguidelines that are given to us each\nyear that our commercial vehicle\nenforcement division has to enforce o\nover our motor carriers that are going\nup and down our interstates. All we do\nevery year is change the date to this\nyear, we change from 2025 to 2026.\n>> Okay. Don't see any questions. You got\nanother one? Yes, sir. Mr. Chairman, uh\nthis this is a public safety bill that's\nnot only will help protect our law\nenforcement, but it'll it'll help\nprotect our families that are going up\nand down the road.\n>> What's the number?\n>> Oh, sorry. HB02\nHB1022.\n>> It's on the back page.\n>> Okay. Go ahead.\n>> Again, this is a a public safety bill\nthat's not only going to help protect\nour law enforcement, but help our\nfamilies that are going up and down the\nroad. There's technology in everything.\nSo, today we got technology and wind\nattending. Uh people are have the\nability now to put a film that's\nelectronic on their on their front\nwindshields, side windshills, and their\nback windshields that that they can\ncontrol and control the amount of tent\nthat they want their windows to be. In\ncurrent law right now, wind attent\naround 32% plus or minus three. Uh with\nwith this technology, they're they can\ntake it up to 100% or take it down to\nzero. And the same thing with license\nplates. This bill will also repeal a\nmeasure back in 2017 where we we\nauthorized electronic license plates\nwhere you can sit with an app and and\nchange what you want on your license\nplate. Uh just this a couple weeks ago\nthere was three cars in Atlanta with the\nsame license plate riding around and the\nflock system picked all of them up. Uh\nalso with this technology they can tint\ntheir license plate. So this is also\noutlawing that. Uh for the first offense\nit'll be $500 and any offense after that\nwill be a thousand. So basically if your\nlaw enforcement sees somebody with\nattended window that cannot see in the\ncar, they pull them over, they can hit a\nbutton and make their windows go clear.\nUm, it's proven that also with dark\ntended windows, what what you can't see\nin, they can't see out. And so this also\nprotects us going up and down the road,\nour families, uh, for the people that\nhave this dark tinted window that they\ncan, you know, in intersections and can\nsee us going up and down the road.\n>> Okay. Whip Park has a question for you.\nit. We, you know, we it's got to be we\nhave a law that that says 32%. So that's\nas high as you can go. You can go lower\nthan 32% plus or minus three, but you\nknow, law enforcement, they have a a a\nmeasure that they gauge electronic\nmachine that they put on the window to\nto see. So, you know, by now we're, you\nknow, the law only allows 32%. So, um\n>> I haven't had any discussion with them.\n>> Okay. Have a question. Chair Martin, is\nthat you?\nTry try the mic next to you there. That\none's not coming on.\nTry.\n>> We usually can hear you when you talk.\n>> Try the one on the other side. Let's try\nthat one.\n>> I can hear you.\n>> Well, talk loud. Okay. Go ahead.\nMy question is\n>> it it\nthat would be a v vague part in the\nbill. I do not have any any specifics.\nSunshine\nvery careful.\nOkay. Chairman Powell has a question for\nyou.\nTry the one next to you there. We have a\nlittle difficulty this morning.\nWell, just talk loud. There's a little\ntechnical issue here.\nThere it is.\nthat that is a big part of it, you know,\nwith with changing our our tag system.\nWe used to have stamp tags and that's\nthat's become a problem because now\nthey're there are vinyl tags and they're\neasy to to change uh with putting\nanother vinyl label on them which you\nknow your stamp tags you could not do\nthat. Then of course when we uh did the\nelectronic tag you can it's all an app\nso you can put whatever you want to on\nthat. But the main thing is the safety\nis as I said before what what you when\nyou can't see in the car well because\nthe tent's too dark they can't see out.\nSo that's another safety issue we have\nto take into consideration is is our\nfamilies going up down the road and the\npeople that are driving these cars. They\ncan't see us either.\n>> Okay. I don't see any other questions.\nThank you Mr. Chairman, thank you\ncommittee.\n>> Well, excuse me. We do have a question.\nI'm sorry.\n>> All right. Chairman Liby, you had a\nquestion, didn't you?\n>> You pass. Okay. Anybody? I don't see any\nno other questions.\n>> Thank you, sir.\n>> Uh,\nokay. We're having a little difficulty\nhere with the mics. Uh got a couple of\nmembers who want to ask for something.\nWe're going to try your mic and if it\ndoesn't work, we'll let you come to the\npodium. How about that? Okay. U Chairman\nHawkins.\nNope. If you would just go to the podium\nand\napologize. We'll try to get them to\ncheck this out for us.\nUh, thank you, Mr. Chairman. I'm asking\nfor HB9, I mean, excuse me, 629's on the\nfront page. Um, this is a bill that we\nhad last year, and this bill is now a\nsubstitute. It includes a very important\nissue with stop the bleed kits.\nIt adds these kits, the training for\nthese kits to the CPR and AED trainings\nthat are taught in our school to the\nresponse teams. Uh this issue actually\ncame about after the Appalachi school\nshooting and unfortunately got\nsidetracked when a member of the\ncommission was moved to Washington. Um\nthis is supported by the commission\ntrauma commission and the regional\ntrauma commission. The kits are provided\nuh to the schools free of charge from a\nnational source. I have placed in the\nbill that is it will be upon\nappropriations. Uh, so in case something\nhappens in Washington and that money\ngets lost, we'll find a way to pay for\nit in Georgia. Protect our children.\nThat's the bill.\n>> Okay.\nI don't see any questions. Thank you.\n>> Chair Lady Cooper, you have one. You can\nuse the use this mic. See if that one\nworks for you.\n>> Okay. Thank you, Mr. Chairman. Um, on\nthe first page about six or seven up\nfrom the bottom is 17 717. House 717. Uh\nsome of us that have been here a long\ntime will remember when we had pain\nclinics popping up everywhere and a real\nproblem with opioids being given and\nother drugs mainly by orally. And we had\nto uh have the medical board enact\nregulations and rules about who could\nown them. And this bill follows the same\nthing except we're even in a worse\nsituation. ketamine which is an\nextremely extremely dangerous drug only\nFDA approved for anesthesia and even\nwhen an anesthesia\nfact that the patient has had it. So\nthese\nchecking\nIt's like we will have\n9% what they wanted to do. uh and also\nit sets up you know uh about\nadministration even for physi they were\nrequiring it through advanced airway uh\nmanagement training that's how danger it\nis that a general physician would\nadvanced training to they get so\nanswer questions\n>> okay have a question for you\nrepresentative Kelly thank you ma mr\nchairman\nMadam Chair, thank you for the\nlegislation. I I understand this is a\ndangerous drug that's being\nadministered. Are there current\nindividuals owning this? Are there\ncurrent facilities owned today that\ndon't meet the ownership structure\nprescribed in this bill?\n>> Yes.\n>> And are we divesting anyone's interest\nthat owns them today?\n>> No.\n>> So if you're if you own one of these\ntoday,\n>> we're not going to force you to sell or\ndivest your interest.\n>> No.\n>> No.\n>> No. I would like for it to be that way\nbecause they're dangerous and why they\nwill have to register with the board.\nJust register so we know where they are.\nI would hope that once their standards\nput in place that they would want to up\ntheir facility to meet standards, not\nabout the ownership maybe, but that they\nwould have a defibrill\nintubate a patient if they were having\nairway problems. Uh because I would that\nonce you have standard in place, if\nthey're smart, they wouldn't want to\ntake the chance of having a really bad\nreaction and the lawyers, you know,\ngoing at them because there were\nstandards and they weren't meeting them.\nUm, they are starting up all over the\nstate. There's probably somewhere about\n20 plus of them now that we know of\nowns one. He has talked to people and he\nthat most of them are not having\nbe an anesthesiologist and he has he\nsaid everything that he would have in\nthe O to help with patients but he says\nhe's talked to these people over the\nstate and if you go out on his website\nhas through it uh he has a ketamine\nacademy which is what you do to set him\nup and that's why he was talking but he\nwas very with me\n>> I agree with you I hope They bring them\nup to senators as well. I was just\ncurious about the ownership aspect.\nThank you, Madam Chair.\n>> The grandfather in\n>> Okay. Don't see any other questions on\nthat.\n>> Any other member of the committee have\nanything they want to present this\nmorning?\nOkay. Let's do this. Let's set a\ncalendar for Friday,\nthe legislative day number 14,\nHouse Bill 629. Do I hear a move?\n>> Have a motion and a second. Is there any\nopposition?\nIt's on.\nHouse Bill 945.\n>> Moved and seconded. Any opposition?\nIt's on. Okay. House Bill 980.\nHave a move and second. Any opposition?\nIt's on. Okay. Don't forget today we got\nthe budget on the floor. We will not\nhave a rules meeting tomorrow. We will\nnot meet tomorrow. Our next rules\nmeeting will be Monday at 900 am. Monday\nat 900 am. Thank you. We're journed.",
  "updated_at": "2026-02-14T14:47:08.925532+00:00"
}