{
  "video_id": "uAM1CKNJ294",
  "url": "https://youtu.be/uAM1CKNJ294?t=1044",
  "title": "Georgia House - Day 17 (2026-02-08)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 17,
  "video_date": "2026-02-08",
  "duration_minutes": 237,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 17 (2026-02-08) session:\n\n## Overview\nThe session featured the introduction of several new bills related to public health, water rights, fishing regulations, and other policy areas. A notable moment was a prayer and pledge of allegiance led by a visiting minister. The session also included routine procedural items like confirming the previous day's journal.\n\n## Key Actions\n**HB 1170**: Bill to amend the Georgia code relating to the Department of Public Health\n**HB 1171**: Bill to amend the Georgia code related to sales and use tax exemptions\n**HB 1172**: Bill to amend the Georgia code relating to water rights\n**HB 1173**: Bill to amend the Georgia code relating to fishing with a bow and arrow\n**HB 1174**: Bill to amend the act creating the Harris County Public Improvement Authority\n**HB 1175**: Bill to amend the Georgia code relating to physical therapists\n**HB 1176**: Bill to amend the Georgia code relating to health insurance and public employees\n**HB 1177**: Bill to amend the Georgia code (no further details provided)\n\n## Bills Introduced (First Reading)\n- HB 1170\n- HB 1171 \n- HB 1172\n- HB 1173\n- HB 1174\n- HB 1175\n- HB 1176\n- HB 1177\n\n## Notable Moments\n- Visiting minister Jacqueline Carr gave a prayer and led the House in the Pledge of Allegiance\n- The House discussed the challenges and importance of their legislative duties\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nThe transcript indicates a quorum was present, with members joining the visiting minister in another room.\n\n## Adjournment\nThe transcript does not explicitly state when the session was adjourned or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you You you you and the history embodies the themes of freedom and restoration. I first recognized her contribution to the state of Georgia when she hosted the You Will Win, the You Will Win conference last summer at the Georgia Conference Center in the city of College Park. Through the profound phrase, You Will Win, she has uplifted countless of individuals during the times of hardship, guiding them out of despair and to empowerment. Her ministry resonates deeply with the people who we as legislators advocate for this very chamber through policy and budget decisions. I've come to understand the immense power of spoken word as Proverbs 1821 teaches us that life and death is in the power of the tongue. When Minister Carr speaks, her words carry authority and weight capable of moving mountains. Today, I have invited her to impart words that I hope will stir the hearts and inspire all of us to push forward in our legislative duties. Colleagues, I share with you Ms. Minister Jacqueline Carr. Good morning. Greetings to everyone. I am humbled to be included in this monumental moment. I want to thank you all for allowing me to share this moment with you. Before I go into prayer, I understand and I know that you carry quite a load and as you have made the commitment to do your best to rightfully serve the state of Georgia, sometimes it can become a lot. Even to the point to where you get discouraged. However, I am here to remind you that despite how heavy or intense it is, you are still going to win. God is committed to seeing that you get all of your wins and he's intentional about your victory. And she spoke about waiting and I got a few requests before we go into prayer. I just want to say I know you're and I know you're time. I know you're broken but you will win. All of those may be facts but the truth still remains that of the name of Jesus. You will win. Because everything attached to you wins. Now if you believe that everybody is stand with me as we get ready to say a word of prayer. Heavenly Father, we come before you today with our hearts full of hope and I sit on the horizon of a brighter future for the great state of Georgia. In your wisdom you have guided the steps of those who have come before us and now we ask for your light to shine upon our path as we navigate the complexities of governance and leadership. We pray for our legislators and those chosen to represent the diverse voices of our beloved state. Grant them wisdom Lord beyond their own understanding. Feel them with a spirit of unity, compassion and discernment as they make decisions that affect the lives of millions. May they remember the sacred responsibility entrusted to them to serve not just with their minds but with their hearts aligned with the values of justice, equity and peace. Lord we ask for courage and strength for our leaders that they may stand firm in the face of adversity always striving towards the common good. Let them be beacons of hope and progress work entaillessly to uplift every community, especially those who have been marginalized and undeserved. May their efforts so seize of change that will blossom into a future where every Georgian can thrive regardless of their background, their beliefs or their place in society. It's in Jesus name I pray we say together Amen. Would you join me as we recite the pledge of allegiance? I pledge allegiance to the flag of the United States of America and to the republic for which it stands one nation under God, indivisible with liberty and justice for all. Thank you. Thank you for that message of encouragement. We are most appreciative of those beautiful lyrics as well. Thank you for that doorkeepers. If you will unlock the doors. We will ask the members to join our pastor of the day, Reverend Cara and her father in the south any room if you want to take a photo. And greet them and thank them for being here. You You You You You You\n\nOkay members, our next recognition is for the Doctor of the Day. Our Doctor of the Day is brought to us by Representative Miriam Parrish and Dr. Richard Thomas, we appreciate Dr. Thomas being here. Members, if you get a chance, go downstairs until Dr. Thomas, how much we appreciate. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits, Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous Legislative Day and found it to be correct. As the Speaker this morning said, what we do here sometimes hard and goes along with something to think about today. Pain is temporary but quitting is forever. I want to know the point you're right. Absolutely. I will continue to ponder that parole the rest of the day. Chairman Tarvan, the Chair of the Committee on Information and Audits reports that the journal of the previous Legislative Day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair here is done. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair here is done and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Mr. Clerk. President of the Church and the 100th Moose Follomew establishes the order of business in the first part of the period unanimous consents and introduction of bills and resolutions, first reading of reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading of reference of Senate bills and resolutions, morning orders. The Steering Objection to the Adoption of the Resolution establishing the order of business for the day. Chair here is done and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House bill 1170, member of the Senate of the Law, 15th, Canada, 101st. Bill B. Todd will act to amend chapter 2A, a title 31 of the Fisher go to Georgia and it's headed relating the Department of Public Health. Public and Community Health. House bill 1171, member of the Senate of the Chair of the 176th, Corbord of the 174th Tarvern, the second, Erwin of the 32nd, Pall of the 147th. Bill B. Todd will act to amend Code Section 48, 8, 3 of the Fisher go to Georgia and it's related exemptions from sales and use taxes. Ways and means. House bill 1172, member of the Senate of the Chair of the 176th, Rose, the 24th, 113rd, Smith of the 70th. Williams of the 168th. Bill B. Todd will act to amend chapter 8 of the title 44 of the Fisher go to Georgia and it's headed relating to water rights. Judiciary. House bill 1173 by Ripson, Ridley, the 6th road, the 124th, Ridley, the 22nd, can end to the 172nd. Corbord of the 174th. Bill B. Todd will act to amend Code Section 274, 34 of the Fisher go to Georgia and it's headed relating to fishing with a bow and arrow. Game fish and parts. House bill 1174 by Ripson of Smith of the 138th. Bill B. Todd will act to amend the act to create the Harris County Public Improvement Authority. The Intergovernmental Coordination. House bill 1175 by Ripson of Can and the 172nd stints into the 150th. Hawkins of the 27th. Ben of the 94th, Matthew, the 74th and others. Bill B. Todd will act to amend chapter 33 of the title 43 of the Fisher go to Georgia and it's headed relating to physical therapists. It's headed industries. House bill 1176 by Ripson of Kelly, the 16th challenger, the 23rd Cooper, the 45th. Dunhu, the 31st and Buckner, the 137th. Bill B. Todd will act to amend titles 31, 33, 45 and 49 of the Fisher go to Georgia and it's headed relating to health insurance, public officers and employees. Public and community health. House bill 1177 by Ripson of Stevens, the 164th, Washburn of the 144th. Blackmen of the 146th. Bill B. Todd will act to amend part one of Article 2, chapter five of the title 48 of the Fisher go to Georgia and it's headed relating to tax exemptions. Ways and means. House bill 1178 by Ripson of Evans, the 89th, runner of the 85th, color of the 19th Buckner, the 137th, camp of the 135th and others. Bill B. Todd will act to amend title 46 of the Fisher go to Georgia and it's headed relating to public utilities and public transportation. Energy utilities and telecommunications. House bill 1179 by Ripson of Cooper, the 45th Hawkins, the 27th Jones, the 25th Oliver, the 82nd, Lomston of the 12th. Bill B. Todd will act to amend Code Section 3324, 59.25 of the Fisher go to Georgia and it's headed relating to tax exemptions by health benefit plans of step therapy protocols. Public and community health. House bill 1180 by Ripson of Carpenter, the 4th Williamson of the 112th Black men of the 46th, Martin of the 49th Buckner, the 137th and others. Bill B. Todd will act to amend Code Section 48740.26 of the Fisher go to Georgia and it's headed relating income tax credits for Phil. Ways and means. House bill 1181 by Ripson of Martin of the 49th Black men of the 146th. Bill B. Todd will act to amend Chapter 178 of the 53th and Chapter 78 of the 47th. He will be titled an act to amend Chapter 7, the 48th. The Fisher go to Georgia and it's headed relating to income taxes. Ways and means. House bill 1182 by Ripson of Carpenter, the 188th Williamson, the 112th Black men of the 146th. Buckner, the 137th, the 64th. title 48. The fish go to Georgia annotated relating the gentle provisions regarding insurance and income taxes. Ways and means. I'll spell 1183 by resident of Dempsey the 13th Cooper the 45th Hawkins the 27th stoner of the 40th May the act 74th. It'll be taught an act to men part three of article 16 to chapter two entitled 20 of the fish go to Georgia annotated relating to student health and elementary and secondary education. Public and community health hospital 1184 by resident of annullo. It's the 42nd Smith the 18th lever to the 123rd and Evans the 57th. It'll be titled an act to amend chapter five a title 24 of the fish go to Georgia annotated relating privileges relative to evidence. Did you do Sherry House bill 1185 by resident of camp 135th Washburn and 144th fry the 120 second Martin the 49 black men of the 146th. It'll be titled an act to amend part one of article two a chapter five a title 48. The fish go to Georgia annotated relating tax exemptions. Ways and means. House bill 1186 by resident of Hilton the 48th Cox the 28th W. Duke Nick of the 29th Ballad of the 147th May the 56th and others. It'll be titled an act to amend code section 20 1433 of the fish go to Georgia annotated relating indicators of quality of learning and individual schools. Education. Hospital eliminated seven by reps of Thomas the 21st bonner that the 73rd meet the act of 74th and hagan in the 156th. There'll be title an act to amend title 16 chapter four title 30 and chapter six a title 40 of the fish go to Georgia annotated relating to crimes and offenses. Public and community health House resolution 1019, I'm saying to the 180th jasmus of the 11th, ridley of the 22nd knew the 64th horner. Of the third, no, there's a resolution supporting increased protections for American borders. Public safety and homeland security House resolution 1020 by reps of silk ox, the 53rd Jones, the 47th Martin, the 49th, Cooper, the 45th Smith, the 70th resolution recognizing representative Joe Wilkinson, dedicating interchange in his honor. Former member of the House, transportation, resolution 1021 by reps of Stevens, the 164th, Washburn, the 144th, lack of the 146th resolution, proposing an amendment to the Constitution shows to provide for local governments to have the option to offer statewide homestead exception. Ways and means resolution 1022 by reps of camp on the 35th, Washburn, the 144th, ride the 122nd Martin, the 49th, lack of the 146th resolution, proposing a amendment to Constitution says to provide for local governments to have the option to offer statewide homestead exemption. Ways and means Senate bill 339 by Senator Summers of 13th ability, title, and act authorize assessment collection of the technology fee by the pro big court of Chris County. Entra governmental coordination. Senate bill 345 by Senator Walker, the 20th of building, title, and act authorize assessment collection of a technology fee by the pro big court of Dooley County. Entra governmental coordination. Senate bill 382 by Senator Goode, the 51st of building, title, and act to create a board of elections in registration for Gilmer County. Entra governmental coordination. Senate bill 388 by Senator Kropatrick, the 33rd alvers, the 56th and beach of the 21st. Bill B. Todd, an act to amend the act, providing a homestead exemption from Cherokee County School Districts, advalorem, taxes. And for governmental coordination. Senate bill 397 by Senator Williams, the 25th, Strickland, the 17th, and Jones, the 10th. Bill B. Todd, an act to amend the act, creating a new charter for the city of Locus Grove. Entra governmental coordination. Senate bill 434 by Senator Burns, the 23rd, Bill B. Todd, an act to create a board of elections in registration for Glasgow County. Entra governmental coordination. That completes first readers. Senate bill 388 by Senator Kropatrick, the 25th, the 42nd, and 42nd. Second reading of bills and resolutions, the clerk will read. House Bill 1135 by Representative Hatchet of the 155th, the bill to provide a new charter for the town of Dexter, House Bill 126. By Representative Maynard, the 56th, Gallaud of the 19th, Level to the The person of the 119th, Cameron of the first and others, a bill relating to stalking. House bill 1137 by Representative Kendrick of the 95th, a bill relating to form of indictment by Grand Jury. House bill 1138 by Representative Kendrick of the 95th, a bill relating to fund administrator and investments relative to invest fund, is the last Georgia fund. House bill 1139 by Representative Gailier of the 160th, second Oliver of the 82nd Miller of the 62nd, a bill of the 75th, a bill relating to elementary and secondary education. House bill 1140 by Reps of Smith of the 18th, a bill to amend and act to provide a home stay exemption from Harrelson County School District Advalorem Taxes. House bill 1141 by Reps of Hagan of the 156th, a Mathis of the 149th, a bill to provide a home stay exemption from Telfaric County School District Advalorem Taxes. House bill 1142 by Reps of Martin of the 49th, Gallaud of the 19th, Jones of the 25th, Hilton of the 48th, Mom Tann of the 17th, and others. A bill relating to general provisions of professions and businesses. House bill 1143 by Reps of Hagan of the 156th, a bill to amend and act to provide a home stay exemption from Telfaric County Advalorem Taxes for County purposes. House bill 1144 by Reps of Martin of the 49th, Gallaud of the 19th, Jones of the 25th, Hilton of the 48th, Mom Tann of the 17th, and others. A bill relating to general provisions of professions and businesses. House bill 1145 by Reps of Hagan of the 14th, Gamble of the 15th, a bill to amend and act to provide a home stay exemption from certain Bartho County School District Advalorem Taxes. House bill 1146 by Reps of Stevens of the 164th, the Division of the 165th, Petrie of the 166th, a bill relating to ground water use. House bill 1147 by Reps of Maltan of the 17th, Cali of the 16th, Smith of the 18th, new of the 64th, Gallaud of the 19th. A bill to provide a new home stay exemption from Pauling County Advalorem Taxes for County purposes. House bill 1148 by Reps of Maltan of the 17th, Cali of the 16th, Smith of the 18th, new of the 64th, Gallaud of the 19th, a bill to provide for a new home stay exemption from Pauling County School District Advalorem Taxes for Educational purposes. bill 1149 by Representative Maynard 56, Sains of the 180th Thomas of the 21st to build relating to local government budgets and audits. House bill 1150 by Representative Collins of the 71st, corporate of the 174th, Sains of the 180th, Parcola of the 169th, Crow of the 118th. A bill relating to attempting of windows or windshields of motor vehicles. House bill 1151 by Representative McLean of the 109th Prince of the 130th Second, Alexander of the 66th, Gladney of the 130th, Barton of the 5th and others. A bill relating to specialized spending or certain where the agency's funds to nonprofit corporations and proceeds distributed to the General Fund and Agency Fund or nonprofit corporation. House bill 1152 by Representative Camp of the 135th, Carson of the 46th, Powell of the 33rd, purchasing of the 119th dollar to the 19th and others, a bill relating to electrical service. House bill 1153 by Representative Jones of the 25th, Martin of the 49th, C-Ball of the 34th Anderson of the 10th, Huddleston of the 72nd, a bill relating to property. House bill 1154 by Representative Cannon of the 58th, Oliver VIII, 2nd, Beverly of the 143rd, Williams of the 37th, Glazer of the 67th, a bill relating to medical assistance. House bill LM55 by Representative Cannon of the 58th, Oliver of the 82nd, Beverly of the 143rd, Williams of the 37th, Glazer of the 67th. A bill relating to the newborn baby and mother protection act. House bill LM56 by Representative Jackson of the 16th, Holley of the 116th, Baysmore of the 69th, Glazer of the 67th, a bill relating to landlord and tenant. House bill LM57 by Representative Jackson of the 68th, Holley of the 116th, Baysmore of the 69th, Glazer of the 67th. A bill to amend the Fair Business Practices Act of 1975. House bill LM58 by Representative Jackson of the 68th, Drenner of the 85th, Barnes of the 86th, Taylor of the 92nd, Baysmore of the 69th, a bill relating to general provisions regarding Alimony and Child Support. House bill LM59 by Representative Jackson of the 68th, Bruce of the 61st, Holley of the 116th, Clark of the 108th, Reese of the 140th. A bill relating to elections on primaries. House bill LM60 by Representative Jackson of the 68th, Holley of the 116th, Evans of the 89th, Moore of the 91st, Draper of the 90th, a bill relating to carrying possession of firearms. House bill LM61 by Representative Ballard of the 147th, Sains of the 180th, Petrie of the 166th, Reese of the 140th, Banner of the 73rd, and others. A bill relating to income taxes. House bill LM62 by Representative 1934th, Williams of the 112th, Black 1 of the 146th, Carson of the 46th, and Martin of the 49th. A bill relating to revenue and taxation. House bill LM63 by Representative 1934th, Williams of the 112th, Black 1 of the 146th, Carson of the 46th, and Martin of the 49th. A bill relating to revenue and taxation. House bill LM64 by Representative Miller of the 62nd Smith of the 18th, lifted the 175th buckner of the 137th, Fleming of the 114th and others. A bill relating to criminal trespass damage of property. House bill LM65 by Representative Maynard of the 56th, Rees of the 99th, Mt. of the 13th, of the 158th Hilton of the 48th. A bill relating to membership vacancies. Membership not barred to holding public office. House bill LM66 by Representative Jones of the 60th, the bill to provide a home sanction from City of Atlanta, at the Lorm Taxes for municipal purposes. House bill LM67 by Representative Townsend of the 179th, or one of the 32nd Lums of the 12th, Yarta of the 150th, Shocks of the 150th, first and others. A bill relating to education and revenue and taxation. House bill 1168 by Representative Townsend of the 179th, the Lurch of the 167th, Sains of the 180th, Fans of the 133rd, Rees of the 99th and others. A bill relating to motor vehicles and traffic. House bill 1169 by Representative Townsend of the 179th, Smith of the 138th, the Lurch of the 167th, Fans of the 133rd, Rees of the 99th and others. A bill relating to environmental protection division, environmental advisory council, duty and council. And his members and director, our appeal procedures permit applications and inspections. House Resolution 996 by Representative Williams of the 148th, the resolution honoring the life of Deputy, Taiy Brown, and dedicating a road in his memory. Senate bill 1189 by Senator Burns of the 23rd, dollars, all of the 27th brass of the 28th. And with our state of the 31st, more of the 53rd and others, a bill relating to primaries and elections. House Senate bill 332 by Senator Roberts of the 29th, Kennedy of the 18th, due to the 51st, hatchet of the 50th brass of the 28th and others. A bill relating to processing and earning a 20th qualification commission. Senate bill 344 by Senator Antivartia of the 31st, due to the 51st, Kennedy of the 18th, brass of the 18th. Of the 28th hatchet of the 50th, dollars, a bill relating to exemptions from sales and use tax. Senate bill 373 by Senator Walker of the 30th and the Vartia of the 31st, Kirk Patrick of the 32nd Stricland of the 17th, Halper to the 39th and others. A bill relating to requirements for licensure and marriage and family therapy. Senate bill 405 by Senator Dixon of the 45th due to the 51st, liquid of the 4th Kennedy of the 18th still to the 48th and others. A bill to amend the Completion Special Schools Act through 2nd readers. All right, I'll stand. Reports of standing committees, the clerk will read. I'm going to have a Beth Camp in the 135th District. I'm not committee and I'm going to go for coordination locals submitted the following report. Mr. Speaker, your committee on intercom or coordination locals had an irid consideration following bills of the house. Instructed me to report the same back to the house following recommendations. House bill 1063, due passed by substitute. House bill 1080, due passed. House bill 1080, five new pass. House bill 1091, due passed. House bill 1094, due passed. House bill 1095, due passed. House bill 1106, due passed. House bill 1013, due passed by substitute. House bill 1025, due passed by substitute. House bill 1086, due passed. House bill 1087, due passed. House bill 1088, due passed. Respectfully submitted. Representative Beth Camp, all out of 35th District chairman. Representative Lynn Smith, the 70th District chairman on a committee on natural resources and environment submitted the following report. Mr. Speaker, your committee of natural resources and environment had an irid consideration. The following bills of the house. Instructed me to report the same back to the house following recommendation. House bill 53, due passed by committee substitute. Respectfully submitted. Representative Lynn Smith, the 70th District chairman. Representative Jave Collins, the 71st District chairman on a committee on public safety and homeland security submitted the following report. Mr. Speaker, your committee on public safety and homeland security has had under its consideration following bill of the house. Instructed me to report the same back to the house. The following recommendations. House bill 42040, passed by committee substitute. Respectfully submitted. Representative J. Collins, the 71st District chairman. Representative Mike Chokus, the 51st District chairman on committee on small business development submitted the following report. Mr. Speaker, your committee on small business development that has had under its consideration. The following bill of the house. Instructed me to report the same back to the house. The following recommendation. Representative Chokus, the 51st District chairman. Representative Jones, the 25th District chairman on committee and technology and infrastructure innovation submitted the following report. Mr. Speaker, your committee on technology and infrastructure innovation. Senator, it's consideration following bill of the house. Instructed me to report the same back to the house and following recommendation. House bill 988, due passed by committee substitute. Respectfully submitted, Representative Jones, the 25th District chairman. That completes the reading of the report's standing commitments. We will move on to the local calendar. There are five bills on the local calendar this morning to relate to. Homestead exemption. Require a recorded two thirds vote for passage. Third reading and passage of uncontested local bills. Mr. Clerk, will you read? House bill 1063 by substitute by resident. Lumps into the 12th Stuga County. House bill 1080 by resident. Frazier, the 126th City of Wainsboro. House bill 1085 by resident. Lumpton of the 83rd City of Shambley. House bill 1091 by resident of Niel in 79th Clayton County. House bill 1094 by resident. Advance to the 133rd. Baldwin County. House bill 1095 by resident. Advance to the 133rd. Baldwin County. House bill 1106 by resident. Petrie, the 166th City of Tybie Island. House bill 1013 by substitute by resident. Thomas, the 21st City Woodstock. House bill 1025 by resident. Ridley, the 22nd Cherokee County. House bill 1086 by resident. Persever, the 119th Barrow County. House bill 1087 by resident. Persever, the 119th Barrow County. House bill 1088 by resident. Persever, the 119th Barrow County. For what purpose does cheer lady camp rise? To make a motion. Stage a motion. Motion to remove House bill 1025 and recommit to Intergovernmental Coordination Committee. Clerk, will you read the caption? House bill 1025 by resident. Ridley, the 22nd Cherokee County. On the lady's motion, the HB 1025 be the last one. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be back. We'll be withdrawn from the local calendar and recommitted to the Intergovernmental Coordination Committee. Is the objection? Here he none. It is so ordered. Is there an objection to the previous question being ordered on the local calendar? Less HB 1025 and accepting all the others that are here. Here he none. The previous question is the objection to agreeing to the report of the committee, which was favorable to the passage of the bills. Here he none. The report of the committee has agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no and the clerk will unlock the machines. All members have voted. Take your time. We got all day. I cleared my calendar. See how easy? All members voted. All members voted. Mr. Clerk, will you lock the machines? On the passage of the bills on the local calendar, the yeas are 158. The nays are zero. These bills have received their requisite Constitution majority are therefore passed. For what purpose is represented? Can't rise. To make a motion. State your motion. I'd like to make a motion to immediately transmit the local legislation calendar to the Senate. The lady has moved that we immediately transmit the local calendar to the Senate because of some time sensitive priorities we have on that calendar. Is there any objection? Here he noted is so ordered. We have several morning orders this morning. So I'll ask the members to be as brief as possible but also be very thorough because we have some visitors here that need to be recognized. I want another note. They don't make those oak trees like they used to down in the statesboro. Since I'm talking about natural resources, I'll recognize the local legislation. Thank you, Mr. Speaker. Good morning, everyone. To those of you who have a key Georgia beautiful organization in your neighborhood, we just stand for a minute because all over the state, we benefit from key Georgia beautiful. We have these wonderful folks.\n\nUp in the gallery, if y'all will stay in trying to locate you, or there you are, and we thank you so much for what you do. You truly are making my community beautiful, and you're making the citizens and the visitors to Georgia aware of how important this is. So thank you again. Thank you. Georgia is beautiful, and thanks for helping keep it that way. Certainly you and your committee do a great job with that chair lady. Representative Mary Margaret Oliver has recognized y'all give her some attention here. I want you to hear this morning order. Good morning colleagues. Thank you Mr. Speaker. I'm very pleased to be joined with some of our friends this morning to honor the Georgia Lions Lighthouse Foundation. 1949 members of the Multree Albany and Atlanta Lions Club donated $1,000 to form the foundation. Many decades later they are delivering services in 159 counties directly have clinics in 52 counties for vision screening, glasses, updates, telepathy meetings with people they have in developed screenings in schools and providing services to those insured and not insured across the state of Georgia. We have many members with us today. Ask you to stand please and let us honor the Lions Club members of Georgia and their services to Georgia across the state. Thank you very much. What a great program. Representative Oliver when did you say that program began? 1949. Awesome. Great stuff. Thank y'all for what you do. It's important and has benefited so many Georgia's. Thank you. Representative Washburn is recognized for a morning order. And friends let us see what y'all have in common. We want to hear about it. Thank you Mr. Speaker. I'm inviting and given a moment for all of my fellow real tours who are members of the Georgia House to come and join me here. Today is real tour. Today here at the Capitol and I think we have some of them in the gallery. If you're here in our real tour please stand. Thank you. Thank you. Ladies and gentlemen of the House these people do all kinds of consulting and brokerage of all types of real estate. But we want to focus on the one type that is done by so many of them and that is they sell dwellings to people. Ladies and gentlemen the path to financial stability and to some net worth for most all Georgians involves ownership of a home. And these are the people that take that little couple by the hand that are scared to death and don't know where to go and what to do. And they introduce them to a lender. They get them prequalified. They show them a house they can buy and they help them buy it. And that sets them on a pathway of financial stability and the building of net worth. So these people are small business people whether they were the big farm or small farm. They're independent contractors. Small business people and they do good work. So please greet them today when you see them here at the Capitol. Thank you Mr. Speaker. Thank you. We have one last word here. And also I like to thank the lunch and valda's to that came over three and a half hours to be here. So I really appreciate you guys. Thank you so much. Three and a half hours. For helping make Georgia the best place to live work raise a family. You can't do that without a home. Thank you. What you do. Representative Teddy Reese is recognized for a morning order. Thank you, Mr. Speaker. Colleagues, I am deeply honored and immensely related today to recognize a group of young professionals that are here from the greater Atlanta area as well as the River Valley. And that's the Urban Lee young professionals. If you guys will please stand up so you can be recognized by this body. That is the Urban Lee greater Atlanta young professionals and the Urban Lee of the River Valley young professionals. These groups Mr. Speaker commit thousands of hours each year to the betterment of our community to the betterment of Georgia. They are hands on working with our younger generation so that we make sure that we produce the brightest fruit right in the state of Georgia. Thank you to the Urban Lee young professionals for what you do and welcome to your state capital. Absolutely. We were in the River Valley earlier so we appreciate what y'all do. Thank you. Let's see. We have Representative Mogul and Representative Marion. Where's Representative Marion? You're not Representative Marion. That's Representative Draper. There he is. I couldn't see you, Pete. Thank you Mr. Speaker. We're here to recognize the National Association of Hispanic Real State Professionals, Atlanta. They're promoting home ownership and wealth creation. Wealth creation within the Hispanic community. They're providing resources to communities such as business networking opportunities, education and community outreach. Locally, they're actually helping our economy creating wealth and jobs and promoting Hispanic realtors. So please stand up and recognize their president and the current board. Welcome to the People's House. Welcome to the People's House. Your house. We're pleased you're with us. Thank you for what you do. Representative Bell. Representative. Representative Eric Bell. Recognize for a morning order. Thank you, Speaker, for the awesome case. I always said dress my colleagues. But today is the fifth annual Blackmail Educator Appreciation Day. Recognizing the positive impact and influence of Blackmail teachers, educators and fathers in the state of Georgia. This event is started by Georgia Educators Jason B. Allen, his students from Griffin Spalding Board of Education Chair, Arsenteel Brown. This is designed as a date to celebrate the involvement and impact of Blackmail teachers, educators and fathers in our schools and communities. They acknowledge and honor the contributions of the following Blackmail educators in our schools and communities from the state of Georgia and the honorees of this year's celebration. The grandparent of the year, Mr. Morris Bailey, outstanding teacher, honor, regional, excuse me, Ronald Mac, excellence in Education Leadership Award, Dr. Avery Kindley, and the Blackmail Educators 2024 Unaries R. Christopher Brunson, my tree's ball, Devon Williams, and Timothy Jenkins. The group is in the gathering. Can you please stand? There they go. Thank you, Father. The work that you do in the state of Georgia. Thank you, Representative Bale. Welcome to the People's House. Chairman Work-Eiser is recognized for a morning order. Thank you, Mr. Speaker. Today's rule helps hospital day at the Capitol in hometown health as a network of Georgia rule hospitals. It's hosting its 17th annual rule hospital, CEO Day at the Capitol. This day is of great value not only to our hospital attendees but to our legislators. We thank you for being in the gallery. I want to recognize two of my CEOs who are here today, Dave Flanders from Optum and Readsville and Bill Lee from Evans Memorial at Clarkston. I know Jimmy Lewis has worked very hard with Terry England and then with Matt Hatchett to help develop policy that has helped our real hospitals. Furthermore, Mr. Spakers are not treated to that gavill and the oak that it came from that many hearts were broken in its sweetheart circle. Now a few more there, Mr. Chairman. Rumor has it. You broke a few of those hearts around sweetheart circle. I won't talk about those today. Welcome to our real hospitals. Did y'all stand? They must be over in the Senate but we had a good opportunity. Mr. Chairman, be with them this morning. Great group of folks who had to outstanding work in taking care of the people of Georgia. Chairman Halkins recognized for a morning order. Thank you, Mr. Speaker. Today I rise to recognize the Georgia Society of Radiologic Technologists. These are the folks that we all see in our family see with early detection of life saving techniques and detection of diseases like cancer without them. The access would be much slowed down and but they do a wonderful job there in the gallery. Would you please stand? You all recognize our radiotechnologist. Thank you all so much for what you do. Awesome. Thank you all for being here. Thanks for what y'all do as well. Welcome to the people's house. Chair Lady Cooper recognized for a morning order. Thank you, Mr. Speaker. Everybody you found a packet of dental and I think it's a new brought toothbrush and liquid mouth meant for good breath. We've come set a good time now that we're coming up on Valentine's Day so you can get close to your sweetheart and make sure you have good breath. I just want to say this is a gift from the dental hygienist. I want to give a shout out to him if there's any dental hygienists still left. If not they are the... We're going to hold a lot of them up here. Can everybody rise and give them a hand for our packets and for all they do to take care of Georgia's tea. Thank you. The dental hygienist, great. We appreciate y'all. Thanks for being here. Thank you very much. Thanks, Chair Lady. Thank you Mr. Speaker. Everybody enjoy your packets. Representative Bernal and the Clayton County delegation. Clayton County delegation were joined. Representative Rhonda Bernal for a morning order. Come on down. Thank you Mr. Speaker. Today in the gallery we'd like to welcome the Clayton County Chamber Clayton County Leadership Clayton Class if they could stand. Thank you Mr. Speaker. Thank you Representative and welcome to the People's House. The Birchette is recognized for a morning order. Thank you Mr. Speaker. Make sure you don't cross that line. Mr. Representative. Y'all don't cross that line. Let's make sure. Good morning colleagues. Today is Okipinokide at the Capitol and the heart of Georgia and natural treasure that epitomizes the state's ecology. The indigenous and cultural heritage, the Okipinokiswamp, is important to the state of Georgia. Beyond its vast expansive captivating wilderness and the swamp holds profound significance for Georgia. It serves as a sanctuary for diverse wildlife including rare species like the red, cocketed woodpecker and the indigo snake making an invaluable hub of diversity. Today join us down at 12 p.m. and 216 for Okipinokide at the Capitol. I encourage all of you to come. I believe there is a reptilian alligator here in the Capitol. So if you want to picture with the alligator, come on down. Thanks. Thank you Mr. Speaker. Thank you gentlemen. Great natural resource of Georgia, the Okipinokis. That completes our morning orders. You ready Mr. Clerk? We will move on to the rules calendar. Mr. Clerk, will you read the caption to House Bill 1015? House Bill 1015 by resident McDonald, 26 and others to be entitled to amend Article 2, Chapter 7 of Title 48. The official code of Georgia annotated relayed the imposition rate, computation, exemptions and credits relative to income taxes so as to reduce the rate of tax. This bill I refer to the committee on ways and means that committee recommends a dis bill due pass. We are getting into some very important policy matters here. All members, they want to have a conversation. Please take it outside to the any room. Other members are very interested in House Bill 1015. The floor leader of the governor representing Lauren McDonald is recognized to present the bill. Thank you Mr. Speaker, ladies and gentlemen, the House. Today I bring you House Bill 1015 on behalf of Governor Kim. In 2022 this House led with the leadership of Chairman Blackman in the reduction of income tax for 25 basis points down from 5.99 to 5.49. Today we are going to get the lead again. We are going to do an acceleration of the income tax with 10 more basis points. That will be 36 basis points in one year. With this, with this will be about $1.1 billion that the hard working Georgians will not have to pay in this year's income tax bracket. That's the bill Mr. Speaker, I will yield for any questions. We have no questions. You did a fantastic job. Gentlemen, is yielded the well? Is there an objection to the previous question being ordered? Chair, is none of the previous question is ordered? Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, is none of the report of the committee's agreed to? Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1015. The yeas are 100. If so, the clerk will lock the machine on the passage of House Bill 1015. The yeas are 165. The nay zero. This bill having received your records at Constitution majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 1019? House Bill 1019, by the way, is it a read of the 99th and others to be entitled to amend part one of Article 5 of Article 4080 to go to Georgia annotated related to tax exemptions. So it's an increased the amount of a statewide homestead exemption. This bill emin further the committee on ways and means that committee recommends a disbill due pass. I've heard some talk about this. So come tell us about it. Representative Reeves is recognized to present the bill. Thank you, Mr. Speaker. Mr. Speaker, I appreciate your leadership as well as Chairman Shaw Blackman. I am proud to present House Bill 1019 to the House. This bill supports the American dream of homeownership in Georgia by doubling the statewide homestead exemption. This is the first adjustment of the statewide homestead exemption since 1978. So it's been over two generations since this important statewide homeowner tax relief measure has been adjusted. If you think back about 1978, the average house in Georgia back then was $55,000. It's many times over that now. President Jimmy Carter was president. The longest serving house member Dean Gerald Green was still teaching high school in Southwest Georgia all throughout the school year. The Falcons had a player named Dewey McLean still playing for the team in 1978. And baby Zane Daniel, I was his age back in 1978. So it's been a long, long time. This gives good tax relief at a time that's needed for people to buy their first home here in Georgia hard work in Georgia as well as for seniors to be able to buy a new home. This supports home ownership. It helps over a million homeowners in Georgia. And it is a great measure. It will double the homestead from 2000 to 4000. Mr. Speaker, I asked for favorable consideration from the House and I yield for questions. You have no questions. Were you dating representing McLean and myself to a ancient timeframe? He was knocking people out and taking care of business back then just like now. Quite the player. You do have a question representing Wilkerson has recognized for question to your left to your left in the back. Thank you, Mr. Speaker. Does it gentlemen yield? Yes, representative over here back in the back. The other back. Thank you. Thank you for this great measure. Do you know approximately how much this will actually save a family? I know it's $2,000, but when you break it down to dollars wise that people are saving. What is it per household? It is different on the 159 counties based on the military at differs. Does it gentlemen further yield? Yes. In your home county about how much? Because you're probably similar to us. In Gwinnett County, we have 125,000 homeowners. We have the military. It would be around $100 or so a year depending on the county. However, in Gwinnett County, the 21 House members put a homestead ballot measure on, which will increase the homestead above the statewide minimum. You have no further questions. Thank you, Mr. Speaker. I yield well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1019. The yeas are 162. The nays are zero. The bill haven't received. The requisite constitutional majority is therefore, the bill will be in favor of the bill. The bill will be passed. Clerk will read the caption to House Bill 1021. The bill will be passed. All members voting pointing glass up to The Record of which the Bishoparre will be 30 per cent. The bill is recommended. And all it does is it increases the child tax deduction from $3,000 to $4,000. So that is an increase of $1,000 per child for every family in the state. And with rising costs on groceries, childcare costs, and numerous other things that parents are responsible for, this will once again prove that the people of Georgia are looking for pro-family policies, and we are leading the way. And I ask for your favorable consideration. I don't see any questions. Thank you. The lady has yielded the well. Is there an objection to the previous question being ordered? The chair has done the previous question. Is ordered, is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes, all those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1021, the yeas are 165, the nays are zero. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 871? 871? House Bill 871, by the way, represent a percol of 169th and others to be entitled back to a men code section 485, 48, the fish code of Georgia and Tateau relating to the homestead exemption by qualified disabled veteran filing requirements for your ex-extantiation of eligibility. This bill I'm referring to the committee on ways and means that committee recommends that this bill do pass by committee substitute. Chairman Parkle is recognized to present the bill. Thank you, Mr. Speaker, colleagues. I don't know how to be long. I throw it to a little scratchy. I bring HB 871. Been some confusion in some counties as to whether or not the surviving spouse of a disabled veteran had to stay in the same county or in some cases in the same home that they lived in at the time of the death of the disabled veteran in order to keep a homestead exemption. This bill clarifies and provides consistency for the surviving spouse and minor children of disabled veterans as to the portability of this benefit. It does require two-thirds vote and a statewide referendum. As the bill, Mr. Speaker, you have a question if you're old. Yes, sir. I will. Representative Gladney is recognized for a question. She's two-year-old left right in front of you, Mr. Chairman. Does the gentleman yield? Yes, ma'am. Yes, sir. Is it not true that as a veteran of this state, any benefit to a surviving spouse, this would substantially lead to a change of the life of this would substantially help that surviving spouse to continue support her family, his or her family, and her well-being. And it would be in the best interest for this body to support that individual and that family. Yes, ma'am. I actually agree with that. Yes, ma'am. Thank you very much, sir. Thank you, Mr. Speaker. I ask that you vote green in supporting the disabled surviving spouse of disabled veterans and minor children. Thank you. Thank you, Mr. Chairman. He is yielded the will. We have someone who would like to speak in favor of the bill, Chairman Bonner. We'll speak in favor of Chairman Bonner. You're recognized. Thank you, Mr. Speaker. I rise today just to encourage...\n\nI encourage everyone to vote green. I want to publicly thank Chairman Perkel for bringing this bill. And I think it is, it's time for our house to send a message to our veteran spouse community. We do so many great things for our veterans each and every year, but oftentimes it's the spouses that we tend to ignore. And in this case, we're doing something for a spouse that is not only live through their spouses deployment and service, but they've also been there as their caregiver for so long. So when I say that it is the least we can do, I truly mean that. It is the least we can do. So I encourage you, we need a 2-3rds majority. I would ask that we light up every name on that board in green and send a message to our veteran community that we care about your spouses. Thank you, Mr. Speaker. I yield the will. Thank you for your remarks. We have no further speakers on the bill, HB 871. Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the Committee's substitute? Chair, here's none. The Committee's substitute is adopted. Is an objection to agreeing to the report of the Committee, which was favorable to the passage of the bill. Chair, here's none. The report of the Committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. All members have voted. have all members voted all members voted if so Mr. Clerk or you lock the machine on the passage of House bill 871 the yeas are 168 the nays are zero the bill having to receive your records at constitutional majority is therefore passed members we have a couple more bills we're going to take up but I'm going to move on with a further action the chair recognizes chairman Stevens for a motion thank you mr. Speaker I move this House adopt the conference committee report on House bill 557 this clerk will you read the conference committee report the committee on conference on House bill 557 recommends that both the Senate and the House of Representatives received from their positions and that the attached committee of conference substitute HB 557 be adopted for the Senate Walker the 20th of stutthlor the 52nd capacitor the 32nd for the House Stevens the 164th parish the 158th Jan Jones of the 47th chairman Stevens is recognized recognized to explain the committee of conference report for an HB 557 mr. chairman thank you mr. Speaker some of you might recall this bill last year it passed this House 173 to 2 passed the Senate 52 to 1 and what the bill does just to refresh your memory it seeks to address the workforce healthcare challenges by number one expedite certain post licensure procedures nurse protocol agreements and physician assistance job descriptions by the composite medical board it allows APRNs and PAs to provide their adult patients only the adult patients a five day emergency supply of certain class two drugs 48 other states do this Georgia now would fall in line with those it allows PAs and APRNs to authorize disability parking and as you might recall 10 o'clock last the last day of the session it got tied up in some unrelated language and so we could not get it through the conference committee and mr. Speaker if there's no questions I'll ask for your you have a question mr. chairman if you'd like to take yes sir maybe one or two sure reminiscent representative aisle is recognized for a question to you're right does the gentleman yield are you isn't it true that when we voted on this bill last year and when I spoke against the bill last year I noted that while this legislation sounds well intentioned the last thing we need while our country and our state is in the throes of an opioid epidemic is more practitioners writing prescriptions for opioids and the question was last year and and as you might recall the very same answer as the way pharmacist fill prescriptions physicians have what's called an NPI numbered that we insert into the computer the physician assistance which by the way has to have a years working under that doctor before they can even move on they have a separate NPI number both of those have to be matched up as we file that claim so we know immediately with DEA drugs and narcotics and others if there's any games going on with overprescribing but your point is well taken thank you sir you have another question representative Campbell to your left representative Campbell's recognized for a question thank you mr. Speaker does the gentleman yield are you is it not true that this new substitute continues to include automatic agreements that transfer even if original delegating physician changes and that this removes a layer of important oversight as does the new supervising review that is limited not to all records supervised by physicians but to a sampling of records the answer is if you'll look on on line 98 again this is the same language if the problem we've got with PAs and nurse advanced nurse practitioners is that the backlog and that's all this thing as as addressing as the backlog of the of the approval and it's up to a year or more so if the language is is similar whenever a physician has got one of these approved before it follows that same language thank you gentlemen yield for two more questions if you don't mind yes sir they've been blinking the light whip birchette to your front is recognize for a question thank you thank you mr. Speaker does the gentleman yield are you is it not true that in rural Georgia there are certain certain providers only have a physician's assistant that was brought up in committee by one of the gentlemen in rural Georgia and the physician assistant or the advanced APRN is their only health care provider so thank you for the question well thank you for bringing the bill chairman chairman dr. Newton is recognized for a question thank you mr. Speaker with gentleman yield yes sir I appreciate your work on this bill I know there was some question last year whether refills of other scheduled two medications could be allowed is it true that this bill now strictly is the initial five day and just limited to really the pain medications that are needed the gentleman's correct and also the visit has to be in person thank you for that clarification with the gentleman further yield certainly I appreciate you putting that in there we do work closely with nurse practitioners and PAs and this this has the proper amount of of concern about what was raised earlier about the of the opioid epidemic which is still ongoing but at the same time allowing needed medications for a very short term to be done in a responsible way isn't that true I thank the gentleman for the question and that is true thank you sir mr. Speaker if that's all I'll ask for your favorable consideration and finally get this out and pass for the betterment of our especially rural Georgia but all the back log that we've had in our last period favorable consideration gentleman's done an excellent job excellent questions excellent job of answering the questions on the adoption of the conference committee report on hb 557 all in favor of the adoption of the conference committee report will vote yes all those opposed will vote no and the clerk will unlock the machine you have all members voted for what purposes represent to remind us Parliamentary inquiry stage inquiry thank you isn't not true that last year I shared that I was placed on a five day prescription for painkillers for a really bad infection and found myself needing that medication a lot more and had it not been for both a doctor and my spouse who is trained in this kind of stuff I could have been on a very different path right now we're glad the ladies find and I do kind of remember that so we appreciate you bringing that point back up for what purposes represent to you I'll rise Parliamentary inquiry state your choir inquiry isn't it true that while this bill states a five day course of schedule two narcotics research has shown that even as little as a three day course of opioid use can increase the risk of opioid addiction for up to a year after I'm sure the lady believes very strongly what she states all members voted all members voted if so the clerk will lock the machine on the adoption the conference committee report on House Bill 557 the yeas are 132 the nays 35 and the committee of conference report is adopted Mr. Clerk will you read the caption to House Bill 945 945 House Bill 945 I represent of Hawkins the 27th and others to be entitled and act to commend part one of article 1 on chapter 18 to title 45 of the official go to George annotated relating the state employees health insurance plan so is to provide protection recovered persons under a state health plan when an in network hospital becomes out of network this bill ever further committee on insurance that committee recommends a dis bill do pass chairman Hawkins is recognized to present the bill thank you mr. Speaker you know for many years now we're having a problem with our hospitals and insurers going out of contract with each other leaving the patients out of network recently our hospital north george medical center on April the 30th went out of contract with united and health care leaving over 14,000 north georgians without a hospital to go to or the physicians network that they used to for their health care that's affiliated with that hospital I started meeting with the insurers and the hospital separately this spring and over the summer and we have an agreement here but between those two groups what this will do is allow the state health benefit people to be able to stay in network despite or whatever the scheduled contract is that calls for between the insurer and the hospital so we will be this will be set on the calendar year of state health benefit December 31st so in plain English if they go out of contract cannot cannot agree on a contract you and your family and all the state employees will still be able access that hospital as an inpatient there will be a requirement of their contract signing with the state and that is a bill mr. Speaker and if there are no questions you have a question would you you have four questions how well right out in front of each your lady smith has recognized for question thank you so much for bringing this to the attention of the general assembly it's been a serious problem in my county and i'm sure in several other counties we have so many people who all of a sudden have huge bills and no relief thank you very much for doing that thank you ma'am for the comment you have no further questions mr. chairman thank you i ask for your favorable consideration is there any objection to the previous question being ordered the chair his none the previous question is ordered is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill chair his here's none the report of the committee is agreed to shall this bill now pass all in favor of the passage of the bill we'll vote yes all those opposed will vote no and the clerk will unlock the machine you have all members voted all members voted if so the clerk will lock the machine on the passage of the bill house bill 945 the yeas are 167 the nays are one this bill having received the requisite constitutional majority is therefore passed Mr. Clerk will you read the caption to house bill 970 970 house bill 970 by represent dicky the hundred and forty fifth and others to be entitled back to a men part four of article seven chapter three entitled twenty of the fish go to Georgia and tater relating to the reach scholarships those to provide the victims of human trafficking are eligible for such scholarship this bill I've referred to the committee on higher education that committee recommends a dis bill do pass important legislation give the chairman and the well who will be in the well just a second your full attention chairman dicky is recognized to present the bill thank you mr. speaker and colleagues are bringing a hb 970 this is an updating and funding modification for our reach scholarship program it's been this program has been a real passion of mine ever since this inception many of you actually attend these signs every month is in your districts I think when they give out these very ten thousand dollar scholarships to rising eighth graders and very deserving great ceremonies with their parents there with school administrators trying to urge these young students on to to higher education opportunities the bill real lines our state funding and local funding as many you know it's a shared cost to fund these scholarships and many of you may even contribute on a local level to these scholarships a lot of our smaller schools have had issues on a local level raising the amount of money and limiting these scholarships this bill will line it to a thousand dollars for our local commitments and 9000 to our state commitment I really thank President Lynn Riley over Georgia student finance for supporting this program keeping this program financially strong through the years and it's done a great job it's in all 180 of our school systems and and look forward to continuing on it by key to the house enter the governor for continuing to support and fund this program in our in our budgets this also expands eligibility to victims of human trafficking but the big thing is the is the financial real limit but anyway so that is all this bill does it keeps it viable long term for our young people to encourage them to go on to higher education opportunities with this scholarship for their jobs and for other education opportunities I'll be happy to take any questions mr. Spirky if there's any gentlemen has a couple of questions were you yield will represented glaze is recognized for a question she's true you're left does the gentleman is it not true that the reach scholarship is a scholarship that connects to our middle academic students and give them an opportunity to earn scholarships before they get to college and continue to become the students and then the workers of this state that will continue to keep us moving forward it absolutely is and I appreciate your involvement with this program on a local level and your support for it so thank you representative jasmine clerk is recognized for a question to your left thank you mr. speaker does it gentlemen you I do so I asked to this in committee and I'm not sure if we ever got down to it but when we are talking about human trafficking are we talking about sex trafficking labor trafficking all of these things what how are we going to define who is a victim of human trafficking for the purposes of being eligible for this scholarship well they these scholarships are as you know are awarded on a local level by school administrators teachers and maybe some person in the local community so I think student finance I think this is that the governors request I think we'll figure that out and try to do a definition of that but just wanted to make sure those local systems understood that that that criteria would would be helpful if it could be kept helpful if they needed it to be thank you with that you got one more there mr. chairman I think if you're here from representative remind would you take one more okay say for minds recognize for a question thank you does the gentleman yields I do thank you for bringing this bill forward I just had a question online 46 and 47 I noticed those were crossed out does this mean that now more students can become scholars or could this cause a drop of scholars it will be subject to funding I hope we will continue our funding on a state level and higher we part of it was was without tier system that really didn't match up very well to to local school systems trying to raise their money so that's why we went to the straight nine thousand and one thousand funding so lucky with that mr. spaker I'll you have more that would be helpful I believe I promise this is the last one what would you say trust me it'll be the last one and maybe his last question if it's not a good one two I can tell you that chairman martin is recognized for a question the chairman dick yeah you'll for a question I will isn't it true that on line 46 and 47 what you were doing is limiting the limitation and instead making its subject to appropriation so it's unlimited number if the funds are available to get the scholarships it was limited in certain counties and you're removing the limitation isn't that true so much better say it than I did in much better explanation yes we want to maximize all the scholarships we can we can do with this program and the previous thing did a funding format did do that so thank you mr. chairman it with that I'll leave the well I thought you did a great job explaining he kind of I got confused with this but you straight it all out thank you very much the gentleman's yielded the well is there an objection to the previous question being ordered chair here's none the previous question is ordered is there objection to agreeing to the report of the committee which was favorable to the passage of the bill chair here's none the report the committee is agreed to shall this bill now pass all in favor of the passage of the bill we'll vote yes all those opposed we'll vote no and mr. clerk will you unlock the machine have all members voted all members voted if so the clerk will lock the machine on the passage of house bill 970 the yeas are 165 the nays are zero the bill haven't received it requisite constitutional majority is therefore passed you Mr. Clerk will you read the caption to Senate Bill 3333333 Senate Bill 3333 by senators dixon to the 45th and still the 48th to be a title of an act to incorporate the city of mulberry this bill I'm referring to the committee on intergral milk coordination local that committee recommends that this bill do pass yes majority leader estrations recognize to present the bill well thank you mr. speaker ladies and gentlemen of the house I present to you today Senate Bill 333 this bill would create the opportunity to have a new city in guinet county called the city of mulberry I say the opportunity because it must be approved by local voters on a referendum in order for the city to take existence the issue came about as the constituents that I represent as well as represent mccullum who also represents some of the area here in the house brought for concerns about local government hearing issues of planning and zoning that were brought to them and the process really worked from there where a feasibility study was created to determine the fiscal impact of this proposed city to analyze the potential expenses for the three services that would be provided under this charter which are planning and zoning inspections and stormwater management and then also through town halls that we we've had within this area where the city would be so we've had town halls in person as well as a phone town hall and had been able to take in input they've been very well attended within our communities and we've received very positive feedback from the proposal past this new city of mulberry would be in northern eastern guinet it's all unincorporated areas of guinet county so not taking from any existing city and also I think that it's important to note that as part of this charter city property taxes would not be imposed in other words there would be no new city property tax and that's very explicitly included here in this legislation the ultimate concern about overcrowding on within schools or crowded traffic intersections traffic ingestion that's being dealt with right now really those complaints that the constituents I represent have could be very effectively communicated to a city council as opposed to a county commission. Guinet currently has four commission districts with residents in each district of approximately a quarter of a million people and this legislation is proposed would allow council districts which would have a population of between seven to nine thousand so rather than voicing concerns to the county commission and no current county commissioner lives in this proposed area residents would be able to actually contact a neighbor someone who is much closer to the community that would be impacted to share their concerns about proposals for rezoning particularly high density rezoning and how that would impact impact their area. Now I'll just run through a few important notes I'm very proud to say that I'm presenting Senator Clinton Dixon's bill here today and he represents the entire area in the state senate that's an issue here as I mentioned both House members are supportive of the of this proposed city but there is also a companion bill was introduced here in the House and that had bipartisan support so both political parties supported the legislation is as introduced members of both political parties and I want to just make clear that this is a nonpartisan issue within the area voters care about local control of planning and zoning and they're asking for the ability to have this city on a ballot so that they can speak their voice about the need for local control. The I'm aware that there's a minority report I've seen it on the desk and I'll just cite briefly to a few things that I think it's important for for members to know. So first of all I want to mention that Gwyneth County has been terrific to work with. Gwyneth County has facilitated the providing of data so that the feasibility study could be completed. I'm aware that Gwyneth County has passed a resolution which is urged for adequate consideration to be given to the proposal and it's mind or standing that same language or something very similar to that was passed by Gwyneth County back when the City of Peachery Corners was proposed in 2011 and so that's it's not out\n\nThe ordinary for going to take that position. This city proposal was modeled on Peachtree corners because it's been a resounding success. Without imposing city property taxes, it's been incredibly responsive to the needs of the community and has provided effective local government. Now additionally, there is, it's raised in the minority report that this is an issue with the state constitution or with OCGA 363654. Well, I've had a chance to look into this. First of all, there's no case law stating that this proposal is unconstitutional. So there is no existing court order that would support that position. And I'd submit that this general assembly has the ability to empower local residents to have self-governance and that that is consistent with the constitution. OCGA 363654 deals with annexations. This is not an annexation. This is an incorporation of a new city. And so that is a completely separate issue. In closing, Mr. Speaker, I know that I'm between the members and getting to launch and look forward to answering any questions that folks have on this. But I would ask for the members favorable consideration. The residents of the district that I and the representative McCollum represent, I'd submit ought to have the ability to weigh in on this issue, have the right to vote on it. And if it's something that's passed by voters to allow for greater local control in the area of planning and zoning and the other services mentioned that this general assembly should support that effort. And with that, Mr. Speaker, I'd be happy to yield any questions and ask for the members favorable consideration. Thank you. The gentleman has a couple of questions. If you'll take them. Yes, sir. Are you representative Carter from the 93rd has a question back to your left, representative During Carter. Thank you. That's the gentleman you. Yes, ma'am. So as a lifelong resident of the Cap County, I've seen my share of cities. And I tell you the biggest thing that concern me about what you just said. So help me with this is no new taxes. We recently had a city that the creator promised the people no new taxes. They did not tell the people about the franchise fees, but they have now assessed the tax. So does this legislation have language that would protect the potential new residents of a new city that they were never be assessed a property tax in this new city? Yes, ma'am, to the extent we're able to in this legislation, we have done that. Let me just be specific. We have made clear, and it's an excellent question. Thank you, representative. We've made very clear that no city property taxes can be imposed by this city. And that if there ever were to be a proposal in the future, say through local legislation, that it must be approved by a referendum within the city. Now, we have also been very clear that the proposal here is to be cost neutral. In other words, monies that are currently being paid already, such as for franchise fees that are already collected by Gwinnett County, received by Gwinnett County, could be received by the city. Money that is currently being received by Gwinnett County, say through the Title Avalorum tax right now, is the local contribution that that could be received by the city. And I'd submit to you that that is completely consistent with the objective. We have existing revenue that's collected, and there's a portion of that that goes to local governments. And that rather than Gwinnett County receiving those funds, that the city government would receive those funds. And that's consistent with what voters I think deserve, right? If you're paying a Title Avalorum tax, and there's to be a local government contribution, the city of Mulberry should receive whatever percentage of the revenue is, just like any other Georgian, whose local government is receiving that. Question. But will the gentleman further you move? Yes ma'am, certainly. OK. As it currently stands, unless there's something different in Gwinnett, counties are not authorized to collect franchise fees. So when you incorporate a city, the city can. So in essence, when we're doing that, I think we need to just be real clear and honest with the vote if they want it great. But have you investigated, or is there something different in Gwinnett? Where Gwinnett currently collects franchise fees, because most counties in Georgia do not. Yes ma'am, it's a great question. We've spent extensive time on this. And what I'll say is this, the only franchise fee that's currently being received by Gwinnett County that would be applicable is for cable TV. There is no other franchise fee. And the EMC provider for all of this area does not make any collection and would not under this new proposal. So to the degree that we're able to, I can say with confidence that we have run down every foreseeable possibility, because this is an important question that residents are asking. And the absolute objective is there for there to be absolutely no additional revenue collected than what's already being received. And for there to never be any city property taxes. Gentlemen, you and I have a couple more questions. I'm going to recognize, representing Odin Sanya. And but I'm going to ask him to hold that question just for a moment. Members, you're welcome to ask your questions. We're going to thoroughly vet this issue. But I will remind you that the rules, committee and his wisdom apply rule 33.3 to this issue. And so we'll have, we've finished the presentation. We will have 30 minutes allocated to those in favor of the bill and 30 minutes allocated to those that are opposed to the bill. So we'll just make you aware of that. Representative, to your left. Mr. Speaker. Thank you, Mr. Speaker. Does the gentleman use? Yes, sir. Isn't it true that the county commissioner that represents the proposed on Marbury City, the honorary public and commissioner Ho-Camp, cautioned you all to slow down the process and carefully review the impact study, isn't that true? I have communicated with the commissioner that you've mentioned, both before this proposal got going and throughout the process. The commissioner voted in favor of a resolution consistent with the resolution that was passed during the formation of Peachtree Corners' as I understand it. But the commissioner, just to be clear, because I think maybe there was a statement made to the contrary in committee, the commissioner has not expressed opposition to this proposal to my knowledge. And I've asked him about that. So I just think that that's important to distinguish, that the county commissioner has not opposed this proposal as was, as was proffered in committee. Thank you. Gentlemen Yeild. Yes, sir. Representative Hilton of the 48th is recognized for a question to extreme left. Thank you, Mr. Speaker. Does the gentleman kneel? Yes, sir. Isn't that true that I have the distinct honor representing the city of Peachtree Corners, the largest city in Gwyneth County in terms of population? And since our founding in 2011, our city has maintained a zero-military, and our residents continue to be excited to live and one of the best cities in all of Georgia. Yes, sir, you do. And it is well known as a terrific city who does a terrific job for residents. Thank you. Thank you, Mr. Speaker. I know that this issue is potentially going to be debated here today. So at this time, I'll yield the well and ask the members for their favorable consideration. Thank you. Gentlemen, as yielded the well, we'll now hear from those that will speak that are opposed and those in favor, and they'll have 30 minutes. And we'll also have the potential for the chair's time to be 20 minutes, and the minority report which we do have will be 20 minutes. So I'm going to recognize the representative of the committee, Dewey McLean, to speak to the bill. Thank you, Mr. Speaker. And thank you, colleagues. You know, I rise to talk a little bit about SB233. And the reason that I am is I want you all, before I go into a little deeper, you know, I want to say thanks to my wife that is hosting the neighborhood at the house because I'm speaking out onto you all, speaking to them because they wanted, you know, for some reason I kind of knew that this was going to be today. And so they're having a little watch party at the house. So how do you all, I want you all to know that I'm fighting for the constituents. I'm fighting for you all to realize that you all shouldn't pay anything. And the reason I'm saying to you, Mr. Speaker, is that I moved to go and add in 1978. And we always talk about that. I was 24 years old, and I bought a house on Pleasant Hill Road. And I say those things because I want you all to know that Pleasant Road was a two lane highway, two lanes, now it's six lanes. Ronald Reagan dumps into it. I mean, no one's going to stop growth. And so what did we do? Well, even on Club Drive, we have a three, we have a three, three turn left turn lane. I mean, can you imagine that? I mean, I know a lot of you aren't even having the idea what I'm talking about. But to make a left turn, there's three lanes that you can turn left on Pleasant Hill Road now. When I moved in 1978, it was a two lane road. And at the bridge of Yellow River, you had to pull over to the side. You had to pull over to the side to the other car pass, because it wasn't really big enough for two roads. So I don't have a problem with what's going on because it was 70,000 people in Grinette County. Today, we're what? We're at 980,000 almost close to a million. And the reason I tell you all that is, I want you all to know that I have no problem with people voting. I think people should vote on what they have. But it's only those 40,000 that we have in, that are voting. It's not the 980,000 that are voting. There's 940,000 residents that will be affected by what you all do here today. I'm sorry. You got to realize, yeah, they gonna collect $9 million. But when you have a board of $9 million, what do you expect? Somebody just got to pick it up. Somebody's got to pick up that $9 million. It is not a free lunch. It is not a free breakfast. It's not a free dinner. And it's definitely not even a free snack. So who's gonna pick up that $9 million? The other 940,000 people that did not have a say so in how this money is being spread. Okay, let's go a little farther. You got 14 departments. You have 14 departments in Grinette County. 14, we're talking about somebody, a city, there wants three out of 14. What kind of city could that be? They don't have fire. They don't have emergency. They don't have parks. They don't have recreation. What do they have? They wanna control zoning. They wanna control planning. They wanna control stormwater. And I still ain't figured out what stormwater, how they gonna get money off of stormwater. But I hear that. What about the rest of it? Who are they gonna have to pay for the rest of those services? Grinette County. And you think, Grinette County, do you think, and I'll tell the leader, we had our first delegation meeting. I'm the chair of the delegation. We had a meeting and I said one thing to him. And I'll say it to you all. My people say they don't care about a new city. They just don't wanna pay any money. They don't wanna be responsible for anything. Not one red penny. You can have as many cities as you want, but don't put it on my back. Don't make it, don't put it on mine at all. So all I'm saying to you all is, is that what we've gotta do is slow this down. Let's talk about the timeline. I don't think we talked about the timeline. This was talked about in December. December. Okay, so in January, so on January to 5th, they take the county receives a proposal. The feasibility study on that Friday, the 5th. And then on Monday, the 8th, when we come in, a bill is dropped. So what time do you think that the county had time to read or to do anything with their proposal? You dropped something to me on the 5th, and you dropped a bill on the 8th? I don't think that's enough time to do anything. So let's talk about it. So they drop a bill on the 8th. We fast-trackin' this, we're doin' fast-trackin'. We're talkin' about the 8th. The day is what February is the 8th. So we talk about within a month. We've got a bill pass, local ad run, and we're here discussing this bill. We're discussing on something that's gonna affect 940,000 residents. Not just, you know, a lot of you all don't have these residents at all. The problem that I have is that we have talked about election integrity. We always talk about election integrity in here. So you all think about this. So 42,000 people are gonna have in May. They're gonna have another something added to their election ballot that says that, do you want this to be a city or do you not want this to be a city? So I don't even know how the election office is gonna, you know, how this is gonna work because they really don't know exactly all the people are. And so what I'm saying to you all is, is that we don't need to be adding things at this time because again, it's been fast-tracked. When I say it's been fast-tracked, it is definitely being fast-tracked. So I told you all about December. I told you all about January. February today is February the 8th. And we have an election in May. We're gonna do an election in May to see if this is, this is gonna be a referendum with these people. And then, remember, we're gonna elect five city council people in the habit city. So, but now let's talk about this again. You got five city council from five different districts. They're gonna represent between seven and nine people. And they're not gonna elect the mayor. It's not gonna be a mayor elected. So, but they're gonna elect the mayor from the city council from the one of those five. So, one person is gonna be the mayor and the city council. And they're gonna rotate every two years. But you only can serve two terms. So, I don't know how five of them are gonna become the mayor. Because, you know, I mean, I do math, but four one and two is eight. So, if you're gonna own a certain two terms, you're only gonna do. Somebody is not gonna be the mayor within those two years. But then again, I really don't know what America doing two years. I have concerns. And my concern is is that we should have done a lot of feasibility study. I mean, a real feasibility study. I mean, a real two year process. I'm not talking about a month process. I'm talking about a real two year process. I'm talking about something that even the feasibility study that they wrote because I put things on your desk last week. Last week, I put the proposed city of Mulberry that came to some of you all and said, no idea what was on your desk. But I knew it was coming. I mean, no, I'm not. Why, baby, I'm not a magician or anything. I just wanna make sure you know that. But what I want you to know is I put this on your desk for a reason. Because I wanted you to read it. I wanted you to read it. And hopefully you did. So, if you didn't read it, I'll put it back on your desk, but you're gonna vote today. The only thing that I put on your desk, which was Tuesday, which was the reason that no one could say anything, it was the Board of Commissioners resolution. And it was a resolution urged in the Gwyneth County Legislative delegation, which I chair, and the Georgia Joint Assembly to carefully consider the impact of opposed municipality and the residents of Gwyneth County. And the provisions of the services there too. And then, on the motion of a commissioner whole camp, now, commission a whole camp off of this. He thinks the author of this resolution. He didn't vote on this resolution. He is the author. And you all have a copy. Everyone if you had a copy, I know because I put it on your desk Tuesday. And you may have thrown it in the trash, but he authored this resolution. This is not a resolution that he voted on. This is his resolution. It says, let me say this, on the motion of commission a whole camp, which carried by a five-o vote to the Gwyneth County Board of Commission hereby adopt the following resolution. This is an urgent resolution from commission a whole camp. This is not from he voted on it. He authored it. So I don't want to hear this again about he voted on it. One, two, you know, we talked about this feasibility study. You know, it's 29 pages. I was going to put it on your desk yesterday, but I didn't want to bother you all with some of the things. And the reason I didn't want to bother you all with some of the things is because I spent four hours reading it, make sure I understood it, and I did appreciate it until I got to the back page. And the back page says, you know, this is the front page, but then the back page says, no responsibility is assumed for inaccuracies in reporting about the client. This agents are representatives or any other data source used in preparing a presenting this study. This is what it says on the back. So I spent four hours reading something that they don't want, they don't want to hold responsibility to. And then in the committee, I heard a colleague say, well, what did he say? He said, this is standard. It is not standard people. The University of Georgia does not have this on the back of their feasibility study. This is not on the back of their study. This is not on the back of the study of the Georgia State of University. This is not on the back. But what's on the back of this one is, it says, no responsibility is assumed. So I spent four hours reading it and I didn't want to give it to you all, spend four hours reading it. What I want to do is before I leave, Mr. Speaker, is I want people to understand something. I enjoy going at, I love going at, and I'm here to represent those 940,000 that did not have the opportunity to speak. I've got to speak for them because someone's got to pick up those funds. So Mr. Speaker, with that, I do have one thing that I want you all to understand and understand me is that I talked to a group of millennials the other night about what was going on with this. And they said, well, what do you think? And I said, well, I think that what we need to try to do is slow this down. I think this needs to go through a real-to-your-process. I say it would like my mama to tell me about baking a cake. You bake a cake, it takes an hour to bake a cake. It takes one hour to bake a cake. I don't care, it's 350. If you turn it up to 700, it's not going to bake in 30 minutes. I am sorry. It will not bake in 30 minutes. I don't know what's going to happen. I mean, we all know that this should have taken two years, the minimum of two years to do a study. And let's think about it. But again, I'm going to go back to the millennials because I know that I've got other people that want to speak on this. But I want you all to know what I shared with my folks. And my folks said this. It's the city of Mulberry. Some people say, do it with the city of Mayberry. But you know what I think that what my constriction with the saying is they probably should change the name to the city of the Freelotus. Thank you, Mr. Speaker. I leave the well. General Ziel the well, he did have a question. Mr. Speaker, I'm going to leave the well because I have other colleagues and I took their time. Thank you. General Ziel the well. Let's see. General Ziel the well. I have to make a big adjustment there. Thank you, Mr. Speaker. Colleagues, I rise in opposition today to SB333. And I think about the consequences of planning for scene or on for scene. This city of Mulberry in Gwyneth will be added to 16 cities in a county that is close to a million residents. I do believe in the process and respect the views of all my colleagues in this legislation. I also want us to respect the views of those that are locally elected and represent the interest of our community. Whether they represent municipalities, county, they all should have a voice in how we are impacted. Now this city is supposed to be the largest city with a population of 42,880 people and a land mass of 26 miles, which would be the largest city in Gwyneth County. And I do believe by hearing the voices in Gwyneth County, you will understand that this is a big deal. So we should take the time to listen to some of the voices of those who have spent years in several meetings in planning on the direction on how we grow and how we sustain the services we provide to our citizens. I would like to reference the resolution that my esteemed colleague had mentioned a chairman of our delegation doing McLean. And this resolution, again, was authored by Commissioner Holkham. And it reads entitled, a resolution urging the Gwyneth County legislative delegation and the Georgia General Assembly to carefully consider the impact of the incorporation of the city of Mulberry on the residents of the proposed municipality and all residents of Gwyneth County and the provisions of services there to. Please keep in mind that the city that we're talking about is being created in district four of which Matthew Holkham, who is the Republican Commissioner that sits on our County Commission, is a resident. He lives in that district where the city is supposed to be formed. So he does have a view on residents who he represents in that district. And he has spoken by authoring this resolution. I'll just talk on a few experts here because I think it's important we need to point them out. And if incorporated as currently proposed, the city of Mulberry will be the second largest city in Gwyneth. A big deal. It has consequences. During the past year, Gwyneth County has been engaged in the process of developing a 20, 45-unified plan utilizing extensive community engagement and input to reflect Gwyneth's dynamic communities, unique cultures and diverse need. They put a unified plan that included planning with 16 cities. Can you imagine the disruption if this new city is created? We have to go back to that plan. And what would it look like? And what are the consequences? These are real consequences that can happen if that city is created. Another reads the municipal incorporation process is customary to a two-year process allowing for the careful study and review of the statutory requirements for incorporation. The financial feasibility of the proposed municipality and the impact on service provided within the county and its service delivery strategy is going to disrupt the services that are being provided by the county. It's going to disrupt the way they do business if we don't give them the adequate time to study what the impact will be. And these are the voices of our county commissioners who are elected by the people, also living in District 4. I further would like to share the voice of the Gwyneth County Attorney Mike Ludwizak. He spoke to the committee while they deliberated on this. And one of the things I want to point out, he said, as Governor and authority of the county, the Board of Commissioners has responded to represent the interest of all its residents, both in the incorporated and incorporated areas. All its residents. These concerns and, again, consequences will be one loss of revenue to Gwyneth to a minimum of $9.1 million annually. And that was just an estimate. The county has not had the opportunity to do a feasibility study. And that is what they're asking for. Let us do a feasibility study so we can adequately deliberate and understand the impact. Further, we want to point out. We talked about Peachtree corners. The process that Peachtree corners went took two years. A city not as large as this proposed city. Two years and the adequate deliberation was done. And that's why Peachtree corners has had successful growth in the last few years because there was adequate planning. I'd like to say, the democracy is a team sport in making decisions. And we should closely consult all stakeholders. Yes, our stakeholders are voters. Our elected officials, our county officials, and our delegation. And our delegation wasn't given the adequate time to be consulted. Our county commissioners were not given the adequate time to be consulted. And that is why they have asked for more time so we can properly deliberate and have a conversation on how to be successful as clinicians. I personally have had the opportunity to live on three continents, three countries, nine cities. And I know it's a big deal that anything you do in our communities, the decisions we make,\n\nhave consequences. For me right now, creating that city will have consequences. I urge my colleagues in this house to give us time to the Liberia Plan and discuss and give our leaders both state and local an opportunity in making this decision. I lead by saying I'm in a position to SB 3333. Mr. Speaker, I yield the well. The chair recognizes Representative Clark to speak to the bell. Thank you, Madam Speaker. Colleagues today, I rise in opposition to SB 3333. Whenever a new city is formed, there is a lot to consider. What services will it provide? How much will it cost to provide those services? How will the revenue generated to pay those costs? How will the cost of other services that are not provided for by that city be paid? What are the effects on the county that will lose some of its revenue? What are the effects on the people that will live there and the business that are not provided for that city? What are the effects on the government that will be paid? What are the effects on the people that will be paid? What are the effects on the people that will be paid? What are the effects on the people that will live there and the business that are located there? That's just a few of the things we need to consider. This is why the committee that normally here is bills on the incorporation of new cities has a very well prescribed formula for any cityhood to be able to pass out of that committee. The rules of this committee is actually multiple pages long. It's not that one-pager. It gives very specific instructions for the incorporation of cities. Here are those instructions. Quote. Any bill or resolution coming before the committee that proposes the incorporation of a new municipality shall be considered only if the bill is introduced during one legislative session studied over the interim between the sessions and then brought up for committee action in the next regular session. In other words, bills must be introduced in the first year of a two-year term studied after session ends and then brought back to the committee during the second year of the second term. The rule even specifically states that even if you want to introduce a bill in the second year of the biennium, you can do that but then you'll have to reintroduce that same bill in the first year of the next bi-year term. So no matter what, this is a two-year process. But rules also state that a comprehensive feasibility study conducted by either Carl Vinson at UGA or Andrew Young at GSU or another public institution affiliated with the university system of Georgia must be provided 60 days before the session ends. It's not even 60 days since this bill was introduced. For city bills to be considered. So two-year process and a feasibility study done by a public institution, the bill you will vote on today has done neither of these things. This bill started only a month ago and the feasibility study conducted was done by a private firm that holds, takes no responsibility for the data that they presented. And that was only made 48 hours before the bill was actually introduced to this spotty. The sponsor and the supporters will point out that the rules don't apply to them. Oh, sorry. The rules don't apply to them because the bill did not go to the governmental affairs committee but instead went to the interim governmental affairs committee. And they technically are right. This bill, unlike every other cityhood bill that you all have had to pass for your districts, we have had to incorporate a new city, had to go through the governmental affairs committee. But this bill was allowed to circumvent that process. So basically the rules don't apply when it comes to this particular measure. The process that we have followed up to today cheats the people. The process we are following right now could have residents in that area paying very high fees. Yeah, they might not be paying higher property tax, but they could be feed to death. And then if they can't pay those fees, that city can put a lien on their home and take their home from them. The county has graciously asked for this process to slow down just to the normal two year process that's followed by every other cityhood in here. If you are a legislator and you have tried to pass and incorporating a city in your area, you had to go through a two year process. Why should one of your colleagues get to cheat that process? The commissioner in this area, Matthew Holt camp, the sole Republican on the commission has also asked for us to slow this process down. So if the person who they say wants this measure is the same person who has asked us to pump the brakes, then why are we mashing on the gas? Additionally, members of this very chamber, our colleagues have also asked for this process to be slowed down and that this be a two year process. In fact, they want it to be the law of the land. There is bipartisan support for a two year process with a bill that would codify this process that passed out of committee, subcommittee and committee unanimously. Democrats and Republicans, what we are asking for today is not a democratic position. It's not a Republican position. It's not even a partisan position. It is a value position. It is a democracy position. As my Republican colleague and the sponsor of that bill that would codify this process so eloquently stated and I most certainly agree. Incorporating a city is an important process. It is one of the most fundamental local government decisions that can be made and have a direct impact on people's lives. We don't really need it to be that simple. It needs to be intentional and it needs to be fair for all involved. That is a person in here that is not in my party. It is in the party of the person that is bringing this bill forth. I have been here long enough to know that rules can be bent and bills can be stalled and that the outcome for this effort was decided well before I sit in this well right now. I will ask anyway on behalf of the people of Guinet who I am talking to right now that are being denied the basic courtesy of following the process and getting all the information that they need to make an informed vote. Please vote no on this bill today and allow this process to be done right. And with that, Madam Speaker, I yield the well. That concludes those who want to sign up to speak against the bill. The chair recognizes representative Martinez to speak in favor of the bill. Thank you, Mr. Speaker. I rise here today in support of SB 3333 as this area that we're discussing is right next door to me. See, I represent the Kula. Speaker, colleagues, this is God's country. This is God's country. This is a beautiful landscape in this area that we're talking about. At beautiful diverse community, Mr. Speaker and colleagues, beautiful parks. I drive this area often. I know a lot of folks in this area. Safe environment, beautiful area. You see, I was a mayor in a city council once. I represented city of Loganville. A couple of years ago, we tried to develop our downtown main street and we had to develop a ready to roll money. We had everything going. What we didn't have was the people. The people came to our city council. Even they spoke up. They spoke up and rightly so. They spoke up. We heard them. And this development downtown main street was held. We didn't do it. Even though the developer was ready to roll. They spoke up. We listened to them. There was only 16,000 of them. In Walt County, there's 100,000 folks. 16,000 people in the city of Loganville spoke up. And we listened to them in this development as of today has not happened. Minority Party talks about choice. I hear choice all the time. Favorite word. A couple of months ago, we talked about candidate of choice. I think I heard that a lot. Candidate of choice. Let's give the people in those districts a choice. Let's give them a choice to elect their folks. Well, that's what I like to say. Let's give them a choice. Ladies said this is not a Democrat issue. This is not a Republican issue. You're absolutely right. I cannot agree with you more. This is a choice issue. Choice. We're giving them a choice to vote on a referendum. If they don't want it, kind of what happened in Loganville. We came to those people a choice. If they don't want it, they'll knock it down. If they want it, they won't vote for it. But we're giving them a choice. Isn't that what we talked about a few months ago? Candidate of choice. I thought that's what we talked about. Right? We're giving the folks a candidate. We're giving them a choice. You know, we're giving those 42,000 folks a choice to see if they want to do something. I love Gwyneth County. I love my delegation just like the chairman. I love my county. I really do. I do remember one thing a few months ago, a few years ago, when the redistricting came by and I said, if you're going to have me represent, I want some part of Gwyneth County. I love it. I love it. I also represent Walt County. But I love Gwyneth County. I love the people. I love my 21 member delegation. We all get along. We may disagree on some issues, but we all get along. Do you know that there's a million people close to it, a million people, 21 delegates, house delegates in Gwyneth County? You know, there's only four commissioners, four commissioners. The other county that I represent, Walt County, has under 100,000. We'll say 100. You know how many commissioners are in Walt County? Six, six. Each one of them, each one of them represent about 16,000. That's pretty good representation right there. Each one of Gwyneth County's representatives represent 250,000. I remember a few months ago, we talked about voices. The voices are not being heard, right? Remember that debate we had back in December? Voices are not being heard. You tell me we represent 60,000, right? And you tell me it's hard for us, ain't it? It's hard for us to listen to all their complaints, to represent 60,000 people. Imagine having four times as much, 250,000 for each commissioner. I haven't done the homework, but I believe out of all 159 counties, like me if I'm wrong, I believe 100 out of all 159 counties, Gwyneth County commissioners are the ones that represent the most. Walt County, 16,000. Six commissioners for 10% of what Gwyneth County has for about 100,000. Those folks are not being heard. I can tell you right now, those folks are not being heard. I don't care Latino, Black, white. Like I said, this is the diverse community. Those folks are not being heard. And I stand here, colleagues, for you to support this. Let's give the folks a choice. Like I said, is that Republican? No, it's not Democrat. It's a people's right to decide what they want. And we talk about this all the time. It's a people's right to decide what they want to do with their city. Let them cast their vote. Let them cast their vote. Like I said, we talked about this two months ago, right? Vote, vote, vote. We talk about voting. Talk about choice, right? I hear some folks don't want to let the people decide. I hear that. Correct me if I'm wrong. I'm here some people say you don't have the right to vote whether you want to sit here or not. Please correct me if I'm wrong. I'm hearing that. Let's put this on the referendum. Let the people decide. I'm right next door. That's my, that's my area. I'm right next door. I know a lot of people there that would love the chance to stand in line. Come when the time comes and vote. Have their voices heard. Isn't that another thing we heard? I'll tell you we're coming back two months. Have the voices heard. Right? Let's have their voices heard. 42,000 of them. Let's have their voices heard. I now hear for any questions. If I don't have any questions, I'll hear the well. There are questions if you'd like to address them. The chair calls on Representative Cannon for questions. Thank you, Madam Speaker. Do you yield? Yes, ma'am. So can you explain to me why you feel like this does not need to go through the original process and why this bill coming in this form is ethical? That's a good question. My point is that like the majority of the leader talked about people complained. Whatever the complaints were about that area. And I really believe as a local mayor and I told you, and I showed you my, my example about we wanted to build and I was in favor. I was in favor of developing my downtown with the people spoke. It wasn't the whole county, but 16,000 people in local will spoke. I believe that the development held. I believe, Ms. Park, people had the right to choose what they want, including what they choose to live, whether it's a city or not. So I really believe in that. I believe in freedom. Give the people the choice. Let them go vote. Put it on the referendum. Let your cards out there. Lay them out there and show me vote. And this is what we've been talking about for a while now. Two months ago, we did the special session. And we talked about this and I'm very passionate about that. Do you further yield? So just to clarify, you feel as though this process, the way that this legislation has moved is ethical and puts into the considerations of this house's rules about how local people are going to live. How about how local measures get passed? I believe is ethical. Okay. I think it's right. Thank you. Chair recognizes representative Koyeg for a question. Thank you, Madam Speaker. Tim. Do you agree? Absolutely. What I understand that is being asked today is that we have time to vet what is being proposed before we now let, let it go to the public and the 42,000 people to vote in the referendum. Nobody says no to other people voting, but we are asking that there's no need to rush this at all. I'm also a perplexed when I heard you talk about the number of commissioners we have in Gweneck County. When I was party chairman in Gweneck County, I proposed that we have, we increased to nine. It was later brought down to seven, but some people even did not want the seven. And today is being used as a point. And so my question is why don't you give the people the county commissioners and stakeholders a chance to vet this properly so that when we present this for referendum, people will know exactly what they have been asked to vote for. Thank you. Thank you so much. Mr. Koyeg, I do agree about the commissioners. I think 250,000 is way too much for each commissioner. And this is something that we may have to talk about. In other words, it goes, it blows down to these 42,000 people in that area has spoken loud and clear. And that's what they want. And I believe this is what they deserve. Their voice to be heard. All right. Mr. Speaker, I'll hear the well. Thank you. Gentlemen is yielded the well. The chair recognizes representative Anderson to speak to the bell. Thank you, Madam Speaker. Colleagues, I'm not an attorney. I don't pretend to be one. I have spent a lot of time in the last few years working in this space. Looking at two years ago as the chairman of our cityhood subcommittee, looking at many feasibility reports, many pieces of legislation regarding doing that. It's no secret that I am in the process of looking at this policy and getting help from many people in this chamber to do that. But I'm here today to talk about facts. Okay. And some misconceptions and some things that you may have heard that just just aren't so. First of all, there's been the assumption that this process that we're looking at today is unconstitutional. There is nothing into constitution that prevents this from happening. And as our leader said earlier, the presenter of the bill, there's been no case law to that effect. The constitution addresses supplementary powers. Again, I'm not an attorney, but I do know the difference between may and shall. And in addressing supplementary powers, it says that counties and municipalities may provide a list of, from a list of supplementary powers. And there's 14 of them listed in the constitution. So it's not a constitutional issue. Let's look at state code. A reference was made earlier to 3636 54 dealing with annexation that does not apply. This is a new city creation in our state code. The only place that could potentially have an impact on this is in 3630 paragraph 7.1, which defines basically an active municipality. And active municipality meets three standards. The first standard is it has to provide three services. There are 11 listed in the code there. The three services proposed for this city meet and are in that list of 11. The second provision is they have to hold meetings at least six meetings on a regularly scheduled basis. They must be public. They must be recorded. This bill provides for them. The third is a must hold regular elections to allow the people to elect the officials that are representing them. It's simple. This bill not only complies with state law. It not only complies with our constitution. It goes beyond that. Our state law does not require referendum. This bill does. Our state law does not require the provisions in here regarding taxation. This bill does. If we must have government, it must be responsive government. And the most responsive government is the government closest to the people. So I urge you to support Senate Bill 3333 and Mr. Speaker, I yield the well. That concludes the statements on from those in favor of an opposed to we will now move on to the minority report. We'll park is recognized for up to 20 minutes. We'll park. Gentlemen has the well. Thank you, Mr. Speaker. I rise in opposition to SB 333 and I want to make clear a few points. First and foremost, myself along with my Democratic colleagues, we support the ability for the residents living in the proposed area to have the freedom to vote. And determine whether or not they want a new city. My understanding is that that is why there was bipartisan co sponsorship of the House version of this bill that was properly assigned to the House Governmental Affairs Committee. As Democrats, as a party of the people, we believe in the right for Georgia citizens to vote to determine their future and we will always fight to secure that right. My opposition and the opposition of my Democratic colleagues along with some bipartisan opposition at the local level is that this process is moving way too quickly. And for me, in my understanding, this proposal violates the Georgia State Constitution, Georgia State Law, along with long standing legislative rules that require a deliberative two-year process, legislative rules that prohibit city light proposals like this one, and legislative precedent that requires a fiscal impact and service delivery study prepared by a public academic research institution, not a private consultant based on outdated data. My colleagues and I oppose this bill because we believe the citizens of Gwyneth County should have the freedom to vote on a legal proposal that will not lead to litigation and be provided with accurate information so they have the ability to make an informed decision to determine their future. Throughout this entire process, all we have asked for is for there to be a careful, deliberate planning process that occurs over a two-year period that is the customary process for the creation of new cities. So a few things have been said about during this debate, which I'd like to further discuss before I get back to my remarks. But one, taxes cannot be imposed by this city. Yes, that is what the bill says, but that is not what the state constitution permits. As we have discussed Peachtree corners, which is a model example of a great city here in the state of Georgia, which followed a two-year process. Five years after that city charter passed, that city charter had to be amended back in 2018 to sever, to cut out those provisions that otherwise limited the ability for the city to collect taxes and to have a referendum in order to remove those powers. So keep in mind, especially for the voters in this area, if you vote for this city, you are voting for a new city that can impose taxes on you, period, under the state constitution. Number two, it's been said multiple times that there is no case law on this issue. There is no case law because city charters have been amended to comply with the state constitution. Just like this city charter, if it passes, if the voters approve it, will have to be amended to comply with the state constitution or otherwise be subject to litigation in which those provisions that are unconstitutional will be severed, which again, will allow this new city to impose taxes on its residents. Now, much has been said about local control by the proponents of this cityhood bill, despite the actions taken by those same people, those same legislators, who over the past few years have taken action to undermine local control and the will of the people in Gwinnett County. While the proposed city falls only within the district of one member, the implications of this bill would impact every citizen in Gwinnett County, the second largest county by population in the state. By requiring a forced and premature negotiation of the existing comprehensive service delivery strategies approved by the Department of Community Affairs in 2020, that's not up for a negotiation up until 2029, which will result in changes to service costs charged to all of Gwinnett's residents. As this local bill would have a countywide impact, and yes, a city charter is a local bill, but because it has a countywide impact, it is only fair and reasonable that the support of the local delegation should be required or at a bare minimum requested. However, just like previous efforts to bypass a local delegation and forcibly take action without regard for the disruption and harm it may cause to one's neighbors or constituents of a fellow legislator, again, this body is manipulating the rules, bypassing the rules, to put a politician's politics before the best interest of the people. For Article 3, Section 3, Subsections B and C of the Gwinnett delegations bylaws, which have remained the same under both Republican and Democratic majorities, all members of the Gwinnett County House delegation shall be eligible to sign legislation affecting Gwinnett County, and a majority of those legislators eligible to sign must sign in order for any legislation to pass. Repeatedly, the actions of today's Republican Party demonstrate that the rules apply to everyone except for them, that they are above the law. Now, if this bill passes, which I assume it will, given the prior actions taken by the majority party, that again has repeatedly undermined the will of the people in the most diverse county in Georgia. I think it is important for those who are going to vote on this proposal to at the very least have accurate information on what they are voting for despite the statement from the Senate sponsor of this bill and committee.\n\nwho said that he thinks it would be best to have residents vote on this issue first and then conduct studies and be provided information after they vote. This unconstitutional city-like proposal has been pitched as one that will be prohibited from collecting property taxes to fund services for this New County, for this new city, that the services provided will be limited. Again, those restrictions are legally unenforceable under the Georgia State Constitution. That means if voters vote to approve this new Mulberry City, they are also voting to create a new governmental entity with the power to impose property taxes and utility franchise fees and can do so without a voter referendum, regardless of the provisions in this bill. How do we know this? That's exactly what happened with Peach Street Corners. Fabulous city that I support that went through a two-year process, again, which I mentioned previously, that was amended five years after it passed to remove similar unenforceable restrictions in its charter on services and the requirement that a voter referendum approve any new services. Residents in Peach Street Corners, residents look up the article. They felt stated that they felt bamboozled and were provided false information. Now, by no means am I trying to imply that false information is being provided, perhaps a difference of opinion and interpretation regarding the state constitution and this bill. But given the precedent certainly with what happened in Peach Street Corners, it seems clear that if voters pass this bill, there will be unconstitutional provisions in that bill that will otherwise be separable. At the very least, I hope Mulberry residents will be provided the facts and the truth and not lied about this city that again, will have the power to impose property taxes on top of existing county taxes and fees. It has been further noted that this proposal violates state law with respect to imposing restrictions on Gwinnett County's ability to make modifications to zoning that may result in a costly challenge to defend the legality of a moratorium. And it seems a city does not even meet the statutory legal density requirements for a new city under Georgia law. Given the rust nature, given the rushed nature of this proposal, it is understandable that some legal aspects may have been overlooked. But I do think that it is further evident and proof that a two-year period of time is needed and respectfully requested to ensure that any new city-hit proposal is carefully and deliberately created to ensure it complies with the Georgia State Constitution and Georgia State Law. Now, one thing that I've struggled to understand about this entire process, again, is the rush timing. What is the emergent scene that we're trying to address here? I heard that this issue first stemmed from citizens desire not to have a high-density development project in and around that area. That proposal was withdrawn and as far as I'm aware, there are no pending development proposals in that area. It seems to me that we've seen responsive county government in this area. Now, the other thing I've been a little bit surprised about is the immediate reaction to grow government, stifle growth, coming from the party that supposedly purports to be the party of limited or small government and free market. Now, I also think it's important to note that the area of this new city is represented by a Republican county commissioner who was elected after this body bypass the local delegation in 2022 to draw a majority white district in the most diverse county in Georgia that knocked out the first black woman in 200 years elected to the Gwyneth County Board of Commissioners and insurance executive of 25 years, a good woman and a community leader. In this area, we have Republican representation at the local, state and federal levels of government, but apparently that's still not good enough. Again, the solution that's coming in this proposal is more government to grow government. Rather than have one person at the local level to hold accountable, if this bill passes and if the referendum is supported by voters in that area, you will have at least five people who, yes, will be closer to the people, but will also hold more power over the people, including again, the ability to impose property taxes and other franchise fees. Now, as I raise a concern of this proposal, growing government, just like a failed proposal from 2021 that would have doubled the size of local government in Gwyneth County, it was implied that if I carry my concerns to its logical conclusion that I meant that that proposed purportedly, I would support the abolishment of all governments. That is a nonsensical conclusion, all due respect. With respect to the size of government, the creation of new cities, the redrawing of legislative lines, I was provided excellent, common sense advice in the midst of redistricting a few years ago, in which if it ain't broke, don't fix it. Gwyneth County is a thriving, diverse county with a triple A bond rating, a $2.5 billion annual budget. It's been concerning to hear my county castigated in which, for the most part, all of the county professional staff that have insured this county success, they've been there for decades, they've worked under Republican and Democratic control. That's why Gwyneth continues to succeed and thrive because of the professionalism of our staff and because of the great public schools, along with all of the other services that this county provides, some more than to nearly one million people. And so, for my part, I will continue to do everything within my power to ensure all of the people of Gwyneth County, just not a select few, have every opportunity to have their voices heard here in this body and every opportunity to grill and thrive. When all is said and done, again, I support the right of Georgia citizens to determine their future and the right to vote to create a new city. However, I also strongly believe that Georgians should be provided the facts and accurate information as to what they are voting for. Accordingly, because of the rushed process of this bill, its unconstitutional provisions, and the lack of accurate information as to actual cost of services, not only to residents, but in this area, but for all citizens who call Gwyneth home, I urge members of this body to vote no to ensure this city hood bill process goes through a careful and deliberate process. With that, Mr. Speaker, I will yield for any questions and if there are none, I will yield the well. Gentlemen, has no questions. Thank you, Mr. Speaker. Gentlemen, Jewe Dewey, thank you, Whitport. That concludes the Monardi's report. The chair time is now available for up to 20 minutes, chair Lady Camp. Chair, the committee from which this issue came is recognized to speak to the bill. Thank you, Mr. Speaker. And thank you, colleagues, for being here today and listening to the debate on this. We also debated this for an hour in intergovernmental coordination meeting Tuesday afternoon. I think it's important, something has been said about this not being vetted through committee. How committees assign bills is not my purview. It was assigned to the committee. It was done as every general bill would be done. It was presented. Everyone had an opportunity to come and speak reference to the bill. The bill passed the committee after some very vigorous debate over the hour. And we're here today, again vigorously debating this point. The process of the bill, that's kind of been to question. I know handling the process in our committee was done with the utmost attention. The clerk's office was involved as well. There was someone from the office of reapportionment and someone from legislative council present during our meeting to make sure that any questions that arose could be addressed. I would like to yield the balance of the remaining time to speaker pro-tim and the majority leader. Thank you, Mr. Speaker. Thank you, chair lady. The chair lady has you to the remainder of the time. The speaker pro-tim, Jan Jones, and representative Jones has recognized to speak. Thank you, Mr. Speaker. I just didn't want this opportunity to pass me by and not plan to speak, but I just so many of the members of this body came in since we started the process and the interest in folks creating new cities, primarily in the largest cities, largest counties in our state. And 19 years ago, every Democrat voted against the creation of Sandy Springs. In fact, the county commission, just as in the case of the city of Mulberry, passed a resolution, in fact, reading it yesterday in committee, it looked, they must have passed it around because it looked virtually the same as the resolution opposing the city of Sandy Springs by the county commission. One year later, we created the cities of Milton and John's Creek, again, the same rhetoric that I'm hearing today, the same objections, it'll destroy the rest of the county, the rest of the county will have to pay for it, certainly 19 and 18 years later, that's not been the case. And then one year later, 17 years ago, we voted to create the city of South Fulton, which at the time, then and now, a Democrat, African-American majority city, and the county commission once again, opposed it. In fact, the most vociferous opposition came from the African-American Democrat, county commissioner that represented that area, that unincorporated South Fulton. That effort, which we supported, the Republican majority supported the right of that area to self-determine, passed in this body, passed in the Senate, was signed by the governor, but it failed amongst those who lived in the city of South Fulton by a great majority. A year or two later, a couple years later, this body once again supported the members who represented that area, and the people to take another vote. Once again, what was interesting that time, is that the very commissioner that represented the area that actively fought the creation of city of South Fulton after it passed the second time ran for mayor, and served as mayor until he was beat by a member who sits in this body today. And at the time when we first passed it, the county commissioner gave all the same reasons we're hearing today. You know, and of course what I suspect is he didn't like that he was going to lose his direct control over that area as the district commissioner, but once it passed, well then he hopped over and decided to run for mayor. But I would like to remind, or maybe not remind, but illuminate to those of you who weren't here and weren't, didn't observe these fights on this floor of the creation of about a dozen cities. And a handful have failed and that's that's called local decision making. Let them decide what they want and how they want to be governed. But the county commission of cab county and Fulton County, they did not support. They opposed the city of Chattahoochi High, the city of Tucker, the city of Dunwoody, the city of Brookhaven, the city of Sandy Springs, the city of Milton, the city of Johns Creek, the city of South Fulton. All of whom are thriving cities today, most of whom's residents wouldn't even know that they live in a new city. They just know that they have local control and the decision making is made by neighbors and friends that they know far more than the size of these counties. That are I will remind you, when that county is larger in population than six states in the union. And that is also true of Cobb County and Fulton County. We're not seeing a breakout all over the state of interest in creating cities because most of you represent counties where people feel like they have local control. They may live in the county seat or they may live in a city. But for the most part, city means city. It means generally where most of you live, higher density. Most often the city has a police department if it's large enough. They have sewer. They have water. And the county means what most people think of county means rural. It means the country. But that's not true when you get into a densely populated area like the metropolitan area. Our particularly our four large counties operate like mega cities in many respects. And that they have water. They have sewer and they're making city like decisions. But not people don't feel like they have elected, elected influence. That's what these people, most people who approve a city in their area want. They want elected influence. They're still going to be a part of the county and they're still going to be paying county taxes. And it really surprises me. It has surprised me in every instance why the counties have opposed it such as Gwyneth this time. I've heard about the dense city. I don't know the density of the city that we're about to. I hope that we will vote today to give those people that right to vote. But I will mention that the city I represent, the city that I helped had a hand in creating was less dense than the city that we are under consideration today. It was 19,000 people and it was over 25 square miles. But it is a thriving city today and it passed by 86 percent. And I would venture to say if we held a revote it would pass by a higher vote. I've heard the argument that the rest of the county residents will have to make up the monies that this city will collect. I heard that in every argument, every debate of approximately 12 cities or so that we've created here. And it's simply, it's a misrepresentation of what happens. This city will offer three very limited services. Zoning code enforcement and stormwater. They will collect monies for services not rendered now by the county. So they will collect monies for services that the city will supply. I would hope that the county wouldn't increase their taxes for services they're no longer rendering. But if they do, I hope you'll hold them accountable at the election box. It's been said, but the seven or eight thousand folks that each city council member will represent replaces only for those three very narrow services. 250 county commissioners that represent 250,000 people. That is by most people's definition, not very, I would not consider that local governance. And I will say in Fulton County, which is now and I'm not suggesting this for any other county, but it certainly works for hours. We are essentially fully municipalized in an a million person county. The Democrat majority cities and the few remaining Republican majority cities get, get along much better than we did. When we sort of had halves and have nots, we had the halves in Al-Ferrata and City of Atlanta who felt like they had local governance. And we had the have nots, the great unwashed like where I live, the unincorporated residents who felt like we didn't really have anyone representing us on the most local, intimate decisions by local government. And we now have intergovernmental agreements between the cities, even the cities adjacent to the new cities that opposed it, get along much better today. And in fact, I think it works much better. I think if you were to ask most of the commissioners, they would not want to go back to the days of where they had to provide some of the services that cities provide today. But I would encourage you to support this measure today. And as we've seen across the state, I don't know what the outcome of the decision the referendum will be. But I really do believe that more governments in a county of a million people is less government. Because it is government closer to the people and they, and really what government closer to the people means, it means more elected influence. That's what government closer to the people means. And I don't suggest that model for where the vast majority of you live that are sitting in this chamber today. And I have not seen a movement in the 19 years that we've had these sorts of proposals come through the legislature. As for the process, it's been an evolving process. It's changed depending on the measure, the circumstances. And if there was a sense of urgency by the people who appeared to want to have the opportunity to vote. And so I just asked that you give consideration to the legislators who represent this area. And I would say are closer to the people than the county commissioners who might oppose it, who represent 250,000 persons each. And with that, I will see the remainder of the time to the majority later. Majority Leader, F Strace has recognized to finish up the time, chairman's time. Mr. Majority Leader. I think I'm a speaker. I just want to cover a few brief points here. If y'all could have been with me and represent McCullough at the 10th, Senator Dixon at the town halls that we held in this area, it was not political. It was not partisan at all. There was overwhelming support. Residents crying out saying we need local government that will listen to us. We feel like we're being heard where we can get some responsiveness. It was nonpartisan. And unfortunately this issue, just when it hits this Capitol building, suddenly becomes partisan, suddenly becomes divisive in some way. And this issue brought up at the point was made that, well, this originated because there was a zoning proposal, and that proposal went away. And was withdrawn when this city was proposed. This city was proposed originally in November. It was done so with the, when that county knowing about it, with there being ample time prior to the legislative session, because it was said an Atlanta media covered that a city was going to be proposed at the upcoming legislative session, fully open about that. Now, I just, I just want to cover the process here briefly. I think the, what's been described as correct, but the process that's required for legislation here at the state Capitol has been followed. It has been followed completely as it goes through. There were house and senate versions of this bill that were introduced. I presented it at a meeting of the Gwanette delegation. It gave all the members an opportunity to ask questions. I sat there. I think if you asked the chairman of the Gwanette delegation, he would confirm. I sat there and answered all questions. Was open to further follow up questions. I have said to other members who neighbor this proposed city. If you want to include parts of the district you represent in the city, be happy to have that discussion with you. But the proposal that's before you here today only involves two members and both members have signed it and supported. There's also a third member who signed the house version, whose district joins it, and is of the other political party. So there's bipartisan support to give residents in this area this decision. This process has been followed. What's made of public versus private for preparing the feasibility study. That's just a misnomer. That's a red herring to distract. The $9.4 million in revenue per see in the feasibility study effectively matches the amount that Gwanette County claims would be a fiscal impact. The numbers are very close. And I think that citing this disclaimer at the end of the feasibility study, that's just boilerplate language at the end of a report prepared by the state of the state. There's nothing to read into that. I would just say this that cost is the last issue. I'll wrap up. I appreciate the body's indulgence of this debate here today because this is very important to the residents that I represent. It's our residents who are truly being impacted by this bill here today. And the challenge made late in this process that there's going to be a financial impact to the rest of Gwanette County is not supported, both logically and from the facts that we have before us here today. First of all, if this city is created, it will be taking over services that are currently provided by Gwanette. That would allow for a reduction of costs to the county government. And the county claiming that this will increase a tax burden assumes that Gwanette County will not cut costs based upon having to provide services to fewer residents. The second point that I would notice here is that the amount of fiscal impact and the amount of financial revenues anticipated by the city nearly match, which shows that we really have a grasp for this feasibility study, has truly grasped the potential costs, including savings that can be made for reserve fund with this city, to truly cover costs and provide services adequately taking those over from Gwanette County. But the third point that I think is important, and if you'll please, if the clerk will please put this up on the screen yesterday in the yesterday in the Gwanette Daily Post, there was a legal ad run stating that on February 27, 2024, at the regular meeting of the Gwanette County Commission, they planned to take up increasing the chairperson's salary to a tune of $141,800. So to claim that there is some financial impact as a result of passing this legislation on the taxpayers and the rest of Gwanette County, when Gwanette County feels fine to raise the chairperson's salary by $141,000, I'd submit as disingenuous. And I'd ask for your favorable consideration to this measure based upon logically, this not being inconsistent to claim that this is going to be a tax impact on the rest of Gwanette, and by the evidence in yesterday's newspaper in Gwanette County, that Gwanette County is not concerned about costs going forward. Mr. Speaker, I ask for the favorable consideration of this body, and I yield the well. The gentleman has yielded the well that completes the discussion, the presentations on the bill. Is there an objection to the previous question being ordered? Chair, has none of the previous question is ordered? Is there an objection to agreeing to the report of the committee, which was favorable to the pastor of the bill? Chair, has none of the report of the committee is agreed to? Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. For what purpose is representative McClain rise? Parliament inquiry. State inquiry. Mr. Speaker, is it not true that all those cities that Madam Protell spoke of did a two-year process on feasibility? Honest and representative, I'm not sure of that, so I'll let you offer one more preliminary inquiry to that point. Parliament inquiry. Mr. Speaker, in reference to my question would be, my inquiry would be, is it not true that there's got to be, there's no free lunches, or no free dinners, or no free snacks? I think the world proves that. Thank you, Mr. Speaker. Thank you, Representative. For what purpose is representative Raman, rise? Parliament, please. State inquiry. Is it not true that I also represent Peachtree Corners, and that city spent a lot of time and effort to ensure that it is going to be a sustainable city, particularly that 45% of its revenue comes from businesses unlike the city that we are debating today, and that's how they've kept their taxes non-existent. I'm sure the lady knows of what she speaks, and knows of the commercial makeup of all those areas. What purpose does representative Raman arise? Thank you, Mr. Speaker. Parliamentary inquiry. State inquiry. Is it true that we are voting, this body is voting on a bill to decide if the people in Gwinnett County in a small area can vote yes or no to this new creation of a city? We are not creating a city. We are allowing constituents to decide if they want a city. Is that not true? That is exactly what I've heard this morning, or excuse me this morning and this afternoon I believe on this bill. I think the lady knows of what she speaks. For what purpose does representative Inilloowitz rise? Inquiry. State inquiry. Is it not true that this city is structured very similarly to several cities that did not pass at the ballot box in Cobb County last year, and specifically part of the reason why is because this city is also structured where the mayor is not elected by the people of the city, but the mayor would instead be chosen from amongst the council members?\n\nI've heard that. Thank you. I think the lady from Cobb can speak to that as a country boy from South George, you didn't have these problems. I think there's a lot of similarities between Cobb and Gwyneth. So we're going to do exactly what you said. The House passes the bill. We're going to let the folks vote on it. We're going to see what they want to do. What purpose does Representative Williams rise? I'd like a man from the coast to speak to this. Parliamentary inquiry, Miss Speaker. Speeching. Statue inquiry. They're Representative Williams. Is it not true that I'm excited about this enthusiasm of the people getting to vote? And I'd love to see it happen with casino gambling. I knew I shouldn't have recognized you. I don't think that issue is included in this issue. Two more. We're going to wrap this up for what purpose is Representative Hutchinson rise. Parliamentary inquiry. Statue inquiry. Is it not true, Miss Speaker, that the County Commissioner of Gwyneth County makes the least amount of money of any metro area and we've been working on raising her salary for the last two years? I'm sure the lady has reviewed those pay scales a little more than we make. I'm going to close with this one for what purpose does the majority leader rise. Parliamentary inquiry. Statue inquiry. Miss Speaker, is it not true that this legislation was called for by the residents that I represent and that this is distinguishable from the other city proposals that the Distinguished Member referenced earlier because there will be no city property taxes as part of this proposal and therefore is supported by the residents in this affected area. Thank you. I'm sure the gentleman knows what he speaks of. Have all the members voted? All members voted if so, the clerk will lock the machine. On the passage of Senate Bill 333333, the yeas were 101, the nays are 63, the bill haven't received your requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 982? Stay with me members, we have a little more work to do and we'll be out of here. House Bill 982, Mr. Clerk. House Bill 982 by Representative Gamble, the 15th and others to be entitled back to amend chapter 14 of Title 34 of the EFISCO to Georgia and in Tate relating the State Workforce Development Board, so as to require the State Workforce Development Board to develop a proven annually published a high demand career list. Miss Bill, I'm referring to the Committee on Higher Education and Committee recommends that this bill do pass. The Gamble is recognized to present the bill. Thank you, Mr. Speaker. I have before you colleagues, House Bill 982, this is the Governor's legislation on the High Demand Career Initiative. This legislation will empower the State Workforce Investment Board to impart ownership with employers and current labor data and trends to identify, create and maintain a list of high demand careers along with the skills and certifications needed for employment in those areas. This will allow the streamlining of the current lists that are out there so that the careers can be selected easier and changed when they need to be. It will allow for regional input if there's a career in a certain region that is hotter than in another region. It will allow for that and it will take a great program that we've had for some time and make it even better. With that, Mr. Speaker, I'm happy to answer any questions at this time. The gentleman has the further questions. That's a great program. No further questions. I yield the well. The gentleman has yielded the well. Is there an objection to the previous question being ordered? Chair, has none? The previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, has none? The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill, we'll vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine. Have all members voted? All members voted if so. The clerk will unlock the machine. On the passage of House Bill 982, the yeas are 161. The yeas are 161 and the nay is won. The bill having received the requisite constitutional majority is therefore a past. Members we have a couple of further actions to take up and then we will be out of here. I promise. Chair recognizes. Representative Todd Jones for a motion. Thank you, Mr. Speaker. I move to House Substitute to the House Substitution to Senate Bill 26 as amended by the Senate. Mr. Clerk, will you read the caption? Senate Bill 26 by Senator Doble's All of the 27. Begin of the 47th. Good minute of the 8th and walker of the 20th. Be entitled and act to amend the title 50. The Fisher Code of Georgia annotated relating state governments. Those meetings and public hearings and development authorities and community improvement districts to be held by teleconference. Ones. The chair recognizes. You've not explained this yet, have you? The chairman Todd Jones to explain the Senate amendment. Thank you, Mr. Speaker. Colleagues, I will try to be quick. At the end of last year, we voted this 155 to 1. We sent it back to the Senate and they have since made about four deletions and I'll go ahead and go through them with you quickly. It should be on your desk right now. The first is lines 43 through 47, removing the department's ability to contract. Essentially, that clause allowed them to contract with anyone. Visa V, the Electric Vehicle Commission. We took that away. The second thing that I want to mention is that the Georgia Electric Vehicle Manufacturing Commission may not make any recommendations or contractual statements around who can and who cannot be an electric vehicle or any type of automobile dealer. The third is we replaced on line 77, the word automotive and we put the words franchise new motor vehicle that essentially talks about who is going to be part of the commission. The rest of the commission remains the exact same and then finally the fourth on amendments lines 10 through 13, essentially inserting language to again affirm that this commission and this and the department does not have the ability to change the contracting and franchising laws for new car dealers here in the state of Georgia. Mr. Speaker, I'll yield for any questions. You have no questions. Thank you, Mr. Speaker. I yield a well. Thank you, Mr. Chairman. On the gentleman's motion that the House agree to the Senate amendment to the House substitute to SB 26, all those in favor will vote yes. Those opposed will vote no and the clerk will unlock the machines. Have all members voted. All members voted if so, the clerk will lock the machines on the gentleman's motion. That the House agreed to the Senate amendment to House substitute on SB 26. The House of the Gays are 157, the Nays are two and the House has agreed to the Senate amendment to the House substitute to SB 26. For what purposes represent this C-ball rise? To make a motion. Stage your motion. I move that House Bill 451 be moved from the Public Safety and Homeland Security Committee to the Insurance Committee. Both chairs are in agreement. Mr. Clerk, will you read the caption? House Bill 451 by the House of the C-ball, the 34th to be entitled to amend Title 45 of the Fiscal Court of Georgia and it's indicated that the Public Officers and Employees require the provisions of supplemental, illness specific insurance to certain first responders. On the gentleman's motion, the HB 451 be withdrawn from the Public Safety Committee and recommitted to the Insurance Committee is their objection. Here are none of this ordered. For what purpose does Chairman LeHood rise? Councillor that. Councillor that. Members, we have some privileged resolutions. That completes any further actions or the rules calendar. So we'll take up privileged resolutions right now. Mr. Clerk, will you read our privileged resolutions? No group of them looks like to me. Mr. Clerk. Honoring the life and memory of private first class, Hester Gibbons and Massey. Honoring the life and memory of Andrew Drew Parks, Fancher. Honoring the life and memory of James Harold McKinney. Recognizing commending Nancy Harris on our outstanding public services mayor of Duluth, recognizing February 13, 2024 is new Americans day at the State Capitol, recognizing together Georgia, recognizing February 13, 2024 is engineers day at the State Capitol, recognizing February 15, 2024 is lunar new year day at the State Capitol, congratulating commending the Viva dream mile upon its 25th anniversary, recognizing and commending the school social workers association of Georgia for its work, recognizing commending, Philis Kitchens, Thurman, recognizing February 22, 2024 is Alzheimer's Awareness Day in Georgia, recognizing commending Carlton Hodges, commending the Georgia chapter of Natural Association of Black Law Enforcement Executives, recognizing black maternal health statistics, commending small businesses and recognizing March 5, 2024, is women own business day at the State Capitol, recognizing and commending the Georgia Department of Audits and Accounts Depots 100th anniversary, recognizing February 12, 2024 is alpha, alpha sorority in day at the State Capitol, commending the Clayton County Chamber of Commerce in its leadership Clayton Class 2024, and recognizing February 8, 2024 is leadership Clayton Day at the State Capitol, recognizing and commending the Georgia Center for Civic Engagement and Engage Club Programs, which sponsors youth assembly and modern other programs, and congratulating and commending H. Lehman Franklin, and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privileged resolutions that Chair here's known and the resolutions are adopted? Mr. Clerk, would you check the names on that Franklin resolution when you go to Chias and see a Franklin's own there, as far as a signer of that resolution? I think, yeah, he's own there. It's pretty good sign in his own resolution. Congratulations to Riverside Franklin. Just saying. Okay, we're moving on to afternoon orders. One, two, three. You have two minutes. Two minutes for your afternoon order. Except, we'll grant the first two, a little bit of flexibility. Chairman Dickie has recognized for an afternoon order. Members, if you'll rise with me? Thank you, Mr. Speaker. I regret inform the colleagues here that I don't teach tonight. Crawford County, my county where I live, Spinal County and Middle Georgia, last one of that deputies. Deputy Tim Rivers, he was killed in an automobile crash in his patrol vehicle while responding to a call to help another deputy. He was performing on the traffic stop. Deputy Rivers have been in low enforcement for many years with a corporate committee. Chairs department and lease behind two kids, young children and a fiancee. Sheriff Lewis Walker, you know, says his deputy can go through much training and know the risks that go with the job. And very tragic to use tonight. And so just a moment of silence for our Crawford County for this deputy, deputy Tim Rivers and for our Crawford County Sheriff's Department. Thank you, Mr. Speaker. Members, if you remain standing just for a moment, Chairman Green, you're recognized for an afternoon order. Thank you, Mr. Speaker. And my fellow House members, I'm asking you to stand and honor the legacy of the late Hester Gibbons Massey, a native daughter of Randolph County, Georgia, and a citizen of Cuthbert, Georgia. This remarkable lady was a member of the six triple eight battalion in the United States Army. One of the 855 black women soldiers allowed to serve in the Army. During World War II, she received numerous medals and awards that included the WAC service medal, the victory medal, the European African Eastern medal, the good conduct medal, congressional gold medal for being a war hero and a member of the women's Army Corps. A movie on next flick, honoring the six triple eight directed by a Tyler Perry, will be released this month in honor of her and her fellow six triple eight battalion soldiers. Please join me in a moment of silence for us to honor the memory of PFC Hester Gibbons Massey and her contributions to our state and country. Thank you, Mr. Speaker. Thank you, Mr. Chairman and members. Members, you may be seated. Now, we have four after-norders remaining, and I'm going to ask all of you to abide by the two-minute, two-minute guide. Representative Scofio, you were recognized for in the afternoon order. Thank you, Mr. Speaker. Colleagues, did you know that Solomon Calder Fuller was the first black psychiatrist and pioneer of Alzheimer's disease? Dr. Solomon Calder Fuller is widely acknowledged as the first African-American psychiatrist but underrepresented, underappreciated as a pioneer of Alzheimer's disease. He was born in Liberia in 1872, came to the U.S. at age of 17. He excelled in his medical career and became an associate professor of both pathology and neurology at Boston University. He was one of the five research assistants in the Royal Psychiatric Hospital in Germany. And although he translated much of the Alzheimer's work into English, he was really a part of the racial disparities in mental health. But he trained a lot of black psychiatrists to treat black veterans in World War I. So I just want to say that he died at the age of 80, but his contributions are known. And we thank him and recognize him for the work that he did and his contributions to Alzheimer's. Thank you. Thank you, Representative Kimiscofield. Representative Matt Reeves is recognized for an afternoon order. Your time's running. Thank you, Mr. Speaker. I wanted to take the well again today about these tax bills we passed. It's harder and money with hard-working Georgians. They send money to Washington. They send money to Atlanta. Look at the difference in the stewardship here in Georgia and Washington. We are working hard every day to honor hard-working Georgians to lower the tax burden, to keep a good small business climate to support our teachers, our law enforcement, and the folks who work hard every day in Georgia. So thank you for support for these four tax bills today and just let the work go forth back into every one of our communities that we are working hard for our hard-working Georgians to let them keep more of what they are. Thank you, Mr. Speaker. We're, Berchette, is recognized for an afternoon order. Thank you, Representative. Thank you, Mr. Speaker. You already flashed me red there. Mr. to my friend, he just stole some of my funder here, so I'm going to give it to you like this. Today we've continued our effort and I want to reflect on what we've done today as a house and we've led. We passed 8 House Bill 871, which makes sure that the families of disabled veterans continue to receive the tax exemption that their loved ones earn to their service. We passed House Bill 1015, which speeds up the reduction in your income tax rates, and an effort that the house has led on in 2018 and will continue to. We passed House Bill 1021, which increases dependent exemption, an effort to ensure that we keep the money you need to care for your children. We passed House Bill 1019, which increases the state homestead exemption. With the passage of these bills today, a hard-working Georgia family of four will now pay one penny of state income tax on that, will not pay one penny on their first $32,000 of income. That is by partisanship, that is the house leading, that is us putting money back in Georgia's pockets and I applaud each and every one of you today for doing what you did. Thank you, Mr. Speaker. Representative Hal Williams is recognized for an afternoon order. Thank you, Mr. Speaker. First, for any of you, if you haven't had the opportunity to go up in the gallery while we're down here in a look, it's one of the most beautiful shots in the entire state. Go up there sometime and just look down. But why am I here? I'm here for from the place where water tastes like cherry wine, Liberty County, the only place. We have with us today the Student Council from Liberty County under the direction of Mr. Darius Burmwell and Ms. Nakisa Sims and also with them is Maya Patel, who is the Rotary Aratorical Contest winner. She's a freshman who beat out three seniors. Well, you all stand and let us honor you from the great, great county of Liberty. Thank you, Mr. Speaker. Thank you all for being here. Congratulations, safe trips, travels home, water tastes like strawberry wine, cherry wine. I was just making sure you're paying attention. All right, that concludes our afternoon orders. We're ready for some announcements and we'll be out of here. Chairman Hatchett, recognize foreign announcement. Thank you, Mr. Speaker. The full appropriations committee meeting that was at two is now going to be at three. Full appropriations meeting will be at 3 p.m. in room 341. Thank you, Mr. Chairman. Working on a budget, I bet. Chairman Stevens, recognize foreign announcement. Thank you, Mr. Speaker. The subcommittee of Sustainable Economic Development will meet downstairs to 16 on a German lunch will be served. We'll talk about Okie-Fan Okie-Swap. Thank you, Mr. Chairman. Jury Lady Lynn Smith, recognize foreign announcement. Thank you, Mr. Speaker. Members of the House. So my announcement will only last for 15 more minutes in room 230 of the Capitol. There's some food for our legislators sponsored by Jeefe, Georgia Environmental Financial Authority. Great people. Somebody you need to know. The glue that keeps our small candies together financially. Thank you. We're representative of Claims. Recognized for an announcement. Thank you, Mr. Speaker. The Georgia Work and Family Legislative Caucus will still be meeting in room 307 in the CLOB. And there's still lunch over there. So please, and the day's lunch and sponsor is professional associate of Georgia educators. And they'll be talking about educational issues. Thank you, Mr. Speaker. Thank you, Representative Henderson. Recognized for an announcement. Thank you, Mr. Speaker. February is Cancer Prevention Month. Therefore, Monday, February 12th, we're highlighting breast cancer, we're asking women to wear pink, and we're also highlighting prostate cancer. We're asking the men to wear blue. Statistics show that 9800 women will be diagnosed with breast cancer in the month and this year only. One out of eight men will be diagnosed with prostate cancer this year alone. Remember, early detection is key. Early detection saves lives. Remember Monday, February 12th. Thank you, and God bless you. Thank you, Mr. Speaker. Thank you, Representative. Chairman Jasper's. Recognized for an announcement. Thank you, Mr. Speaker. Transportation will meet 15 minutes upon adjournment and 606. Do need to pour them there. Thank you. Chairman Noble Williams has recognized for an announcement. Thank you, Mr. Speaker. Banks and banking, I will meet at 215 in room 406 CLOB. We were meeting at 2, but now it's at 215 room 406 CLOB. Thank you. Chairman Quisser, Chris Erwin has recognized for an announcement. Thank you, Mr. Speaker. Education committee will meet in room 506 CLOB at 1 o'clock. So, education committee meet at 1 o'clock. Thank you. Mr. Chairman, what time are you meeting? Get up there and turn that clock back. You're right. It's 2 o'clock. Thank you for the correction. In 15 minutes, it's at 2 o'clock. Very timely, Mr. Chairman. Chairman Robert Dickie. Oh, there he is. To my left. Is recognized for an announcement. Thank you, Mr. Speaker. The House. I can call some consumer affairs committee. We'll meet in the morning at 8 o'clock, 606 CLOB. Thank you. Representative Anderson. Recognized for an announcement. Thank you, Mr. Speaker. Governmental affairs will meet today at 3 o'clock in room 606 CLOB. Thank you. Members, if you have pages, I invite you to come up front. Before I recognize the majority leader, let me tell you a little bit about tomorrow. We're coming in early for a reason. I'll tell you what that reason is. But I want to thank this House for a really good day. Respectful conversation from all involved here. We always don't agree, but I think we can agree respectfully. And you all did a really good job with that today. Lots of good points were made. Both pros and cons. So thank you all for that. And we've passed a very meaningful legislation that will help the people of this state on a bipartisan basis. So thank you for that. Tomorrow, the trooper that lost his life a few days ago a week ago will be laid to rest at 11 a.m. So we're coming in in case some of you would like to attend the funeral, we'll come in at 9 a.m. in the morning. So you'll have that option if you will. We'll try to get through this. I will work on very rapidly. So any questions with that? Check my check with my office. But at this time, I'll recognize the majority leader for a motion. Thank you, Mr. Speaker. I moved that this House stand adjourned until 9 a.m. on Friday, February 9, 2024. On the motion of the majority leader, that this House stand adjourned until 9 a.m. Friday, February 9, 2024. All those in favor will say aye. Opposed? No. Both are pretty weak, but the eyes have it. Thank you all for your day, and I appreciate your service.",
  "updated_at": "2026-02-13T21:42:04.967493+00:00"
}