{
  "video_id": "ubHM9i23fq0",
  "url": "https://youtu.be/ubHM9i23fq0?t=1252",
  "title": "Georgia House - Day 18 (2026-02-17)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 18,
  "video_date": "2026-02-17",
  "duration_minutes": 152,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-02-17:\n\n# Georgia House Session - Day 18 (2026-02-17)\n\n## Overview\nThis session featured the passage of several bills, including SB 387 and SB 386 related to redistricting for the Maryweather County Board of Education and County Commission. There was also discussion around SB 457 regarding the consolidation of Richmond County and the city of Augusta.\n\n## Key Actions\n**SB 387**: Bill to reconstitute the Maryweather County Board of Education districts, passed 142-5.\n**SB 386**: Bill to amend the act creating the Maryweather County Board of Commissioners, passed 142-7.\n**SB 457**: Bill to amend the act providing for the consolidation of Richmond County and the city of Augusta, under committee consideration.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Lengthy discussion around SB 457 and the need to avoid court-drawn districts that do not consider communities of interest.\n- Bipartisan group of Senators requested the drawing of new maps for Richmond County/Augusta consolidation.\n\n## Votes\n- **SB 387**: Passed 142-5\n- **SB 386**: Passed 142-7\n\n## Attendance\nA quorum was present.\n\n## Adjournment\nThe session adjourned. The next session will be held on a future date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you the clerk will read the of Targaryen. Honoring the life and memory of Louis Chance Jr. Honoring the life and memory of Tyler Germain Wins. Honoring the life and memory of David Jones. Congratulations John A. Jack and Kathleen M. Kathy Molnar upon the grand occasion of their 50th wedding anniversary, recognizing Raven County as the wooden boat capital of Georgia. Honoring Regina Hulett Norman, Liberty Point Elementary School's 2021-2022 Teacher Lear, recognizing and commending M.T.O. and for other purposes. Recognizing commending Michael E. Holton Jr., recognizing and commending Eric Robinson, commending Astro Turf in recognizing Mars 21st, 2022 as Astro Turf Day, commending the restaurant industry of Georgia and recognizing February 23rd, 2022 as State Restaurant Day, at the State Capitol, commending Riley Kay Carlisle Appalachie High School's 2022 Star Student, commending Stephanie Ackinson Appalachian High School's 2022 Star Teacher, commending Anzaly Carroll, Bethlehem Christian Academies 2022 Star Student, commending Ella Ramzell, Winder Barrow High School's 2022 Star Student, commending Michelle Harris Winder Barrow High School's 2022 Star Teacher, commending Emory Guck, Bethlehem Christian Academies 2022 Star Teacher, and commending the Georgia State University's men's soccer team on its outstanding performance and appearance in the NCAA tournament. And for other purposes, that completes the reading of the privilege resolution. Is there any objection to adopting the privilege resolutions? The chair here is none and the resolutions are adopted. We are now going back to or going on to the rules calendar, going on to the rules calendar, clerk will read the caption to Senate Bill 387. Senate Bill 387 to be entitled an act to amend an act to reconstitute the mayor where the County Board of Education is bill ever for the Committee on Government and Affairs. I committee recommends that this bill do pass. Chair recognizes representative Buckner to present the bill. Thank you, Mr. Speaker. The maps that are contained in this bill for 387 or for the Maryweather County Board of Education. They were drawn by the reapportionment election, reapportion redistricting office as minimal change maps. And they reapportioned the population in accordance with the election laws and rules. And they also used the opportunity to repair some split precincts. The maps were discussed in public meetings, voted on in public meetings in December. And the school board voted unanimously for these maps. The bill was introduced in the Senate by Senator Andy Robertson who represents all of Maryweather County. And it passes Senate with no dissenting votes. I urge your favorable consideration of Senate Bill 387 for the Maryweather County school board. Mr. Speaker, I yield the well. Representative Hutchinson, you have a question. Okay. And you had no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? All right. I think you got it fixed. All members now voted. If so, the clerk will lock the machine. On the passage of Senate Bill 387, the eyes are 142. The nays are five. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 386. Senate Bill 386, Senator Robertson, 29 to be entitled. To amend the act, creating a board of commissioners and Mary Weather County. This bill I'm referred to the committee on governmental fairs. That committee recommends that this bill do pass. Chair recognizes Representative Butler to present the bill. Thank you, Mr. Speaker. These maps are exactly like the maps you just voted on, except that they are for the County Commission. They followed the exact same process and they were also introduced in the Senate by Senator Robertson and passed the Senate with no descending votes. And I urge your favorable consideration. Thank you. You have no questions. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? We'll vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 386. The eyes are 142. The nays are seven. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 457. Senate Bill 457 by Senator Burns, the 23rd and Anderson the 24th, being titled an act to amend an act, provide for the consolidation of Richmond County and the city of Augusta. This bill emits for the committee on Governor LaFaire's, that committee recommends that this bill do pass. I'll remind the members that the rules committee has limited debate to a total of one hour. The time to be allocated at the discretion of the Chair. And Chair is going to allocate it equally. Equally. You all hear me? Okay, that means the same on one side is on the other. That does not include the presentation by the author. And in 20 minutes to the minority report in the Chairman's time. Chair recognizes Chairman Newton to present the bill. Thank you, Mr. Speaker. Thank you, colleagues. Like many of you, I wasn't here 20 years ago when I can tell you there were some maps that had to be thrown out by a court. I wasn't here like most of us, 10 years ago, when my local district had maps that could not be agreed on. And because of that, because no map was sent from the legislature, a judge in a hurried fashion, a single-handedly had...\n\ndraw a map for our area that did not take communities of interest into consideration, that split neighborhoods, that split precincts, but it was a federal judge that had to do that. That's the reason I'm here today for Senate Bill 457, is I don't want us to do that again. We have ended up in a situation. We did receive two maps on the ad hoc committee I was part of, as well as our discussions with the Board of Commissioners, two maps that were drawn by the nonpartisan reapportionment office here. In September we received an initial draft, that initial draft was drawn by a newly hired junior staffer. It simply took the new numbers in Augusta and we only went up about three or four percent in population from 2010 to 2020 and basically divided it by our 10 districts and basically moved lines around just to give a starting point for the ad hoc committee to look at. The ad hoc committee looked at it, they looked at different ways to draw things. They decided just to pass the initial draft map that split numbers up evenly directly to the commission who also, they canceled several meetings and passed it on to the commission. The problem with it, it did split once again, different neighborhoods this time but it did split neighborhoods, it split communities of interest, it actually split 13 precincts, some of which it was splitting into three different districts. A lot of community output or outpouring of concern was raised just like you, you, I know represents your district strongly, I and Senator Burns and Senator Anderson, as well as Senator Jones, a bipartisan group of senators requested an additional map from the reapportionment office. Once again, it's a nonpartisan office came up with a map that took into consideration communities of interest, took into consideration neighborhoods, historic lines and it reduced from 13 to two precincts that were split. We thought that would be a very favorable map, unfortunately, it was declined by the commission and the ad hoc committee to even officially receive it for consideration. So unfortunately, we don't want to leave this the same way it was where a federal judge had to hurriedly draw a map and we're in more of a hurry this time than we were 10 years ago. So this new map does correct those items. We've gone over it carefully and it fully complies with the Constitution of the United States, the Constitution of Georgia, fully complies with the Voting Rights Act. I know race has to be a consideration in making sure that a new map that's drawn, no matter who draws it, is taken into consideration in the 2020 census in my diverse community, it's 57.7 percent black. This map continues as it is today, six out of our 10 districts are majority African-American, six out of 10 of our commissioners are African-American that represent them. This map, just like the alternative draft, like the map we're using today, this map that I'm proposing from our Senate colleagues does the exact same thing. It continues that 60 percent of the vote vote on the commission and is really considered very fair. I think due to that, I think we all should be in agreement that this is a fair map. I don't think anybody thinks that if you have 57 percent, you should go to five out of 10 and nobody thinks you should go to seven out of 10 in a general, just the quick way of looking at it. I know there's more that want to speak on this. I do want to make sure that we know this map did address multiple challenges. The school board map you'll hear about in a moment is the same. We were careful about incumbents. There is one school board incumbent that filed paperwork in August to run for the commission and his seat his address because he was not running for re-election in his term ends at the end of 2022 because of that. They were able to move lines around and protect some neighborhoods in his area without consideration of his address. I hope that you'll look over this. You'll realize that this is a fair map. This is not a way to do anything different. I know there's questions about process. I know we didn't have an uncontested local map on the house side or on the Senate side. We don't want to get our district drawn again by federal judge. I hope you'll support SB 457. Thank you. I'll yield the will. I know there's others that would like to speak, sir. You have no questions? We do have others that wish to be heard and they will have a collective total of 30 minutes and the chair recognizes representative Frazier to speak to the bill. Thank you, Mr. Speaker. I rise today first to thank the Augusta Richmond County at Hawk Committee for the maps that they voted created and voted on last year into our citizens and our county because HBE 1120 and HBE 1121 Board of Education and Augusta Commission maps have been hijacked. I also rise today to say that I am absolutely outraged of what has been occurring in this body this year as it relates to disregard for home rule and fairness in the redistricting process. With a new surgical precision, my own Republican colleagues in my delegation has hijacked Augusta Richmond County maps. And I am outraged that we could not come together to make an agreement that all of us would have been satisfied with. But my Republican colleagues have targeted black led and majority black counties to impose their will on by creating these maps that the city of Augusta Richmond County at Hawk Committee did not ask for. So despite what my colleagues will say about communities of interest, split precincts, it is clear by their actions while they are doing this. In 2012, our maps were re-grown by a federal judge. I actually live in a split county and been living there for, it's been split for 10 years. So when I drive out of my driveway, I'm in district four. So as I get to the end of the driveway to the mailbox across the street is lend to my neighbor, she's in district 10. So we have learned a little with split precincts. And it's nothing new to us because we knew at the time that Augusta Richmond County was changing. And so the white majority population was decreasing. So according to the 2010 census, we had to draw the maps according to the numbers we needed to have, respectively, in each district. So my colleague just said that there's a time crunch. And we have to get these maps passed quickly. Or there will be a chaos. But this is manufactured chaos by the Republican colleagues that created this situation. When they decided to ignore local control and when they did it to us, what they've done to other diverse counties is not just our Augusta Richmond County maps, Cobb County, Gweneer County, Athens, Clark other counties made it painfully clear that the only thing they are concerned with is keeping the power at all cost. This power graph is at the expense of the voices and the people that voted for every one of us and especially our black voters. Augusta Richmond County is currently 61.7% blacks, 34% white and 5% Hispanic. Do the math. African Americans have the majority. Senate bill 457 is a map motivated by fear. The Republicans losing their power and rapidly diversifying counties and communities. This fear of diversity is evident not only in this map itself but also in the evident of the process that got us to this point. The fear of motivating this map itself is evident as well. The white population in Augusta Richmond County has decreased over the last 10 years and black population has increased. So what Republicans have done is packed and cracked black voters in the district four. That's my district, district five, district six, all just to appease the need for power. But this map is about more than just a Republican power graph is also about appeasing a small portion of residents who are afraid of the growing diversity of this county. Republicans have violated federal laws to make a majority black district majority white. Why would they do this? Well, besides the obvious reasons of wanting to maintain control, they're trying to protect a small number of white residents preferably in district eight from having a black commissioner. That's what this is all about. Home rule, delegation rules, house rule, regular order, all of this has been violated for the sole purpose to appease just a fearful residence of change. But I'm here to tell you, black elected leadership and black people governing is not something to be afraid of, folks. And the fear of black elected leadership is certainly not a valid reason. So I am asking everyone in this chamber, all of my colleagues here, including the author of this bill, to do what is right for the constituents of Augusta Richmond County, let them decide on how their maps should look because the citizens of Augusta Richmond County deserve better. They deserve transparency, honesty and fairness in this process. I implore all of you here today to vote no on House Bill 457 because it is not fair. Thank you, Mr. Speaker, I yield a well. Chair recognizes representative Prince to speak to the bill. Thank you, Mr. Speaker. Colleagues, I rise in a proposition to Senate Bill 457. Senate Bill 457 is a clear example of subverting the democratic process, ignoring the presidents in this House of Home or Local Rule, solishing the voices of Georgians and a blatant disregard for the authority of local leaders in Augusta Richmond County. I want to speak briefly to the role of local leadership. Many of you have served as county, city, commissioners, school board trustees, and some may be mayors of cities. So you know that our local leaders serve a very important role in the democratic process. I submit to you that they are our first line of defense. They are the ones that are in the trenches. They are the ones that catch the heat when the trash isn't picked up. They are the ones who are called to fix potholes when your parks aren't clean and when your ambulance services are not up to park. And just like you and I, they are elected. They have run campaigns, knocked on doors, all for the privilege to serve the communities in which they live. As politicians, we all know about the down ballot drop off theory. The fact that people are less likely to vote for positions further down the ballots. So when someone votes for their county commissioner or their school board member, they don't do it just because it's at the top of the ballot or because they saw some large billboard sign or some fancy TV advertisement, they vote for them because they know them. They trust them. They see them at church in the grocery stores. They are children, they are grandchildren. Go to school together. They serve on community boards together. They know that they can talk to them frequently at county commission meetings or school board meetings. Our local leaders are the voices of our community and know and represent them in a special and a unique way. The maps contained in Senate Bill 457 were drafted behind closed doors. They were composed without input from the local leaders and more importantly without inputs from the citizens, it directly impacts the citizens of Augusta Richmond County. These maps were drawn in a vacuum completely out of the adopted local redistricting process by state legislator who represents less than 1% of those affected. But more importantly, they were drawn without the consent of those in power by the people to execute these maps, the commissioners of the Augusta Richmond County. We are all elected to serve in this state and we have all taken an oath to uphold our democracy. But what we have here before us today is an anti-democratic power grab and we cannot allow this to continue. Colleagues, I urge you to join me and both know on Senate Bill 457. Thank you, Mr. Speaker, and I yield the well. Chair recognizes Representative Howard to speak to the bill. Representative, you've got 18 and a half minutes left. Thank you, Mr. Speaker. Thank you, Mr. Speaker. And to my colleagues here in the House, you've heard some compelling testimony here, I believe. That really gets right to the truth of what's happening here in our chamber. And it's unfortunate that we have to meet in this type of environment to defend what we feel is right and everyone has right to defend their positions. So that's what we do. But I come to, like my other two colleagues, I come to oppose House Senate Bill 457. And I'll give you a couple of reasons why. One of the arguments is that we've heard throughout our debate over this that the maps were drawn by a junior staffer. And I don't know whether where a junior staffer came from. But I think everyone in this room know that if the director over at real pushement, who we have a lot of respect and a lot of, we honor her for the work that she's done, the experience that she has. Do we do anyone in this room believe that she would hire a junior, a person and get them to draw a map for your county as if an intern drew your map? It never, it won't happen. It never will happen. You know, we have, and we know her to be an honorable person. And that she would not allow that to happen. So I wish we would dispel the myth of using the term junior staffer as if an intern drew our map. This was a person that had to have some type of experience to know to be assigned the task of drawing a map. So that's one of the areas that I think we needed to hear. Next, I think we, I've heard the conversation about the senator from the 23rd, the senator from the 22nd, and myself drew a map. That's so far from the truth. If I can draw a map on the phone because I was invited to a conference call and I was on the conference call and Ms. Wright was in the room and we expressed to her that the, how the ad hoc committee was running into some problems with some of the communities. And we were trying to do what was right and try to make things smooth over. And now just because we were trying to do what was right and smooth things over, we are being accused of drawing a map. We never drew a map. I don't even know where to start. So I wanted to clear that up. That's not, that's far from the truth. There was no drawing of any maps by myself, senator from the 22nd, or even the senator from the 23rd. At that time, now I can't, I can't say what happened later on when we were out of the picture. But to clear that up, I just want to be sure that everyone knew that. There's another piece of this where we had, we adopted as a community, as an ad hoc committee, or a study committee, however you want to describe it, that we went out, we went out, had six meetings, four of them were across the city where we had hearings where the communities came in and forced their concerns. And with that, we came up, that's how we ended up with the, the one map that we finalized. This started back in July, the meeting of the ad hoc committee started back in July. We culminated in December. So there was no rush to judgment, a rush to do anything, everything was done above board, transparently, where the community could see what was going on. Members of the location could see, even though they were some were not on the committee. And likewise with the commissioners, they, some of those, we only had four members of the house, four members of the county commission, four members of the board of education that made up a 12 member ad hoc committee. And who best to go out and do that, do the hearings and the study committee. And at every one of the hearings that we had, the attorney for the board of education was there, the attorney for the city was there. So everything was recorded, everything was put online, where even if you were not able to make it, you could look online the next day and see what happened at the meeting. There were documents to show what any documents that were presented. So the, this was the most transparent and up front way to operate that we, that I, I've ever seen. Lynn Bailey, who's the director of the board of elections, she coordinated everything that we did at each meeting. And it was done, like I said, transparently. But let's go back to the guiding principles piece. Guiding principles, we wanted to make sure we didn't have split districts or split communities and minimize that. But there was one other piece that just came up in the last couple of days. And my colleague mentioned that earlier. We drew lands, we were, we were supposed to protect incumbents. Y'all have heard that, I'm sure. That's one of the guiding principles that we use in a lot of our, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, well. That was not done. We have a member of the, whether he's, whether he's going to run again or not. He's sitting now and he has two years left on his turn. And he was drawn out of his, his district. So that's not, a, a guiding by guiding principles. Because we adopted those principles and said we wouldn't protect all incumbents. And that was not done. So there's a lot that has gone wrong with this process. And I would hope that there, I don't want to see your judge, uh, read draw the lands myself. But we're pushing ourselves into that corner. So what do you do? I think I'm a compromiseable person, but nothing has been presented. And, and I make one other point. And, and, and this is the problem of the key point of the whole, my whole, uh, the district that we are talking about is called district three of the commission and board of education. All right. The current makeup of that district is 43% white and 44% black. The new, with the new map that we are voting on today, yes, before 37. The makeup would be 46% white and 42% black. So you are flipping a minority, majority district and making it a majority, minority district. And I don't think that's going to fly with the voting rights act. Maybe I'm wrong. That's my personal opinion. You know, some legal man's in here who can answer that better than I can. But that, that within itself tells you what's going on in this whole situation. You know, somebody is trying to protect one area in order for things to move in the direction that they would like to see it go. And, and I'm going to read these numbers back and I'm done. 43% white currently, 44% black. The map that we are voting on today would make would flip it and make the white population. This is voter, voter are the vat. 46% white to 42% black. You know, and the thing about it is that district elected a white is predominantly black now, but they elected a white commissioner. So it's a diverse area that will elect a white just like in other districts where you elect blacks. But let's try to do what's right and oppose this building, sending back to, because there's another bill out there that was adopted by the commissioners and the Board of Elections and the ad hoc committee. And that bill is sitting in government affairs right now. If we can allow that bill to come forward, that would be considered a local bill and we can, I think everyone could live with that, with that bill, with that map. So with that being said, Mr. Speaker, I'll yield the will and thank you. That is all of the speakers that wanted to speak. Is there any objection to the previous\n\nThe question being ordered, the chair here is none the previous question is ordered. There is a minority report which I understand is being waived. That brings us down to the chairman's time. Chair recognizes Chairman Darling Taylor, the chair of the Government Affairs Committee. Thank you, Mr. Speaker. I can report to the House that this bill was fully vetted and presented in past in the committee. And I will yield the remainder of my time to Chairman Noom. Chair recognizes Chairman Newton for the balance of the chair's time. Thank you, Mr. Speaker. And thank you, colleagues. I'll be brief. Just correct a couple of things. Just a doctor, I know people like to look at sources and footnotes. Census.gov is where for 2020 is where I got the 57.7. That is the census we're using for this. One other thing that was mentioned and some of the rebuttal was that an individual had an incumbent had two years left on a term. That's not true from the Board of Education website. The term ends 1231-22. And in addition to that, in an abundance of caution, even if that person wanted to run again, they had already filed back in August 16th a declaration for campaign contributions to run for a different local office. That's the Board of Commissioners that he now wants to run for. So I did want to just clear those two things up. We were not running over in competency. We do know the importance of that to everyone. The other alternative map that was the original draft that was passed by the commission, as was the ad hoc committee, unchanged from the initial draft. It could not pass the Senate. We were going to end up in a position to where we were not going to have a map. We were going to do what happened 10 years ago and leave it to a federal judge. Regarding outreach, there was multiple efforts of outreach by the majority of senators in our delegation to both the ad hoc committee requested to have the previously scheduled meetings to want to keep the schedules into December. That was rebuffed. There was other requests to work together with the commission. I know in January 6th there was a phone call asking the mayor and the pro-tem to work with us to ask the delegation. In another meeting on January 26th, where we met actually with the director of the reapportionment office who told all of us directly that that map never should have gone out, that initial draft, because it was not vetted by senior staff nor the director. But in the hustle and bustle of the congressional and other maps it did. I enjoy and am honored to work in a community that is incredibly diverse. It is a black majority district. I work wonderfully well working together. As some have mentioned in here before, potholes, traffic jams, traffic accidents, trash pickup, nobody cares if it's a Republican or a Democrat doing that. We work together. We're working together on a way to build a new policy in our downtown area. We work together. We have a wonderful community. This map that I'm proposing on behalf of the Senate preserves that black majority on the council. It preserves it on the Board of Education and the following bill. The maps are just, the maps are fair. I really look forward to working together on this and continuing to work together for a wonderful community. I hope you'll support SB 457. Thank you, Mr. President. Okay, that completes the debate. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of Senate bill 457, the eyes are 97. The nays are 63. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate bill 458. Senate bill 458 by Senator Burns, the 23rd and Anderson, the 24th being the title of an municipal mend and act regulating public instruction for the county of Richmond approved August 20, 30, 1872. This bill ever referred to the committee on Governor Affairs. That committee recommends that this bill do pass. Chair recognizes Chairman Newton to present the bill. Thank you, Mr. Speaker. To keep this simple and straightforward, the lines are identical in the two maps. And the number of districts, there's eight districts plus the two super districts. So there's the same ten districts. I hope you'll support this map as well. Thank you very much. Mr. Speaker, I'll yield the well. You had a question, but the gentleman has yielded the well. We do have speakers on this and the same rule will be followed as to time. Chair recognizes Representative Stacy Evans to speak to the bill. Good afternoon, colleagues. I rise in opposition to Senate bill 458. Not only to support my colleagues in Augusta Richmond County, not just then, but also the voters of Augusta Richmond County to respect them, to value them, to treat them like you would all want your voters to be treated in your home community. Maybe think of it how you would want your mother to be treated if she were going to be voting. Now, I've been around long enough to know that there are always going to be political maneuvers. That there are games that's not new. I've been in plenty of rooms where I've heard Democrats that have been here a long time or used to be here talk about the war stories and the good old days when they were in charge and some of the things they did back and forth to political jockeying and the maneuvering. I know it's not limited to one side or the other. But it is one thing to maneuver around in politics and game when we're talking about general legislation that all of us are going to vote on because it affects all of our state. It's yet another thing to play in local legislation. And that's what I've been told ever since I came here. My first time around the sun and now back for my second time around the sun, we have different rules when it comes to local legislation. We respect home rule. Now, I don't know about you, but when I have a problem on a customer service issue and I call and I ask and that's our policy. Those are our procedures. That is the most frustrating answer that anybody can give me as to why we're doing something. So just to say we've always done it this way or we've always respected home rule, that's really not enough. So as we've been going through this session, I've been really trying to sit back and pull myself out and think why? Why do we have this policy that we have for years and decades, perhaps from the beginning of time? Why have we always thought differently about home rule? Why have we tried to hold that more sacred? Because it's not just enough to say that's what we've always done or that's our policy. And I finally understand what it is. Because when we vote on legislation that affects the whole state, the voters can look at the one they elected and say, I either like what you did or I don't like what you did. And then I have a voice at the poll. I can go and I can say I like what you did, I'm going to vote for you. I can say I don't like what you did and I'm voting against you. But when your local delegation comes down here and they try to implement the will of the local people. And everyone else down here takes over that legislation and they say what they want. There is absolutely nothing that those voters can do. So this is not just about political maneuvering or gamesmanship because we're in the minority or you're in the majority and I'm going to get you this colleague. I'm going to get you that colleague. You are getting the voters. The voters of this state deserve one person, one vote, one man, one vote. They deserve it to mean something. So if they're mad, if a Gussar Richmond County voters are mad about this vote, there is nothing they can do. Because if they vote out their elected officials from a Gussar Richmond County, so what? They didn't want this either. That's why it's different. It's not just that's our policy. That's why we that's what we've always done. That's why because historically this body has respected the voter and it really hurts my heart that we're doing this. And you know, I listen again, I've been around long enough to know that Democrats have done some bad things to y'all Republicans. I know. I understand. I know the games that were played with global redistricting. So don't you know, I know I get it. But I've really tried to talk and do my homework and go through the history and find out about how did Democrats treat local Republican delegations when it came to local legislation with Democrats weren't charging? It was different. It really was. And then I step back and I think, well, what if it wasn't? What if what if I'm getting all the wrong stories, right? History is in the eye of the beholder. What if I'm getting the wrong information? Well, when does it stop? When does it stop? It's because everybody's doing it. I'm pretty sure all of our moms and dads and grandparents told us just because somebody else is doing it. It doesn't mean you should do it if they jump off a bridge or you're going to jump off a bridge. And then I also think back more fundamentally to this, just because you can, doesn't mean you should. Wisdom, justice, moderation, moderation, just because you can, doesn't mean you should. So again, I'm not naive. I know that this vote is predetermined. I'd like to think that when I stand up in court to make an argument, I have a chance to have an impact on the outcome. It's a little bit different here, I think. But I rise not just because I think I needed to say something because I've been sitting back trying to figure out why this was so upsetting to me and I think I've explained that. But it has to end somewhere. And I hope that I'm here long enough to know what it's like to be in the majority. I think it would be kind of fun. Might be a little more productive. I hope I get to see it. But I know that for this to change, what we're doing today, I think. I think abandoning home rule. What it's going to take for the redistricting process overall to change so it's not such a political process and the party in charge just does what they want to do. The only way that's ever going to change is if the party in power lays down the sword. And that's hard to do. I think there's probably some members of my party that think when we get back in charge, I'm going to show you. I'm not going to lay down the sword. I want it to be known. I want it to be on the record. I'm holding myself accountable today. God willing, the Democrats make it to the majority and I'm fortunate enough to still be here that the voters see fit to send me here and I have anything to say about how this place will run under a Democratic majority. I will lay down the sword. I will respect home rule. If I'm not in leadership in some way and leadership wants to go a different way, I'm going to be opposite them on that board. Let it be known here today. I am laying down the sword. When it comes to overall redistricting, if I get a chance to have any say in that from a majority standpoint, I will lay down the sword because it's time for us to respect the voters enough to make their vote count. And we are ruining that today and we continue to do it every day and it's just not right. Thank you and I yield the well. Chair recognizes representative Howard to speak to the bill. Thank you, Mr. Speaker. I don't need my desk because I'll be brief. My dad spent 18 years here prior to my serving and I spent 16 and I didn't spend much time with him when he was here but I would see him come home and some days he was some weeks he would come home with a little frustration, you know, you can tell it. He always taught us, you let it roll off your back. You don't carry it. So following the lead of my colleague that just spoke, I don't know how much longer I'm going to be here. But he gives me the strength. I may catch up with Smiry. At least I'll follow him. I won't catch up with him but I'll follow him. I may have to live to be 100 years old. But following the lead of what was just said and this may send me home before I want to go home but I'm going to say it. I'm willing to lay down the soil too. It's got to start somewhere. I don't know whether any of my Republican colleagues in this room are willing to do that but somewhere is got an end where you can vote what you believe is right and not what I won't I don't know how to say that but so with that being said, I think our time is up. This bill that we are voting on now 450, Senate bill 458, it's the Board of Education that parallels the commissioners' districts in Augusta and I would ask you, umbly, to vote no on this bill. Thank you. Marlene Taylor for the chairman's time, 20 minutes. Thank you, Mr. Speaker. Again, this bill was fully vetted in committee. It was voted out and passed and I will yield the rest of my time to the author of the bill. It recognizes Chairman Newton for the balance of the chair's time. Thank you, Mr. Speaker and thank you, Chairman Taylor. I appreciate the integrity that all are bringing to this. I can assure you just like all of us vigorously represent our voters at whatever our role or whatever our level in a map drawing process is, which I believe the Supreme Court has said, is a political activity. We all use the tools that we have to represent our districts. I appreciate you letting me have the opportunity to represent my district to work together with people of honor and I hope you'll support SB 457. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none the report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Prince rise? Hall of Mary and Court. The State are inquiry. The speakers are not true that the maps in Senate Bill 458 were not viewed by the members of the trustees of the Richmond County Board of Education. I have no knowledge on where the other representative. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 458. The eyes are 97. The nays are 63. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 437. Senate Bill 437, Senator Alvers, 56, beats the 21st of Patrick, 32nd, brass, 28th. To be entitled to amend the act, creating board of commissioners of the full county. This bill having referred to the committee of government affairs. The committee recommends that this bill do pass by committee substitute. Chair recognizes representative Maynard to present the bill. Thank you, Mr. Speaker. Let me just start off by first saying clear up a little confusion about SB437. The title in the bill talks about making Fulton County board of commissioners nonpartisan that is not what this bill is about. It was substituted with language that says this is about the Fulton County board of commissioners map. Let's just start with that. There also is a lot of other confusion because there were so many maps out there. There was three different bills. There is one bill right now that is SB437. I want to thank my colleague representative Stacy Evans for her comments on just laying down the sword because that is really what I have tried to do this entire time that I've been here. I don't necessarily always vote with my party because I vote policy over party. And guided by the Lord, I vote appropriately for my community. Over the past week, nearly 100 Fulton County residents took off a work to come down to the capital and show support for a fair map that doesn't disenfranchise them. Fulton County commissioners have said in one of the hearings that they had three people to come to the county in support of their preliminary map that did disenfranchise people that did disenfranchise people. The map before you was drawn in collaboration with Senator Albers and it was favorably passed out of the committee. It was a mutual understanding of the severity of Fulton County not having a map and holding elections on 2010 census data that brought us together. There was no collusion, there was no premeditated collaboration, just two independent separate legislators that were proactive and took initiative to make sure Fulton County had a map. There is some misunderstanding in this process and it sounds funny that I would even be saying that there is misunderstanding because how would I know how the redistricting process is? I read the book and I asked experts about the redistricting process. I did not just come up with these rules on my own. The lack of understanding and maybe denial to say face is why some commissioners and some members of the delegation continue to tell people that Fulton County has a map that they submitted a map. That is confusing the community myself and probably everyone else in this room because Fulton County doesn't have a map. In testimony one commissioner declared we turned our map in on the 21st. That is correct but that was a preliminary map that they voted on three days earlier on January 19th. So Fulton County they did complete the first half of the redistricting process. They did not complete the second half of this redistricting process. External affairs in a, I'm quoting from an article in CW69 news, external affairs confirmed that the process ended with them on February 1st. February 1st is the date that the State Reapportionment Office sent back the map to them. To date the commissioners voted and sent the state only one map, a preliminary map. The map Fulton County did send over on January 21st did not meet the state's minimum standards. It was initially sent in the wrong format. They had to send it back to them and say, hey, we need it in the right format. They sent it back on the 21st. There were also 29 technical errors. It was a 6% deviation. There were wrong addresses for two commissioners, numerous splits in the precincts and communities that were so broken and disenfranchised that up to three commissioners were representing one single precinct and that happened in multiple parts of the community, which happened to be the poorest part of the community or the poorest part of Atlanta, which is the community that I represent in zip code 30314. This is the community I was born in. This is the community I was raised in. This is the community that sent me here to speak up for them, regardless of the backlash that I receive, I am here for their voices. On February 6th, Fulton County and the delegation were still drawing the maps. This was one day before Chairman Tancersley said the deadline is the 7th. The reapportionment office confirmed in testimony that Fulton County never sent a final map that they approved. The county chairman testified that he took the maps off of the February 2nd agenda to vote on a final map. He also said he has no idea who drew the maps. And for these reasons, and to prevent Fulton County from potentially violating federal law, the one person when vote statute is why I'm even standing here before you. I'm asking this esteemed body to vote in favor of SB 437, it is by substitute. Senator Albers and I both realize that a map needed to be done. He said I'll draw the north half, I said I'll draw the southern half. And I want to thank Chairman of the Fulton County delegation because he actually asked me to draw the southern portion of the map. This was not done without telling the Fulton delegation chair, I even told them I know already leader, I am drawing a map because Fulton County does not have a map. There was no collusion, no premeditated collaboration, I just want to say that again. I'm like, I'm really disappointed that some of my colleagues have been on the internet, on the radio, different forms of media smearing my character, but my community knows why I'm here and why I'm doing this. On February 7th, the Fulton delegation dropped a bill to make the Fulton County commissioners nonpartisan, it wasn't until February 8th that I even brought that to their attention, they had no idea that they actually did not even drop a map. Today, please vote on SB 437. And I'll take two questions at hand. You have no questions. Perfect, thank you. I yield the will. We have other members that wish to be heard on the issue. Those in opposition will have a total of 30 minutes. Those in favor will have a total of 30 minutes. The chair recognizes representative McLaren to speak to the bill. Thank you, Mr. Speaker. I rise today in opposition to the bill. I don't want to go into a whole lot related to the speech you just heard except to say that when the offensive unit goes out on the field, they typically don't run so many defensive plays. I think we all know why we are here. We have already had this debate several times. I heard comments today from colleagues ranging all kinds of topics. I represent Fulton County. The only reason I'm up here today is...\n\nbecause in good conscience in a chamber where debate on policy must occur, there must be opposition where true opposition exists. Otherwise, I would sit down because I think when you feed the kind of energy that is behind this bill, you disgrace the chamber. I believe that by putting this bill on the floor, house leadership has disgraced the chamber. I'm going to have to throw everybody a karaoke party after this session is over because I'm doing too much of this from the well this time. But I'll get right to it. Representative Evans said a lot that I agree with and I think I'll try to riff a little bit off what she said. But I'll go the other way. She said she'd like to be in power because it might be fun, like a little bit fun. I don't think being in power is that fun. That's easy for me to say, but I see all spaces when you run committee hearings, right? It's a burden and I mean that's seriously. It's a burden to be in power because you have to balance a lot, right? You have to take into account a lot of stakeholders. You have to do what you feel is right. You're responsible. I get that and it's so easy for us to kick and scream and yell when we're not in power because frankly we don't have the same burden of responsibility. That's how I try to live in this chamber. That's the try to respect that try to show is because I know that I'm not riding the budget. So when I vote no, I'm saying to the budget office, I'm saying to the committee, it's worked so hard that I'm not looking at their work essentially. I know that that's got to feel bad. But I have a theory of power. I just a super, you know, wonky thing to say, but I have a theory of power. I'd like to share with you today that I think instructs why we feel the way we do. Because we're exhausted. This is exhausting. Other members of characterize what this feels like. The theory is that when you use power as a means to an end, that's something bigger than yourself, something outside yourself, that you can find fulfillment in power. That it's worth something. It's worth the effort because there's something you want to do. But when you use power as a means to an end only into itself, there's an emptiness to it. There's an ego to it. There's a graspiness to it that serves only itself. And I contend today that that feels bad and that that's why this chamber feels the way it does during these debates. Because at the end of the day, we can talk about numbers and percentages and redistricting and fairness and populations and voting and there's a lot of high-minded ideals. But we all know how we feel. That's the most immediate experience we're having. So to put a fire point on it, I think that most members in here, to the extent you don't actually, I'm not talking to the ones who really believe that Cobb, Goenette, and Richmond Augusta were the only maps in the state that needed the careful guiding hand of this chamber to fix them. I'm not talking to the people who are true believers who really think that. I'm talking to the people who are putting their heads down and saying, we're going to vote with our team. The politics is a game that you guys would have done the same thing to us, or that frankly, maybe it just doesn't even matter. I think that there are a number of people in this chamber who think that this is just doesn't matter. Because there is, oh, it's one commission seat here, it's one commission seat there, why you guys getting so worked up. But that view is acidic. That view destroys norms. To think it just doesn't matter, we'll just vote with the team is why this country is so torn apart right now. And whether I can guarantee you, as colleagues have today, that we will behave better if we're in the majority, putting that question to the side and just building on the idea that this feels bad, I just don't want to feel so bad and I don't want voters to feel like this is all we do. I've had that conversation a number of times the last few days. Voters sometimes feel like this is all we do. And I guess I thought that by coming up here, some of my colleagues have been showing you a little bit of that feeling and sharing it and saying I can admit to this outloud that I just don't like how this feels and I don't think you do either and I wish that there was something we could do about that that maybe we will not feel the need to disrupt norms just because we can, just to do it. I have given leadership in this chamber repeated credit for having a study hand and we've heard that phrase today, study hand. And I think in many cases on a relative basis, relative to what it could look like, that has been true of this chamber and it has been something I've appreciated in my house experience since the day I got here in early 2019. But debating this bill on the floor the way we are, exploiting the internal caucus politics of the opposition party, and dressing up in a narrative that this is about anything other than power is not the work of a study hand. And that needs to be said and I would have much preferred to stay quiet today. But I think it's important we say the things that we feel, even if they feel bad. But that must speak right yield well. Chair recognizes Chairman Chuck Martin to speak to the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I'll be brief. The lady that presented the bill made the point that I absolutely wanted to be clear on and that this bill today has nothing to do with changing the manner in which the elections in Fort County for the seven commissioners are held. They'll still be partisan. They'll still be primaries. They'll still be handled each and every district on the year they were supposed to be handled. The districts have been numbered in a way such that every incumbent will run in the cycle. They would have normally run in. So the elections will be conducted in the way that they were and that the verbiage in the title that said that it alludes to nonpartisan is basically ineffectual. Those of us that have been around for a while know that when a bill is introduced that never changes on the literature as it moves around but the preamble and the language in the bill does change. I would only say this with respect to the gentleman that spoke before me that I live in North Fulton County. And the maps that have been considered those districts of the remaining same the map we have before us today for the first time that I'm aware and I've lived in Fulton County my entire life with the exception of a brief period after attending the University of Georgia. My family has lived in Fulton County my entire life and for the first time if these maps are approved today my neighbors in South Fulton will have a South Fulton centric commission seat to represent South Fulton County. Let me say that again for the first time they will have a South Fulton commission seat that looks like a block stacked on top of the rest of the county stacked on top it that will represent the people of South Fulton for the first time. This is not about party that's probably going to be a democratic district probably was probably is before the lady might address that it has nothing to do with that but that's can you talk about communities of interest quite a bit that for the first time that area of South Fulton will have a commission seat that lists the commissioner will be elected and will be completely represented them. With that Mr. Speaker I encourage people to look at the map this is a good map for Fulton County and devoted favorite I yield well. I think that's all the speakers I don't have a request for the chairman's time. Is there any objection to the previous question being ordered? The chair hears none the previous question is ordered. Is there any objection to adopting the committee substitute? What is the objection to? Mr. Speaker object to the committee substitute being adopted because it was over the bill that followed the local procedures and had the requisite signatures. All those in favor of adopting the committee substitute will vote I those opposed to adopting the committee substitute will vote no and the clerk will unlock the machines. All members voted. All members voted. If so the clerk will lock the machine on the adoption of the committee substitute. The I's are 99 the Nays are 59 the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair hears none the report of the committee is agreed to shall this bill now pass? All those in favor of the passage of the bill will vote I those opposed to vote no and the clerk will unlock the machine. I'd like to make a motion Mr. Speaker motion to be out of order. Is there have all members voted have all members voted? If so the clerk will lock the machine on the passage of Senate bill 437 the I's are 97 the Nays are 62 this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 369. Senate Bill 369. Senator Dixon the 45th Alvarez the 56th. Cowsr to the 46th. Kennedy the 18th. Robertson the 29th and others to be entitled act to amend and act relating to the education districts for the election of members the Board of Education of Winat County. This bill then refer to the committee on governmental fairs that committee recommends that this bill do pass. Chair recognizes chairman of station to present the bill. Thank you Mr. Speaker today I bring to you ladies and gentlemen of the House Senate Bill 369 the objective of the legislation is clear it's to remove partisan politics from the classroom. Now a majority of school districts throughout the state of Georgia are already nonpartisan and I've just done a little research anticipating my presentation today Fulton County the cab county Rockdale County Walton County Atlanta Public Schools City of Buford schools City of Decatur schools City of Savannah schools Clark County Muscogee County Richmond County Bib County White County Towns County their counties all over the state rural urban suburban that have nonpartisan school boards and if you represent one of these areas and you vote against supporting another county to go nonpartisan to remove partisan politics from the classroom I'd say that's very difficult to explain you know over in the Senate when this bill was debated a state senator introduced an amendment requesting that it applies statewide all right that was the argument that we heard in the Senate I know their their representatives lined up to speak but I'm curious is that your position that this should apply statewide will if you believe that then you vote yes on Senate bill 369 and you address it for 10% of all public school students in the state of Georgia you make a meaningful impact for kids to remove the politics from the classroom so there can be a focus on education now I have been consistent in my support for nonpartisan local offices throughout my time and the Georgia House of Representatives in fact when I was newly elected I see some nodding from a co-sponsor maybe on a previous bill when I was newly elected I carried two bills to make two offices in Gwinnett County nonpartisan and they are today and I had bipartisan support it looks like maybe from from some of the members who were about to speak against this bill I had bipartisan support to make local offices nonpartisan in Gwinnett in 2014 and I had favorable votes from Democrats who represented Gwinnett on those two pieces of legislation in 2014 so if there has been any change it has not been in my posture on this issue the the important focus of educating students in Georgia is something we discuss frequently we passed a very pro-education budget recently and we put a lot of confidence and trust that our local school boards are going to focus on educating kids doing what they're responsible to do and injecting partisan politics into the classroom does not serve the best purposes of educating Georgia students and making the school board nonpartisan is a clear way to address that Mr. Speaker I'll be happy to answer any questions if there aren't any you have no questions you'll the well gentlemen is yielded the well okay same ruling as to time we've got a few that want to be heard on it and uh chair will wreck a lot 30 minutes collectively y'all can allocate that among yourselves as you wish at the end of 30 minutes the last speaker will be terminated so we'll take these in the order of sign up chair recognizes representative Hutchinson to speak to the bill thank you Mr. Speaker I am a duly elected member of the Guneck County delegation I do not support this bill and I am asking you to vote no on SB 369 thank you Mr. Speaker I yield the well chair recognizes representative McLean to speak to the bill thank you Mr. Speaker I rise to an opposition of this bill but I want to clear up some of the things that my colleague said yes I do believe judges in the state of Georgia should be nonpartisan now that I do believe and I did sign on for that so I have no problem with that so I want you to get I want to make that clear but I am a duly elected official of Guneck County and my delegation along my constituents we do not support this bill and I'm asking all of you all to vote no on this piece of legislation yes judges should be nonpartisan but school board should be who they are thank you Mr. Speaker and I yield the well chair recognizes representative Park to speak to the bill thank you Mr. Speaker I am a duly elected member of the Guneck delegation and chair of the Guneck State House delegation I do not support this bill and I ask you to vote no to SB 369 and vote no to respect the will of Guneck County voters who do not support this piece of legislation thank you Mr. Speaker chair recognizes representative Beth Moore to speak to the bill thank you Mr. Speaker I am a duly elected member of the Guneck delegation I do not support this bill and in the name of local control the process is set forth for local legislation and the bipartisan composition of the Guneck Board of Education I am asking you all to vote no on Senate Bill 369 thank you chair recognizes representative Kendrick to speak to the bill thank you Mr. Speaker I also support a nonpartisan in judge races but I am a duly elected member of the Guneck delegation and I do not support this bill and I am asking all of you to vote no on SB 369 thank you Mr. Speaker chair recognizes representative Bennett to speak to the bill thank you Mr. Speaker I am also a duly elected member of the Guneck delegation I do not support this bill and for the record I have been consistent in my opposition to nonpartisan ship and so I ask you to vote no on Senate Bill 369 thank you chair recognizes representative McLeod to speak to the bill thank you Mr. Speaker and good afternoon everyone prior to 2018 before the first school board member of color was elected there has never been talks of nonpartisan elections and by 2018 Guneck County was already 200 years old I moved to Guneck County in 2000 by 2004 my daughter graduated from central Guneck High School during her high school years at central students the student body was overwhelmingly white and the school board members were all white we didn't go to the school board means like a mob to disrupt and antagonize no we respected each member and trusted that they had our children's best interests at heart but our trust was ill advise because as the number of children of color grew in Guneck County public schools so did the disproportionate disciplinary actions being leveled at our children when I was approached by the lawyers committee on civil rights in 2016 to be a plaintiff on three lawsuits I agreed one of the first the first um um let's just um lawsuit that I was a part was the gerumandering of district 105 the second was the question of why that the board of commissioner was not diversified and the third was why the school board wasn't diversified Guneck County had already flipped from a predominantly white county to a county where the majority are people of color in 2017 I participated in depositions of all three cases during the board of commissioners this deposition one of the sitting commissioner was asked why is it so difficult to diversify the board of commission and she responded I don't see what the problem is they have nice houses and they've got nice cars what more do they want during the deposition on the school board in 2017 two out of the five all white school board members were asked their opinions on segregated schools in the sixties and seventies both women responded they didn't have an opinion the lawyer then asked them what is your opinion on segregated schools sitting here in 2017 both women stated they had no opinion even though eight out of ten students in Guneck County public schools are students of color this legislation to turn the school board elections into nonpartisan races is not about fairness or taking politics out of school because our children have been subjected to discrimination and politics by people who are supposed to be helping to protect them the minority republican members of the Gwinnett delegation was unable to present ideas and policies that will sway people who might not look like them to vote for them instead they come up with ways to cheat or divert from the issues instead of earnestly trying to update the quality basic education formula from 1985 they use nuance explanation to say they are fully funded QBE formula based on the 1985 formula i can assure you Gwinnett County does not look anything like it did in 1985 the verdict 127 million dollars to private prison will only continue to fill the school to prison pipeline the very thought that the very thought that people of color are capable of leading maybe foreign to my republican colleagues but i assure you not only can we lead but we've been leading for thousands of years and we will continue to allow you we will not continue to allow you to define who we are are continue to endanger our children my grand my grand son now attends Gwinnett public Gwinnett County public schools and i will do anything and everything in my powers protect him and all our children what the republican majority in this house have been doing is abusive they have they have abused the rules they have abused the minority members of this house and they have abused our constituents i will leave this well with this warning from my grandmother who used to always say nothing is forever nothing lasts forever delay is not denied god don't like ugly and i ask you to reject SB369 by saying no i yield the well to recognize this representative Mitchell to speak to the bill thank you mr speaker i'm a duly elected member of the Gwinnett delegation and delegation secretary and i do not support this bill and i'm asking you all to vote no on SB369 i yield the well chair recognizes representative Kennard to speak to the bill thank you mr speaker i rise today in opposition of sp369 as most of you know i'm a i'm george agron was born at Crawford Long Hospital just a few miles down the road and was raised in Gwinnett county i'm a product of Gwinnett County public schools raised my family in Gwinnett county all three of my daughters a graduate of Gwinnett County public schools we are all in with gcps now when i was going first grade through twelfth grade in Gwinnett county that was from 1972 to 1984 and i graduated from part three high school in 84 i was very involved at part view i was in the chorus band beta club played varsity sports kind of well-rounded played baseball and basketball as a matter of fact for for your enjoyment today i scanned a picture of my yearbook this is the 1983 basketball team that i played with and i know all all these white guys look just alike so let me identify myself i'm in the second row in the dead center kind of a character out of welcome back hotter not too long after that picture yes you're welcome not too long after that picture was taken i locked off the sides of my hair and for about five or six years sported a mullet business in front party in the back but that's what the basketball team for part view looked like in 1983 i've recently attended some part view sporting events and the basketball team looks nothing like that these days when i was in first grade the gwinnett county was about 70,000 people and during my entire k-12 of experience i did not go to school with one person of color but something beautiful and powerful has been happening to go in at another metro counties for several decades it's called growth and diversity gwinnett county has now swelled up to about a million people and most of that growth has been from people of color my nordy groups that have relocated to gwinnett county gwinnett county is now the most diverse county in our state one of the most diverse in the country often use the metaphors of scripture so for me gwinnett county is a coat of many colors and a sound of many waters were so eclectic with our cultures and ethnicities language faith traditions sexual orientations and more now the dynamic of this diverse growth has been happening for decades among gwinnett citizenship but not so much among its elected leaders the board of commissioners and the school board has not looked like gwinnett citizens until very recently the county was a coat of many colors but the boards were monochromatic white not until 2018 did we break the color barrier with the first person of colors in our county commission board and school board in 2020 both boards flipped significantly and became predominantly men and women of color now this change did not happen via an insurrection new hostile government takeover there was no coup it happened at the ballot box the locals in the community cast their vote use their democratic voice these new leaders were duly elected democracy worked locals determined their fate but as I personally witnessed this transition of leadership this transition of power I wondered what the white community who had been in power for 200 years would do you know we were comfortable with people of color being on the bus but now that they're driving the bus what will we do what would the response be let me stick a pin in that for just a moment right outside the capital building on the grounds is a bronze sculpture named expelled because of color it honors the 33 African-American formerly enslaved men who became state representatives and state senators in the Georgia assembly the United States had just defeated the Confederacy winning the Civil War and Congress passed the 13th and 14th of amendments now these formerly enslaved men were full citizens empowered with the right to vote and run for office and so they did creating the original 33 we call this era in our history reconstruction but it did not last long about 10 years roughly it lasted as long as there was a federal military presence to keep the south in compliance with this new world order but once the federal military presence left white southerners grabbed their power back not through a democratic process but by force by violence life threatening intimidation manipulation they flexed their dominance changing rules passed a series of laws that not only would retrieve their power but keep them in power and boy was it ever effective it really really worked there was another black man in this Georgia assembly until 19\n\n62. Now let's fast forward to 2022. I believe these ghosts are hunting us now. During this session, there has been a parade of legislative measures that harken back to this post-reconstruction past. Bill's drafted and pushed through at a brick neck pace by passing longstanding rules and traditions that are effectively overturning the will of local communities, expelling new elected leaders of color by drawing them out of their district. There was one bill dropped in the special session that would have stripped the first American female chair and went out of their voting powers, disempowering her office. And we've seen a number of measures revising district lines with surgical position, manufacturing might power blocks in a county that's two thirds not in light. Now these moves made in 2022 are more clandestine than they were in 1890. They're more convert. The language is more polite. We're clicking this language like communities of color, nonpartisan elections, catch phrases like getting politics out of our schools. But if it looks like a duck, walks like a duck, it's a duck. Segregation by any other name is still segregation. Now if we were to consider this measure by making all school boards nonpartisan, I might be in support of that. But the timing of this is so obvious. It was after these boards had flipped. You've tipped your hand. I saw this coming and I wondered what would happen. And now I know. And to be frank, I've been upset, I've been mad. But more than now, I'm just heartened. And I'm sad that people who look like me seem to be so unavolved. I'm in this unique position of growing up in Gwinnat. I've had a front row seat, a panoramic seat in view. I grew up in Old Gwinnat. I've raised my family in New Gwinnat. I got to tell you, New Gwinnat is so much better. I love New Gwinnat. Our best days are ahead of us. Listen, I loved and do love Alvin Bullbanks. I'm a fan. His legacy is strong. He put Gwinnat County Schools on the map made it a world class school system. Served as so well for 25 years. My daughters were the recipient of his leadership. But at 70 years old, Alvin Bullbanks time has come and gone. Now the new board in a 50 unanimous decision selected Dr. Calvin Bullbanks to be a successor. And what a beautiful, brilliant move it was. I visit all my schools in my district, all 19 of them. And without exception, all the principals, all the faculty say things are going great in Gwinnat. It's been a seamless transition. We love where we love where Gwinnat has been. But Dr. Watch has taken this baton and taking it further, expanding the greatness of our school system. So we're in good hands in Gwinnat with our new leadership. And I just want to politely ask you to leave Gwinnat alone. Leave Gwinnat alone. We are good. We are good. Thank you for opposing SB369. I yield the well. Mr. Jasmine Clark to speak to the bill. Thank you, Mr. Speaker. This afternoon, I rise in opposition to SB369. Let's be clear. SB369 is a local bill by law. It affects one county, just one, Gwinnat county, not Cook County, not Habersham County, not Floyd County, just Gwinnat county. You have heard here with your own ears, you have seen here with your own eyes that a majority of the duly elected members of the Gwinnat delegation do not support this bill. 10 of 18 or 56% of the delegation reject this legislation. If this bill is not supported by the majority of the delegation chosen by their constituencies to act on their behalf, then a vote on this bill is a vote against the people of Gwinnat. So you may be saying to yourself, well, I'm a Republican and I don't care what the democratic members think about this bill. And you know, that's fair, whatever. Well, if that is your posture, then I would submit to you that 60,000 plus Gwinnat Republican voters were specifically asked if they want to know the party affiliation of the school board members and a super majority of those voters, 71% said yes. They want to know the party of their school board members. If you zoom out greater than 65% of 1 million Georgia Republican voters across the entire state also said they want to be able to know the partisan leanings of the school board members in their county, which is why the author of this bill conceded and had to make this a local bill instead of a statewide bill that would affect every county. I have not seen a single solitary shred of evidence to show that the sentiment of the voters has changed. So we asked if we want to do this, why don't we ask the voters? We just asked them in 2020 and they said no to nonpartisan. So if they want nonpartisan now, I believe that we should ask them first. Let's not shove things down their throat. However, my Republican colleagues rejected this. If they are so sure that the voters have changed their mind, then why is there a fear of simply asking them? Well, I bet I can answer that for you. This is not the will of the voters. This is the will of a few to try to change election outcomes in their favor after previous elections have not gone their way. The author of the bill reports that nonpartisan elections make school boards less political. This is categorically false and false and based on faulty logic. Nonpartisan does not equal nonpolitical. Research actually shows that it can be the exact opposite. Without being able to tell voters their party affiliation on the ballot, school board members will signal their partisan leanings through their actions after they are already elected. Nonpartisan elections don't remove politics. It removes information. How do I know? Because the voters tell me how difficult it is to find out where some nonpartisan candidates stand on the issues that they care about. Now, if it's difficult in a year where many nonpartisan candidates have been running for months, it will be exponentially more difficult when we abruptly, abruptly, change the general election date in the middle of an election year. This bill changes the election date in the middle of an election year. How would your voters feel if they were looking forward to voting for you in November and all of a sudden it was moved to May of this year? They probably be pretty upset, especially in a year where so many other things are changing. Voters are having to deal with new districts and district numbers. They're having to deal with new candidates. They're having to deal with new voting rules. We have not had an election in Gwinnett County since SB202 was passed. So there are a lot of things that voters are already going to have to deal with and now we're throwing this at them too. Why would we do this to the voters when they have specifically and definitively told us not to? Today, you are being asked to cast a vote for a county that 90% of you in this room do not represent. When doing this, it is important to lean on the will of the people. To vote for this bill is not an attack on me. It's not an attack on my Democratic colleagues or the Democratic caucus, but it is a direct assault on the hundreds of thousands of people in Gwinnett that we represent. Please do not disrespect the residents of Gwinnett. Please do not devalue the votes of the people of Gwinnett. Please do not ignore the people of Gwinnett, Democrat and Republican, 71% of Republicans. Please vote no on SB369. Thank you, Mr. Speaker. I yield the will. Okay, we have a minority report. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report by rule 20 minutes for the minority report and the chair recognizes representative Mitchell. Thank you very much, Mr. Speaker. I'd like to level set a bit before the front end of this minority report. We all have common ground in this room. All of us, every single one. You may not have used the Elsa shampoo this morning or brush your teeth with strawberry glitter unicorn toothpaste, but every single person in here believes we are making choices that are best for Georgia's children. Every one of us believes that. It's our common value. Where we differ is how we see that laid out. And when we have common beliefs but different ideas as specific objectives, we find that everyone can feel righteous in their position. And the more righteous we feel, the greater the divide seems between our objectives, even though that space has not actually changed. But we can overcome that perception if we want to. So I invite you to try. I have 20 minutes to convince you that we want the same thing and that you want to vote against this bill because it's the right thing to do. I had three minutes in committee and I could see people who were nodding. So I know that we have common ground because in three minutes we could find it. So let's talk about abruptly moving our school board elections to may of it. Because that's what this bill is really about. If it were not, we would have seen that committee on moving all school boards nonpartisan from the summer actually proposed legislation to move all school boards of elections to a November nonpartisan vote. I was not in this body in 2011 when y'all by vast majority vote moved our nonpartisan county elections to may via House Bill 158. But I'm 100% not opposed to moving them back to November. If we do this, we are in an entirely different conversation. I think it's easy to feel like we know more than we actually do about school boards except for maybe the one or two people in this room who have actually served on a school board or who rewrote school board policy in 2010. Even there, we know a great deal about one school board that we served on and less about other people's school boards. Why do I make this assumption? Because friends, my done in Kruger and this is strong. I have learned more about Georgia school boards this year than I could have ever wanted to know and specifically I've learned it about mine. And I had to go down that rabbit hole to understand what was being said, if what was being said about my school board was true. And now I know enough to know, I do not know enough. The done in Kruger goal is achieved. I stand before you in the place of humility. So a little education for those who like me did not come from K-12 education leadership backgrounds post 2010. Did you know that school boards do not make most decisions within a school system? They can't change the curriculum. They can't edit lesson plans. They do not determine COVID safety protocols. I'll say that one again. They do not determine COVID safety protocols. School boards set policies and they set budgets. If you don't like what's being taught or how it's being taught, you're looking at your operations folks or your superintendent to quote OCGA 20-2-61, which was introduced in 2010 in Senate Bill 84 in a partisan fashion but did pass overwhelmingly. The fundamental role of a local board of education shall be to establish policy for the local school system with a focus on student achievement. The fundamental role of a local school superintendent shall be to implement the policy established by the board. It shall not be the role of the local board of education or individual members of such a board to micromanage the superintendent executing his or her duties. A lot of things that folks worry about, a lot of things they take aim at our school board members for are not in their control. I often look at votes and try to put myself on both sides of the discussion and see what concerns I would have. I invite you to do the same using the districts that you represent as the lens. Let's look at the school boards that we each represent in this discussion. Think of the school boards that are elected you to be here. I have spent an unreasonable amount of my time as a legislator understanding what school board make up looks like here in Georgia and whether that should remain in the hands of the local delegation. And I don't mean in the hands of a single member of the delegation or a small part that reflects the voices of only a loud but tiny minority of the residents of that county. I mean all of us. I actually reached out to every partisan county school board that had publicly available email addresses and I asked all the members if they'd like to offer an opinion. And I know a little bit about survey design so I kept my ask really simple should these decisions remain local? Should your board remain as it is? Should all boards remain as they are and would a change be disruptive? I got responses to the survey from multiple counties and I got a few emails from folks who did not want to fill out the survey with a county identifier but didn't want me to know where they stood. And by multiple counties I mean 16. You can listen and hear if the counties you represent are in it. Barrow, Chattuga, Cherokee, Cobb, Crisp, Fayette, Borseth, Gordon, Green, Hancock, Newton, Paul Dingpoke, Taylor, Thomas and Washington. Notably, Gwyneth is not in that tally. 75% of the folks who responded to me wanted this decision to remain local. You know what else? They didn't all want it to remain partisan. About half of them wanted to be nonpartisan. So if you represent one of the counties that I just named ask them if they want a change. That's their local decision and it should be respected. As a note there were two counties that do very much want to change nonpartisan. One for the same reason I'm arguing in this bill. They want more people having input in their election. Fewer voices are heard in their school board elections because there are only candidates from one party running. So in their election if you want a voice in the school board you need to be voting with that party in the primary. Moving to a nonpartisan election but in November would allow every vote to maximize the number of voices of local families that weigh in on school board membership. So let me drill down into that a little bit so you understand it better. And let me put it in the words of a fellow elected because I think everyone in this room can have this conversation. Do you know your vote goal for this May? That's a number of people who have to turn out and cast a ballot for you to win a May election. What's your voter universe for your May election to get to that vote goal? Do you have that number in your head? Does it look the same as in the general? The voter universe represents the people you're reaching out to in hopes that you can ask them to go to the polls and then when they do go they're choosing your name on the ballot. Is the universe more or less inclusive of independent nonpartisan folks in May or in November? To be clear it's November. People outside this room don't know this but that number for a May election is tiny compared to a November election. It is for you, it is for me, it is for a nonpartisan candidate on the May ballot. And that's not just because you're casting a partisan ballot in a primary. If the election you're trying to win is Democratic nonpartisan or Republican turnout in May is vastly less than in November. I think 20% of November turnout and you're in the right ballpark. It turns out even elected folks aren't good at turning out in May elections. I'll say that again even us elected folks right here are not good at turning out in May elections. They're even less good at turning out in May voting before you're we're on the ballot. So the idea that we can have some strange groundswell of unusual investment to come out and consistently vote in a May election just to influence school boards which will vastly outperform the other dresses on the ticket including nonpartisan judges who are already elected only in May is unlikely and frankly bordering on ridiculous. And you don't have to believe me you can look it up. That date is public. I did look it up for a bipartisan subset of us. We do have some dedicated members among us who vote in every primary election but they're not in the majority. They're not they're not even over 20% of the subset that I looked up. Most people do not vote in a May election. So we need to be very real world about the implications of moving someone else's school board election to May because that's where we live. While our boards do not have a hand in each day to day decision in our schools we want to have an opportunity to vote for them. They're the only elected position in our whole school system. We don't pick teachers we don't pick principals we don't pick superintendents we do pick school boards. So let's make sure as many of us as possible get to weigh in on the board that decides one of our largest budgets in our county. Even if you're not a parent you have invested in a school system that says school system impacts you and your family. Understanding that impact I ask myself what school systems do other members of this body represent. And since I trust that my colleagues on the democratic side whom I've spoken to are going to support our ask as a guinette delegation that we get to listen to the voices of our constituents and not chaoticly throw our school board elections to May this year. I look specifically at districts represented by my colleagues across the aisle. So I ask you if you can hear me in this room. Do you know if the school boards you're representing are partisan or nonpartisan? Do you know whether they want their elections in May or November? Let's start with a breakdown of that representation into two of the simplest categories. Are all the school boards you represent nonpartisan? Are none of them? How many county school boards do you represent? Well the median number of county school boards in a currently Republican held state house seats is two. The maximum number if I'm correct represented by any single colleague across the aisle is nine. And if we break that down into November elections and May elections you're actually all the way over the map. I believe 19 of my colleagues across the aisle do not represent a partisan school board at the county level. So there are 19 of you whom if you vote against guinette's autonomy in this space to decide our own school board makeup and election time you're not voting against what we do in the district I represent. You are however voting against what the residents of the district you represent would want done to them. Which is for legislators from other parts of the state to make a partisan decision because this would be a partisan decision make no mistake to change how their school system elections run. And to do that with only a few months until their brand new election time it's just not right. There are around 35 of my colleagues across the aisle who represent only partisan school boards at the county level. That means you're saying the system you have at home that your voters ask for isn't acceptable for a county that you do not represent but is okay for your own county. And let me assure you all your primary electorates they all voted in 2020 on that same ballot question and they all wanted partisan affiliation to be known in school board elections. The only exception to that in the entire state is Trudon County which ironically is actually partisan right now. The remainder of my colleagues across the aisle represent at least one partisan and at least one nonpartisan school district. If you stand in that position do you know which is which? Does one run so much better than the other that you'd want the rest of the state to decide for you that we should abruptly change the other likely not. But if that's the case for you then you could have a yes vote here but there shouldn't be very many. You are all voting to change my school and unlike a state house district which is not anyone's to own this is my school board. It represents my community. It is where my children go. It is the board representing a system whom I trust in place of a parent every single day I send my son out the door and you will be voting to change it without being a stakeholder in my community. You've not read the resumes you've not picked the candidate you've not not the doors you've not waved the signs you've not sat in the school board meetings you've not watched your first school board sworn in that represented your values in a county that finally is starting to hear your voices. I ask you not to take that away from the voices of Gwyneth families just because of partisan politics. We wouldn't take it away from you. We wouldn't I wouldn't we know what it feels like to have local control denied to our families. Please vote no on this legislation because when we get up here you get up here and make this request like I am to leave decision-making about education local we're going to honor your request. Won't you honor ours? Thank you Mr. Speaker and I yield the well. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here's none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machine. What purpose does chairman have? Strangely rise. Parliament or inquiry. State your inquiry. Mr. Speaker isn't it true that testimony was provided that the association of school boards as well as the Gwyneth Chamber of Commerce support local offices being nonpartisan. If the gentleman so states for further parliament here inquiry Mr. Speaker. Yes. Isn't it true that as a member of the bar an attorney I should wrote incredible restraint not asking chairman Taylor to speak for 20 more minutes and the well as part of her chairman's time to get this question to the body of the house so they could vote on it. You want a medal for that? We'll give you one. What purpose does chairman rich rise? Parliament or inquiry. Isn't it true that parents from every corner of Gwyneth County have expressed frustration at the hyper politicization of our school system? If the lady so states what purpose does representative Jasmine Clark rise? Parliament or inquiry. Is it not true that 71.46% of Republican primary voters reject nonpartisan elections in Gwyneth and to vote yes for this is to vote not only against Democrats but Republicans as well. I haven't seen that polling but it's the lady so states I'm sure she believes it to be true. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill that chair here's none the report of the committee has agreed to? Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will lock the machines. Have all of members voted? I think we've been here too long or I know I have. Have all members voted? What purpose does representative McLean rise? Parliament or inquiry. Make your inquiry. My inquiry. By having this vote we got to have this vote done the election in May that time of turn to turn around anything? I have no idea representative. Thank you. Have all members now voted? If so the clerk will lock the machines on the passage of Senate bill 369 the eyes are 95 the nays are 61 this bill having received the requisite constitutional majority is therefore passed House bill 961 will be postponed to the next legislative day. What purpose does representative can trail rise to make a motion? State your motion. I move that House bill 60 be recommitted to the House Education Committee. Chairman it's carcoring the caption. House bill 60 be titled an act to amend title 20 the fiscal to Georgia annotated relating to education so as to revive for the establishment of educational scholarship accounts. On the gentleman's motion that House bill 60 be recommitted to the education committee is their objection is their objection the chair here is none and it is recommitted. We have a number of local bills that the clerk has members of both parties. The chair will ask for unanimous consent that the rules of the House be temporarily suspended to allow the bills to be read for the first time in a sign to committee they will all be signed to intergovernmental coordination is their objection chair here is none and it is so ordered. What purpose does chairman Alan Powell arise to make a motion? State your motion. I'd like to ask for the rules of the House to be suspended so that a bill may be read and assigned for the first time. Clerk will read the caption. Unnumbered House bill or I was in a poll of 30 second and others to be titled an act to amend article 9 of chapter 12.\n\nThe title 16 is the official go to Georgia and say to really an access to medical cannabis system, provide that the Georgia access to medical cannabis commission is subject to state procurement laws. On the motion of the gentleman that the rules of this house be temporarily suspended and that this bill be read for the first time in a signed committee, is their objection? The chair here is none and it is so ordered, the bill will be assigned to the regulated industries committee. If you have signed up for an announcement, please make your way to the front of the chamber. Chair recognizes Chairman Dickie for an announcement. Thank you. Thank you, Mr. Speaker. We will have our agricultural consumers, farmers, committee meeting upon a German over in 4-6 CLOB hearing only. Thank you. Chair recognizes Chairman Estration for an announcement. Thank you, Mr. Speaker. The Gunter subcommittee of Judiciary will meet upon a German in room 342. We have three bills. Room 342 upon a German. All right, we are going to be off for a long weekend for President's Day. I hope all of you have a great weekend. Two people, two of our members will have really good weekends. On Saturday, Chairman Bill Workhizer will celebrate his birthday. Happy birthday to Chairman Workhizer. And on Monday, it will be the birthday of Representative Victor Anderson. Happy birthday, Representative Anderson. The chair recognizes the majority leader of the House for emotion. Thank you, Mr. Speaker. Mr. Speaker, I moved to this House stand adjourned until 10 a.m. Tuesday, February the 22nd, 2022. The majority leader has moved that this House be adjourned until Tuesday, February 22th at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. And this House will be adjourned until Tuesday, February 22th at 10 a.m.",
  "updated_at": "2026-02-13T08:30:41.396692+00:00"
}