{
  "video_id": "Ufq-bEsxQT8",
  "url": "https://www.youtube.com/watch?v=Ufq-bEsxQT8",
  "title": "02/25/2025 Senate Committee on Regulated Industries & Utilities",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 139,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Regulated Industries & Utilities session on 02/25/2025:\n\n## Overview\nThe session focused on Senate Bill 34, which aims to ensure that the costs of electricity incurred by data centers are paid for by the data centers themselves rather than being passed on to residential and small business customers. There was discussion around past practices of customers subsidizing the costs of large users like data centers, and whether the recent Public Service Commission (PSC) rulings adequately addressed this issue.\n\n## Key Actions\n**SB 34**: Requires that the costs of electricity incurred by data centers be paid for by the data centers, not residential and small business customers.\n\n## Bills Introduced (First Reading)\nNone.\n\n## Notable Moments\n- Senator Huffstettler presented the changes made to the committee substitute of SB 34, noting it aimed to codify that data center electricity costs should not be borne by residential and small business ratepayers.\n- There was discussion around past practices of customers subsidizing large users like data centers, and whether the recent PSC rulings adequately addressed this issue.\n- Senator Lucas questioned whether the data center electricity costs were actually appearing on customer utility bills.\n\n## Votes\nNone recorded.\n\n## Attendance\nQuorum was present, with some committee members noted as attending a Veterans Affairs meeting.\n\n## Adjournment\nThe committee adjourned, with the next session date unspecified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you which everyone you want, I'm gonna give them another minute to finish signing up. I got a couple of committee members that are in the veteran affairs meeting that should join us here pretty quickly. While we're waiting, let me remind committee members our committee dinners tomorrow night. I need you to RSVP to page McKinna, my administrative assistant to let her know if you're coming or if you're not so we can get a good head count. We got so far 18 different sponsors that have agreed to come join us and have a little social time. Get to know each other on a personal basis so try to remember to let page know if you are coming or if you're not coming. All right, I'll recognize you, Senator Huffsteller. We are working on Senate Bill 34. You have a committee sub you presented to me last week with just I can only tell a couple of words changed but we're working off of LC 55 0 4 6 0 s committee members. There's also in your folder a proposed amendment from Senator Summers that is a proposed amendment to this and I will summarize it briefly as I understand it. Nick Tate will be here, our legislative council member or assistant to this committee can explain in more detail but as I understand it is to make the rules change is the substantive policy in the committee sub before you apply to all electric suppliers which would include EMCs and municipalities and MEAX as well as Georgia power so it's sort of an even play and feel for all electric suppliers. Anybody speaking to the bill feel free to give your thoughts on whether this should apply just to Georgia power or to all electric suppliers or to none of them. There are copies of Senator Summers amendment next to a good friend Senator Lucas here if anybody wants just to see it but it's legal mumbo jumbo that says what I just said. All right, Senator Huffsteller if you would present your bill I know you gave us a once over on it before. We've taken a good bit of public comment on it. It looks to be another six or seven at least people that would like to be heard today. It happens sometimes as bills sort of percolate through the system and get publicity and get attention drawn to them so we may have people here today that have not spoken before. I'm going to try to give new speakers an opportunity to speak before people that have already been heard on this. If you would start by explaining to us the changes in your bill and just the general purpose what you're attempting to accomplish here and we'll allow the committee members to question you and then we'll start listening to speakers. So floor is yours. All right and this is the same bill that we presented at the last meeting. You showed the sub at the last meeting. Yeah, I wasn't positive when that came to me. Pardon? I wasn't positive when you brought that sub. Yeah, we had the last meeting. It was just a couple of words change substantial being taken out like you said. And I'll be brief here because we have gone over this and save time if I need to make comments then but Senate bill 34 is a short bill. It says one thing in electricity cost incurred because the data centers will be paid by the data centers and not by the residential and small business customers. It doesn't set the rates or get involved in setting the rates. It does codify the law that those response for the cost will pay for the cost. Well since the last meeting I did meet with a PSC staff and the chairman. I expressed my concerns at the ruling from the PSC left it totally at Georgia powers discretion. They stated they wanted to get something out quick and that it was only a first step and I think that's fair and I think the chairman that I met with has similar interest on where the cost should go. But I want something in place that doesn't let history repeat itself. And the legislature certainly has responsibility to help protect its citizens. The legislature created the Public Service Commission. We can set basic parameters and guidelines if we have the need to. You're going to hear some testimony that the ruling from the PSC is inadequate to protect our ratepayers. And if we all agree and I've heard we all agree that the residential ratepayers should not incur costs from data centers then no one should have a problem with this bill. Thank you to the committee for your consideration. I hope you'll pass this important piece of legislation for the ratepayers of Georgia. Anybody have questions for Chairman Huffsteadler? Senator Luke, as you're recognized. I think you're much 12. Senator, can you show me, in fact, where the data centers have been placed on the customers utility bill? Well, going backwards, I would say one thing is we've been told that the data centers and this has been statements from the PSM selves are going to take up the power of the additional plant vogal, which is about a thousand megawatts. I think it's a thousand and twenty four. In addition, they're adding thirty four hundred more. So the ratepayers had a surcharge from two thousand eleven, I believe, until just recently that paid for the profit, the taxes on the profit, some interest. In addition, they have a sixty year mortgage set into their base rates to pay for this.\n\nSo I would say and I'm not really trying to look backwards as much as forwards, but I would say backwards. It looks like they're going to be benefiting from what the ratepayers have in their charges right now. We've of course had six rate increases in less than two years. My biggest interest is this 3,400 going forward that we codifying to law that they won't be charged anything for those. But can you show me, in fact, where data centers have been billed to the ratepayers? You look at the rate they're paying right now, which is a fraction of the consumers' rates. The consumers are paying for this additional power that's being consumed by the data centers. We are paying for that. We pay it. We are paying for plant voting. Right. And who's going to benefit from it is the data centers. Again, I'm not opposed to data centers. I welcome them to Georgia, but that would be the past, and I don't want history to repeat itself. So I want to make sure we codifying to law that this won't happen in the future. Are you for me with the term CWIP? CWIP. I know it's an acronym that is. It stands for construction work in progress, which we used to pay for. Right. And we ended up not doing it. And then, of course, in its infinite wisdom, the legislature kind of gave that up. And so we get charged for things like plant voting, contract, the went bankrupt. Georgia Power ate that up, but that was part of that profit. And so what I'm asking you can read a faculty issue that data centers, the Georgia Power Fund is in the customers utility to be. Customers, and I'll try to say this again, the customers are paying for the capital cost of electricity that's being used by data centers coming into the state who are paying a fraction of the price. Senator, did the public service commission recognize that and in their most recent rulings or regulations attempt to recoup the cost of generating electricity and transmitting it from data centers or other large load? I don't think it's recouping. I think it's more going forward that they're going to look at that. And I'm looking forward as well. But I do think that if you look at the past, it's certainly going on right now. And their most recent plan does it project that they're going to need significantly more power production to feed the needs of Georgians, including these large users? Right. In addition to the thousand megawatts from Plant Vogue, they say they need another 3,400 megawatts of power. So almost three and a half times as much. So they're going to have to build more capacity. Any other senators on committee have questions for Senator Huffsteadler before we have public comment. All right. Thank you. If you will stay here at the witness chair so we can have you handy. We'll begin with old law school classmate of mine, Robert Baker, the first Bobby Baker. We called him in the day. The first Republican member of the Public Service Commission if I recall correctly. You may. He was, he didn't run with the crowd. I did. He was in the library. It was supporting the board. We're in different sections. We didn't have the same classes together. Thank you, Senator. Thank you, senators for allowing me to speak here. And thank you for Senator Huffsteadler for inviting me here today. My comments today will focus on my review of Georgia Power Company's recent rule changes regarding new large load customers and why Senate Bill 34 should be passed. I served on the PSC for 18 years and have been practicing before the PSC for the past 15 years. The recent rule changes approved by the Public Service Commission at their January 23rd 2025 administrative session provides no guaranteed protection for ratepayers. But instead our full of loopholes that you could drive a truck through. Additionally, the rules can be changed at any time within 30 days by Georgia power at Georgia powers request or at the PSC's own initiative. Now the first rule change was to Georgia power companies general rules section a paragraph one. It says that the company may require additional terms and conditions of electric service, including with that limitation minimum billing requirements and a longer term of contract when the company deems it appropriate when the company deems it appropriate to ensure the company recovers all costs associated with servicing or preparing to serve a customer. With an expected peak demand of 100 megawatts or greater at one or more premises. Now the rule change does not mandate or require Georgia power to impose any additional contract terms or conditions upon a new large load customer but gives the company the complete discretion to do so. The second set of rule changes are to the rules and regulations for electric service section D paragraphs to 13 and 14. Before you go there on that first rule you just mentioned the ways. How does this statue change that? How does that statue change that? How does this proposed bill change that that rule that was passed back in the fall? It's going to eliminate the discretion on the part of the company whether they make any changes or not. Changes the shall to a may. I mean a may to a shall. I don't think it says in the bill shall but the intent in the way it would be interpreted probably would eliminate the discretionary aspect of these these PSC rules. So those cost must be considered in setting the rate. Does it allow flexibility for the public service commission to have further additional rules and rates and regulations in the world of large capacity users? I believe so yes. This sets a floor but not a fixed. It is basically saying setting out a policy statement that the cost causers need to pay for the cost they cause. Okay. Go ahead. I just want to make sure we understood. Now please ask any questions you have. The second set of rule changes are to the rules and regulations paragraphs to 13 and 14 and to paragraph two. The company makes additional terms and conditions discretionary and provides if additional terms are quote deemed appropriate by the company to ensure if it recovers all costs associated with servicing or preparing to serve. A customer paragraph 13 states the company may require additional performance and credit provisions. It deems appropriate to protect the company and ensure the recovery of cost. The new provisions of paragraph 13 are discretionary or optional based upon the company's judgment and it makes no mention of protecting existing ratepayers but instead it emphasizes protecting the company. If the company determines it can recover the additional cost from other sources or ratepayers there's no mandate requiring that the new performance or credit provisions on new large load customers be enacted. Paragraph 14 deals with recovery of cost incurred to serve the large load customer at the termination of their contract for service. Once again the rule change contains discretionary language may be required and allows the company complete flexibility whether to recover any cost from the large load customer. These rule changes are essentially worthless because of the numerous loopholes that they contain none of the rules changes offer any guaranteed protection to existing ratepayers and do not require Georgia power to impose additional cost, terms or conditions upon service to new large load customers to guarantee the additional cost incurred to serve them or recovered from them. Now everything you told us so far that's not statutory that's a PSC rule that that is a PSC rule submitted to that was approved January 23rd 2025. Okay up until that rule was there any such imposition of recovery of cost nothing specific that I'm aware of. Right and are you aware of having any knowledge about the exceptional power needs of these large data centers or big power users. I do and they do use an enormous amount of power Georgia power is used to dealing with increase in demand of a hundred megawatts a year a hundred megawatts a year. You're talking now about thousands thousands we have more than adequate generation right now to serve all customers in the state of Georgia. And what is going to happen if if if these new large load customers come in is that there's going to have to be provision made for new sources of large load generation huge amounts of generation. I mean you're talking about billions of dollars more in in capital expenditures and the problem is is that a lot of the rate system is set up so that you and I were on base rates as residential customers we pay base rates average rate right now is about 21 cents a kilowatt. If you're a large industrial customer or a large load customer you can get on what is called a marginal rate it's a great deal it's wonderful you're paying a fraction of what base rates are you have to be interruptable but you get it it's it's it's 21 cents to five cents that's the differential and it's if you're an industrial customer make sense it's you know you want to pay 21 cents or five cents. It doesn't take a rocket science to figure that out but bottom line is what is worse about these rule changes so that they can be amended or dropped entirely within 30 days at the request of Georgia power or on the commissions initiative pursuant to O CGA 46-2-25. Senate bill 34 is needed to make sure rate protections are put in place that can be changed and not changed in 30 days by three commissioners. Georgia ratepayers need the protection provided by Senate bill 34 not ask you to support Senate bill 34. If you have any questions I'll be we're glad to try to answer. I'm going to have a few given your experience on the public service commission will you just give my committee a real brief primer on the territorial service act and the difference between the large user large load customers and your general residential or commercial customers. Georgia has a statute that was passed back in 1975 called the territorial act territorial service act for electric service. It's unique in the United States and that we have had electric competition to a limited extent since 1975. If you're a large load a new a new large load customer has a load a new connected load of 900 KW not even a megawatt 900 KW you when you are proposing your project a factory a shopping center. It has to be a single meter connection can basically shop you can shop in Georgia you can get a shop with EMCs Georgia power me you can look for the best deal out there for your electric service it's one time option. It's only for large load new large load customers it's a great deal and a lot of these you know these data centers and new large load customers they're going to take advantage of it they're going to shop it they're probably going to prefer Georgia power just because of the size of the company their reputation their reliability. But if you're a new large load customer it's a great option in Georgia to have to be able to shop around and get the best deal you can negotiate. Senator Summers has an amendment not only that you've seen it or not but the gist of it is that this law would not only apply to Georgia power through the PSC rule essentially being codified but that create a new coach section that would require any other electricity supplier. So it's a great deal to be subject to the same conditions and I think his point is that because the EMCs can be competing against Georgia power for these large load data centers or other industries that they ought to be on the level played filter also be forced to recoup those cost and distribution cost do you have thoughts about that or observation about that. It's just a quick observation based on the information I don't think there should be any discrimination. I don't think that. Committee members anybody have a question for Mr. Baker and I'm going to start with you. The majority leader gooch. Mr. Baker thank you for being here so pleasure to see you have an example on customer choice in DeLonigua we built a hospital two years ago it opened the hospital area that we were to hospital was built was currently being served by Georgia power however Jackson EMC was the customer choice or there was a customer choice to provide the electricity so Jackson EMC had to build the power lines over to the hospital which was several miles away who pays for that upgrade for that power line because the Georgia power lines were already on the property where the hospital was being constructed but Jackson EMC had to bring the power line to the hospital so in that situation who would pay for that upgrade. For that utility for Jackson EMC new transmission lines were built to already existing transmission line is a service line but it was a three phase power line so it was a significant investment of money for you know two or three miles I'm not picking on either side I'm just trying to learn because we're talking about an issue with only data centers but I wonder how that compares to a hospital or a commercial development. You know center I'm not familiar with the facts of that case but it normally what happens is yes that's an example of how there can be competition yes there's a lot of back and forth if this hospital was originally served by Georgia power they're not going to give that up voluntarily. It was a brand new hospital. Brand new hospital. Okay so in that case in that particular case and that knowing nothing but what you're telling me is that that might have been included in the cost to the hospital of if it's a distribution line now distribution not transmission if it's distribution the hospital may have had to pick up that cost but if they got you know if you you'll pay you know a few hundred thousand dollars or a million dollars if you can save ten million dollars. I mean that's just good business good economics. Would the power company pay for that extension of that line if they knew they had a long term customer there and they would make the money back in a five or ten years. You can do it yes they're not going to give it away but they're probably going to build the capital cost of building that distribution into the rates that the hospital got if they were a new large low cost. It's a contract. It's a contract you build it into the rates they're not out to lose money they're out to make a profit. I'm not trying to put words in your mouth but it sounds like we're carving out data centers only when there's other examples of where commercial customers are doing the same thing but the power companies are paying for the upgrades to service those customers. Am I clear on what this bill does? It depends in these cases though you know the in this bill I think it specifically says large load customers it doesn't say data centers unless there's been a change that I haven't seen the more recent change. A more recent change. Okay. I think it's best to find some data centers. Okay. All right. The costs are like I say if they're coming in if they're shopping their electric service provider it's a very competitive it's a business deal it's business negotiations you're talking about huge amounts of money for capital expenditures. Georgia power has to build huge huge transformer stations to service these large load customers and that that's an enormous that's tens of millions of dollars or more and cost right there just to build the transformer station to serve a new customer. And normally they're trying to get on they don't share anything with me as far as how they negotiate or their contract terms but they're going to try to get that new customer to cover the cost for some of those expenditures that they have to go out of pocket. And there's no guarantee that they're going to be around for 10 years 20 years. I mean we're seeing right now the whole transformation in the AI industry was a deep peek or whatever it is how it's just transformed the AI industry and all these data centers are a lot of respect spec projects pure spec project unless they've got Amazon Google. Or you know being built by them a lot of these are spec projects and they're looking for perspective customers to to use their facilities and there's no guarantee they're going to be around in five years 10 years 20 years but we we're going to be here we're going to be paying. Senator Kennedy you're recognized for questions and you senator again. Thank you Mr. Chairman thank you Mr. Baker thing with us. And thank you for walking us through your analysis of the PSC's new internal regs on this issue I don't we don't have those in front of us what couldn't follow but I think I understood I have a copy of it like a copy. I think I understood your the points you're making you describe them as as loopholes my question is assuming that Georgia power wants to fully employ the concept of passing along these additional costs. How long would it take for that to happen what would you expect that process to look like and how long would it be before they logistically could actually employ that concept as embodied in these new regulations. Well first the the new capital the new generation has to be built. So right now there are there if anybody's familiar with plant yates there right now they're project they're planning to build three combustion turbine units up there that will cost a couple billion dollars. And those costs that those plants are still under construction they probably won't come into the operational into twenty late twenty twenty six maybe really twenty seven at that time then those cat those costs for those three new plants and for the other investments that are being made for battery storage large scale battery storage would then be put into rate base. So we're about to start a rate case this summer now are those plant yates cost going to be included no because the those plants aren't even built yet. I don't know where they are but it's going to take a while for them to be built. Now there are other costs that have been occurred from buying power from out of state from Mississippi power and from another power generator. Those costs are in rate are being recovered. So it sounds like some two to three years maybe you mentioned twenty six twenty seven something like that I'm sure George power could tell you exactly when those combustion turbines of plant yates will be operational and then can be included into rate base but I don't know. So so Mr. Baker so the purpose of my question really was to and maybe I'll ask the question to someone else is it George a power wanted to utilize the regular the new regulations which you said were January twenty third so about thirty days ago in a way fully as I think you're contemplating that this bill would do they wouldn't be able to do it and we wouldn't know what or see it for a few years so we're really too. So I think it's really really too soon to know whether or not they're going to align themselves with what you think is ought to be done or not fair. Well sort of fair but if these rules are in place it's all discretionary they don't have to do it. The language is leaves huge leopoles and they can either negotiate with these new perspective customers and they're doing those negotiations now. They don't wait to the data center or whatever is built they start now in fact they started months ago to begin negotiations because of the contracts you know bidding for for electric service providers. So these leopoles in the rules that can be changed in less than thirty days don't provide any type of real reliable protection for existing ratepayers that's that's my point that's what I'm trying to say right now and that's why Senate Bill 34 gives it a little bit more guaranteed protection. So I think that's what I think is going to be more than just a little bit more guaranteed protection for the future cost when they come you know when those plans are built they come into ratepayers that those costs would be blown by the large load customers that created those cost. Now we need right now the demand is just astronomical, astronomical, unbelievable the amount of power that they claim that could be out that could be demanding is in you know eight eighty eight two hundred compared to a hundred every you know for the past twenty years. Crazy that's crazy and who's going to pay for that that's the question who's going to pay for that at twenty one cents a kilowatt right now that's that is historical highs we've had thirty seven percent rate increases since March of twenty twenty three and there's no end in sight no end in sight for the average ratepayer. I mean ratepayers can't get the marginal rates I can't get a marginal rate I'd love to pay a nickel a kilowatt I think that'd be great I don't and that's what that's like when I'm here. Senator again you recognize for question thank you Mr. Chairman I can I want to ask a couple quick questions keep it to the two of three. You know you took an economics class somewhere in your history you learned about widgets said they always told me if we make more widgets that we make them cheaper. You agree with that. No you don't know okay now I'll give you a perfect example we've got in Georgia the major widget machine at Vogel. The United States most expensive generator of electric power and probably in the world that's the most expensive in the end of world I think there's only one or two facilities that are more expensive than the Vogel three and four. I was glad I wasn't here when when they decided to build build three and four on Vogel said the I don't think most my colleagues were here said the end that's where when I look at it the as we continue to make more widgets. The common theory is is that the widgets will get cheaper data centers are a continuous load they run twenty four seven three hundred sixty five days a year when they get an operation until they don't. I appreciate your service on the public service service commission for the years you two were there and one of the things that I guess when I look at it you made rules and regulations use talk about how quickly in 30 days and three commissioners you can change that how were you elected to the P.S.C. by Georgia voters Georgia voters do you think those Georgia voters are going to keep people on the P.S.C. that aren't protecting their utility race. And would they was there is there I was there method or reason why those people that are elected on the P.S.C. and given their role they to regulate the regulated utility Georgia power then why is it that you want the legislature to get out of our lane and and forced just for data centers not not anybody else but here's a here's a load that runs twenty four seven. The why do you think that we should we should go get in front of the voters with the public service commission they can respond much faster to these questions you know I would love to have an opportunity to vote for a public service commissioner but I haven't had that right to vote for a public service commissioner since November of twenty twenty two we've got three seats being held one by a commission who's never been a lot of people. And I think that's the only thing that I think that's the only thing that's been elected to the P.S.C. and who's never been elected to anything anything is coming. Oh when when I mean this is never happened in Georgia history has never happened in Georgia history that this kind of thing has happened where you have constitutional officers that have not been elected for three years just unreal unreal and if you can't hold them accountable find somebody else. Senators have questions for Mr Baker. I thank you and let's be respectful of our folks testifying for and against the I have sixteen people signed up to speak and all but one if identified themselves as in favor I don't have Mr Bond didn't say which side he's owned from the P.S.C. but let me first recognize Mr. Aaron Mitchell he spoke to us recently from Georgia power to let's hear their side. Then I'm going to call on Mr Tom Bond from the public service commission then I'm going to hit a few of the others I know a lot of you made efforts to be here we'd like to hear from you but we do have a limited time period. All right Mr Mitchell if you'll identify yourself and give us your thoughts on this committee sub and the proposed amendment. Yes sir thank you Mr. Chairman and members of the committee my name is Aaron Mitchell I'm vice president of pricing and planning for Georgia power. My team is responsible for planning to meet the energy needs of the state and our customers for the next twenty years as well as ensuring that the prices that we charge are appropriate for recovering the costs that we incur to serve each and every customer. I'd like to start if I may by by providing some clarity and some corrections on some statements maybe that were made earlier in reference to the thirty three hundred it's thirty three hundred megawatts of new generation that were approved by the public service commission last year. Those megawatts will be online by the end of twenty twenty seven to meet our customers needs beginning in the winter of twenty twenty eight that's December through February or March of that winter period. The important point that I wanted to make related to that is we will spend capital.\n\nBillions of dollars to install those 3300 megawatts. And we have committed that residential customers will pay nothing in excess to account for those 3300 megawatts of new generating resources. In fact, we committed that residential customers will pay less than they were paying when the public service commission approved that because we are able to install that new capacity and serve additional load to the effect of $2.89 less in downward pressure on rates because we are able to serve a growing system and a growing number of Georgians or growing number of businesses. The more that we are able to serve, the more that we can provide benefits to existing customers by virtue of those new customers coming online and paying their fair share of the costs that we incur to serve those customers. I think that is a really important point for this committee to hear in that we not only are growing our system, Georgia Powers made a commitment to provide downward pressure on rates because we are growing our system. And the public service commission has ordered us to provide that downward pressure on rates related to that 3300 megawatts of increased growth that we are about building right now. Related to pricing for large customers, large customers are different in that they are large. They are not different in that the pricing fundamentals of all utilities in this state and throughout the country is that the price that is offered through the rates for any customer must ensure especially for these large customers because the investments are large. Must ensure that we are recovering revenue from those customers that exceed the costs that we incur to serve them. Georgia Power and no other utility has any incentive to push those costs on any other customer in its system especially residential customers. In fact, we are incentivized to do the opposite to make sure that the prices that we are charging these customers for the large loads for the new generation that we are adding for the transmission that we are adding is not only sufficient to cover the costs but is sufficient to provide benefits to all other customers like I said that downward pressure in rates. What do you mean by the charges you are making sure that let us just call us residential customers are not paying for your additional power generation and distribution cost for these big users. Yes sir. How do you do that then they are not paying yet but you are having to build new plants according to your most recent plan in order to provide power for these new customers and that is big news. So how do you make sure that that doesn't get passed along when you are incurring the cost up front and then recouping it to your rates later. Thank you for that question. So we incur costs to build a new combustion turbine or a new battery energy storage system or any transmission we are not allowed to charge customers for that until that unit or that transmission asset goes in service to serve our customers. We are adding those additional assets to follow the load growth for Georgia and all of our customers but in particular to your question as these large customers come online when we have a new generator come online that follows the needs of these large customers. We are doing things by virtue of these rules and regs, changes that the public service commission ordered as well as how we recruit upfront costs from customers to ensure that those costs aren't spread to others. For example we build local transmission or onsite substations to serve these large customers. We require 100% upfront payment from those customers before we will build that asset and those costs do never go into the rate base and are not subject and there is no chance that they can be spread to other customers. Is that mandated by PSC rules and regulations or just the good-heartedness of George Powell? Well it's both. So there's been some discussion about the rules and regs and what it allows the company to do and the flexibility provided in the rules and regulations ensure that each of these customers are different. There is no data center that is the same. They are not spec. So every data center or large customer that we serve our engineers determine what's the transmission in generation needed, what's the cost to serve that and the tools in the rules and regulations ensure that we can adapt and charge more or upfront as those situations arise all to balance those costs from being shifted. While the rules and regulations provide us needed flexibility to ensure that we're charging appropriate rates, the commissions order does not. And so I read this last time I'd like to read it again. From the commissions order filed on January 28, 2025 approving the rules and regulations. The first main bullet point states that the company shall exercise a discretion under the rules and regulations changes. And a manner designed to protect existing customers from bearing any of the costs of adding these large customers. And so while the rules and regulations provide flexibility again the commissions order does not and the commissions order carries the full force of the law. I've got one question and I have at least two senators that have questions. Are you concerned that other electricity suppliers have a competitive advantage now against Georgia power in bidding for the large load clients or data centers under that new rule and regulation that applies only to you and not to them. And I think that's the case that you want they they could undercut you by not recouping those costs if they elected to. Certainly, Mr. Chairman, I can't speak for the other utilities. But like I said, no, no utility is incentivized to spread costs through other customers to your direct question. No, I'm not concerned. Georgia power will not serve a customer if we cannot recoup the cost from that customer for these large loads. Our price will be our price to compete for that load. It happens every day each of us in our daily lives choose other providers. But we will make sure. And our ordered by the commission that we can't charge them less for what it costs these large loads to be served. Well, you may never have another large load client or data center. Then if the MCs get wise to this and realize how much money they can get paid up front to recoup their cost and they don't have to set their rates in accordance with this new rule and regulation. Again, I think we are very competitive. We offer competitive rates, superior reliability and these rules and regulations changes were Georgia powers proposal. We started working on this in June of last year with the Public Service Commission. We want the rules and regulations to be applied because we want to protect all other customers and give some assurance beyond what we have today that we're protecting all other customers. For example, we're going to require collateral throughout the contract term such that if a company has to make a different decision and leave before our contract expires, that collateral will cover the cost of what they would have paid so that other customers do not bear. We're the force of those costs and so data center closes down, losing customers and new technology makes them obsolete. You still got them. Yes, they're locked down. Yes, and we believe this protects customers. Senator Albers, I'm going to recognize you for question. You feel free to have a follow up. It doesn't have a long dialogue and then Senator Dullesaw. I'll be brief, Mr. Chairman. Thank you. And thank you to you and Sister Ward for spending some time going over some of the numbers with me. I think part of the challenge here because after we had that conversation, you all reported your 2024 numbers. And I think this gets back to a core of people are concerned about the rising utility rates and if they're being driven by data centers and other things, how that's impacting the folks that we all serve, knowing in the last few years, the average family's gone up $500. During the worst inflation we've seen since the late 70s and early 80s, $500. But you all just did $11 billion increase and your profits increased $2.5 billion higher than you've ever been before. So my concern, I think why the author of this bill is here today doing these things is we're not seeing that money coming back to people. And I know you said you've committed to rates going down, but commitments to us really mean nothing until it actually gets back either on people's bills or they're getting something back in the mail. Now here in Georgia, we had a record surplus. We started sending money back to people. They're getting $250 back per person yet again. Plus we did it for property taxes. So I guess I want to know in all of this, you know, it's the old hey, just trust us. We're going to do the right thing. But I'm losing a little faith based on the numbers I'm looking at right now. So help me understand. Are we going to see a refund coming soon? So thank you, Senator. You're quoting the Southern company earnings, right? Georgia powers have peace of Southern company. I was putting the Georgia power numbers, but keep talking. You know, our profits are capped by the public service commission and any earnings above that 80% of that goes back to customers. Great. So when are we getting our refund? Yes. Any earnings for 2024 that were above what the commission has approved 80% of that will go back to customers that that proceeding goes before the public service commission. And we'll be taking care of an array proceeding on how that is distributed back to customers. All right. We want to get you far down the road. Senator Dulles, you're recognized. Thank you. And like German hours, one thank you for meeting with me. You guys essentially would you agree have a monopoly for your residential customers? Is that accurate? In the service territories that we and other electric providers in the state, the territorial at defines service areas where you want to. Yes. Yes. So help me understand the logic because I can't connect this idea that you're not incentivized to charge more for the residential customers who don't have a choice. So if you can then have lower prices to win the business of the non-residential customers that don't have a choice, it would seem to me that if you could have costs passed on to the residential customers that would provide a vehicle then for you to be more competitive on the commercial side and really have the best of both worlds. What am I missing in not understanding the logic on that? The Georgia power doesn't have the decision on how those costs or charges are allocated. That's a decision of the public service commission on what we're allowed to charge. Each of the customer classes based on the cost to serve those customer classes. Regardless of that, any large customer will pay their share of the costs and they will not be passed. If that's the case, why are you all here? Like I've had more lobbyists that were out. You guys have a lot of lobbyists to work for you. And I've had more of them reach out to me last week saying, please don't pass this. This is already taken care of. If it's already taken care of, what's the issue? Thank you for that question. The intent of protecting all customers is the same. We share that with the Bill's author and all of you. The reason we've been talking about the rules and regulations is to illustrate that there are mechanisms and tools in place to ensure that we are growing Georgia appropriately and ensuring that these large loads pay their share and all existing customers are protected. The unintended consequences of how this bill is potentially authored is customers pay for a share and access to our system. All customers use the transmission system. As the bill is written, it could be construed that if a data center or a large load requires any change to the system that they pay for the entirety of that asset, which means that they could be entitled to the benefits provided from that asset. So those benefits that I said earlier that we will be passing to existing customers and residential customers could be limited and provided only to the user that incurs or causes those costs to be incurred. That's the reason the intent is the same. That's the reason is that we don't want unintended consequences to prohibit the benefits that we have committed to, been ordered by the Commission and for C from the Growth Committee. So really your issues with line 17 and 18 which speak to this but for language such that a massive cat-backs could be contributed to data centers, even though all of that may not be used by the data center. That's right. So why aren't you lobbying for pro-rata language to be included in this bill that then recognizes the pro-rata nature I think of what you're getting to, which I think is reasonable, I think we probably would all agree to that. Yeah. Our system serves all customers and that pro-rata share of what you cause on that system is allocated to you or these large customers. That's our main concern. Okay. All right. Other senators having questions if not we've got several other speakers. Let me remind our audience be respectful here. This isn't a bunch of, you know, a play or something we're going to applaud every good line or cheer people on or boot people that we don't like what they say. Let's be respectful for all citizens being able to share their views. I want to hear from the public service commission, Mr. Tom Bond is signed up to speak. He spoke to us last time but now having sort of let it settle in a little bit just to hear your perspective. Mr. Bond, thank you so much for being with us today. Thank you, Chairman. Committee members. My name is Tom Bond. I'm director of utilities at the public service commission. I've had the previous committee meeting on this. Chairman Huffstler, Statter mentioned that he would be meeting with Chairman Shaw to discuss the bill. As discussed at that meeting philosophically the PSE is 100% behind this bill as evidenced by the change to Georgia power companies rules and regulations with modifications by the commission on January 23rd, which changed the terms and conditions for these large load energy customers. In 2023 when the commission reopened their integrated resource plan, the PSE held hearings on the tremendous energy need caused by data centers that is heading for Georgia. The rule change requests that the commission modified and approved last month is a direct result of those hearings. As discussed at the meeting of the chairman regarding SB 34, there is some concern at the commission that putting any rule into law can restrict the commission's flexibility to look at every situation on a case by case basis. The commission normally makes these types of decisions in an evidentiary hearing with expert testimony and weighing the evidence and making decisions that way. Although the chairman asked me to express this concern, the PSE defers to the will of the legislature on how you want to proceed with this. It's certainly within your authority and so we will do whatever you ask us on this. Any questions? Thank you for being here. Would you please stand by just in case we call you back up if anything comes in. Mr. Tony West, Americans for Prosperity. Good afternoon, Mr. Chairman. Thank you for the opportunity to speak. It's been a long meeting already. I'm the State Director for Americans for Prosperity, Georgia here to speak in support of this bill on behalf of our activists across the state. We support policies that increase economic growth and encouraging evasion. We're excited at the new opportunities for jobs that come when businesses expand or relocate to Georgia. We're optimistic at the possibility of legislation that will protect both average Georgia ratepayers while also maintaining our high standards as the best place to do business. Senator Albers had referenced earlier. Georgians have been really harmed by inflation these last few years and higher energy prices have contributed to that pain in their pocketbooks. We believe it's entirely appropriate for this body to take a step like this to ensure ratepayers aren't harmed further. Thank you. Any questions from Mr. West? Thank you for your views. Ms. Liz Coil, Georgia Watch. Thank you, Mr. Chairman. Commissioners, Liz Coil, the Executive Director of Georgia Watch. We're a statewide consumer advocacy organization and we've been intervening in matters of the Georgia Public Service Commission. I've been in cases and integrated resource plans and plant Vogel since 2010. I've been down there since 2012. So I've been through a lot of these proceedings and I can tell you from our toll-free consumer hotline, as you all know, your constituents are struggling to pay their power bills. There were some talk from Georgia Power and then questions about downward pressure on rates and a couple of dollars that were in the settlement that was reached in a special rare interim integrated resource plan when the company realized the one we just finished was not forecasting enough capacity need for these large data centers. So in that agreement, which we did enter into, because there were some good things for ratepayers, what it said was it'll put a couple of dollars down pressure on rates. But what witnesses wouldn't say in the witness stand was your constituents power bills are going to go down by that two dollars. It just means it'll offset by a couple of dollars. And let me tell you, now that the company has filed the next 30-year plan, we know there are going to be a lot of costs associated with it. And once we get through that proceeding, I think you all know at the end of this year we're going to have a yet another rate case. And in all the years, I've been down there at the commission for rate cases. People's power bills have not gone down. So I urge you to use the tools you have available in the law to make sure that Georgia Power's customers, and I do support the amendment that would apply this to EMCs and also the municipal electrics. Those people's power bills are going up too. And I think that that's a reasonable, I haven't talked with Chairman Huff, to see if he agrees, but I think that's a reasonable amendment. And I really do hope that you all will pass SB 34 today. Thank you. So what do you think we ought to do? Not on this bill, but as a state. We've got Georgia Power and all these EMCs that are busting their chops trying to get electricity out. We've had enormous demand. And in their RP, they've got a plan for more power else. We're not going to have computers anymore or any internet connectivity. Thank you. And that's really a great question. We are going to the state is going to need to generate more power. And that's going to cost us more money. Right now, it looks like the data centers by far are going to be the biggest driver. As I think Mr. Baker said earlier, we don't know what's going to, I mean, we didn't expect data centers even two years ago. The company had a smile on emergency IRP because we didn't know what was going to happen with these data centers. So one thing I can suggest to you is that the house has formed a special committee that will start meeting. The chair of that special committee said this summer, but they're going to be taking a really close look at the resource needs of the state entirely, but specifically as it relates to serving the resource needs of these data centers, these large load, data center customers, and it's not just electric. It's water and I don't know about you all, but my water bill's gone up to. So I think it's reasonable for this body to support Senator Huffsteadler's legislation because we know the company agrees, the public service commission agrees. The evidence is clear. We're going to need to find better ways to meet the state's electricity needs without continuing to harm the residential customers in this state who face some of the highest energy burden in the whole country. So why do you feel that that needs to be done in a statute or code rather than delegating that public service commission, which we have historically done and they are elected by voters to represent the consumers interest and the business interest? Well, I'm not going to get into that question about the last time they were elected. I will say that the commissioners have been known because they have that latitude from the this body to change their rules and change their decisions that affect the company. I have been in proceedings specifically when the commission's own staff, folks like Tom Bond, the public interest advocacy staff that started to look out for their residential and small business customers, but even their own advisory staff, I think that was in the last rate case when the staff did not want to settle with some of the things Georgia power asked for in that rate case. And commissioners instead made a motion that went around the staff negotiated directly with the company and that was a real disadvantage for Georgia's residential rate payers and I was there for that. Any questions? Senator again, you're recognized. Thank you, Mr. Chairman. Appreciate your testimony. One of the things, are you a Georgia power customer? Are you live on EMC or a meeting? I'm a Georgia power customer. I live in the city of Atlanta and my office is in downtown Atlanta, so I executive director of a nonprofit that is served by Georgia power and I'm personally served by Georgia power as are my parents. And I see. I mean, just so you know, my home, I'm served by an EMC, hard EMC. Well, what happens with the EMCs and I don't know all of our members know, but they're directed by board of directors. They are elected by the members of the membership of the co-op. And this is where for me works really well. I mean, I get to vote for who's going to set my rates and their customers as well, just like me. The amendment, you said you favor the amendment. One of the things that would scare me about putting EMCs or you know, I've been a city manager for 10 years, two different cities. One of the things that those citizens get to vote for who they won't representing them and then that goes into meagg said on to the meagg board. Let's get to your question. The question is is when I look at this, you'd be putting another set of rule makers in if you add in the EMCs and you add in the meagg cities into this. Does that not seem unfair that those those would be, you know, because the board of directors or the EMC, the city officials, they don't get they're they're being nipped by the public service commission. A couple, thank you for that question. The public service commission is, I know you know, but maybe not everybody else knows, the public service commission regulates the monopoly utilities. So they record, regulate Georgia power. The public service commission except in very minor cases, they don't recognize the electric member co-ops and they don't like regulate the municipal electrics. And let me tell you, people served by those other electricity providers also are facing higher power bills. They're also paying for paying for plant vocal. But one thing about this legislation is it does not mandate Georgia power or an EMC or a muni to serve these large load debt customers. So I really don't see given that it would be optional. It kind of levels the fine field EMCs may say, hey, it's not fair. We wouldn't we might want to serve these large load customers. And this is a competitive disadvantage if Georgia power has to follow these rules. You know, and if I like the territorial service, I hang on. I got a recognition light up your mic. Go ahead. Thank you, Mr. Chairman. The territorial service act assigns territory all over the state. And wherever a data center lands, they have a customer choice. But if they land in an EMC territory or a municipal city territory, then they're required to serve the load. Whether it's a customer choice or not, there's a default. If the land in Georgia power territory and nobody else wants to compete, then it's a it's a default for Georgia power to serve them. The what worries me about the amendment that we're talking about here is this would give would handicap the governing authority for the meag cities and the EMCs because you're putting them under the PSC as well. And currently they're not they never have been there's never been a situation where for rates. They go back to the PSC. Thank you for that question. And since I heard about the amendment today, I didn't see that part that it would actually put them under the PSC. What I think it does is it says that the objective of Chairman Huff Stettler's legislation. And I think we've heard everybody agrees that we don't want residential customers regular people of Georgia subsidizing these large load data centers. And those large load data centers as you said they could be they could be located in Georgia power territory that what the territorial act there's that exception. So if a large load data center can locate in Georgia power territory, but the EMCs or the munis could bid for that. So it's just leveling the playing field as far as I can tell. I will say that the amendment does not put them under the PSC. It has a separate code section. He's calling for it to make them follow the same rules. It does not set their rates in any way. They just must take into account the cost of generation and distribution of electricity to treat everybody fairly. That's all the center Lucas. I'll recognize you for question. Then we got got here at least one more speaker and then we'll miss having a lot of this is proposed to be confusing back during the day. Georgia power wouldn't even go to the rural community. Now you take the pig now you want to get it. You know I'm talking about the EMC they served the need because Georgia power wouldn't go out and serve the end of the land. Do you have a question for the speaker will have discussion of the bill here later but let's let these folks be heard if you got something from this call. No, I ain't got nothing important. No, it's important. I ain't got nothing. No, you've been here a long time. You got a lot of institutional knowledge so we value your comments when we get to that point of the situation. All right, Mrs. Patty Durand. I'll tell you before you get here went to legislative prayer fellowship this morning they told us to remember always to turn the other cheek. You are a candidate for the Public Service Commission. No, sir. I'm not the election was canceled in 2022. I want to correct Bobby Baker the last time anyone voted for a public service commissioner was 2020. Okay, are you a candidate for districts? No, I'm not. I'm not a candidate for district 46. We've seen you calling for challengers and those two districts. No, sir. I'm not a candidate. I'm not running. You have views on this bill. Yes, I have some handouts for the commission if I may give it to you. You're going to need to you had to have those in our office before noon yesterday but just put them on the table up here if somebody wants to get one on the way out there be free to.\n\nMy name is Petty Duran and I run an energy consultant seat called Cool Planet Solutions. Before that I ran a nonprofit in the energy space for 10 years called the Smart Energy Consumer Collaborative. We did research on consumers in the smart grid before that I worked at Georgia Tech for a year on smart grid topics. So this handout that I have for the committee is to show a Georgia Power Bill, a residential bill with 1,200 kilowatt hours that month and it does not show rates, it does not show tariffs, it does not show surcharges. And what I want the committee to see on this bill is that there is a lot of information that's missing and so that allows Georgia Power to make claims like our rates are 15% below the national average but what does not get included in the bill are the surcharges, tariffs and other fees. So it is deeply misleading to say that Georgia Power bills are below the national average when the residential bills are not only the industrial bills are below the national average because they get the marginal rates that Bobby Baker mentioned. So I have that demonstrated on the bill, on this handout. So if you go to page 2, what you have to do of the handout is you have to go to the Public Service Commission's website to go to their electric service rate calculator where you can enter in your information and then click calculate and then the rate calculator will actually show all the details of the bill. And that's where you'll find on page 2 this fuel cost rider that I've circled in red. The fuel cost rider is over $50 this month, that's for one month just for gas and if you calculate $50 out of this bill that's about $195, that is a 26% cost on the bill that is not included in the rates. So therefore that is my evidence to the committee that residential rate payers pay a lot more than what is advertised as the lowest cost in the country. It is deeply misingenuous. Let's move on to the last page because what I really want to share with the committee is that since the Consumer Utility Council was repealed in 2010 and I know we're not here to discuss that legislation and thank you for passing it out of this committee, residential rates have increased 57% almost twice the rate of inflation over that period which was only 31%. And I have the sources below the table. And this is 2023 data. I don't have 24 data because the AIA, the Energy Information Administration doesn't post last year's data until October the following year so I won't get that data till October. So this does not include plant vocals rate increase. So if you look at number two on this last page, during that same time period that residential rates increased 57% industrial rates or what Bobby Baker refers to as marginal only increased 6% far, far below the rate of inflation which I see I forgot to update on the table. It should say 31.6%. So that is one example of how that Georgia power is cost shifting to residential customers from industrial customers. That is a clear example. And I want to make one thing clear. I've worked in energy for over a decade, almost two. Because no such thing is downward pressure on rates. That is a thing that Georgia power just makes up. There's not going to be a refund to Senator Albers question. There will not be any, in fact I was surprised to hear the Georgia power witness talk about the couple of dollars in what they call downward pressure on rates because that was actually a tax refund from Governor Kemp that they are required to pass through to Georgia power customers that they are now claiming as part of their downward pressure on rates. That is completely false. It is not because of anything to do with Georgia power. It has to do with Governor Kemp. And then to the bottom part number three on May 1st of last year, the day after Unit 4, reactor 4 and plant vocal went into service, Georgia power passed the largest rate increase in US history, definitely in state history. But I couldn't find anything in any state that was larger than a 23.7% rate increase for one unit of one power plant. Let's just throw both units in there. And since then, since that enormous rate increase, residential disconnections have soared over 30% from the prior years number. And I have a little snippet here of the disconnect report highlighted in yellow so you can see that about 20,000 people get disconnected. Those are households. Let me correct myself, not people. Every single month from Georgia power for inability to pay. Almost 200,000. It would have been 200,000 if Georgia power hadn't done a moratorium because of Hurricane Helene. And that is almost 10% of their customer base or 10 times the national utility disconnect rate of 1%. We have a very big problem with residential rates in Georgia power in Georgia. And I want to just make sure that you're aware that since Commissioner Johnson was appointed to the Commission by Governor Kenpin 2021, there's been no election. He served now five years. He's voted for $20 billion of rate increases for Georgia power customers without a single Georgia voter voting for him. So is that the one you want to run against? The Commissioner Eccles has served for nine years without an election. You in favor of this bill? Yes, sir. I would like you to pass this bill to protect residential ratepayers. Do you think it ought to apply to EMCs and municipalities as well as Georgia power? I'm not sure about that. I'm worried that EMCs, one thing that has not been mentioned, EMCs are nonprofit. Municipals are nonprofits. The only for-profit entity in this room is Georgia power. So EMCs have no incentive. In fact, the all five commissioners pay their bills to electric membership corporations. Georgia power customers have no representation on the commission. And their bills are all 20% below our rates. I meant to bring that today, but I forgot. Questions by committee members. All right. Thank you for being here. I'm going to call one more witness because I'm at 1220 and I have called seven so far out of the 16. I'm picking at random John Duke because you were the third person to sign up for you here. And unfortunately you stood up. You were speaking for the other six people that are listed as citizens. Give us your view if they got peltched they should just pass them to us directly. Wow. Appreciate it. All on you, Mr. Chair. Yes, sir. A little bit of pressure here. I'll first of all say, thank you for calling me in Senator Coward. Yeah, I like the way you run this hearing. It's very, very well run. What is it? Coward's shirt. I'm sorry. Coward's shirt. You say that because I called you to speak, didn't you? No, I really do. I try to be fair to all sides and hear it. Yeah. We're honoring every center that brings legislation before us deserves to be able to present their case. So let's hear it. Well, so I'm a hydrologist. I build FEMA floodplain maps for engineering firms in 26 states. But I've got a 1925 home that I fully have fully electrified. I've put in nine car chargers for people. I'm not an electrician, but do it for friends and family. And so sort of as a hobby, I guess I've been following electric markets. And this is so just giving that background that I do have a little bit of knowledge. And I've also been to several public service commission hearings and set through hours of those things. And I'm not a lobbyist. I mean, just doing this voluntarily. And I've watched those hearings. And they've been pretty shocking to me. They've been pretty enlightening to say the least. And that's why I'm for this bill here. Although I think this bill eats at the edge of the real reform that we need. But maybe I can touch on that at the end of my comments here just a little bit because you ask about away forward. But in the reason I think that, well, the reason I think this bill is needed is because I've been to these public service commission meetings. And I'm spoken at them. And by and large, the public service commission ignores everything from their staff, expert testimony, citizens comments. I mean, I don't want to use the word corruption, right? I mean, really we shouldn't go there. I'm trying to avoid that. But it feels like these public service commission meetings are show trials, honestly. And Georgia Power is not going to do to your point out of the goodness of their heart. And there needs to be the shouts and the mists in the language. It has to be. You're not serious if you don't. So I mean, obviously there's some senators here who are not for this. The question is why? What, who are you fighting for, your constituents, or for Georgia Power? I mean, you really need to ask yourself that. This has nothing to do with partisan politics. Does it? I don't think so. I mean, you don't even know who I am. I don't know how to vote. Heck, I'm probably more conservative than most of the Republicans here, no matter how I vote. I mean, but this is why this bill needs to go through because I've seen these public service commissions. Their own staff told them to abandon plant vocal, like South Carolina did. South Carolina literally buried $6 billion in the ground because they cut their losses and walked away because the plant could never pay for itself. And by the way, plant Votal will run for 60 years, full blast, and on the last day of its operation before it finally retires, it'll finally pay for itself, maybe. And so the public service commission was told abandon this. This is just an example. But if I may, I don't want to take, I'm sorry if I'm taking too much time. If I may, I wrote an op-ed of what I think is real reform. And I would just like to read part of it. I won't read the whole thing. But this is what it says. I don't know why the public service commission does not seem to have the people of Georgia at heart. But what I do know is that the world is transitioning to clean energy due to affordability and reliability and the races on. For example, in Texas, red state Texas, oil drilling Texas, the Electric Utility Council Reliability Council of Texas, AirCOT, runs an island grid that depends very little on interstate transfer of power even during times of peak demand. They request bids from power supply for supply and given day and power producers send them in according to how much they can provide at a given price. AirCOT stacks the bids from cheapest and most expensive until they fill the quota. From the power producers or paid the same price as the last electron no matter who bid what. This process called the uniform price auction makes their grid work on performance and not on how much money was invested in a particular power source. They let the power providers figure that out. Since the fuel source for renewables is free, the profit margin for a renewable energy company is high even at a lower bid price than what is offered by a fossil fuel plant. So I won't keep going on in my whole op-ed because I'm really in this op-ed also trying to advocate for the renewable energy. But the point of the op-ed is clean energy wins on economics. But this is the reform that we need. Take away all subsidies. Take away all subsidies to all power sources and let the free market truly reign if that's what you believe in. And at the end of the day clean energy will win and so will the consumers of Georgia. Thank you. I appreciate you being with us. Last speaker I realized the EMCs have been mentioned here and they've got to remember that directly effects and I think they have the chance to be heard. Mr. Curtin, if you could try to hang in here for just two or three minutes. Now come on. I'm trying to wrap this up by 1230 and vote on this one so we can do another one. But I need to hear your viewpoint. Both do you think these rules ought to apply to George Power and do you think they ought to apply to your EMCs? To directly answer your question, Chair. Hi, I'm Kevin Curtin with the Georgia EMC just to introduce myself. I represent the 41 lecture co-ops in the state of Georgia. We do not have a position under underlying bills in a bill 34. Although we are opposed to the amendment and let me explain why. It is very much having to do with our structure. For almost 90 years, this body has trusted the members of our co-ops to elect board members to set our rates terms and conditions. That process has worked extraordinarily well. Our rates are extraordinarily competitive. Our reliability is second to none. Having a law imposed on us on this particular issue takes away our boards of authority to make decisions on behalf of the co-op. Therefore, we are opposed to the amendment. We believe that trust, which has been embedded in our boards for 90 years, should remain with our boards. I will also point you to 46, 3, 11, which is the code section you're trying to amend, already essentially requires us to treat similar customers in a similar manner. So that's already the law. And we filed that law for many years with no problem. The last thing I mentioned is, are we solving a problem that doesn't really exist? Of the co-ops that serve the 41 co-ops that served Georgia today, 4.4 million Georgians, they serve one data center that would follow this bill, one. As of now. As of today, correct. All right. I beg your name, Mr. President. I beg your name, Mr. President. Any point, any point, questions? Thank you. Senator Huffsteadler, will you just do a quick wrap up? And then we'll see if the committee wants to move on your bill. So right after the Consumer Utility Council was defunded in 2000, as we've talked about, there was another bill that passed in 2009 that allowed a financing method that had search charges. I know there was a statement that they're not allowed to charge until it goes into service. This actually did. The legislature intervened and allowed it to pay interest, profit, and taxes on the profit. It's supposed to end in 2017, but continue to until now. And in addition, we've got the 60-year mortgage on it for the residential and small businesses. Now the profit on that was supposed to be 5.8 billion when Vogue was built because of the cost overruns and the delays the profit actually doubled. I don't know where I've seen a system in this country where you get more money for being over budget and behind schedule, but that's with the add-on, that's what it was. And so we then got involved. I know some of the others, including our previous chair of appropriations, said people outside the legislature and end that that wasn't, that was part of the worst bill he had voted for, others said similar things. So we passed in 2018 Senate Bill 355 that put a sunset on that financing message. It was way of letting those guys kind of make a statement, yeah, maybe this wasn't the best way. But I know Senator Albert has talked about the profit on Georgia Power, which is the majority of the profit of Southern Company, but it was a double digit increase to 4.4 billion, which came from our ratepayers with multiple rate increases. Again, we've got the thousand megawatts that they're paying for that's going to be used. We've got the 3,300 it was talked about. And I know people have beat up on the PSC and they've frustrated me at times too, but I want to say that some of this stuff was inherited. I think Chairman Shaw is trying to address this. I believe they're seriously working on this right now, but I do believe as in the previous bills, the legislature has a role as well in this in protecting our citizens as we have had bills in the past involved in it. So I urge you to support a simple bill that simply says the cost incurred by data centers will be paid by data centers. For those of you that vote no, I'm going to ask what's your plan. Georgia State that provides itself on low cost and low taxes. Now number four in residential bills. Should we wait until we're number one? This bill does not cost Georgia power a penny though. It just codifies into law where the cost would come from. It's certainly within the legislature's purview to set parameters around energy. And this does not set rates, but it does provide protection from cost being charged again to our residential customers in our small businesses. With residential power bills, we're now as we've said in the five highs in the country. Our citizens are pending on you to protect them from these costs. I'll ask you support this bill. Thank you. Are you do you have an opinion as to the amendment? I'm not the expert on the EMCs. I've heard statements both ways. I guess I probably need to be neutral on that at this point. I'm concerned of it what it might do to the underlying bill, but I'm. You would say I'm probably neutral on it overall. I'm just not and actually I haven't seen it as a whole either. Senator Dullesall, you're recognized for question. Thank you, Mr. Chairman. Thank you, Chairman. I'm wondering if line 21 is unintentionally doing what the gentleman from Georgia power indicated was his concern. And it would allow in the cases of large cap-backs is for new facilities. The sole placement of that cost on the data centers and I'm wondering why the bill doesn't speak only to the pro-rata. Percentage. Well, as far as the data centers, we were told that 80% of the cost coming we're going to be from that data centers. And that's why we were looking at them as a whole. So. I mean, if I could blow things up and have a whole new right structure, I would do it. But I was really trying to protect the consumers from the biggest major cost coming on board, I guess. I understand what you're trying to do. Do you understand? I'm not sure if you've caught my question though. Right. Explain your pro-rata what you're saying. I'm saying that there's really there's an there's an or proposition in here that it's either the charges need to be recovered solely from the data centers or pro-rata. Based on electric demand. I'm curious what the scenarios are. It wouldn't always be and why it wouldn't always just be pro-rata demand and when it would be solely. Because if the pro-rata is 100, then it's 100, then that gives you a path. So what you recommended changed the language there? I would probably need to think through it a little bit more, but I just want to fly that for you. The second thing I wanted to ask is this 100 megawatt or greater metric that's on line 26 and 27. What percentage of data centers do you think that that captures? In other words, what's the scale that this would capture and if the concern is data centers, how did we land at that 100? That's obviously that's a massive one. We heard testimony. Right. I think it substantially gets all of them. I think we were trying to have a number that would capture pretty much all the data centers. I think I can answer your pro-rata question as I understand it. The OR says they can either solely collect the costs from the data center or they can take a pro-rata and perhaps if they're not using 100% of the new cost, it would be fair, but it gives them the option to go one way or the other. And I guess that would be the choice of the provider. Senator Summers, I'm going to recognize you to discuss, well, we'll just wait. Let's do first things first. Is there any motion by a member of the committee either do pass or do not pass for this bill? I got a motion do pass from Senator Albert second by Senator Sims and this is a motion to do pass substitute SB 34. LC 550460S before further discussion, would you like to propose your amendment, Senator Summers? They don't have to, but you can. Mr. Chairman, Mr. Mayor. It's in our folders and we'll label it as a amendment one. Amendment one. I need you to get to the podium because we're going to have to ask you for an explanation. The simple amendment is, as we keep saying in this committee, we're here to protect the consumer regarding data centers. And we had a conversation today, is that data or data? Either one we're going to protect, we're going to protect across the board on data centers. And that's what this amendment was about and to make sure the code section is right, we've asked our legal counsel Nick Tate to explain the amendment. If you will, Nick, please. Certainly. So this amendment would take the language online 13 through 27 and it would create a new section of the bill that would insert this language as a new subsection to code section 46113 with a couple changes. 13, notwithstanding the provisions of code section 46311 would be switched to notwithstanding the provisions of subsection A and B of this code section. Electric utility online 14 would be replaced with electric supplier approved or allowed to go into effect under code section 462225 or 46226 on lines 19 and 20 would be replaced with of the electric supplier. And then lines 13 through 27 would be replaced with following language. No rates for charges of an electric utility shall be approved by the commission or otherwise allowed to go into effect under code section 462225 or 462526 unless such rates for charges comply with the provisions of code section 46311. Now talking to us, what is that? This is our legal wonderkin to our committee here. Nick is wonderful. He's been with us for a couple years and he knows how to put into the code, the language that we're trying to tell him locally. Am I right that this makes the same rules? Why you taking the same language? Great the new code section that applies to EMCs now. Yeah, that's right. It's taking it's taking the current language and putting it in a different chapter. There applies to all electric suppliers. And am I right that this does not put the EMCs under the supervision or control of the public service commission? No, it does not. It's the state legislature by imposing the same standards on all utility, I mean, power providers. Right. It's just making the new language applicable to all electric suppliers. Okay. Any questions for Mr. Tate? All right. Then we will first deal with the amendment. Is there a motion for amendment one? Motion. I got a motion's opposing amendment one. Is there second to that? All right. There's no second. So we will deal with the underlying bill. The motion is a due pass by substitute SB 34 LC 550460S. All in favor raise your hand. What you got discussion. All right. Let's hear it. Thank you, Mr. Chairman. We had a couple of questions. One by our citizen and one by the author of the bill. And I wanted to address both questions. First question is, you know, why would we vote no on this bill? And for me, it's not what we're trying to do in this bill. It's the fact that we continue as a legislature to delegate authority and power to the PSC. And then when we don't like that decision, we go and try to change it. And I think that's the case here. We saw it with I think the last time I remember delegating powers to the PSC was was poll attachment fees. And maybe we've done it since then, but that's the last one that comes to mind and I fought diligently against the committee and on the floor and lost that battle. And then many people came that were in favor of shifting that to the PSC and didn't like the decision that they ultimately made, which I did like the decision they made. And again, it's just the fact that we're giving the PSC authority and then we're coming back and saying, we don't like it. We're going to we're going to overturn what you're doing. And I don't I don't like that number one and then two of the author of the bill said, what is your plan? Well, my plan is if we're going to continue to give authority. Well, number one, I think we should quit giving authority. I think we have a better process here in the legislature. It goes through two chambers. It goes through two committees in each chamber and it goes on the floor. There's no better process than that. That is the most transparent and heavily vetted process that there can be and it is certainly better than the process of the PSC. So the plan I would say is we quit giving authority away at this level. And that's that's the end of my discussion. Other comments or discussion? All right. All in favor raise your hand. I'm counting eight page. All right. All opposed raise your hand. One, two, three, four, five, five opposed. So your bill passes committee will move on to the rules committee. Do you have the energy left to hear your second bill on the agenda? I wish I was that clever to be intended. No, that was just a 40 and slip. I'm going to give you just a minute as the crowd clears out. We're going to be here in Senate Bill 162. CLC 520744. Thank you. Yes, birthday, boy. Senator Goode, so glad to have you. We're not going to make them sing. We should have while we had all the big crowd here the entire choir. Happy birthday to you.\n\nI don't think I had you mind. Number four, I'll tell you what you're going to do. So while we're waiting for order to be restored in the room, I'd like someday, when we have an hour to kill, for this body to have an open discussion about how we got to where we are with all this energy policy in Georgia for the history of it. One, we shut down perfectly fine running energy plants. Co-plants are being shut down across this country. There's a federal policy depends on who's in Washington, whether we should have solar panels everywhere, whether we should have nuclear power plants everywhere, not any at all. We're being forced to close co-power plants. Seems like if we to kept those co-power plants running, our cost of energy would be lower today in Georgia. But some of the people that testified for this bill today were against co-power plants, and they're against solar nuclear power plants as well. So I feel like nobody has a strong plan for where we should be in 50 to 100 years down the road. I'd love to have that discussion with the experts. We spent a lot of time last year to look at how we're going to power up all these electric vehicles as well. So it kind of blends in. That's part of our job. So we'll see if we can find all that extra time. All right. I'm cross over this way. Senator, that's the first thing. I'll try to be quick on this. There's a much simpler bill for a couple of reasons, though, is I'm actually not going to request for a vote today because in working with a composite medical board in the Georgia Hospital Association, there's a couple of things we want to do to it. But let me go to what we've been working on. We've been working on this for over a year. Right now, you've got a system with physicians, physician assistants that the composite medical board has had a leadership change in the last year. And I think we're working on getting into the modern air. I think they're doing a great job. As it is now, you might be seven months getting credentialed somewhere. Sometimes I've seen it longer than that. When I actually went to work at a hospital across town, I didn't throw in half a month, but maybe I've got connections, I don't know. But this system that they're going to put in place has been proven in other states. It works pretty much everything I do is stalled them from one of the other 49 states. But it works in other states. The composite medical board's been very proactive in trying to get it in place. And we feel like that they will have somebody credentialed. I'm sorry, there's licensing which they do, and there's credentialing which the hospitals or other health care providers do. They do the licensing. So I need to keep my terminology right on that. But we think the licensing will be done within 30 days. And I really think it will be within two weeks at their point. The other substantial change we're trying to do is, and we've already tested this out with the medical students, the dean of the Northwest Georgia campus. These medical students go in a hospital. They send other paperwork, they're transcripts, everything. And then they go to the next and do the same thing. They do it 15 times. It's crazy what we're doing. And nobody's sat down and said, why are we doing all this? All that data will be online. And one other problem with the previous system is it didn't kick out if he were deficient in something. Somebody would sit around for weeks or months and call what's going on with my application. They actually had to manually go in and try to figure out what was going on. This system will let you know of any deficiencies that are there. I think they're really putting a good system in. But we've done this. We're now our medical students as guinea pigs in this are credentialed wherever they go now. And it was cost them hundreds of dollars per hospital to go through this process. So we know it works in this state on a much smaller scale. The biggest change we're looking at is that you would be and we certainly want to do this with a nurses too, but they're into the Secretary of State. And I think Chairman Tiller and Larry Walker working on that side of it. Where you would be credentialed, if you're credentialed at one facility in Georgia, you would be credentialed at all facilities in Georgia. But we would also allow the hospital to have additional requirements if they want to. And I think I've heard from the composite medical board that could even build that into their software that the hospital could have their own unique requirements. So we've done this with the students already. We're going to move from, as it is now, somebody you talked to them from out of state and say, well, I'll see you in maybe seven months. Well, it's hard to hire people that way. It's a huge workforce issue for us. Somebody goes on pregnancy leave and somebody tries to get credentialed there and the baby's three months old before they get credentialed. It's not really working in that manner either. So I want to applaud the composite medical board for their hard work on this over the last year. Dr. Grookes is not here, but he's one of the physicians that's on that board and he's certainly been instrumental in making this change go forward. I've got some changes that we need to make to it in a couple of lines and I'd like to obviously get this moving, but I don't feel comfortable with it today. And I know the... You're running out of time. I know. And the Georgia Hospital Association, I think maybe you see here, I know the composite medical board here and maybe they can speak to it. Nobody has signed up to speak to this bill, but you do. Okay. If somebody's here that wants to, I'll give them a chance. Come on up and get ready. Check you go ahead and finish your account. I'm basically finished if they want to talk and I'll... All right. If there's any questions, I can answer those two first. If you'll take the podium, identify yourself and give us your views. Thank you, Chairman, members of the committee. My name is Ryan Miller. I'm at the Georgia Hospital Association. We just wanted to support Senate Bill 162. Thank the author for his hard work. We appreciate the effort to streamline the licensure process. Questions? All right. Thank you for being here. The sir. Hey, I'm Jason Jones, the executive director for the medical board. We had been working with the senator on some changes to it, but for the premise of it, it's good because we are moving in that direction where we're gonna license quicker a brand new system. It's gonna make things more streamlined and the credentialing side, we don't do that, but we believe we can build it into our system to where everything will be a smoother one system, go to one spot to get that. So I think it'll speed up that process. We just gotta tweak it just a bit. But we're moving in that direction to make things quicker and more efficient. So I think we'll get there and this is just part of that. Push to get there. What's credentialing mean? Is that licensing given of medical licensing? So credentialing is when a hospital takes all that information, such as licensing, schooling, certifications, and they compile that together to say they're good for that specialty at a hospital. We don't do that. We just do the licensing part, making sure that they have the education and credentials for the licensing, but hospitals go a little bit more in depth as far as the specialty that goes. So this isn't like given somebody hospital privileges to see patients at your hospital or is that what we're talking about? So that's what we're talking about. Yes, sir. And we don't do that in medical board, but we're hoping we can contribute to it. Senator Albus has a question for you. Thank you, Mr. Chairman. It's more of a comment for those of us that haven't been fully aware of the composite medical board for many years. They were a bit challenged. We were not getting the type of service innovation. It was really selling things down. Since our new executive director, Jason Jones, has taken over, it has been a 180 degree shift. Things are on the right path, though. It's a thank you for you and your team we're doing now. My constituents are very happy by the work you're doing. Thanks, sir. Other questions? Senator Lucas, you got any views on this one, brother? That was sad. All right. Hello. I'm for making, you sure? No, no. We thought you must. Born a race. We thought you were in Senator Albus district, therefore a minute when he was complimenting you so much. All right. Nobody else being signed up speak? Are there any other questions for the author? Can I make one other quick comment? Tell me what a memo you wanted. Is it a very small change? What's the look of? Well, we've got to take out. They do protocol agreements with nurse practitioners, but they don't really license them. Last time in other boards, I need to take them out. What line are you talking about? Well, in a couple of places, we've got them listed. And I got to go back. I had a sub that actually had that in, but I didn't get it to you, so I didn't want to do that today. But you'll see them on the first page listed as protocol agreements for licensing for advanced practice nurses. And we needed to take them out. We needed to change that line 12 from credentialing to licensing, because this is the licensing part. And I mean, we could fix it in rules if you want to do that. It's just a few technical things. It'd be the prison commission. I will. One other comment I want to make real quick is we had the hospitals, the CEOs, really want this. And they said, we'll change our bylaws if we have to to make this work, because we can get people almost immediately. No hospital had to change a single bylaw to make it work for the medical students. OK. I'm going to recognize Senator Summers for a question. It's a brass. Senator Brass, I'm sorry. We changed this matter. I was just going to go through some procedural stuff. It's no questions. But as far as timing goes, if this bill were to move out today, it would get reported out of committee tomorrow, second red on Friday. We would have time to move it in standing rules. We could make changes there if the committee were in agreement to move the bill along. And I only suggest that if the committee does want to move it along, there is time to do it. And then it doesn't clog up your committee, Mr. Chairman. All right. And I do have some changes in red here, but there's half a dozen of them. I don't know. OK. Pass them up here. OK. I'll tell you what, we can probably make it simple. We can take an amendment from the committee to change that credentialing the licensing on line 12. That'll get you going. You also wanted to take out the date there of no later than July 1st. Well, that's what the composite medical board wants to do. I'm trying to look at the goals. But I'm OK with that. OK. All right. We will accept an amendment from Senator Albers here when the time comes. And then you can even deal with it in rules committee and also on the floor to make your other judgments. We'll at least get you where we know what we're talking about as I understand it, you would want to change the word credentialing to licensing at line 3 and at line 12 just to clarify that no manclature, right? OK. So what's the pleasure of the committee on the passage of the bill? I got a motion to pass by Senator Albers and a second. Senator Anderson. OK. And now would you like to propose your amendment? Senator Albers is at it, line 3 and 12. 3 and 12, the question is questions. All right. Is there a second of that amendment? Seconded by Senator Summers. All in favor of the amendment. Raise your hand. Any opposed? All right. So we got you partially amended anyways, so we're at least directing it the right subject matter. Any further discussion on passage of this bill? All right. All in favor of the do pass Senate bill 162 that's LC-52-0744 as amended. Raise your hand. And that appears to be unanimous. Thank you. That was very quickly done. A lot more efficient than your last one. But no more important to certain people, right? Senator Harborson, you have this room for committee. And I think we are just about encroaching on your time. I got one minute left. What is your committee? The... We got it. I don't know that. Yeah. I got state instruction on annual bill in the past. OK. With all the properties, we got one important issue in there as well. OK. Are you willing to see five minutes to me for Senator Jackson? About four and a half minutes. We're going to get four and a half. Senator Jackson, I wouldn't do that without the permission of the dean, but I noticed you sitting here the whole time. Yes. He's gracious enough to give you four and a half minutes to present Senate bill 142. We'll have to take testimony later. But at least educate us because we are on a time crunch. Yeah. Thank you, Mr. Chairman. And thank you all so much to Dean for seating a bit of your time. We've heard this bill actually in brief in this committee last year. But what this bill does at its heart is it creates a pathway for any individuals who were trained as medical physicians internationally to be able to have opportunity for a license here in Georgia. It is also geared towards making sure that those physicians who do come are able to work in places where we need them. So it's specially and specifically tailored for folks to only be able to have this limited license in a place that has a high need. So they have to be in a rural area, a place where this underserved. So it really is geared towards. And this came out of a recommendation from the Rule Health Committee study committee that we did, I guess a year and a half now ago, to try to help make sure we can get more physicians online in places where we need them desperately across Georgia. It's a two phase, a two tier process. So the first two years, it's a limited license or provisional license. Now mind you, you have to be, you have to graduate from medical school. That's absolutely essential. You also have to have worked. You have to have been licensed and worked as a physician in your home country. In the country that you came from. And we've confined it so that in the original bill that we had last year, we weren't very clear about how recently you would have needed to work. So we've narrowed that and said, if you need to have worked within three of the last seven years. So we've narrowed it so you can't say I was a physician 10 years ago and I want to come and start working tomorrow. We've said you had to have worked within the last three or seven years. And then you can apply through the medical composite board for a provisional license that would only allow you to work in these places where we need them. And that, of course, you'd have to be hired there. The institution would have to hire you and agree to take you on. They'd have to have the capacity to be able to supervise you, of course, in that process. And then after two years, while you're doing that, you would have to pass some medical exams. So there's step one and step two medical exams. So there's a process. There's some safe guarding in place for us that will help make sure and ensure that these folks are up to standards, if you will. And then there's second two years. It's kind of what I think of. I have a brother-in-law who did his medical degree, did residency. And then in order to get his loans paid back, he had to go and work out in rural Indiana. And he worked four years in rural Indiana and they paid all of his medical loans, right? So that's what I think of this next second years. So the first two years, it's you're getting your supervision, you're taking step one, you're taking step two. And then the next two years, again, you have to be in a place where we need you. So you need to be at a federally qualified health center or you need to be in a rural hospital. You need to be in a place where there is need. And you serve there for two more years. And that's kind of the commitment to Georgia, right? And saying, we created this process for you. We've helped kind of smooth this way. So we want to make sure. And what we also know, and this is true, certainly for my brother-in-law, is when you keep a person in a place for about four years, that's often long enough for them to put down roots and really build a family there. And so my kind of seeker, hope here, is we experience people to these smaller little areas that needed a doctor and they find it to be home and they stick around so that we can continue to really fill in this gap and this need that we have for physicians. So that's the general overview. The, of course, there are details here that I'm happy to go through if you would need me to, but that's the overview. So it's essentially a provisional type license to practice medicine in Georgia. That's right, it's a provisional license to start while you're getting the rest of your credentialing. So you are having to take these exams that are, these are national exams, right? So step one, step two, and while you're also working, you do step three before you can get a limited license. And then after that, you can actually apply for a full license. So it's not an indefinite, like forever, you have to be in this limited position. You can then apply for a full license. So it's two years to start with and an additional two, if you go to a highly needed area. Yeah, you actually need to be at a high needs area both times. So it's really four years of being in a position in a place where we need you. But there is additional supervision requirements on that first two years in particular. I know we have a number of people sent up that would like to be heard on this, just looking roughly at my chart, it looks like about five or six people. So we're going to have to postpone action on this. But thank you for presenting to us. Committee members, don't throw it away. You want a question? All right. Senator Summers has a question. I just mean a smart other question. Just to be able to find out. No, no, I'm just curious people in the audience. I would raise your hand if you support this bill. Sir, this action has. I just curious how you all are here for it. And those that don't support it. That's a good sign. Thank you, Senator. Thank you. With that, we are adjourned. We still need your RSVPs for the dinner tomorrow night. Please let the page know.",
  "updated_at": "2026-02-13T15:54:32.998356+00:00"
}