{
  "video_id": "UHYZ7_4dFdo",
  "url": "https://www.youtube.com/watch?v=UHYZ7_4dFdo",
  "title": "Sen. Josh McLaurin Press Conference | 9/19/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 13,
  "summary": "Here is a structured summary of the key points from the Georgia Sen. Josh McLaurin press conference transcript:\n\n**Overview:**\n- Sen. McLaurin held a press conference to discuss the impending deportation of journalist Mario Guevara by the Trump administration's Board of Immigration Appeals (BIA), an executive agency. This is seen as part of a broader pattern of the administration's attacks on free speech and the press.\n\n**Key Actions:**\n- The BIA has issued an order to deport Mario Guevara, a journalist who has been legally residing in the US for decades, with no notice or explanation other than a 13-year-old deportation order that had been paused.\n- Guevara has an active federal court case seeking habeas relief, which the BIA is proceeding to ignore.\n\n**Bills Introduced (First Reading):** \n- None detected.\n\n**Notable Moments:**\n- Sen. McLaurin is joined by Richard Griffiths, a representative of the Georgia First Amendment Foundation and former immigrant journalist, who speaks about the troubling pattern of attacks on the press under the Trump administration.\n- Griffiths expresses how \"dispiriting\" it is to see a journalist thrown out of the country for doing their job.\n- There is an emergency hearing underway in federal court, with the ACLU and other organizations seeking a temporary restraining order to stop the deportation and allow Guevara's case to play out.\n\n**Votes:**\n- None detected.\n\n**Attendance:**\n- No quorum notes.\n\n**Adjournment:**\n- No adjournment information provided.",
  "transcript": "All right. Good afternoon, everybody. Thank you for being here on short notice. My name is Josh McQuarran.\nI serve in the state Senate for North Fulton County. We're here today because the Board of\nImmigration Appeals, which is an executive agency under the Trump administration, has issued an\norder to deport journalist Mario Guevara today with no notice, with no explanation, except that\n13 years ago, Mario Guevara had a deportation order that has been paused since then. Since then,\nHe has been legally in the United States doing journalism spending time with his family\nand just being a citizen without a criminal record. And he was arrested on some trumped-up charges\nthat have since been dropped in June and was put into ice detention at that time and has remained\nin ice detention awaiting his opportunity to clear his name and go back to living as a productive\nand responsible citizen in the United States where he has been for decades. Today with no warning\nThe Board of Immigration Appeals decided that it would dredge up that 13-year-old order and send\nMr. Guevara out of the country. The Board of Immigration Appeals decided to do this,\nnotwithstanding that Mario Guevara has an active case in federal court where he's seeking\nhabeas relief. To try to prove, again, that he's entitled to stay in the United States under\nthe same rules and practices that he has been for decades, ignoring that that federal court\nproceeding was happening, the BIA proceeded anyway, and his lawyers are currently scrambling\nto figure out what the BIA ruling was even all about in terms of what its legal basis was,\nor why it's happening right now. So I want to make something very clear for anybody who's\nlistening. This is not just a court in the traditional sense. It's not the judiciary\nwith Senate confirmed judges. This is an executive agency, the Board of Immigration Appeals,\nwith judges that are appointed by other executive officials responsible to the Trump administration,\nwho have made this decision. So make no mistake. This is not an isolated incident. This is not the\nresult of a court proceeding. This is yet another attempt by the Trump administration to silence\nand chill journalists from just doing their jobs and not just journalists to silence the speech\nof people in media, people of influence, who are speaking out across the country about some of\nthe overreaches of this administration. When Mario Guevara was arrested, he was reporting on ice\nand ICE operations in the Metro Atlanta area.\nAnd so again, this is one journalist,\nand this is a journalist who is not a U.S. citizen,\nbut he's part of a much bigger picture.\nWe know that late-night hosts are Trump's latest target.\nTrump has made it very obvious\nthat he wants to go after late-night hosts\nand remove their FCC licenses if they disagree with him.\nWe should understand Mario Guevara's detention\nand deportation and intimidation\nas part of this larger picture of the Trump administration\ntaking actions against free speech in this country\nand creating one of the most dangerous environments\nfor free speech that we've ever seen in American history.\nI'm honored today to be joined by Richard Griffiths,\nwho is a representative of the Georgia First Amendment\nFoundation, who himself was an immigrant journalist,\nand I'm honored to have him here today to speak\nabout his experience in the United States as a journalist.\nI came to this country in 1974.\nI still have my reporter's notebooks that I still use,\nwere 43 years as a reporter.\nI was never asked in the nine years I was here on a visa,\nwhere are you from?\nWhat are you doing here?\nI was always welcome to do the reporting.\nSo this today for me is personal.\nTo see someone thrown out of the country\nfor doing their job, working as a journalist\nis incredibly dispiriting and it's part of a pattern.\nWe have seen journalists attacked at 60 minutes.\nWe've seen them attacked at ABC News.\nWe've seen journalism attacked to the New York Times.\nToday, thankfully, a judge threw out the order against the New York Times.\nBut it is a pattern of assault on a free and independent press in this country.\nBaroness Mistake, this is just one small piece of it.\nAnd a person who was doing his job at that rally\nwas stopped on pretext if you look at the video, arrested,\ntaken to jail, the charges never could fly and all the charges were dropped\nbut he was still put into detention and today we learn he's being deported.\nthis is an outrage. We as Americans have to think about the institutions that protect us.\nThose institutions include a free and robust press and independent judiciary. In this case,\nthe independent judiciary was not allowed to weigh in on how this journalist would be treated,\nAnd that is a very sad day for our country.\nIn conclusion, the status of the situation right now, I mean, you know, we came to the capital\nhere to get the message out about this at about 4 p.m. earlier this afternoon was when Mario\nGuevara received the order that was issued today. His deportation could happen at any time.\nSo we scrambled to start getting the message out because we want the public to know\nthat this is happening so fast and what we've seen from the administration in other cases of\ndeportations under the Trump administration's new mass deportation policy is they try to hike\nthe ball so to speak as quickly as they can so that lawyers and judges cannot get involved. We've\nseen the Trump administration move people who are detained by ICE to different federal districts\nacross the country so that they're out of the access of the judges and lawyers who are working\nwith them when they first got detained.\nSo we fully expect that if ICE could, they would deport Mario Guevara immediately.\nAnd that's why there's an emergency hearing being held right now.\nAs we speak, it started at 4 p.m. in federal court.\nThe ACLU, other organizations in conjunction with the Georgia First Amendment Foundation,\nthe Committee to Protect Journalists, the UGA Clinic for First Amendment issues.\nThose forces and other local attorneys are working together to try to get a temporary\nrestraining order from the federal court.\nI know they're seeking that relief, again, literally as we speak, to try and stop this\ndeportation so that the federal court proceedings that Mr. Griffiths refer to have a chance\nto play out so that he has a chance to show that these criminal charges were bogus, that\nthere is no legal reason to deport him, and that he belongs in the United States.\nAgain, this is just one man and it's just one journalist, but he represents the front line\nagainst Trump administration's attacks on free speech across the board.\nAgain, this was a week when we saw the attack on late-night hosts in general and Trump\nwho is emboldened by that has given comments to press where he said, well, if anybody\ndoes negative coverage of me, I guess we should just remove their FCC, excuse me, revoke\ntheir FCC licenses.\nSo he's being open about his intentions, and we should understand this action by the\nBIA and ICE, both executive agencies, as part and parcel of that strategy to chill speech.\nWe'd be happy to answer any questions.\nSo that's what's so perplexing to the attorneys working on this case, because the appeal that\nWhat was in front of the BIA up until now had to do with his release on bond, right?\nIf you remember the press conference we held just a few weeks ago, a month into his detention,\nthe question was, could he be released pending further immigration proceedings to determine\nwhether he could stay in the country valid?\nSo everybody's understanding until today was that the BIA was going to rule on the bond\nissue, but what ended up happening was the BIA made its own decision to reach back into\nthe files. I mean, you can imagine like at your workplace, you got a Manila folder file\ncabinet that's 13 years old, they went back and reached and found some legal basis that\nthey could hang their hat on to issue an order for his immediate removal. So that's why I\nraised the point that the BIA is an executive agency. This is not some independent court,\nlike we're talking about the federal court proceedings that we're having right now as\nan independent court. The BIA is an arm of the Trump administration, with judges that\nare appointed by the Trump administration. So, you know, they're dressing this up in a lot of\nlegal ease, but the simple reality of it is that the Trump administration wants this guy gone\njust like they want anybody gone who is potentially providing critical coverage of the administration.\nWell, politics still matters, and Trump is still looking at opinion polls.\nI say this a lot.\nIf you live in a country where an authoritarian gets 70-80% approval for the stuff he wants\nto do, you're in trouble.\nBut Donald Trump is not getting that level of approval.\nHe's getting 30, 40 percent at best for some of these policies that he's forcing down\nthe throats of Americans.\nSo it's really critical that we show up on days like today to speak to the public and\ndeclare with one voice, this is not okay.\nWe don't want this broadside assault on free speech in this country.\nNow we're here at the state level.\nThe Georgia First Amendment Foundation represented.\nI'm a state senator, but look at JB Pritzker and Illinois.\nThere may be a reason why Trump doesn't send the National Guard in Illinois because the\nThe people of Chicago, the people, you know, in the streets of Chicago and Illinois more\nbroadly, but also the administration at the state level were very good at pushing back\nin the public sphere, narratively, against what Trump was trying to do and Trump realized\nhow unpopular his decision was.\nSo I want everybody listening to realize, your voice matters.\nIf you don't like what's happening in your administration, if you think that we should\nbe protecting free speech and that somebody should be saying something, you are the one\nto say it.\nAnd that's why we're here today because we want the Trump administration.\nWe want the BIA.\nWe want ICE to know that Mario Guevara has the support of the public because he did\nnothing wrong.\nHe was a lawful resident of the United States for decades.\nAnd this is pure politics.\nIt is pure malice by the administration to choose this opportunity to dredge up a 13-year\norder to try to get rid of him now.\nThis man was a legal working journalist looking at what the government did.\nHe was showing the public what the government was doing.\nAnd here we have the government, apparently, taking retribution against him for doing\nthat work.\nThat should scare all of us.\nSo one way to resist the administration's harmful attacks on speech is to speak more.\nYou know, there are Supreme Court cases precedent in this country that say the remedy to bad\nspeech or incomplete speech is more speech.\nYou know, this country has a strong legacy of protecting the First Amendment and inviting\nto participate in the aftermath of Charlie Kirk's murder, we've had a renewed conversation\nabout just what it means to have an open dialogue about public debate.\nAnd I think what we're seeing from the administration today is exactly counter to that first\namendment tradition in this country of open free debate.\nWe're seeing the government cracking down on individual speakers.\nAnd so the first best act of resistance that any young person can make to this administration\ndoing that is to raise your voice.\nWe all have social media, we're all producers of content and information now if we want\nto be.\nFind your voice, put a video online, join with your friends, join a club, join Facebook\ngroups if that's all you can do for now, and make it known as loudly as possible that\nwe don't support what's happening and that we're not going to lie down.\nHe's not that powerful.\nI mean, he's the president and his administrative agencies can mess with people like we're\nseeing today, but he wants to be a dictator and he has said that out loud, but he doesn't\nhave to be one.\nSo enough people say, we don't like that.\nAgain, if the public opinion stays low enough,\nthen he won't be one.\nBut it takes all of us to make that known.\nAnd public opinion is only shaped\nwhen people speak up and shape it.\nAnything else?\nWe appreciate everybody's time today.\nI'll be around.\nWe'll book you around for a couple of minutes.\nI know.\nAnswer more questions.\nYeah.\nOK, thank you.\nAll right, thanks.\nAppreciate it.\n",
  "updated_at": "2026-02-12T18:41:04.028693+00:00"
}