{
  "video_id": "ui_MYIAfuRw",
  "url": "https://youtu.be/ui_MYIAfuRw?t=1055",
  "title": "Georgia House - Day 6 (2026-01-22)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 6,
  "video_date": "2026-01-22",
  "duration_minutes": 89,
  "summary": "Here is a structured summary of the Georgia House session transcript:\n\n**Overview:**\nThe session included a prayer by Reverend Dr. Rodrigo Cruz, who provided an encouraging message to the legislators to remember their role as public servants working for the common good, rather than personal or partisan agendas. The session also acknowledged the passing of Representative Carter Barrett's mother.\n\n**Key Actions:**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- Representative Liam introduced Reverend Dr. Rodrigo Cruz, praising his church's community involvement.\n- Reverend Cruz gave an inspirational speech urging the legislators to remember their role as public servants and work for equal opportunity, justice, and dignity for all.\n- Condolences were expressed for Representative Carter Barrett on the passing of his mother.\n\n**Votes:** \nNo recorded votes.\n\n**Attendance:**\nA quorum was present, as indicated by the roll call.\n\n**Adjournment:**\nThe session adjourned. No information provided on the next session date.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGood morning, hope everyone's had an enjoyable weekend.\nMembers will please come into the chamber and please take your seats.\nGood morning.\nThe hour of convenient having arrived, all members will please take their seats, members\ntake your seats.\nMr. Clerk, will you ring that bell?\nWe're going to have the morning roll call, all members present will please vote\ngreen to signify their presence in the chamber and the clerk will unlock the machines.\nYou\nAll members voted.\nI think all members have voted now, so Mr. Clerk, will you lock the machines?\nDoorkeepers will you please close the doors and keep them closed.\nAs is our custom, we will begin our day with scripture reading and prayers by the chaplain,\nafter which we will pledge allegiance to the flag of our country.\nBefore I let Representative Liam introduce our pastor today, I want to remind all the\nmembers, or let you know, I won't remind you, I mean if you probably do not know Carter\nBarrett lost his mother early this morning, she had been in hospice care, but the pastor\nis going to remember Carter's mother and certainly I know you all will reach out to Carter\nand certainly remember her and that family in your prayers.\nChaplain this morning we'll be introduced by the gentleman from the 98th House District\nrepresenting Marvin Liam, representing Liam.\nFirst condolences to Representative Barrett.\nI think many of us know what it is like to lose a parent.\nGood Monday morning, I have the honor\ntoday of introducing one Reverend Dr. Rodrigo Cruz.\nReverend Cruz was born and raised in Monterey, Mexico,\nwhere he actually practiced criminal law for several years.\nbut whether you see the legal profession as profane\nor sacred and as a lawyer myself,\nI waffle between the two depending on the day,\nit can be no doubt that Reverend Cruz's next calling\nwas an even higher one into full-time ministry.\nAfter Pastor Cruz and his family moved to the United States,\nhe received a master of divinity\nfrom Asbury Theological Seminary\nand a doctor of ministry from Wesley Theological Seminary.\nAnd then in 2016, he launched the net,\na multi-ethnic church in Winnett County,\nAnd then in July 2020, he was appointed to serve\nas a superintendent in the North Georgia United Methodist\nconference overseeing about 75 churches in Gwinnett,\nBarrow, Walton, Akone, and Clark counties.\nHe remains the founding and lead pastor of the net,\nwhich now has multiple campuses.\nAnd one of those, the network campus, is in my district.\nThis church campus, including, of course,\nReverend Cruz and his colleagues,\nReverend Colmanares and others,\nhave been a light in my multicultural community.\nIt has been home to among many other things,\nhome first, Gwyneth, the first homeless shelter\nby Gwyneth County, a recently rezoned future 72 units\nsite of affordable housing, and innumerable resources\nfor the community, including countless food drives\nand COVID testing drives during the pandemic,\nand co-hosting with me events,\nand these are just in the last six months I realized,\neverything from opioid overdose,\neducation and Narcan training to a stand-down event\nfor veterans to Tai Chi for seniors.\nTo me, Reverend Cruz and his church\nare a living embodiment of the idea\nencapsulated in many faith and lay teachings alike,\nbut including in the Book of Romans,\ncontribute to the needs of the saints,\nextend hospitality to strangers.\nWith that, it is my honor to introduce Dr. Reverend Cruz.\nvery much. Good morning. Representative Lee, Mr. Speaker, thank you for this opportunity.\nI was told I could do this in Spanish, but then I was also told that for most of you,\nyour Spanish may be limited to ordering tacos and finding a restroom. So I will do this\nin English, what at least in what I like to call my Southern version of English, as\na true native from the south, way, way south.\nFirst of all, I want to thank you for your service.\nCan imagine how complex your responsibilities are.\nNot only being a public servant is hard, but it's also perhaps one of the least popular\njobs to have out there, given you have to be more popular that at least the person you\nrun against to get into this office, but I believe that once you're in this role, it seems\nthat no matter what decision you make, someone is going to be unhappy with it.\nSo I want to acknowledge that, I want to say thank you for your service and how do you\nShe's in the South and bless your heart as well.\nBut I do have a word of encouragement for you.\nYou see, as you begin 2024 and make decisions on behalf of the state, as you go through\nyour to-do list of all the things that you want to accomplish, I want to kindly encourage\nyou. Before you do anything to remember who you are. You see, I am a big believer\nthat when you remember who you are, that will influence what you do. One of my\nfavorite things in life is being at that. Me and my wife, we have five children\nhome and we are racing or trying to raise anything between a toddler in diapers and a senior\nin high school. And I don't know what is harder. But you see, I did not become a father because\nI like to change diapers. Dilling with crap, pardon my French, it just comes with a territory.\nI became a father because of this opportunity\nto impact someone's life.\nSo here she can become the best version of themselves\nand influence our society.\nI want to believe that whenever you decided to run for office,\nit wasn't because you enjoyed dealing with diapers.\nBut it was because of this idea of being able\nto impact people's lives.\nSo, we together can become the best version of ourselves and together influence this beautiful\nstate of Georgia.\nYou see, when you remember who you are, that influence, what you do.\nSo, as you go through 2024 and the opportunities present in front of you to do things, when\nperhaps the opportunity present in front of you to do something that advanced your personal\nagenda, I want to encourage you to remember that you are a public servant not to advance\nyour personal agenda, but to create legislation and policies that create a social fabric that\nis grounded in equal opportunities, in justice, and fur treatment for all.\nYou see when the opportunity present in front of you to do something to please your friends,\nthat you remember that you became a public servant not to do that, but to represent those\nwho are at the margins, so they can be seen, heard, value, and treated with dignity.\nYou see when the opportunity present in front of you to represent your political party,\nthat you remember that you're in this place to represent every single citizen and resident\nof the state of Georgia, and work eagerly with each other to dismantle any system that\nis the value on people's life.\nWhen you remember who you are, that influence what you do.\nAnd I will finish with this.\nYou see, out of my five children, I have four boys and one girl.\nAnd a couple of years ago, my baby girl\nwas being bullied in the school bus,\nto the point that she refuses to ride the bus.\nAgain, so I gathered my boys, especially the older ones.\nAnd I had a conversation with them.\nSo when you get in the bus tomorrow with your sister,\nyou have one assignment.\nSee, their mom was looking at me, giving me the eyes, telling\nme, remember that you are a pastor.\nAnd I'm a public school teacher.\nwatch out what you said and all I say my voice was, remember who you are, you'll know what to do.\nI want to thank you one more time for your opportunity to be here.\nI want to remind you that there is a church in Gwyneth County, the Ned Church.\nThere's over 450 churches across the state, United Methodist churches,\nand we are praying daily, not for what you do, but for who you are. We use\ntime so we can pray together.\nGo we need you thanks for the opportunity to be in your presence. It is a gift\nthat we do not take for granted. Go we certainly pray for a representative\nburied and his family, for also the rest of the members of this house that\nus, they're going through challenges that life brings to them. Especially I pray\nfor the unity of this body, that you will give them wisdom, discernment,\nclarity, grace and courage to keep the main thing the main thing and that is the\nbetter of the beautiful state of Georgia for the sake of others. We pray this in the name of Jesus Christ. Amen.\nNo, we'll invite you to, please.\nYeah, thanks.\nFirst of all, it is the flag of the United States of America.\nAnd to the Republic, which is the nation of the United States of America,\nit is difficult to live in just as far as ever possible.\nDoorkeepers, you may unlock the doors.\nMembers, you may greet Dr. Cruz in the south any room.\nDr. Cruz, thank you for those words of direction and encouragement.\nIt's a way to start today.\nThank you so much.\nThanks for being here.\nYou\nmembers we can get have your attention just for a minute or two our doctor of the day\ntoday is brought to us by representative Houston gains of the 120th he is doctor B. Rustin\nMcAllister, M.D., he'll be downstairs at age station.\nThanks for inviting and taking care of our health needs\ntoday, Representative Houston Gaines.\nThank you so much.\nAnd let Dr. McAllister know we appreciate him being here.\nChair now recognizes Chairman Tarvan,\nChair of the Committee on Information and Odits.\nIf the members will give him your attention.\nChairman Tarvan.\nMr. Speaker, your committee on information and audits has read the journal from the\nprevious legislative day and found to be correct.\nAnd we welcome everyone back today, after it being awful week for appropriations.\nAnd this one is for everybody but me and maybe you, Mr. Speaker.\nWelcome to the day, another day, another chance, feel free to change.\nI'm with you on that when Chairman I'm doing my best.\nChairman Tarvan, the Chair of the Committee on Information and Audits reports that the\nJournal of the previous legislative day has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal that Chair here is\ndone the reading that the journal is dispensed with, is there any objection to the confirmation\nof the journal? Chair, here's none and the journal is confirmed.\nMr. Clerk, will you read the resolution establishing the order of business for the day?\nRepresentative, station 104th News, follow me, establishes the order of business during\nfirst part of the period, unanimous consent. Introduction to bills and resolutions, first\nreading in reference to house bills and resolutions, second reading of bills and resolutions,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day? Chair, here's none and the resolution is adopted. Before we have\nFirst reading of bills and resolutions, I want to remind all the members, all the members\nof this house, that people's house, that this is the first day that we have young people\nin the chamber, we have pages today.\nSo I hope you all will recognize those pages, give them your attention, and show good behavior.\nI know that's difficult for this crowd, but show good behavior.\nAnd the chair will always also like to tell you, thank you for those who attended your\nappropriations committee meetings last week.\nI hope it was beneficial to you and your interest and you serving here.\nWe're glad to have the pages again.\nFirst reading of bills and resolutions, the clerk will read.\nBill 928 by Representative Ridley, the 22nd, Ridley, the 6th,\nPowell, the 33rd, Horn of the 3rd, Fleming of the 114th.\nBill B. Toddl, an act of men, Code Section 15, 18-5.\nThe defense go to George Annettetti,\nrelating the appointment of substitute\nfor absent or disqualify district attorney.\nJudiciary non-civil.\nHouse Bill 929 by Representative Ridley,\nthe 22nd Ridley, the 6th, Powell, the 33rd,\nhonor of the third person to the\n119th and others, Bill B.\nTodd will knock to a man,\nArticle 2, Chapter 7 to\nTitle 48, where the fish go to\nGeorgia annotated, really need\na position rate competition,\nexemptions and credits for\nstate income tax.\nWays and means, House Bill 930\nby Robson and Ridley, the 22nd\nRidley, the 6th region, the 99th\nApollo, 33rd honor of the third,\nBill B. Todd will knock to men\ncode section 35, 119, where the\nfish go to Georgia annotated,\nreally the disclosure of a resting book photographs prohibited public safety\nand homeland security hospital 931 by resident Ridley the 22nd Ridley the\n6th reason the 99th one of the 3rd person through the 119th it'll be\ntunnel act to amend chapter 5 of tunnel 21 of the physical to George\nAnisated related government transparency and campaign finance judiciary\nHospital 932 by resident Mathis 149th,\nGuntler of the 8th, Gulliver of the 19th.\nBance of the 133rd, a lot of the 131st and others.\nBill B. Toddl, an act to amend Code Section 165-1.\nThe fish go to Georgia annotated, relating to murder.\nJudiciary non-civil.\nHospital 933 by resident Mopton,\nthe 17th part of the 5th Mathis, 149th.\nBill B. Toddl, an act to amend Code Section 42.\n86th, the fish go to Georgia annotated,\nrelaying the special license plates motor vehicles hospital 934 by\nresident want to honor the 17th math is the 149th gull of the 19th can of the\n172nd gunner of the 8th and others will be titled an act of many article\n5 of chapter 4 title 10 of the fish go to Georgia annotated relaying the\nself-service storage facilities judiciary hospital 935 by resident\nadvanced on 33rd, Higins on on 61st, Cameron. The first\nSkoggins of the 14th, Chastain of the 7th and others,\nwill be titled back to a men in chapter 14, title 40, the\nfish go to Georgia annotated related to use of speed\ndetection devices. Motor vehicles, House will 936 by\nRift Center, bottom of the 73rd Skoggins of the 14th\ncolored in 19th, Kelly of the 16th, 9 to the 134th and others.\nThe bill be titled act to amend part three of Article 16 to chapter two, title 20 of the\nofficial go to Georgia annotated relating to health of elementary and secondary school\nstudents.\nEducation.\nHouse Bill 937 by reps and a mouth out of the 17th call out of the 19th camp on the\n135th.\nCannon in the one hundred and seventy second, corporate of the one hundred and seventy\nfourth.\nWill be titled act to amend part four of Article three, chapter one, a title 40 of the\nFischkoda, Georgia, annotated, relaying your rideshare network services.\nMotor vehicles.\nHousehold 938, by Robson and Barnes, the 86th, Taylor, the 92nd blaze, the 67th,\nAlexander, the 66th, Bella, the 75th, and others.\nBill Bitton, an act to amend, Chapter 7, a title 44 of the Fischkoda, Georgia,\nannotated, relating to landlord and tenant.\nWhat do we do?\nJudiciary.\nHouse Bill 939 of our represent\nAgreevision and 9.9\nHitchons.\n1161.\nLumps.\n1112.\nMans 133.\nScott.\n15.\nThe others.\nThere'll be talent act to a\nman title 40 that this quote a\njoint attendee related motor\nvehicles and traffic.\nMotor vehicles.\nHouse Bill 940 by reps.\nI chose the 25th Williams.\n1148th.\nCannon.\n170 second.\nHorner.\nBill B. Todd on an act to amend part two of Article 15 to chapter one of Title 10 of the fish go to Georgia annotated relating to fair businesses practices active 1975\nAgriculture and consumer affairs\nHospital 941 by Representative Erwin of the 32nd Jones to the 47th Dubinick of the 29th Jones to the 25th reason the 9th and others\nwill be taught on act to amend code section 222 to 60 the official code of\nGeorgia and attendee relating to capital outlay funds. Education possible 942\nvibrates in a meter the 56 a lot of the 131st Daniel the 117th\ndensity the 13th Hagen to the 156th and others will be taught on act to\namend code section 1611 92 the official code of Georgia and attendee\nRelayning's sexual extortion.\nJudiciary non-civil.\nHouse will 943 by reps of Jasper's to the 11th,\nPaula 33rd, Ballinger the 23rd,\nWarner the third, Ridley the 22nd,\nand others.\nWill be titled an act of men code section 4883\nof the official go to Georgia annotated\nRelayning exemptions from sales and use taxes.\nWays and means.\nHouse will 944 by reps and apocalypse the 27th,\nDonahue the 31st, lever to the 123rd McCollum to the 30th cops to the 28th.\nBill Bitton and an act of men chapter 5, a total 48.\nThe fish go to Joe Jantetti, relaying to add Belorum taxation to proper.\nWays and means House Bill 945.\nI wrote some hawkers to the 27th Taylor 173rd Anderson to the 10th.\nErwin to the 32nd parish of the 158th.\nBill Bitton and an act of men, part one of Article 1 of chapter 18, a total 45.\nof the fish go to Georgia annotated relating the state's employee's health insurance plan.\nInsurance.\nNo, nine forty six by roasted pockets.\nThe 27th done who the 31st McCollum on the 30th Cox the 28th or one of the 32nd and others.\nIt'll be titled act to amend part one of our five a of chapter eight at total 48.\nAnd the fish go to Georgia annotated relating to special district mass transportation sales and use tax.\nWays and means.\nNuskel 947, my resident of Lever to the 123rd\nfrustration of the 104th on the 103rd,\ngone through the 8th Oliver, the 82nd.\nHe'll be town of an actual men article\non a chapter six, a title 15.\nThe official go to Georgia,\nannotated related to general provisions\nconcerning superior chorus.\nJudiciary House of a 948,\nour resident mopped out of the 17th Kelly,\nthe 16th color of the 19th.\nScott was the 14th part of the fifth and others.\nThey'll be tonne on active men chapter two title 21 the fish go to Georgia annotated relating primaries and elections generally\nGovernmental affairs house with 949. I've said a mob tonne of the 17th color of the 19th scog is the 14th Kelly the 16th\nBarton of the 5th and others will be tonne on active men chapter two entitled 21 of the fish go to Georgia annotated relating elections and primaries generally\nYes, government affairs house resolution 804 by\nresident of art of the 49th still Cox the 53rd Jones the 47th Jones the 25th\nresolution for Rosalind amendment to the Constitution shows to change the date\nby which temporary loans for counties municipalities and other political\nsubunditions. Judiciary. That\ncompletes first readers.\nSecond reading of bills and\nresolutions. The clerk will read\nHouse bill 921 by\nrepresentative Bernal of the 77th\nout of the 76th bell of the 75th kneel of the 79th.\nI bill to authorize the governing authority of the city of Forest Park to levy and excise\ntax house bill 922 by represent advance of the 133rd target of the second lumps in the 12th\nCollins of the 71st editions of the 160th first to build related general provisions relative\nto criminal trespass and damage to property house bill 923.\nMy representative Taylor of the 92nd Alexander the 66th McLean to 109th Douglas of the 78th\nKenner to the 101st. I bill relating to motor vehicles and traffic house bill 924 by\nBy-repsed balance of the 23rd hatchet of the 155th night of the 134th Cooper, the 45th Taylor of the 173rd bill relating to insurance.\nHouse Bill 925 by reps of stains of the 180th percent of the 176.\nHilton of the 48th Daniel, the 117th corner of the 3rd and others.\nA bill relating to general provisions relative to emergency management.\nHouse Bill 926 by reps of Reeves of the 99th Maynard, the 56th green of the 154th.\nHilton of the 48th fans of the 130th and others are bill relating to criminal procedure.\nHouse Bill 927 by Rep. Hagan of the 156th, Abstration of the 104th, Anderson of the 10th Canon of the 172nd, Sains of the 180th, the bill relating to hunting, House Resolution 780, by Rep. Petrie of the 166, Sains of the 180th, Kelly of the 16th, Gains of the 120th, Sebald of the 34th and others, a resolution proposing amendment to the Constitution of the State of Georgia, so it's a clarify that only citizens of the United States shall have the right to vote in elections in this state, through second readers.\nYou\nYou\nYou\nYou\nYou\nWe have no reports of standing committees, so we're going to move on to morning orders.\nMembers will please take your seats, representative Hilton, if you'll make your way down.\nWe'll now have our morning orders members will you give the member in the well your attention\nwe have some special people or two members in the well good to see you so well we're\nWe'll recognize, we'll recognize, we'll represent the Hilton\nand represent the Hawaii.\nWe got one more friend here.\nThank you, Mr. Speaker.\nAs many of you know, the Girl Scouts\nwere founded right here in Georgia\nby Juliet Gordon-Lowe in 1912.\nAnd I am honored today to be joined by one of the best\nGirl Scout troops in all of Georgia\nfrom Peachtree corners.\nLet's stand and give a warm welcome to troop 17069\nall the way down here from Peachtree corners.\nThank you.\nThank you, Mr. Speaker.\nI think that happened down in Savannah, didn't it?\nFound him at the girls' house.\nWelcome.\nGood to have y'all.\nHope y'all have a great day.\nThank you for that recognition.\nRepresentative Derek Jackson, Representative Reese.\nRepresentative Teddy Reese.\nOh, you have friends too, don't you?\nYes, yes.\nWe'll serve Mr. Speaker.\nI do have friends, Mr. Speaker.\nI do have some friends.\nGood morning colleagues, it is a great day in Georgia.\nThe reason why it's great because we have some of our divine nine family members who are\nhere with us.\nAnd so for those who do not know what the divine nine is, the divine nine is a nickname of\na group of non-historically black Greek letter organizations that collectively makes up\nthe National Panhandlingic Council.\nThese non-organizations, Mr. Speaker, have placed significant places in our history and\nour culture.\nthese organizations comprise of nearly four million members.\nAnd some of the members, if you can kindly stand in the gallery, are represented right\nhere.\nAlpha Phi Alpha fraternity, Alpha Kappa Alpha, Sorority, Kappa Alpha Si, Omega Si Phi, Delta Sigma\nZeta, Phi Beta Sigma, Zeta Phi Beta, Sigma Gamma Ro, and last but not least, Iota Phi\ndata. Let's give them a warm welcome members. Thank you, Mr. Speaker. We yielded well.\nRepresentative, I didn't know you were literate in Greek there, but you did a fine job on that. I can just\ntell you what. That was awesome. I know who to call on when I need to translation now.\nWelcome, members. Good to have y'all.\nMembers, we have a resolution. We'll speak to our scheduling a little bit here. I thank Mr. Leader.\nClerk, are you ready to read House Resolution 805?\nClerk will read the resolution, House Resolution 805,\nmembers will give the clerk your attention.\nHouse Resolution 805, a representation of the 104th,\ncalling a joint session to the House of Representatives in the Senate\nfor the purpose of hearing a message from the Chief Justice of the Supreme Court.\nThe gentleman from the 104th, the majority of this house,\nRepresentative Estration is recognized\nto explain the resolution.\nThank you, Mr. Speaker,\nand if the clerk could put up the resolution.\nThank you.\nThis House Resolution 805, or is the lawyers in the room know\nyour favorite day of the legislative session.\nWe get to hear from the Chief Justice\nto give us an update on the State of the Judiciary.\nSet for February 7th at 11 a.m.\nin the House Chamber, where we'll have a joint session.\nI'd ask for your favorable consideration.\nThank you, Mr. Speaker.\nIs there any objection to the adoption of the resolution?\nChair, here's none.\nThe resolution is adopted.\nI'm sure it will be riveting, so we all need to be here.\nFor what purpose does represented the frustration rise?\nMake a motion.\nState your motion.\nMr. Speaker, I move the House Resolution 805 be immediately transmitted to the Senate.\nMajority of the frustration moves of House Resolution 805 be immediately transmitted to the\nSenate is their objection, hearing none is so ordered.\nMr. Clerk, will you read a resolution, House Resolution 806, Mr. Clerk?\nHouse Resolution 806 by Representative Abstration 104th,\na resolution to call for the nomination and election of the chairperson of the state election board.\nThe gentleman from the 104th is recognized to explain the resolution.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House House Resolution 806, which is, I believe, is out on the\ndesk and you can see up here on the board, just schedules the House confirmation vote for\nor Thursday, January 25th at 11 a.m., this is concerning the appointment of Chair of the\nState Elections Board.\nSo this resolution does not confirm the Chair of the State Elections Board, just schedules\nwhen that will take place, which would be Thursday of this week at 11 a.m. and I'd ask\nfor your favorable consideration.\nThank you, Mr. Speaker.\nThank you, Mr. Leader. Is there an objection to the adoption of the resolution?\nChair, he has done the resolution is adopted.\nMajority Leader is recognized.\nWhat purpose does the majority leader rise?\nMake a motion.\nState your motion.\nMr. Speaker, I move that House Resolution 806 be immediately transmitted to the Senate.\nRepresentative Estration moves the House Resolution 806 be immediately transmitted to the Senate.\nis their objection.\nHearing none, it is so ordered.\nYou\nMembers, we're going to take up a matter with the that we had in the 23 session that\nrepresenting Mathis brought to us.\nSo at this point in time, you'll give the gentleman in the well your attention.\nChair will recognize representing Mathis for a motion.\nThank you, Mr. Speaker, I'd like to make a motion, please.\nmotion. I'd like to move that the House agree to send an amendment to this House\nsubstitute of Senate Bill 35. This is a-\nWe'll let you explain it in just a second. Mr. Clerk, will you read the caption?\nSenate Bill 35 by Senator Meredith and 9 Jones, the 22nd bubbler, the 55th\nwith Harveston 15th and others to be taught and act to amend Code Section 42-86 of the\nFisher Code of Georgia annotated relating to Special License Plates.\nRepresentative Methods is recognized to explain the Senate Amendment.\nYes, sir.\nThe amendment is adding into a glucose monitor bill that we passed in this house with\nonly one neighborhood. It offers a glucose monitor for Medicaid patients. And we hope\nthat did you give it a favorable condition? I mean, consideration.\nOn the gentleman's motion, that the House agreed to send a amendment to...\nThe gentleman didn't yield the will so we're going to hold him back to answer a couple of questions.\nRepresentative Hokeham is recognized for a question.\nThank you, Mr. Speaker.\nIs the gentleman yield?\nYes, sir.\nIs it not true that the second part of this measure was an action that the House took\non day 38 last year to amend what had been House Bill 364, the wrong conviction compensation\nreview panel bill to SB 35.\nIf you say so, yes.\nOkay.\nAnd is it not further true that while passing this will eliminate that language from this\nbill because lines 1 and 2 strike out in their entirety lines 1 through 226 of the House\nsubstitute which was passed with overwhelmingly support I'm going to support your\nmotion and then we can continue to work on the wrongful compensation at going\nforward. Thank you. Thank you for the question. You have no further questions.\nMs. Speaker I yield well. On the gentleman's motion that the House agreed to\nthe Senate amendment that the House substitute to Senate bill 25 will need\nto vote different members.\nAll those in favor will vote yes.\nThose opposed will vote no,\nand the clerk will unlock the machines.\nI have all members voted, take your time, I know you got a bad knee.\nAll members voted.\nAll members have voted so the clerk will lock the machines on the gentleman's motion.\nThe yeas are 152s and days are one and the house has agreed to the Senate amendment to\nthe House substitute to SB 25, 35, I'm sorry, House Bill 35.\nMembers, we have a couple of motions to withdraw a bill for one committee and recommit to another\nfor what purpose does representative Roger Bruce rise to make a motion, state your motion\nthat we move House Bill 882 from government affairs to judiciary, non-civil, both chairman\nhave agreed.\nMr. Clerk, will you read the caption?\nHouse Bill 82, by the way, Senator Bruce, the 61st\nand others to be titled an act to amend Code Section 35-119\nof the Fish Go To Georgia Annotated Relay in the disclosure\nof arrest booking photographs.\nOn the gentleman's motion that HB882 be withdrawn\nfrom the Governor Affairs Committee and recommitted\nto duty non-civil committee is their objection.\nHearing none, it is so ordered.\nThank you, Representative Bruce.\nBoy, that back rose busy today, has been busy.\nFor what purposes represent extension rights?\nWould you like to make a motion?\nNo, no, I'm sorry, I didn't...\nI didn't...\nChris...\nThank you.\nFor what purpose is representing Stinson rise?\nTo make a motion, Mr. Speaker.\nState your motion, Representative.\nTo speak, I make a motion that House Bill 174 be moved from education to public health\nand both chambers are in agreement.\nThank you, Representative Clerk.\nMr. Clerk, will you read the caption?\nHouse Bill 174, members, that are Bentley,\nthe 150th and others to be entitled\nand act to amend part three of Article 16\nto Chapter 2, entitled 20.\nWill the fish go to George annotated,\nrelating to student health and elementary\nand secondary education?\nOn the ladies' motion that HB 174 will be withdrawn\nfrom the education committee and recommitted the public and community health committee is\nthe objection.\nHearing none, it is so ordered.\nMr. Clerk, will you read the caption to a group of privileged resolutions, Mr. Clerk?\nHonoring the Life and Memory of Mayor Betty Hannah, Honoring the Life and Memory of Sergeant\nMark Andrew McIntyre, Recognizing Commending Katrina Barranco, congratulating Commending Philip\nMoss, congratulating Commending Jack Bailey, Commending the University of Georgia 4-H program,\nFebruary 7th to 14th, 2024, this congenital heart defects\nawareness week at the state capitol recognizing and\ncommending Gabriel Tobin.\nCommending Delta Sigma Theta sorority ink for its 111\nyears of service and recognizing January 29th, 2024 is\nDelta Day at the state capitol recognizing commending\ncommand a sergeant major, Brandon B. Rudder for his exceptional military career,\nrecognizing commanding Colonel Mark J. Austin for his exceptional military\ncareer, recognizing commanding Lieutenant Colonel Robert C. Colverson for his\nexceptional military career, recognizing commanding Colonel Jeremy Wilson on his\nexceptional military career, recognizing commanding Chief John Lentonay on his\noutstanding public service and law enforcement.\nCongratulations in Thomas County Central,\nYellow Ejects for winning the 2023 GHSA class,\n6A State Football Championship.\nRecognizing January 27th, 2024 is international,\nHolocaust Remembrance Day.\nRecognizing commending the Atlanta vibe\nprofessional women's indoor volleyball team.\nRecognizing commending Easter Seals\nand all its Georgia chapters.\nCommending and congratulating Helen Rouse Walton,\nrecognizing and commending Yolanda Hollins McGee.\nCommending the Georgia FFA Association\nof Recognizing February 20th, 2024 as FFA Day\nat the State Capitol,\nrecognizing and commending the Miss Georgia Peach Scholarship\nPageant in the 2023 Georgia Peach Queens,\nrecognizing commending Wilman Antoine Meadows\non his outstanding public service,\nrecognizing commanding Lance Hester\non his outstanding public service,\nrecognizing commanding Keisha Cheetam\non her outstanding public service,\nand recognizing and commanding\nthe American Foundation for Suicide Prevention\nand its Georgia chapter.\nAnd for other purposes, that completes the reading\nof the privilege resolutions.\nYou\nIs there an objection to adopting the privileged resolution, resolutions plural?\nJerry is known and the resolutions are adopted.\nWe're going on to afternoon orders.\nMembers I will remind you though before we finish the orders that we do have pages.\nIf you have a page here today, we will be taking page photos immediately upon adjournment,\nimmediately upon adjournment.\nYou're good with this you're good represent Carter you're recognized.\nGood morning everyone and happy new year.\nI have not been down to the well, but you know why I'm here.\nThursday, February 1st, we will be asking you to well read for\nGo Red for Women, which is the American Heart Association's\nDay, where we bring awareness to heart disease, which we all\nknow, and I hate to keep coming back saying this, it's the\nnumber one cause of death in women and black women in\nparticular so make this note that today is the first day we're coming to ask you\nso you have time to either shop or get our go home and bring us a clothes on\nThursday February the first we're wearing red thank you mr. Speaker thank\nyou represent Carter I knew that represented Carter would fall along with the\ntime constraints here so members some of these others I'm not sure so\nespecially the next one. So I remind all members we have three minutes for your\norder. Representative Carpenter. Oh boy, I'm ready.\nChairman Carpenter is recognized for an order and Chairman Tarvan. All right.\nAll star cast here. All right folks. We got your rug this year.\nWe will be down at the freight depot tonight from four to six to celebrate\nDawton Whitfield Day at the Capitol. Get out of there, have a have a little\nto eat, a little to drink, and get you rug. We really appreciate you to show how\nimportant manufacturing is to Northwest Georgia and the state of Georgia.\nThank you. Hey, that's awesome. That may be one of the best. What do you think?\nHey, Chairman Dickey likes to pitch.\nHey, members, this is a great event with Dalton Whitfield County, so I hope everyone will\nmake an attempt to get down.\nIf you don't go down and get your rug, I'm going to get it.\nWe're going to bring back an armload of them.\nYou may not get a chance.\nRepresentative Schofield is recognized for a afternoon order in the morning, Representative\nSchofield. Thank you, Mr. Speaker. Good afternoon, colleagues. Without question, Georgia\nlaid to rest the phenomenal woman this weekend. Miss Diane Powell-Larsche. Diane was always\ndedicated to making a difference. Those who knew Diane loved her. Diane was the owner\nof large-shade communications, a public relation\nand communication firm responsible for the 94th birthday\ncelebration of Dr. Joseph E. Laury as well as the 75th\nbirthday celebration of Congressman John Lewis\nand so much more.\nDiane created family food fest formerly known as Real Men\nCook to honor urban men on Father's Day.\nEver committed to serving the community, Diane\nwas the founding president of the Greater Atlanta\nSection of the National Council of Negro Women.\nShe was the former Vice President and Outreach\nfor the Junior League, and she faithfully and tirelessly\nserved as a board member of the League of Women\nVoters in Atlanta in the Fulton County chapter.\nShe also served as an active board member for over 20 years\non the Lupus Foundation of America Georgia chapter,\nand she was a member of DeGmasinga Signifeta\nin Coxerardians Corporated, I apologize, ladies.\nDiane gave her time, talents, and treasure\nto Atlanta until her final breath to our husband, Joe.\nThank you for sharing Diane with all of us,\nand in so many special ways.\nWe will always carry Diane in our hearts.\nLet us give a moment of silence and a smile\nwith our hearts for a life well-lived.\nThank you, Mr. Speaker.\nThank you, Representative.\nOh, she does.\nYou may be seated, members.\nYou have another morning order, okay?\nRepresentative Scofield is recognized for an additional afternoon order in the morning.\nThank you, Mr. Speaker.\nMaternal mortality is not just an urban rule or suburban issue.\nIt's a human value, human rights issue that do to our failure as a state has acted not so\nsufficiently to put this issue, making Georgia a state of emergency.\nMaternal mortality and pregnancy associated, associated deaths,\nDavis state, men, women, and families, the Maternal Mortality Review Committee reviewed\n786 pregnancy-associated deaths and of the 786 pregnancy-associated deaths, 312 were determined\nto be pregnancy-related deaths. So we can't turn a deaf ear, but it won't stop women from dying.\nWe can think it's not happening in our district, but I highly think that's a false narrative.\nAnd let me be clear, we're not scaring black women from having babies.\nWe will continue to tell the truth.\nWe love our data and we have the data.\nWe have the funding, in fact, we have so much funding that we know\nwe can use some of this to fix the problem.\nWe have the brightest minds and the best people in this chamber, y'all.\nSo I'm curious, why do we still have a problem\nwith death of maternal mortality?\nColleagues, it's our responsibility and our time is now.\nThank you, Mr. Speaker.\nI yield the well.\nRepresentative Audine is recognized\nfor an afternoon order in the morning.\nRepresentative Audine.\nThank you, Mr. Speaker.\nAnd he has some friends, just give them a minute to join you.\nMembers need to pay attention to the member and the will.\nOn December 29, 2023, Shania Kelly's green was shot by a stable at Walla 10 in the\nholiday party.\nShe was 18 years of age, a loving daughter, a young mother of an eight-month son, a sister\nand a friend to many, friends who loved her daily.\nI attended her funeral yesterday.\nAs it was personal for me, as I celebrated my birthday,\njust down the street from this tragedy that happened.\nI have two kids her age.\nI could not begin to imagine how the mother so young\ncould have lost her life.\nHer mother, I heard her mother's words during the funeral,\nknowing the grief and pain that she felt.\nDuring the funeral ceremony, I learned that Shania\nwould have graduated this spring,\nand wanted to pursue a career in Lash Tech\nand dental hygiene professional.\nI wanna thank the Winnock County Police\nwho have worked tirelessly investigating this shooting,\nand know with the support of our community\nwho will bring the suspects to justice\nonce they are apprehended.\nI thank God mostly because she knew Christ, and she is with the Lord today.\nAs a body I ask for your prayers for the family as they grieve, but let us do justice for\nFashonai's young son, who will grow up not knowing her, her grandparents, her large family.\nI thank God for her uncle for constant communication.\nLet us do something in Georgia for young kids and others that fall victim to similar situations.\nLet's make a change in Georgia addressing violence that are impacting our kids.\nCan we take a few moments of silence for Shaniaia Kellis-Green?\nAmen.\nThank you, Mrs. Speaker.\nThank you, Representative Gardina.\nof Jasmine Clark is recognized for an afternoon order.\nAll right, good morning, colleagues.\nThis morning, I would like to welcome the Atlanta vibe\nto the Georgia State Capitol and specifically\nto the Georgia State House.\nThey already got a chance to visit the Senate.\nThe Atlanta vibe is Georgia's premier professional indoor\nvolleyball team and the founding members of the Pro Volleyball Federation. This\nestablishing and growing professional volleyball in North America. Did you all\nknow that volleyball is the number one team sport for girls in the United States?\nWell I am so proud that we are welcoming this professional team to our state. They\nThey will play in Gwyneth's own Gas Southerina, and the players on the team come from all over\nthe world, including six national team players, two international team players.\nThey come from 18 different universities, including conferences from the SEC and other conferences,\nand they also have players from all over the country, including right here in the state\nof Georgia.\nSo we welcome them to the state capital.\nIf you are interested in taking a picture with them, they will be in the south anti-room.\nThis is history and the making, so they would love to see you all.\nThank you, Mr. Speaker.\nI yield the well.\nIf y'all are coming down, we'll take some photos with you in the south any room.\nThank y'all for being here.\nYes, volleyball is pretty cool stuff.\nWe appreciate it.\nI know a lot of young ladies are to play in volleyball.\nIt's really catching on fast.\nIt's pretty fast, pace to it, thank y'all for being here.\nThat completes our afternoon orders.\nWe do have some announcements.\nChairman Corbett recognized for an announcement.\nThank you, Mr. Speaker, the Motor Vehicle Committee will meet at 8 o'clock in the morning,\nroom 606, CLOB.\nThank you, Mr. Speaker.\nRepresentative Trance, recognize.\nFor now, Representative.\nThank you, Mr. Speaker.\nThe cab delegation does have a meeting today in room 514.\nThe cab delegation has a meeting in room 514 at noon.\nLunch will be provided.\nThank you.\nfloor earlier to gamble.\nI recognize for announcement.\nThank you, Mr. Speaker.\nTomorrow morning at 7 a.m.,\nthe fellowship will meet in the House Judiciary Committee room.\nAll members, I encourage you to come.\nWe look forward to seeing you.\nThis will be our first meeting for the year.\nLook forward to seeing you at 7 a.m. in the morning\nin the judiciary room for the house for the fellowship meeting.\nThank you, Representative Cooper.\nChair Lady Cooper has recognized one of those.\nThank you, Mr. Speaker.\nLadies and gentlemen, the house, please.\nIf you will have, can I have your attention?\nAcross our state, people are having to put off\ntheir elective surgery all over the state\nbecause there's not enough blood.\nWe are desperately short in the state of Georgia\nand therefore we really need people to help fix\nthat situation.\nOn Wednesday, this Wednesday, we're gonna have a blood drive\nhere at the Capitol again.\nIt'll be from 8 a.m. to 5.\nthe bloodmobile will be outside between the capital and the L.O.B.\nSo if you could plan to stop by and help the citizens of our state\nby donating a pint of blood, we would really appreciate it.\nIt'll be raining that day probably, and I know you're sweet, but you won't melt.\nAnd so if you will make plans to go do that, the other thing I would ask you,\nThis would be a great time to get a photo of you giving blood\nand putting it out across your districts\nabout how desperate people are and they can call up the red cross\nand ask where they can go and donate blood.\nSo why don't you take that opportunity and get a good photo\nwhile you're giving blood and then put it out on your media.\nThank you, Mr. Speaker.\nI yield well.\nChair Lady, I have a question.\nI bet there's plenty of blood in the state but it's just in other people's bodies and\nwe need to share it with those who need it, is that, would that be correct?\nYou are really right Mr. Speaker there is a lot of blood in Georgia but it's just in\npeople's bodies thank you for that so everybody I hope you will begin to share some of that\nblood in your body.\nI hope all the members will join in the effort on Wednesday.\nLeader, frustration, recognize foreign announcement.\nThank you, Mr. Speaker.\nThere will be a chairman's lunch today in room 403 at noon, 403 of the Capitol noon today\nfor the chairman's lunch.\nAnd the chairman's lunch will be on Mondays for more in session throughout the legislative\nsession as planned.\nWe'll see you all chairman and four or three at noon. Thank you.\nChairman Mitchell.\nChairman Billy Mitchell.\nI want to hear what that was about. Recognize for them now.\nThank you, Mr. Speaker. There will be a meeting of the Georgia House Democratic\nCaucus tomorrow morning at 9 a.m. in room 216 in the Capitol.\nSo breakfast will be served.\nThank you so very much, Mr. Speaker, for your patience.\nThank you, Mr. Chairman.\nChairman Irwin recognized for an announcement.\nThank you, Mr. Speaker.\nJust one announce we'll have our first education committee meeting today scheduled at 1 o'clock\nin C-L-O-B 506.\nSo education committee members, please come to our first meeting today.\nA lot of good information going to be presented to you today.\nThank you, Mr. Speaker.\nImportant meeting, thank you, Mr. Chairman.\nChairman Meeks, recognize for an announcement.\nThank you, Mr. Speaker and members.\nTomorrow, one o'clock, there will be an economic development subcommittee for\nappropriations hearing, one o'clock room 341, thank you, Mr. Speaker.\nOne o'clock 341, thank you there, representative Meeks.\nthat completes our announcements and we have a member who has a birth date a\nday wait just a minute you want to you want to know the shot at it okay we'll\nget it right this time represent representative Jasmine Clark has an\nAll right. Thank you, Mr. Speaker. I wanted to make an announcement that the Georgia Legislative\nBlack Caucus will be having a lunch and learn today at 11 o'clock a.m. in CLOB. So happening\nnow, it is a hot lunch and we would love to have you all there. Legislative Black Caucus\n11 a.m. 5 10 CLO B. Thank you. Perfect. Well the people down in Lowns County\nGeorgia and this big city of Valdosta are celebrating today. One of their very\nown has a birthday. One of our very own has a birthday. We won't give it away\nbecause he may have not been old enough when he was elected this body, but Chairman John\nLeHead is celebrating the birthday today, Chairman LeHead.\nYou look marvelous for your age.\nremember if you have a page we're going to take page photos so join us up here 10 o'clock\nmajority leaders majority leaders recognized for emotion thank you miss speaker I'm\nmove that this house stand adjourned until 10 a.m. on Tuesday, January 23rd, 2024.\nOn the motion of the majority leader that this house stand adjourned until 10 a.m.\nTuesday, January the 23rd, 2024. All those in favor will say aye. All opposed say no.\nWasn't even close. We're adjourned. I have it.\nYou\n",
  "updated_at": "2026-02-12T16:30:02.983822+00:00"
}