{
  "video_id": "uIv6NTZ8eik",
  "url": "https://www.youtube.com/watch?v=uIv6NTZ8eik",
  "title": "10-17-23 Senate Study Committee on Local Option Sales Tax",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 145,
  "summary": "Here is a structured markdown summary of the Georgia 10-17-23 Senate Study Committee on Local Option Sales Tax session:\n\n## Overview\nThe session focused on discussions around the local option sales tax (LOST) in Georgia. Representatives from the Association of County Commissioners of Georgia (ACCG) provided an overview of the history, current issues, and potential solutions regarding the LOST negotiations between counties and cities.\n\n## Key Actions\nNo specific bills were mentioned as being passed, referred, or introduced.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- ACCG representatives gave a presentation covering the history, current problems, and potential solutions for the LOST negotiation process.\n- The committee heard from county managers and attorneys who discussed their local experiences with the LOST negotiations.\n- There was discussion around whether to try to improve the current negotiation process or explore alternative approaches.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript did not provide any specific details about quorum or attendance.\n\n## Adjournment\nThe transcript did not include details about when the session adjourned or when the next meeting would be held.",
  "transcript": "you Welcome to our second low option sells tax study committee. And what we'll do today is we'll hear presentations from ACCG and feel free to ask questions super early from us of council here to make sure we stay on safe and safe as they are going to keep us safe and safe as they are going to keep us safe as we have council and we've got our Senate press team. We could give them a round of applause from the panel to get us hooked up and set up. And we will add ACCG presentations. We'll answer them. We will answer them at that time. I appreciate you all coming to the great city of the city of the city. I hope you can help me. Members of the committee look at your calendar and give me a couple of dates. As you can text me that we could have our next meeting with the next two or three weeks. We'd like to coordinate that. Our next meeting will be in spawning with chairman Davis. Spawning is going to gladly host us. And I think his manager is right behind me. So we will come from the city of the city of the city. We will be able to review the report and kind of go from there. If you all could take a moment and do that. I want to make sure everybody can make it to the next one. Just not the first of November I think we have all the ethics here in that. You're on ethics. Which none of you are. But are you the president? You will be there all day. That's so exciting. I think the president is. Yeah, out of this, we just any day not the first, because we'll be here at Mayano from nine to five. So we'll be here. We can, if you want to just text me kind of what your options are and we'll do it any, any money moe and grab it from there. Because if you tell me I won't tell that I will forget. That way you can just put pencil like hold on your calendar right now. I don't know. I don't know. I don't know. We'll have to travel to Perkins, Paul and so. I'm excited about that. Well, thank you. And also. Well. We'll go ahead and try to look at those dates. Like all committee meetings in the Senate will get started and I'll ask manager J. Melter to open us up with a word of prayer and then we'll move into our presentations from ACCJ. Thank you, Senator. You're what we thank you for the continued blessing. You still want to say for the community. We thank you for the leaders of God of Year today to continue to address the central question that you most famously closed. Give up the season. What is the season? We're here with our skill and our abilities to try to determine that for the Georgia people and for the people of our counties and bar municipalities. We pray for peace and we pray for the protection of the servicemen women of the United States military who were across the globe and here locally serving in our name and in your name here to look for the peace and protection of our country. Thank you for our abilities to be here today and discuss this one whole opportunity for our state and your name. We give thanks. Amen. Amen. And to my left, Senator Russ Goodman will also be taking autographs and will be available for bookings to give his official account. Okay, sorry about this, but he will be giving his official account of his experience and time in Israel. He's back. And so he's also a welcome to host the group. You go back. But you have to get your own way there and back. He's not going with you. Just call you. So we're excited to have Senator Russ goodman back and his mom made it back safely while they were in Israel. It's always an interesting day when you read your A.J.C. email that says Senator is in Israel and I said I'm not even going to text it because I'm just going to pray for him and pray that they make it back safe. And so he's back with us and here at the Low-Govs and Sales Tax Center Society Committee. So let's just give Russ a little round of applause. Thank you. I'm glad to see you. Without further ado, I'd like to welcome members of the Association of County Commission and what's the last one on the G-Govs? ACG, the comment, give us some presentation. Thank you, Chair and Mallow. Members of the Senate Law Study Committee, we appreciate you allowing ACG to speak today. Fortunately, I don't think law-sing issues are quite as contentious as what we're dealing with over there in the Middle East. But counties and cities in some places it does get fairly contentious. So we do appreciate you looking at this. At the end of the day, local government want to go about their business and provide the local services that are citizens to man and women. And so we're going to have a little bit of a conversation with the state of the state. And so we're going to have a little bit of a conversation with the state of the state. And so we're going to have a little bit of a conversation with the state of the state of the state of the state. And so we're going to start with sort of history, y'all didn't get thinking they created this, lost tax, and then walk all the way through till we're at today. So we'll start with the history. And then we'll talk about some of the current problems with the current process, and then we'll wrap up with some potential solutions we ought to look at. We do have a couple of our county managers and the county attorney here today. They're gonna speak more from a local perspective and talk about the experience they personally had. So we've got Byron Lombard, he's the kind of Andrew Green County. We've got John Hart, the attorney for Chatham County. And Heather Scott, she's the manager in Jeff Davis County. So sort of a two smaller counties and a larger county perspective. They all had difficult negotiations. So you'll hear from them at the end. I'm gonna have Dante come up here in a second. Dante Handel and our team. He's gonna cover the history. You'll feel free to ask us any questions as we go along. We want to make sure you also understand the timeline of how things have progressed. I'm gonna start though with sort of a big question that is gonna be before you all. And once you'll think about this question today, as for... So when the original law was created, it was a formula driven system. There was no negotiation. It was really about property actually. We went back into the historical records and looked at some of the conversations that were taking place. The general assembly clearly had time meant for this to be a property tax relief. In fact, there was actually some debate on how to give the property tax relief. So the governor at the time, Governor George Busby, he wanted the system where we rolled back, we decided to make some population to give a rollback in the inner opioid area, cities they were rolled back inside the cities, which is what actually got into the original law. We had a chairman in Chairman Collins of the Ways and Means Committee. He didn't want to do it like that. He actually wanted the state to collect the full opinion of sales tax and give it back, like you always give him that HRG this year. You know, the HRG grant credit, the billion dollars did you all vote it on? He had envisioned a system like that where the state would give the property tax relief back to all the citizens, not the counties and cities. And of course, the governor went out in that discussion and the way the original law was developed, as it was a formula in the manual and straight to the counties and cities based on that form. So we're gonna talk about that. But getting back to this decision, so there's kind of two ways we can approach this. One, we can try to improve the current negotiations. So clearly the current negotiations don't work and they cause a lot of our feelings and a lot of places. So we can try to improve on those negotiations. And quite frankly, I'll be honest with you, that's probably where we're gonna get the most consensus between GMA and ACCG, as far as our members and GMA members. We can probably get most of our members to agree that, hey, an improvement to the existing negotiations is a good thing. Second option is to forget what the government's forgetting, right? One government fighting another government over limited potomani and go back to, well, how do we just give this back to the property taxpayers? Do some sort of formula that's equitable. It's all property taxpayers. Whatever you all, we can talk about equity and ways to do it. But at the end of the day, how do we give it back to property taxpayers in a way that everybody's getting the same benefit off their property tax bill? That would probably require some kind of a formula. And I can tell you, there is no formula that's gonna satisfy everybody. You're gonna make probably about half the people up seven of any kind of formula. We've had these discussions, we've talked about formulas, we've got some good ones. I'll mention somebody in today, but in the day, probably half my members, half his members, they're not gonna like it, because they're gonna run the numbers, right? And they're gonna see where they stand. And if they come out to the better, they'll support the formula. But if it takes many way from them, they're not gonna be supportive of the formula. So again, the way it's looked at today is kind of a government to government. What is my government getting to support my budget versus what's the other government's getting to support their budget? But the other way to look at it is, what are the taxpayers getting in the day? So keep that question in mind as we move through the presentation. And without them, go ahead and call Dante Handel up here to give a history of loss. And when he's done, we'll talk about some of the problems with negotiations. And then we'll mention some potential solutions, Dante. Thank you, Clint. Good afternoon. Chairman Malum, I'm a member of the committee. Appreciate your time, Seth. Good afternoon. So my name's Dante Handel with ACCG. And I'd like to talk to you a little bit about the history of loss. So in 1975, that's when the original loss law was enacted to provide property tax relief. So we're using sales tax to offset property tax for the citizens. That law was later amended in 1976. And then there were a handful of court cases that changed the course of loss and kind of helped smorfen into what ends up being today. So 1978's first major court case I'd like to talk to you all about. That case is Martin versus Ellis. So that one struck down the differential rollback as unconstitutional uniformity concerns. So original loss law, the county portion is being used to rollback in the unincorporated area only. And the city portion is being used to rollback in the incorporated area only. So that court case and the changes that the city residents now receive in a double rollback. So the county would have to rollback county-wide, not just in the unincorporated area. And then the city would still provide a rollback in the incorporated area. And later in 1979, next major court case, city council of Augusta versus Manjelly. So that court case ultimately declared lost unconstitutional and essential issue. And there was whether or not allow an portion of the proceeds of the county tax to be distributed to the cities was constitutional or not. Ultimately, distribution to the city's failed as an unconstitutional and proper purpose of taxation. So the general assembly had to go back and take a look at that law in 1979. That's when the general assembly passed a new loss law. This time it was a joint county city tax. It fixed some of those constitutional issues requiring kind of a property tax rollback. There was really intended to be a stop-get measure to the general assembly could go back and pass constitutional management to restore that original formula. Now, a year later, in 1980, next case is Taylor County versus Cooper. So the Supreme Court of Pell of 1979 lost law. The constitutional authority provided by supplemental powers and special district provisions. There's no equal protection to do process problems on the basis of some areas received a greater benefit than other areas. And the local negotiation is not an unlawful delegation of power. And in 1994, we see that the new loss legislation requires periodic negotiation. That's where the eight criteria that we have today are added to the law. Since we have that required periodic negotiation next year in 1995, that's when we have the original required negotiation. So the two sides always have been able to renegotiate. That's where it was required after the 94 law. And so that is the first negotiation, 1997, the service delivery strategy law goes into effect. And then in 2002, after the dissennial census, that's where we have the first required negotiation following the census. So later on in 2009, baseball arbitration was introduced with two sides each would submit their best offer. And ultimately one would be selected. 2013 case, Turner County versus the city of Ashford throughout baseball arbitrations. That's following the 2012 renegotiations after that dissennial census. And in 2014, a previous room's directed in the process for the lost appeals mandated. 2019, ACCG and GMA were working on negotiating with each other about lost. And then in 2020, we had the pandemic that put those negotiations on hold. And it weren't resumed until 2023. So 2022, last year is when we had the next round of negotiations after the dissennial census every 10 years. And in 2023, the two associations are working together trying to improve the process. I'd like to turn it back over to a clean field down at any questions. Anyone have any questions about that issue at timeline, down the outline? We started with a purely population based formula, real simple, easy to calculate, went to a rollback in the end of order here from the county, a rollback from your city. And they threw these series of court cases. They had to change the law to keep it constitutional and keep the whole law from being thrown out. And we never had put another formula back in place, but they did come back and put a mandatory negotiation in place. And that's where we're at today, this mandatory every year, 10 year negotiation that we're doing. Okay. We're going to talk now about some of the problems with current negotiation. First of all, everybody knows this is zero-sum game, right? There's a fixed pot of money that's collected and sell facts in your community. And you've got to split it between the county and all the cities. So any dollar that one side gets as an increase means it has to come from somebody's getting a dollar deduction. So that's one thing that makes these negotiations difficult, because there's always somebody that's losing money in their budget if somebody else gains some dollars in their budget. Keeping laws from terminating always comes making it more equitable. So we've heard this over and over again, people think there's a change that needs to happen, right? But at the end of the day, you're going to hear from some presenters today where this is happening in their county. They fought really hard. But at the end of the day, they could not reach a consensus and nobody wanted to let it have to terminate. So what they did is they just left it like it was. It's not that they were happy with the way it's been. They really thought that a change was due, right? But obviously, whatever side was going to lose some money did not want that to happen. Whoops. And so they want to believe in it like it is, right? If I, from us to months, and then leave like it is. Because it's too big of a risk. I mean, in the penalties, you lose the tax, which means all your tax here lose its property tax relief on their tax bill, which is going to probably get everybody in office thrown out. It doesn't matter who's faulted it. Nobody wants to, it's a political figure. You don't want to, you don't want to have that happen on your watch, right? So you try to negotiate, but at the end of the day, if you come down to the wire and you're faced with not getting what you want or the tax lafcing, you just go and kind of take what you can get. Every government does not have an equal C at the negotiating table. I'm not sure why this keeps setting off on me. I apologize. You think about the negotiations on me, too, examples. Let's take Fulton County this year. So Fulton County, one of our largest counties in the state, they're almost completely immunized. They only have a small sliver of industrial property that's left in the unincorporated area. Well, they were only getting like less than 5% or so of the tax. So they had, this is a huge county. The little bit of law spending there, getting in their budget was minuscule compared to their budget. So they really had to have anything to lose and everything to gain. So you can imagine the city's going to that negotiation and they're negotiating with the county that's saying, we're going to need more. And oh, by the way, if we take, we're ready to let this thing lapse and go to the poster, whatever. That's a credible threat because we can absorb this loss in our budget without any doing any harm. You all can't absorb that loss and we know it. So that's the case with where the counties were having some leverage over the cities. Now the reverse, I'm going to give you the reverse. Let's take Forsyth County, which is north of Fulton County. They've got one city city of coming. They represent about 3% of the county population, but they're the only city in the whole county. So the county's got to get agreement with that city, but it's only 3% of the population. Everybody else is outside the city. Well, they were getting closer to 15% of the money, even though they were 3% of the population, they wanted to keep that 15% of the money. What do you do? The county can't afford to lose the cell tax. They get the bulk of the money. So that city really has a lot of leverage in that negotiation. And then we have this thing called absentee municipalities. These are cities that are small that they don't have to sign the agreement. They're not required to sign on. So the default formula for them is they get a population share of what the larger cities negotiate on their behalf. So they really don't have any say so, right? Because the large city and the county can keep them out of the negotiations at any time. They can say, look, we don't really care what you think. We're going to give you your population share of the municipal share of this. And go one home, we'll tell you when we've got it resolved. So they don't really have much of a city at the table. So again, when you look at who's at the table here, it's not always starting from a level playing field. In Russia, again, we see a lot of people just leaving it like it is. Because that's the easier thing to do than it tried to explain why it changes needed. It's the end of the day it's easier to say, we'll just continue to do what we did last ten years. There are side agreements from passing negotiations. A lot of them. Those are lost or forgotten. In other words, sometimes maybe 20 years ago, one side got more lost money because they took over, let's say they took over a service like recreation. And so the agreement, the side agreement was, okay, you take over this service and we'll give you more lost money. Well, those like officials are not in office anymore when the next round of the issues take place. No, but in people forget. And so they just say, why is that jurisdiction getting so much lost money? They don't deserve that much. They forget that, well, there was a reason why they got more lost money because they took over a service back then. But they forget about those side agreements. So then you start re-maching things. Well, they don't deserve that kind of money. They need to be more in line with everybody else. There's obviously higher consultants in attorneys who get paid to do this work. And guess what? I've never seen a consultant or attorney that's argued for less for their client. They all argue for at least as much. Sometimes it's a defensive posture. Sometimes what they're saying is, we just want to keep getting what we've always gotten. Just don't give us anything less. I've seen that. And I've obviously seen them argue for more. Never seen them say that we deserve less. They're getting paid to the representative client. And they do so well. They know the law well. They know the law better than probably any of the elected officials that are in the room. And they got all the statistics that they use. And they can spend the numbers anyway they want them. That makes these negotiations really tough. And costly. That's where you get into a lot of tax costs to try to pay for these consultants' training. Because the guarantee you what's going to happen is once one side gets the consultant or attorney, guess what? The other side's going to get one. Right. They may have not gotten one to begin with. But they hear the other side's getting one. OK. Now we're going to lower up. We're going to consult enough and get ours. Um, eight criteria will get into those here in a little bit, but they're very ambiguous. It's very difficult for you to understand them. You can see a lot of these criteria reference SES. And you're going to say, well, don't we have an SES agreement, which is a separate agreement? Yes. But remember, is Dante said in the timeline that SES law got passed after these eight criteria are already in law. And we never went back and changed the eight criteria. So really the law of the negotiations were the first SES negotiation to. We were handling SES negotiations in our all SES negotiations back then. And then we created that separate negotiation, but everyone back and changed the law. The negotiations do not usually focus on tax equity. Again, it's really the end of the day. It's more about how's this going to take my budget? How's this going to affect my services? Not so much is everybody. All the actors get the same amount of tax relief. I'll talk a little bit since it came up at the first meeting a little bit now. I think the first meeting was host to us being used by some counties as a threat. Like if you don't negotiate with me a law, that sign will let it lapse and we'll move to host someone dressed that later on in the presentation. And then at the end of the day, it's political in a lot of places, right? We're dealing with elected officials, representatives in their constituents. You all are elected a lot of you all elected officials here. How many of you all want to tell your constituents that you got a less money? Because of your work on a committee, now they're getting less property actually. Because you had to give some money to the other side. Nobody wants to be in that position. And so you may even internally sometimes think, yeah, this has got a really good argument. Maybe we should give up some money. But in the day, I don't want to give up anything. I want to at least get what you staff. And so a lot of this stuff is political. So there's really no justification. It's just like, okay, we used to get 30% percent and we spent to get 30% percent. And we don't have to bring any evidence to the table. So that's just a real snapshot of some of the things that we see that make these negotiations real contentious. Now when you get into some of the criteria and we're walking through the criteria and how they're worth it and just how confusing they are for the elected official that have to consider it. Yes, Chairman. Just a quick question. I know we were talking percentages. And so in the percentages, have we maybe discussed that when, for example, collections are up. What if you didn't have large collections, maybe your percentage of laws was this dollar amount. Is there any way or conversation about when collections are higher and you see a large portion, dollar wise? Because when you say budget, we're talking dollars that were budgeted. But if collections are up and budgeted dollars will be more because collections are higher. So how does collections factor into this conversation? So that's a good question. It does factor into the conversations. And so what I see is that because it's done once every ten years, you're kind of stuck with it after that for ten years. So but in some of the negotiations, I've seen people use past projections like this has been our short growth in sales tax. And then they adjust the percentages over multiple years. So maybe one side is going to give up 5% so another side can gain 5%. What they'll do is they'll say, okay, based on our revenue projections, we're growing it about 2% a year. So we can absorb that 5% loss. That actually assorted any real dollar loss in our budget. If we gradually do this over a three year period. So we'll lose a third of it, the first year, a third of it, the second year, the final third, the third year. But if the store trends hold, we won't really lose any dollars because our sales tax is growing enough that we're going to keep the same amount of dollars in our budget. Even though we're losing 5% that makes sense. That's what they do. That's why I've seen it. So before I actually get into the specific criteria, I just want to be thinking about these when I go through the criteria. But first of all, it's an on-exclusive list. In the log just says, you have to consider these things. It does not say you have to use it. It doesn't give you any priority over, okay, you use this one, but this is the most important one. This is the second most important one. It doesn't even give a waiting, okay. We wait this one more heavier than that one. It just says, consider these things. And then, oh, by the way, you can consider anything else. So consider this and you can consider anything else you want to consider. Which doesn't give a lot of direction or guidance when it's that kind of language. Some of the criteria may have more value to others. And we see this in negotiations. Like the city will pick the criteria that they think are most advantageous to them. And the county will pick the criteria that's most advantageous to them. And that's the ones they argue. We should use these criteria. Well, why? Well, the real reason is because there's more advantageous to them. You use that criteria. Some are more relevant than others. You know, if it's about property actually, if you think statistics about how much property tax relief you're giving would be more relevant to the discussion, but that's not really what happens. So some are easier to measure. Some of them are very difficult to measure. We'll get into some of that, too. Again, no guidance on which ones to use, how to weigh them, how to measure them. There's no definitions. So we get arguing over what is point of sale. What is daytime population? What is economic benefit? So all those things get argued over in negotiations. So I think my point is, the criteria instead of being helpful guidance, they tend to just confuse the process even more. You have more ammunition of both sides to argue. So here's the criteria. We're going to walk through them. So you'll see the first one, which is the link here one, talks about the service delivery responsibilities of each political subdivision to the population served. Think about that. We have a lot of different populations we serve for each type of service. I've got counties that have county-wide services. We have counties that do some of their services only in the unoccupied area. We've got some counties that do their services in the unoccupied area in some cities, but not all of the cities. We've got cities that provide services outside of the city boundaries into the unoccupied area. So if you look at it service by service, we've got a different population set potentially for every single service. We're looking at. Think how complex and confusing that's going to be when we have to line up. We really have population numbers for some of our service areas. If you think about a service area, if you've drawn to provide a fire service, well, the census doesn't acknowledge our service district. They're not given a population statistic. Do we have population statistics for those service areas? No. We're having to guess. Maybe you can guess at it. I don't know. But we don't even know what the population is for some of these service areas. Other than maybe the property tax bills and you can guess how many people live in a household. I don't know how we get to some of these population numbers. And then what really gets confused is really the last part of this. The inherent value of the community of the central business district and the unoccupied areas of the county and the obligation of all residents of the county for the maintenance across the area of the central business district and the unoccupied areas of the county. What does that mean? The inherent.\n\nvalue. So Senator Goodman, you're an agriculture. I would argue that if you didn't have all those farms in the unincorporated area, you probably would have a city there, right? If you didn't have the agate, the agate industry dried up overnight, would that city still exist? So that would, you know, you can look at, hey, the unincorporated area has a huge value to the central business district. You have key customers because of the farms. Vice versa, the central business district would say, well, if we didn't have the central business district, you have to go to a neighboring county or another city to shop, but because we have the central businesses, you know, that's where the versus work looked. That's where the convenience sort looked. So we produce economic, where the quote, economic engine, because we have all the stores and commerce. Well, again, they may have the retail stores and commerce, but in the unincorporated area, you have a different kind of commerce. It's not retail, but it's still just vital to the community, right, to support local economy. And so that gets real confused. You don't argue about that all day. Who's valuable, you know, and they're both valuable at the end of the day. So number two, service delivery responsibilities of each political subdivision to the resident population of the subdivision. That's actually one of the easier ones, right? We can take census numbers, which is based on resident population. We can tour calculate that. But here's the problem with resident population. A lot of times in the negotiations, the counties are only giving credit for the univore population, but they serve the city residents too, right? Those city residents receive county services. Sometimes disproportionately, you know, like a library, maybe located in the city, and maybe more city residents use a library, but the county pay for the library. So you really got to look at it if you're, if you're again, talk, talk about population served for a lot of the county services is kind of what population. And even if you use resident population for the county, there, whether you live in a city or not, you're still a resident of the county. The existing service delivery responsibilities of each political subdivision. What does that sound like? SES service delivery strategy? Remember, that was part SES, but that's exactly what we do in service delivery strategy negotiations. So we're already doing this in a separate negotiation. We're talking about the service delivery responsibilities of each political subdivision. We get that to the park community fairs. We have to tell them, here are all the services we provide in our county and all our cities and where they're providing the services and how we're paying for them. That's a separate negotiation now, but it's still here in lawful, so it's rehashed a second time. Existing service delivery to the city, the effect of a change in silks tax distribution on the ability of each political subdivision to be short term, long term debt. Fortunately, in our state, we don't have a lot of debt. I mean, we have things like tax anticipation notes and leasing and some of those things, but that's not truly debt. It is like geobond debt where you're pledging the full faith and credit of the taxing powers of the jurisdiction of payback debt. We don't have a lot of counties in cities taking out geobond debt. So it's not, that's really, am I opinion not a really big issue that they're going to fail to be able to pay off their debt due to a change in the law of application? This is a popular one point of sale and use which generates the tax to be abortion. I don't know who put this in law, but they obviously did not consult with our state department revenue because in Georgia, we are not appointed to sale state. We were what we call appointed destination. That's how we cite us to sale in Georgia. And you may say what's the difference in appointed sale side versus appointed destination side as well. I'll tell you, let's take a home depot. I'll live in Cherokee, the home depot shop at this in Hoth. Why do that home depot store? Basically, by anything in that store walk out with it, my sales tax is going to hop county, not to become out of it. Now, if I go to that store, so I'm signed a contract to have a wash machine or dishwasher delivered to my house and installed, now they're going to charge me Cherokee sales tax. Now, I'm not taking that wash machine home with me that day. They're going to send it in install route next week with a truck and they won't put it in my house. So, where I receive that is at my house, not at the store. So, the sales tax goes to where my house is located. Same with all these internet transactions. You may be buying who knows where the warehouse is sending you that product. But you're not paying sales tax to the county where the warehouse is located where the product came from. You're paying sales tax based on where they brought that package off, which is usually the front door step. So, it goes to that county. That's what I mean by appointed destination. We're not appointed sale. Also, the department revenue, so other than the most tax with the cities that are in Fulton County, every other tax is a county-wide tax shared with the cities. So, when a retailer is filling out their sales tax return, they have to apportion all their sales to the 159 counties and then those few most cities. But they're not telling the department revenue if the sale occurred inside a city or in the iniquity area. They're just saying it occurred in that county. So, that's all the information that you are gets. So, the DOR has no idea if the sale is attributable to something that happened inside one of the cities or outside of the city. They're multiple cities obviously in a lot of counties. They have no idea where it's coming from. So, you can talk about appointed sale, but there is no data on appointed sale. Because again, appointed sale doesn't exist. And even if you did a based on appointed destination, you can't even get that information. So, you see a lot of people trying to do proxies for this. They'll go in and get data about how much general commerce goes on in their area. How much retail sales they have in their area. And that becomes a proxy for this. The existence of inter-governmental agreements among in between local sub-advisions? What does that sound like? Again, SES. That's a type of an agreement between counties and cities. Now, there may be some side agreements outside of SES, but a lot of this gets captured in your SES agreement. The use of the any political sub-advisions or property taxes and other revenues from some taxpayers to subsidize the cost and services provided by taxpayers of the levings of the VHS. So, this gets in what they call double taxation. Well, we address double taxation again in SES negotiations. This is part of this deal of passing. So, they wanted us to address double taxation in this negotiation. So, again, we're addressing in both types of negotiations. And then, any coordinated plan of a county municipal service delivery and financing. Again, what does that sound like? Another coordinated plan of how counties and cities will provide their services? That's the SES negotiation. So, you can see throughout these criteria, they keep referring to things we already do in our SES negotiations. And which makes this negotiation confusing because are we rehashing everything we just did in an SES negotiation? Now, we've got to talk about it all and argue over it again. And that's what happens at a lot of places. They talk about it every time they get a chance. So, as you can see, the A criteria are really confusing and don't really lend a lot of guidance to the process. So, let's talk a little bit about tax equity. We told you that the original formula was a simple formula, population-based, residential population, got thrown out by the courts. And then, the county started taking the Mount of May it received. It was only going to a rollback in the Unincorporated Area and started providing that rollback to everybody across the whole county. But the Mount of Money pretty much stayed the same. So, what does that mean? If I was given two dollars to the Unincorporated Area and zero dollars to the county residents inside the city, now, I'm taking that two dollars and I left one in the Unincorporated Area and moved one over to the city. So, I just cut theirs about in half. And that's very simplistic. But that's what's happening. The Unincorporated Residence got a reduced amount of tax benefit because they had to then use some of those dollars to pay for that tax benefit inside the city. And, of course, the cities are still continuing to get money and providing the rollback on the city tax bill. So, we actually run the numbers across the whole state and we gave you a copy of this. We send it out ahead of time. I think you've got a copy of the data that was put together. And it shows the percentage of the county tax bill and the average percentage of all the city tax bills within that county. So, again, how much percent-wise reduction do you get in your property taxes due to this loss sales tax being collected? And what we found is for the counties, this is statewide average here, roughly 22%. So, if you didn't have the loss, your property tax bill would go up roughly 22% for not having that offset. For the cities, it's roughly a 49, almost a 50% offset. So, if you live in a city and the loss were to go away, your city taxes would basically almost double. It's about a 50% reduction you're getting due to loss. So, you can see that on average, everybody gets the 22% off. So, whether you live inside the city or you live in the end-acorporated area, your county taxes, you get the 22% off your county tax. Because you're paying the county taxes even if you're in the city, right? So, you're still getting the 22% reduction on your county taxes inside the city. But in addition to that, you're getting another, roughly, 49% reduction in your city property taxes. And now I'll get to special service districts. They get nothing. We'll talk about that later. Yes. How do you calculate for the total city ad floor tax burden when you're talking about jurisdiction with multiple municipalities? How are you calculating that percentage? An average? Yes, it's an average. We just took all of an average room together. So, it could be a very different city by city. Yes. For like a local context, so we have municipalities in Chatham County. One of our municipalities has no millage. Right. They get 100%. Yes. Which would absolutely throw the other percentage for that. So, that's kind of what I'm asking about comparing apples to apples here because it is very, you know, idiosyncratic to the makeup of the county in the municipality. Yeah, so we actually looked it in your right. So, I don't think it's on this slide, it's on a later slide. But, so for the counties, we looked at the smallest amount of reduction was around 2% off the tax bill. That was the worst case scenario. Best case scenario was around a 48% reduction in the county taxes. So, that was sort of, that's a big range though between 2% and 48% off. But, for the cities, the range was even bigger than that because it went all the way up from, you know, less than 5% or so off your tax bill all the way up to 100% off your tax bill. Like you say, so there's a bigger range for the cities. But, for the case of what we did, we were just taking averages because we were trying to, again, we took the averages for all the counties in the state, but we also were taking the averages for all the cities in the, in the state. We also look at two, because I see is sometimes similarities would be a very small municipality that would be able to offset all of its millage rate with their lost proceeds compared to smaller unincorporated areas where perhaps their special service district fees or taxes can be completely offset by lost as well. Do you look at that too when you look at the, when you talk about the county, that's just countywide taxpayer M&O? Yes, it's just countywide. I was going to get to this later in the program, but we don't give any offset on special service districts. Well, you're not supposed to. Right, you're not legally allowed to. That's right. Yes, not that we don't just do something. We can't. We can't. We can't. Yeah, we, yeah. So, like I live in a county that I received my fire service to an unincorporated service district and roughly my millage rate for fires about four mills. My county millage rate county wide millage rates about six mills. So, that's a pretty substantial amount for mills. Yeah. Well, I get zero rollback on my four mills due to lost, but the people in the city that get their fire from the city, they do get a lost rollback on their fire. But, so the reason is they can get the lost rollback on their fire because they're paying for that other city general M&O levy where mine's not coming out of the county general M&O levy, therefore the county can't give me a rollback on my lost. Right. But the city, the city taxpayers also pay the county M&O as well. Yes. But they should only be paying the county M&O for the county wide services, right? It's not for things like fire that are not county wide. But, couldn't you look at a city millage similar to a special service district millage? You could. Yeah, we'll get that later, but you're, I like that. I mean, we like that idea. If you thought, if you think about a special service district, which provides a lot of those supplemental powers that we'll get to later, you could, if you treated them like a city, I think you'd get a little more equity there, where you could roll back on the on the special service district like you roll back inside the cities. Yes. I agree with that. So, 95% of the counties with a loss, the tax provides greater tax relief to the municipal taxpayer. And again, we sent you the data sheets. If you have any questions on specific data, I think these are the data for the counties that are in your senate districts. So, it's not the entire state. We just looked at the ones inside your senate districts. The bulk of county wide M&O levy is not supplemental powers. So, this goes back, so one of the things that happens in the negotiations, because this says it, it's a holdover from the original law. Remember when the original law was created, we only got a share based on our unincorporated population. Therefore, you should be using it for those supplemental power services, right? The things that, you know, it's for a rollback for the unincorporated area, but also to pay for things in the unincorporated area that you don't provide in the city. Well, when the law got changed, and we started providing the tax relief county wide, we still have that holdover supplemental powers language. So, some cities will argue, as they'll say, see there, you're only supposed to be using this loss for supplemental powers. We're like, well, legally, how can we use it for supplemental powers? Because we have to put in our general fund, and that's not where most of our supplemental powers are paid for. Supplement of powers, if you're going by SDS, you should be paying for that of a special services, or not your general fund, because those are the things that compete with cities, right? Cities got their own services. Unincorporated area has its own services. And so, and we're also doing the rollback. So, we pay for the rollback out of the general fund. So, how can we pay for supplemental services when we're putting in our general fund and doing the rollback out of the general fund? It just doesn't, it's too early in conflict. Again, that last point of already mentioned, we legally cannot, this is what our attorneys are saying, because I've asked this question over and over again. I think it would require, it would change the law. But we can legally not do a rollback on millage for a special service district, because it's not county-wide. So, let's talk about hosts. So, I think this came up in the context at the last meeting of some counties that were threatening, hey, we're going to go to a host if you don't negotiate what we feel like is fair and lost. So, first one, let you know what host is, because some people don't even know what host is. It's only, by the way, into cabin right now. There are only two places that have it in the state. And I'll tell you why that is. They, for whatever reason, couldn't pass a law, stacks. And then long after the loss went into the law, we passed a host law, and they were eligible to do it, and they were able to get their voters to vote for that. But the law said, for everybody else that has a lost, you're not eligible for host. You can't do a host if you have a lost. And so, all these other counties across the state, hosts has really never been an option for them to consider, because they have a lost. Legally, the law says they can't consider it, right? So, now, if the law said you can choose between a lost or a host, that would be a different matter, but that's not what the law says. So, the only way the host would ever be able to be considered if the lost went away. So, what is host? It collects about the same amount of money as lost. There's one big difference, though, where you spread lost out to all your property taxpayers, so commercial, industrial, rental, everybody gets a little bit of tax benefit off of of loss. Host, you're targeting your homesteader properties. What you're saying with hosts, you're saying, we're going to get priority to the homesteads, because those are the people that, you know, they're not making money off the home they're living in. We don't want tax grandma out of her home, so we're going to put all that tax relief into that type of property only. So, what happens is we're like in counties you can give with lost on average 22% tax reduction with host, in Rockdale, they're given 75% reduction. In the cab is 100% reduction, significantly more. Same amount of money, but the reason they can give so much more tax relief is because they're not applying it to all types of properties. They're only applying it to the homesteader properties. So, for the homestead owner, if you own a house and that's all you own, and it's the house you live in, host is going to be financially a better deal for you than lost. But now, for everybody else that owns a farm or owns any other type of property, rental properties, yeah, loss is going to be better for you because at least you get something. You get nothing out of hosts. So, that's kind of the main difference between the two. So, there's a capital component to host where you can take 20% off the top and use it for capital before you use the rest for property tax relief. That's kind of changed into cab. That's still the case in Rockdale. The cab has gone through three iterations of host laws. They've got, so they're not operating off the same host law as Rockdale is. They're kind of unique. So, I think if any other county ever were to do a host, we've got Gwinnett, Cherke, and Cobb that don't have a loss. So, those three counties would be eligible for a host. They would be following the Rockdale County model. And the Rockdale County model does not share it with the city. It just goes, the county is the only one that gets it. And they provide that property tax relief to the home city of property. But the city resident gets a big chunk of their county property taxes reduced, right? So, in Rockdale, 75% of their county property taxes go away because of a host. So, it does benefit city residents, but it just doesn't give any money to the city budget. So, loss covers between, I already mentioned this statistic, between 2 and 40% of the county tax burden. But then you see where host is covering 100% and 75% in Rockdale County. So, here's the other thing about host. If you were to let the loss lapse, real it, and that's your threat, okay? Loss, we couldn't get tax equity on lost. So, we think host is more equitable. Therefore, we want to go to a host. Because that's what I hear from the counties. If we could get tax equity in loss, we wouldn't be thinking about a host, but because of any tax equity or we'd feel like we're not getting it, this becomes what we feel like is an equitable way to provide the tax relief. Again, that's their opinion, we know that. But realistically, could they let the lost lapse and pick up a host? Yes, but a lot of things have to happen perfectly for them, which are not likely to happen. And here's the process. Let's say that a county didn't sign the the lost agreement that was due in December of 2022 and they let the tax lapse. So, January 1 of 2023, there is no more lost. And let's say the county says, okay, now we want to go to a host. Here's what's got to happen. First of all, they got to go you, the members of their delegation, and get you all to pass a local act. Because with host, you've got two questions on the ballot. One's for the homestead exemption and one's for the tax. So, it's a two-part question. You got to pass both of them. Do you want a homestead exemption, blah, blah, blah, and do you want the tax to pay for that? Because of the homestead exemption piece, they have to get the local act passed. So, if the city comes to you and says, whoa, don't you pass that host, they didn't play nice with us in lost negotiations. You better not allow them to have a host. Now, your delegation is stuck between your county and your city. And you got to, what are you going to do? Are you going to pass the local act? Are you going to not do anything, right? So, the delegation can stop it in its tracks. The county commission, unlike Splaust and all these other sales taxes we've been talking about, where the county has the ability to put it out to referendum. They do not have the ability to put a host out to referendum. They cannot go put a host out to referend. They have to go through their delegation only their legislative delegation has the authority to put that host on the referendum. So, that's probably going to stop it right there. So, if you do get it passed your delegation and get them to pass the local act of the general assembly, then you got to have the local referendum and your citizens got to pass it. So, that would probably happen in November of 2023. Let's say it passes. The citizens want this host and they pass it. Okay, now collections don't begin immediately. They don't begin until April of 2024. And then the law says you got to collect for a full calendar year before you can provide tax relief. So, collecting for the rest of 2024 is not enough. You got to collect all of the rest of 2024 and all of 2025. And then only then at the end of 2026, when those property tax bills go out at the end of 2026, then you can finally provide some host tax relief on those property tax bills only to home standard properties. So, tell me what elected official is going to make that gamble. What elected official is going to say, I bet you I can get my delegation to support the host. I get my citizens to support the host. And then I can get my citizens to wait four years for property tax relief from the time lost lapses until I implement my host. I don't know about job, but I don't think that's likely to happen anywhere. In fact, in reality, it's never happened anywhere. Whether it could happen, yes. Technically, it could happen. But the likelihood of that is slim to none. So, again, going back to this thread of, hey, if you don't negotiate on loss with me, I'm going to go to a host. Okay, yeah, you can go to a host, but this is what you got to go through to get there. That's not likely to happen, yes. Do you believe that for the counties that you saw threaten the host that those county leaders understood this process? Well, I don't know. We tried to explain to them. In fact, you're sitting next to one. Chairman Davis, I hate to throw you under the bus, but they were looking at the host and he had me, you had me come to your commission meeting and you invited all the local officials and had me give a presentation on it, right? So, we were glad to do that to anybody that said, I know that my counterpart Jim Thornton in a GMA, we've had these discussions and I hope that they were advising their city members the same, but that's what I told my county. That's fine. Go if you want to threaten. I guess you can do whatever you want to do, but just know that the reality is you're probably never going to be able to do a actual host if it comes down to that, because this is the process you got to go through it. Yes. I can't imagine that your business community know your agriculture for community. We appreciate going from a loss to a host. They would probably fight. Guess what? And what's going to happen when you're ag and commercial folks come to you, Senator, and say, don't you dare pass that local act? Are you going to just pass that local act? I'm not going to pass it in my business. That's right. So, again, I don't think this thing would ever fly. A comment about it from when we were going through a loss, we said, I really said to the county, our county manager, what other options do we have? And the answer was host. We said, oh, what do we know about host? Bring Clint in and let's talk and see what the host looks like to be able to do that and invite everybody that wants to come in and listen to the presentation on what host looks like. So, it was eye opening for all of us. It was, oh, okay, thank you. Sounds good in theory, but in practice, that looks pretty tough. We like the idea of all the homestead extensions, not having to pay, but what it takes to get through it, we can't get there from here. So, I'll briefly touch on most because that also came up at the first meeting. I think most came up in the context of, okay, if counties are going to have this host thread on the table, give us the most threat basically. So, if they can go to host, we go to a most. I think it was kind of how it came up. Well, one of the big differences, as I've already mentioned, with host, you got to get your delegation on board to do it. With most, you don't have to get your delegation on board. If you all over to change general law to allow all cities to do a most, the cities could put it to referendum without going through the delegation. So, that's an issue. Also, remember, the current most is used just for water and sewer. If you're going to start using it for operational, so it could replace like a lost tax, you'd have to go ahead and write a whole new law for that, because the current one's only for capital. You'd have to use it for operational purposes. Yes. What about public safety with that fall under operational as far as use? Well, there's capital and operational components to it, obviously paying your police officers as operational, buying patrol cars that are building a building, that's capital. But even, but most is very narrow right now. Not only is it only for capital, but it's for a very specific kind of capital, it's for water and sewer infrastructure. So, you can't use it for patrol cars, even, or fire trucks, or any of that stuff. So, you all would have to go in and completely create a new type of most statute. And then you'd have to, if you wanted for operations, so it could do what lost is doing, you'd have to design it, so it would almost be probably a permanent type of tax, use for operations, use to roll back city property taxes, or however you want to structure it. And then you'll have some of these discussions at the first meeting, but our concern with most is one, every other local sales tax is a shared sales tax. Counties and cities share it, in its county wide. You get into a tax just for the cities. Now you're going to, now the unincorporated areas there, but they're going to tax just for them, right? Or the county's going to want to tax just for them. Take water and sewer, for example. We've got some counties that have big water sewer systems in the unincorporated area. And they're going to say, well, if you expand even the current most to all cities, to allow all cities to do water and sewer, they're going to be, what about me? In my county, we have a county wide water authority. Where can I get money, like them, to do to offset my costs for my water authority, or my county water system? And it's like, where's the equity there? Okay, we're going to give another sales tax for water and sewer to some cities and give it to everybody that's got water and sewer, regardless of who's providing it, right? If that's the policy, you determine that it's sales tax is a good offset for keeping water rates down. If that's your policy and you want to provide more sales tax to do that, then apply it to everybody that has a water system, not just cities that have water systems. Yes. The issue, though, isn't it about the negotiations for lost and how most and host get are just cards that are played in those negotiations, rather than them being actual viable options for counties or for cities? Yes. So if the issue is about how do we make the negotiations for lost, more sustainable, less adversarial, more equitable, more data-driven, what have you, then what most and host actually are a little bit irrelevant because it's just the ability to play those cards in the negotiation table. Yeah, and you all, through a change to the law, this is your committee to rate make recommendations, but you can even take away the threat, even though we don't think it's a credible threat, and just say, you can't do it, right? You can't eliminate a lost and go to a host or a most or whatever. That's for you all to decide. But yes, we're talking about loss today, and that's the context we're talking about both most and host as sort of alternatives to lost, and cards that you play in the negotiation, and are they fair cards to play? So the most important part, what are the solutions? I'm going to go back to the question I asked you all at the very beginning. You got to kind of decide as a committee, do we try to improve this process that we just went through, or do we throw it out and go back to some kind of a formula? So if you're trying to improve the process, GMA and HGVAR have been working on that, and I'll tell you where we're at on that. We don't have a final agreement yet, so what I'm telling you today, I just want to preface it by saying this is just the discussions that are happening amongst staff and a few of our elected officials, our policy councils have not signed off on any of this. But what we're talking about right now is marrying up lost and SDS negotiations happen in the same calendar year following the year you do your comprehensive plan. Why? Because we just talked about all the things that lost it have to do with service delivery and all the things in SDS it have to do the same thing. So get the same elected officials together at the same time to do both of those negotiations, because there's a lot of cross discussion that takes place. First is what happens now where one group of elected officials handled the SDS negotiations eight years ago, and now you got a whole new group of elected officials that went in there eight years ago, and now they're handling lost negotiations, and they don't really know what those groups that group did eight years ago. And so it gets real confusing. So do it all within the same year, both SDS and all, still two separate negotiations, but you still have to fight to sign two different agreements, but you do it all in the same calendar year. So that's yes. That's one question, because I'm an ag guy, right? Right. And just this comment is taking to me a little bit as well as, but if you're saying what counties saw a 22% to decrease, yes. And cities was 49%. And those are just averages, yes.\n\nThe rural county that was in a lost and went to a host. I mean, farmers could see their taxes go up. Yeah, you go 0% reduction with a host, because you don't get a host. Right, but still you have to run county government, and you have to educate your children. So they can see their taxes go up 30% or 40%. Without a lost, well, on average, we said it was roughly 22% off your tax bill. So without that loss went away, you lose about that 22% reduction against different from county to county. But yeah, your taxes would go roughly 22%. OK, so if you went from a loss to a host. Or if you just a little lost lost and didn't go to anything. But yeah, either way, because you don't get the host on those types of properties. So even if you went to a host, the government would still get a replacement source for loss. But you as a farmer wouldn't get a reduction on your ag property tax bill. You'd get a reduction on the house you live in. But it probably wouldn't be. My guess is your farm costs a whole lot more than the house you live in. I'm just guessing about it. It does. Yeah. So a lining SDS and lost is one of the things we're looking at. The other thing we're looking at is simplifying the 8 criteria that I went through and making it easier to understand. So going from about 8 criteria to probably about 4 criteria and trying to improve on. But there would still be criteria to consider. And they were still probably fights over the 4 criteria. But at least it'd be better than maybe the 8. And then the last thing that we're looking at is a dispute resolution process. So if the county and the cities failed to renegotiate, you would bring in an outside panel to provide a recommendation. So they would not be deciding it, but they would be providing a recommendation on how to decide it. So the outside panel would hear from both sides. So both sides would exchange all their information, give each other their best and final offer, put all your cards on the table. Here's what it is. And then if they still couldn't reach a consensus, they take all the information they've already disclosed and turn it over to the panel. Now they can't bring in any new information to the panel. You can't hold something in your back pocket and pull it out the last minute and say, oh, and by the way, this is on the table too. No, you can only present to the panel what's already been disclosed. And then the panel looks at both sides. And they decide which one, which sort of which proposal is the most reasonable, it makes the most sense and is best justified based on the data and everything else it's used. And they pick one and say, this is what we recommend you do. And then the elected officials can either accept it or not. Those that accept it though, don't lose any sales tax and continue to get what they've always received. Now that you don't have a new distribution certificate in place, so you're not going to get the new percentage whatever that may be one day. But you continue to get what you've always gotten. The side that does not go with the recommendation and says, we're not doing it, they're going to start losing some of their sales tax. Not all of it, but some of it. And the DOR is going to hold it in an escrow account until they reach an agreement. And that ratchets up over time. So it's putting a lot of pressure on the side that doesn't agree to the recommendation to come back to the table and figure it out is what it does. Again, some of our members like that, some of us don't. But it is a process for resolving the dispute. First is the process right now for resolving the dispute is everybody loses, the tax is gone. This keeps the tax from going away from everybody. And it tries to reward the better. Whatever the dispute panel thinks is the more reasonable body, they get kind of rewarded. Because their side gets chosen and they continue to collect the tax they've always collected. And the side that's being unreasonable in the view of the dispute panel, they now got to acquiesce and agree to it or start facing penalties. Also gives them some political cover, right? Because if they're the side that doesn't get their agreement chosen by the dispute panel, then they can say, well, we had to go with the dispute panel because we can't afford to lose any of this money. But it was a dispute panel that kind of pressured us into doing this. But the dispute panel would be made up of a county official, a city official that had both gone through training. The training would be put on by GMA, ACCCG, and probably the call of instance into government. So we would train every, you can't be a panel member unless you've gone through the training. And then we'd have one neutral that would be somebody that's part of the, Jim, what's the word for the neutral? They're part of a judicial mediator arbitration. Spring Court has a list of, so they don't really understand county and city government, but they do understand mediation and arbitration, and they would also be on the panel. So that's what we're looking at. So that's an attempt to improve the existing process. But it's still going to be a negotiation, right? You're not getting rid of the negotiation if you go down this road. The other thing, other way to handle it would be to go to a formula. So these last three solutions, all are formulas. And they all are formulas with their simple formulas. They're easy to calculate. And they've got the taxpayer in mind. So we're not really thinking about these formulas from the perspective of what does the county get, what does the city get, it's what does the taxpayers get. So the first formula would just go back to the original formula, reinstate the original formula. Now remember, the original formula got thrown out because it was unconstitutional. So if we go back to the original formula, we can make it legal. We just got to go into the constitution to make it legal. So that's the big hurdle with the original formula. We would actually have to go in and have a statewide referendum. 2,3rds majority passage in the house and the Senate to get it on the ballot. And then pass it statewide to go back to the original formula. But that is an option, right? Go back to the original formula and make it constitutional. And then it's a simple population divide. Number before you with this panel that you're talking about, Stewart, can you weigh in on what that legality of the panel? Yes. Provides some clarity. I get you right here. Thank you. I was concerned about it. I know where he's going, because we've had these conversations, but go ahead, Stewart. So what happened with the arbitration panels was the at least of the rationale that Supreme Court relied on when they threw out the amendment made in, I think, about 2010. Their concern there was that in that case, it was a spear court judge who was going to make the final decision on what the tax rate should be, or sorry, what the distribution formula should be. And the Supreme Court felt that that was a legislative function. And the state constitution, at least at the state level, provides for a strict separation of powers. So the Supreme Court thought that leaving it up to a spear court judge to fight and be the final arbiter on the distribution formula required that judge to make a bunch of policy calls. And that was a legislative function. And therefore, that's why the baseball arbitration provision was thrown out. I think arguments were also made in the lower court that you're taking some of the constitutional powers that the governing authorities of cities and counties have away from them as well. But that's not some of the Supreme Court rule dawn in that case, but there is that kind of issue floating around out there as well as taking what is constitutionally given to the boards of commissioners or city councils. And giving that to another body that has not been created by the constitution could also be problematic. So that's kind of why it's difficult to formulate a solution is you've got to find somebody who's not a spear court judge and still keep a lot of discretion in the hands probably of the city and county governing authorities on them having the final say, I guess, on what goes forward. So we have no idea. And if you all were to put this dispute process in law, I guarantee you we'd get challenged. And the courts would have to rule on this and tell us if this dispute process is constitutional or not. The attempt to make this dispute process constitutional is two things. One, we take it out of the spear court judges hands. And we put it in the hands of a panel this made up of some county and city elected officials, even though they're not from that jurisdiction. And then the second thing we did to try to make it constitutional is to make it a non-binding arbitration. So they issue a decision like arbitration, but that decision is not binding. The county and city officials still have to make the decision whether they adopt the decision of the panel or not. But that being said, it is somewhat coercive, right? Because if you don't adopt it, there's going to be some incentives for you to adopt it, right? And penalties if you don't adopt it. So the character stick approach. And so I guess that would be the question for the courts. If the dispute process, if you all reput this dispute process and law is going to get challenged and the courts are going to have to say, well, is it really still in the discretion of the county and city governing authorities to make this decision? Our view made it so coercive that they really have no choice but to adopt it, because they can't afford to lose the money. That's going to be the kind of the conversation I think you're going to have in the courts over this. And we don't know what the answer to that is. But again, I'm just telling you what we're talking about. This is our attempt to try to make what used to be what was clearly unconstitutional in the former baseball arbitration to try to make it constitutional. Now the other way to do it, and Jim, then I have talked about this too, is again, open up the constitution and put it in the constitution. Then you can make it binding arbitration if you put it in the constitution. But that would be another big hurdle to get over to try to put something like that in the constitution. So I mentioned the original formula. The third one is a formula that would just give everybody the same percentage off their tax bill. I've got some slides on that. That's the original formula. This is a sort of give everybody the same percentage off their tax bills. This is an example. So what you see over here, that column there is how they're currently splitting the loss. So the county's getting 82% of it, and city A gets 14% and you see on down the list. But to actually give everybody 26% off their bill, because right now, unincorporated residents and city residents are getting 23% off their county bill, 23.52. City A gives their residents 33% off. City B gives them 62% off. City C gives them 87% off. And City D gives them 77% off. And those are probably the smaller cities, obviously. So you can see that, depending on where you live, you get a different amount of tax relief. But if you want to give everybody 26% off their total tax bill, that's the county and the city bill combined. So if you live inside the city, it's the combination the two, then you're going to have to readjust the numbers. But there's a way to do that. You all could legislatively say, we're just going to give everybody the same percent off your bill. We don't care if you live in unincorporated area or in city A, B, C, or D. But that would be a significant change in revenue between counties and cities if you were to go that route. And I guarantee everybody would run their numbers and the people that are going to lose money are not going to like that formula. And then the last one I'll throw out there would be the HCRG grant formula that you're already using. You used it this year. The reason this one's different is it's not a percentage off the bill. It's a flat dollar amount off your bill. Remember the governor said, I'm going to give everybody $500 off their property tax bill. Well, $500 off my $200,000 property is going to be a much higher percentage than $500 off my $1 million property. But in the eyes of equity, some people may think, that's fair, right? OK, we don't really care what your property's valued at. We're just going to give everybody the same dollar amount off. And the way HCRG is calculated, remember, it's $18,000 worth of value. That's what HCRG was done this year. You could set it at any number. But this year was $18,000 of value times the milligrates, county city and school milligrates, to get you that roughly 500. But if you look at your own bill, you'll see that your HCRG grant is not $500. It's something close. It's either below that. I think mine was $440. Some people probably it's over $500. It depends on your milligrates. The higher your milligrates are, the more HCRG grant credit you're going to get dollar-wise. But it's still going to be roughly close to the same amount for everybody. But remember, that was the ways the means chairman wanted to do this statewide. Now, I'm not suggesting we do this statewide because then you'd have to suck all the money up into a state pot. But you could at least do it at the county level. So within a particular county, you can take the sales tax that comes from that county and share it with all the taxpayers based on the HCRG grant formula. The general sum is already created. So all these things I'm talking about are things that are currently in law. This is not plow a new ground. These are things that already exist. We're just saying maybe you could use one of the things that already exist that you're already doing as a way of splitting lost. And by the way, ACCG doesn't support any of those formulas I mentioned. I haven't run any of that by my policy council. I'm just what I'm trying to do is give the committee thinking through, do you all want us to improve the process or try to come to some agreement on a formula? But we can't do both. And so I would hope between, say, now in your next meeting in Spalding County, we could get some feedback. When I say we, me and Jim Thornton from GMA, we could get some feedback from you all because we're going to have our subcommittee get together again before the Spalding County meeting. But which way do you want us to go? Do you want us to keep going down the road? We're going down, which is just make the current process better. Or do you really want us to take a stab at creating some kind of a formula we can get consensus on? And I'll be up front with you. Us getting consensus on a formula, at least in Jim's eyes and eyes is near impossible. Like we think we're going to win, we probably can win the lottery if we can do that. But we will try. But at the end of the day, it's going to be tough because our members look at it not from necessarily what's equitable from the taxpayers' point of view. They're looking at it from what's equitable for me as a county government or city government. And nobody wants to lose money in their budget, right? So any formula we throw out there, every county in city is going to run the numbers. And then they're going to make the decision about how they feel about it based on how it affects them personally. And that's the problem with the formula. You'll have any questions. We've got some other presenters I'll want to bring up to talk about their local situations and how they dealt with loss negotiations at their local level. But that's the general presentation. I'd be happy to answer your questions that you have. Sure, go ahead. So agree with your assessments. I have one question about the first recommendation of the improving the process recommendation and tying it more closely to the service delivery strategy. And I have a concern, and I'm just registering the concern, sure, is I think in Chatham County where we had what I would describe as an exciting loss negotiation. Our service delivery process was not exciting. It was driven by data. It was driven by service. It was staff led when it got to the manager level and then the commission and the city council level very easy to approve those because we had those politics taken out of that process and was based on service delivery. And what was the best strategy for us to serve our residents jointly as county governments? And so just registering the concern that the closer we tie that process in with the political process, we're going to seep in some of that gamesmanship, perhaps, in both. Well, actually, one of the reasons, again, two-sever negotiations just done in the same calendar year, you could do one negotiation, finish it, and then do the other. So do one for six months, do the other. You could do them both simultaneously. That's up to you all. But one of the things that not only do you have the same elected officials negotiating on both agreements, but we do envision there to be some trade-offs. We do envision that maybe there's a double taxation issue that comes up in SES or a service. We no longer want to provide this service in the county. Let's give it to the city or vice versa. Let's take a city service and let the county do it county-wide. But there could be some trade-off in revenues. Because SES is about the cost side of your budget, the expenditure side of your budget, where loss is more about the revenue side of your budget. So if you do both of them in the same year, you could get into some of those negotiations and trade-off. OK, I'll help fix some things over here in SES, but you need to give me a little more money on loss. And you can have that conversation if you're doing them in the same calendar year. If you're doing them, say, eight years apart, that conversation's probably not going to happen. Or if it did happen, it's going to be forgotten. And you've got a different set of players in the room. It's going to make it really hard. So yeah, we understand that doing both negotiations in the same year could be problematic for some people. But we feel like, again, the benefits outweigh the cons and getting them both done. And they're not having to worry about either one of them for 10 years. So you get them knocked out, and you're good for another 10 years, and then you do them again. Well, we did ours in the same year. They just weren't tied together. OK, so that's what we're suggesting. And then you did it exactly. We're not suggesting you do them in a single negotiation. It's still two separate negotiations. And you can handle those negotiations however you want. So because you still have to sign two different agreements. The SDS agreement goes to DCAs, you know. The law certificate goes to Department of Revenue. And there's thresholds that are different for who signs for the cities. You've got to have the county sign on for both. But with SDS is a different threshold of the cities that have to sign on then lost. And so we're not changing any of those thresholds. You still have to have the required number of city signatures that the law requires for both. Any other questions for me? Well, we appreciate the time you've given us. I'm going to go ahead now. Let's see who is first. Byron? Yes. Do any members of the committee to all support byron? Yes. I'm good. So Byron, if you'll come on up, Byron's from Green County. Byron's the county manager for Green County. If you don't know anything about Green County, how many of you all raised your hands? You've been a Reynolds plantation. Been to the Ritz? That's his county. So obviously he's got kind of a wealthy enclave there around the lake in his county, which is good for his tax base. But it probably gave him a little more money to fight over, too, in their loss negotiation. So I'm going to let Byron kind of talk a little bit about his experience with their loss negotiations. Thanks, Byron. Thank you, Grant. Thanks to the committee for letting me get up here and speak about Green County. I've been there for over 22 years as the manager now. So I actually started working there in May of 1997, not as manager, but then became manager. And so this is my third, this most recent loss negotiations was my third bite at the Apple. So I've been through three. Any horror story that you have heard, they're real. I can assure you of that. Trying to learn through each of the two former experiences, I approached this one a little differently. I wanted to put purely analytical data, verifiable, accurate data. And so I spent, I probably prepared for close to a year leading up to it. None of the cities were. I've got five cities in the county. None of them were preparing. I was. I was using the data and crunching the data based on Geomaze perspective and ACCG's perspective. I wasn't trying to buy us it towards counties. I was trying to get all the data so that everybody, when we sat down, we steered away from the emotion. That was my goal, was to steer away from the emotion. I gave a 28 page report to all five cities ahead of the first meeting in January of 22. And then we sat down and went through it in the first meeting. I gave the lost history, some of the same stuff that Clinton Dante went through, the history, the local history of collections. Really thought it was a very thorough presentation. Then I acknowledged, however, that it was still my product. So I begged them. I mean, I must have said it 10 times during that first meeting, pleading with them, go attack this data. Go attack it, come back with your own data. And we had set the next meeting for a month out. So to come back, bring whatever data you can compile. Let's add it to the matrix. Let's discuss it. Let's figure out whether it's applicable. Let's figure out if some's wrong with my data or not. So 30 days goes past. We show up for the second meeting. All five cities show up. Not one single one brought any data in. And they acknowledged that they couldn't attack the data. The data was accurate. It was nothing they could do. The data actually showed that Green County should go from a 68% to conservatively 85% of lost. Now bear in mind, we're sort of an anomaly. Over 93% of our tax bases are unincorporated. Less than 7% is in the five cities all combined. So our data was going to show a much heavier weighting towards the county. We certainly didn't expect to get 85%. But we didn't want to negotiate against ourselves or negotiate from an emotional perspective. But that's exactly where it went. And whenever you get that level of emotion and the zero sum game that you actually are in, it's going to create a lot of hurt feelings, a lot of hurt relationships. And so if there's one thing that I could hope for out of this committee's efforts is some way to not have that. I would certainly prefer not to have the negotiations at all. Been through three. I won't make the next one. I'll retire first. But the staff members that will likely come in behind me have said, none of you're going to have to come back and help us. It's preparing that much data is pretty daunting. And not all the staff members, particularly in my county, are small rural county, even though we have Lake O'Connie, we're still small in rural, so we don't have very deep staff. So they know that when it comes up again, they're going to need some help. Whether or not I actually help in the next one, who knows? But I think it was the thing that made it more difficult for me every time we deal with this is you're dealing with new electeds. Whether it's on the county side or the city side or most likely both of the five cities we have in Green County, three of the cities have either have fewer than 264 people in the city, but yet they still want to see it at the table. And in their eyes, they're still a city, and legally yes, they are still a city, but less than 264 people and of those three, none of them have a property tax. So they are getting that 100% reduction. There is a data driven formula that can be derived and take all of that negotiation out of it, so that you're not fighting in such a small town where in my case, I'm the one that wore the bulls eye because I was the one carrying the water. The electeds, great, I've got some great ones, we've got some great ones with the cities, but do they understand everything they need to do about service delivery strategy or services or lost or how it works or how to calculate a rollback? They don't. And so they rely on staff. So then the staff members that hired employees are the ones that end up getting sort of beat up in the process, and in some cases it can lead to their departure because it gets that ugly. It is that ugly of a process and it's crazy not to try to fix it. When you have a city consultant after we went through more and more meetings all throughout the year, trying to get an agreement, one of the cities, the county seat, finally hired a consultant. That consultant came in and put together a bunch of data, I knew them. His data was incorrect, I mean, just mathematically incorrect, in many cases, but he had also represented some counties. So here you've got a law statute that can be argued so fundamentally different by the same consultant, depending on whether he's representing a county or representing a city. That should tell you all something. That should tell you something, fundamentally different perspectives. I mean, complete paradoxical argument if I'm on the city side as to when I was on the county side. And we actually used that in our discussions, hate to do attack the credibility of somebody I knew, but I had to. Why would you argue this for these cities? But over here you argued the opposite for these counties that you represented. So that also cost that city money. Money they didn't have, about 15,000 or 18,000, whatever they paid them, they didn't have that money. And our three smaller cities, they don't have staff. So they don't have the ability to compile this data or go hire a consultant. But in the end, the county seat didn't want to discount the smaller cities because the more of them they were at the table, the more they were unified front battling against the main old county. And that's the other thing. The one thing that helped us get through this in our case, we did go from 68 up to 82, ramping up over five years, which is pretty remarkable for us. But the one thing that helped us, as I dealt with each county commissioner, I asked them, just please be resolute. Don't get picked off by this city. They all have their little alliances and they're close with this city where they live or it's in their commission district. Don't let the city council members pick you off and plead with you from an emotional perspective and tell you how much it's going to hurt the city. Let's stick to the numbers. Let's stick to the data. And for the first time in 22 plus years, they did it. The commissioners did it. They stuck together. We did have to leverage the host to some extent. Clinton, I had those discussions over the phone. It was not something we wanted to do. I think our commissioners, though, one of the things that they were resolute on is they were not going to accept a formula that was so inequitable, that they were actually willing to let it go and try the host. We did run a lot of numbers for a lot of our historical legacy farmers, our agricultural community, which is still strong in Green County. And we could show them a lot of their farm properties and conservation use. It wasn't going to hurt them that much. In fact, they're homes and they're surrounding acreage that they did have homesteaded. Many of them, the majority of them, we're going to be better off under the homestead option sales tax. From our citizen standpoint, we would have rolled back our property tax 100% on homesteaded properties. So to talk about whether or not it would pass, more than likely it would pass. We were already in the community explaining it, not because if we wanted to do it, we really didn't want to do it. It was not something we wanted. We certainly didn't want to take that revenue away from the cities. But we also didn't want an inequitable formula that we had to stick with for 10 years. So in the meetings that we had with people in the community, the community groups, and explaining it overwhelmingly, they were in support of the host, even knowing that there was going to be this gap. We had ways we were going to overcome that gap. So we did have a way to try to make it work. But at the end of the day, it was such an inequitable result from the failed negotiation that the commissioners were not willing to do it. And they stuck with it unanimously. They were resolute. And so we finally got to where we needed to be. The damage done in that process, though, the relationships that get damaged are unbelievable. And you either got to wait until the next negotiation or you got to wait until a lecture change or managers change or staff change. That's not healthy for a small community. It's not healthy for a large community. So we definitely need to have a change. Hopefully you guys will come up with a great solution for that. And with that, I'll answer any questions anybody may have. Yes, sir. What made the change in your county that it would go from, would you say, 67% to 85% by data? Was that changes in the county? Or are you saying that was poor negotiations in years past? So mostly it was a failed or a poor negotiation 10 years ago. And I was a part of that. The longer you stay, maybe the little credibility, a little more credibility you get. So back then, the chairman that we had, great guy, salt to the earth guy, but wanted everybody to get along.\n\nWe needed to hold hands and be nice. So we did not land where we needed to land in the 2012 negotiations. So we really needed to make up some room. But again, if you think about our tax base, 93% is unincorporated. Our business district is not inside the city. The hard part about that though is the city wouldn't acknowledge that. But with the Ritz Carlton and how much money it generates, like a Coney village with publics and all of the merchant shops around it, our business district is not inside any of our cities. So we are an anomaly to an extent. But because of any of the analytical data you use, all based on the eight criteria, some of the criteria were not necessarily applicable. But to the extent that we could compile data on all eight criteria, we did. And again, it was all verifiable accurate data. We showed that in some cases we should be 92 or 98%. We actually put a chart together that aggregated all of the different data sets that were relevant to the eight criteria and weighted them all the same and came up with 85.22%. If you had it to do over again with the relationships that were damaged, would you do it all over again the same way? I would. There's no way around it. Again, three times, all three times you had the damage relationships that didn't matter what approach I used. I can sit there at the end of the day and know that our data was right. The city's acknowledged our data was right. And that's who I am. I am data driven. I am, you know, financially driven. So if I can show it and if people don't like it, I'm okay with that. I don't have to get elected. The elected might want to do it different, but I don't think they would. I think they're happy with where we landed. Yes, sir. Really admire the approach that you take in. What pieces of their data? Let me interject one second, was it mad? Could you pull the microphone closer to you? Yes. Our awesome press team. They're streaming. Got it. Great. Just a lot of respect for the approach you took on your negotiations. What were the pieces of data that you felt if you could give an example of the verifiable data that you used in your report? And so the largest one was of course the property tax base. So we have non-special districts in the county that we're able to dissect the data for those non-districts, their fire districts. We have a recreation special district. We have a library special district. Those are county wide. We have a few others, but being able to look at that data and show that for example around rentals, 65% of our tax bases in that tiny little area. I mean, it's less than a tenth of the county geographically speaking, but yet it represents 65% of the tax base. When you then add to that the neighboring fire district, which is the low rent side of the lake where I live, you're adding another 15%. So two fire districts, less than 20% of the geographic area of the county is 80% of the tax base. The cities can't fathom that because they're always used to historically being that's where all the commerce took place. They can't fathom that and they're disconnected with that. That data was helpful, but for purposes of loss, just the unincorporated versus the incorporated tax base was one of the huge metrics. Obviously population is a huge metric. I calculated it based on G.O.M.A.'s preferred method, but I also calculated it based on obviously what we would prefer to use to get credit for the entire county. I had both data sets in there and used them both and the aggregated data just trying to be fair. Beyond that in terms of sales tax, we can't guess. I didn't want to use any numbers that we couldn't guess on. We know from our HOTO Motel Tax and what comes in through the Ritz Carlton, we had a good idea of how much sales tax is generated just from the Ritz Carlton. That morphs the sales tax collected in the rest of the county. It really does. We showed those numbers, showed that data, but we didn't rely on that data because it wasn't verifiable. Even though we had some information in the package, we didn't put that in aggregated data because we couldn't prove it. Trying to think of the others, I know that the property tax was the biggest and the population was probably the second biggest. Thank you. Any other questions? Just a question as it relates to, you have a large, unincorporated area that remains unincorporated that you provide your services to. Yes, sir. I think cities have a much smaller share of what is incorporated. I guess my question would be what happens when annexation comes into play and those cities start growing or annexing into the unincorporated areas? Would that change or would it be the way it is in Green County for the foreseeable future? If I understand the question, obviously the county seat is growing. Other four cities have not done any annexation other than one little small part in one city in 20 years. Greensboro does continue to grow. We encourage them to grow. We encourage Greensboro to be healthy. If Greensboro is healthy, it helps us. As they grow, then as their population grows or as their tax base grows, obviously that would change those data sets in 10 years. We would have to factor that in. I certainly would not be hypocritical and include it now and then not included in 10 years if I'm involved at all, but it will help them. We encourage them to try to have good, healthy growth, quality growth because it will certainly help them with their sales tax percentages in the future. I think last question would be, you put together a great data set in one thing that I know members of this committee that served in General Assembly. We come back the second Monday in January, it's 40 days and it's a gauntlet to get through a lot of bills and 40 days and sign a die. Sometimes you read in a blurb and boating. Would there be any help to have some periodic review periods within that 10 year period to bring both governments together to discuss growth and changes that may be occurring to help prepare for that next 10 year negotiation? That's not, we're cramming 10 years of change and a small subset of a window from July, I got to get it done by 1231 or it goes away because information does take time to digest. I mean, just look at General Assembly, it takes us two years. So it would be helpful. I think knowledge is key. Education being informed is key. So I wouldn't want to, again, I would favor a formula in statute so there are no negotiations. So we said that upfront, but if you are going to have to negotiate, then periodic reviews to just talk about the status, not negotiate, but just the status to try to educate only downside to that as some of those elected that are there on those periodic reviews may not be there in 2032 when it comes up again. So you may have lost some traction, but it would be helpful. Again, I mentioned that the electives have a lot to learn. They're certainly sipping from a fire hose and there's no way that they can know everything they need to know in that time when lost hit. So any upfront, I beg my commissioners when they go to ACCG's conferences to take this class or that class, I'm not sure they do. But we need to do a better job, I think, ACCG and GOMA, and making sure their electives fully understand this stuff. Well, maybe it's not at the elected level, but maybe it's a staff review. The staff in government tend to outpace most of us. I'm looking at Stuart. I'm like, Stuart, did you write any of this into loss? And the reason for that is maybe it's a periodic staff review because staff has the ability to influence elected officials because the Stuart tells me this isn't going to fly. And it's not going to be bill that I think anyone of us carry. And so would that be something that staff is consistent like you've been here to have these reviews and so that maybe if you do have a new city manager or a new county manager, you all have had a chance to go through this review process together and better understand and look at the record per se and then advise your respective elected bodies to kind of move forward. So that way they understand that this is the recommendation from staff. This is what we've been meeting to understand and do and here's how things are changing and how we can kind of get to that compromise and preparation for the next 10-year loss negotiation. I would love to see a formula possibly as well. But like any good thing in statute, some auto come to Stuart and there'll be a carve out of the formula and then it doesn't work because we've just carved it out so much. It would be healthy. I mean what you're speaking of would be healthy and I'm sure that already occurs organically in some places anyway. For our part, it does not. I mean we actually tried to have meetings with all the mayors on a monthly basis and it was just the same thing as the loss negotiation was as always a handout. Can you do this for me? Can you do that for me? And so our chairman said, you know, that's not what we're here for. We're here to talk about and collaborate on things. Not just you come and hear with your list of things you want us to do for you. Those meetings fell apart but at the staff level, you know, some of it does already occur and I'm sure in other jurisdictions it occurs a lot more frequently than it does in Green County but it does occur to some level now. No others? All right. Thank you. John, John Marks, the attorney and the academic. He's a couple of good about negotiations. And I do want to recognize as John comes up. We do have our chairman of our kind of commission. Chairman Ellis was here with us. He just stepped out. I missed him. We have commissioner, Pat Farrell and commissioner Helen Stone, all representing Chatham County that we're here with us and one acknowledged him being a good politician. So as we talk about service delivery, you know, just a shameless plug. Commissioner Farrell and that SSD is a pretty, pretty good subject about just, you know, getting rid of that, right? There's no question that our way of having a general budget M&O and SSD complicates what you try to do in the negotiations. And I think Jay will agree with me that the negotiations were brisk at the very least. But I've been through three of these and thus far we have been consistent about it being brisk. So and we got seven municipalities that have seven sets of needs. They usually tie up to each other, go after the county share and then divide everything that's left amongst themselves. Generally, I'd say on population there may be some variances there. But that's kind of what you're seeing. We've got one in one particular town that's growing very rapidly and therefore obviously the city of Savannah has to pace itself against that town. They want them to give up. It's the same old thing. You know, where's the money coming from? That's the bottom line. First of all, I commend you all for doing this and I wish you all the luck in the world. I really do. I think you got, you hit on something early on is that you're back to basics, the equitable property tax relief and a manner of dividing it so there won't be disparity between one jurisdiction and another jurisdiction over how much a citizen gets compared to another citizen. If you live in a municipality, you're going to get the county rollback. You're going to get the city rollback. If you live in the unincorporated county, you're going to get the county rollback. And that just in and of itself creates a disparity as between those. Then you get into the argument of what are we going to end up with in our share? Everybody has their own calculation for that. I don't know how you get around that situation because everybody becomes very myopic about how they look at that situation. And is that zero sum game? A dollar taken away is a dollar gained somewhere else. So that's what you're up again. The eight criteria to be polite, they're not very helpful. They're so vague you don't know what you're doing. You had first criteria that just went on for about three paragraphs. That got written partially by the city attorney, Jimmy Blackburn, who I had a great deal of respect for putting the part in there about the city. And then the county attorney, who I know pretty well, wrote the part that dealt with the county, well when you got through reading that paragraph, you didn't know a damn thing about anything. And that's just the way it was because everybody was protecting their nest. So I don't know how you overcome that. I think a formula, I think the eight criteria either need to go away or we need to have three criteria or four criteria that you can apply some type of an objective standard. Just like our manager from Green County said, you know you got to have numbers that you crunched that people can't come in and come up with something else. And in our situation, and I think it was true for the city, we come up with what we thought was a pretty good set of numbers. And they'd come in and see the same data sets in a different view text and we'd get further apart rather than closer together. So those, and what do you do with them? You got to acknowledge them because they say you got to acknowledge them, but as a practical functional part of that thing, I have never in all three of them seen anybody sit down and really when it gets down to how much am I getting and how much are you getting, they talk about any of those eight factors. So if you can come up with three or four there, I would think that would go a long way. We got together before we came over here, the managers, myself and a couple of others, and came up with some things that the county would like to see done, but I'm sure the city is going to hate it. But I'm hoping in there there may be as an idea that you can take and modify it however you wish. The biggest part, the county general fund carries so many services in it that nobody else pays for. And it's not getting better, it's getting worse because one of the best things that you can get out of the legislature is a new program that nobody funds. We'll let the county pay for that fee. Okay? And during our process, we came up with 32 different things that we did. And just to read off a few of it, the Sheriff's Department, at 10 million to county jail, 48 million, something as simple as the tax commissioner at 6 million, mosquito control at 4 million, that's like snow and ice money up north. We don't have that problem. And then you go down and you deal with all the other issues. That added up to $140 million, well actually $141 million. And if you went back and figured that again today, that would probably be $155, $156 somewhere in that lower range. I don't think it'd be quite at $160. But the thing about these 32 services is there no revenue in them. Everything is an expense. So you don't have the water. The county does not provide water and sewer. That's provided through the city. And then there's a rate system that's worked out from underneath that. So I think that's what you see counties being up against. And then the other thing that there's been some discussion about, that I think needs to be settled once and for all, is there's a contingent of folks that believe the only thing the county deserves is those supplemental powers, powers and nothing else. And there's been a couple of attorney generals letters and opinions indicating that the county should have the benefit of all the services they provide, not just the supplemental powers. Now that might have been great 60 years ago, but supplemental powers is nothing compared to what you're on the other side of the ledger doing across the board for all these various things. You don't think much about a library, but it's $7 million. You don't think much about the district. Attorney's Office is at $9 million. If you have a district attorney's office, you're going to have a public defender's office. So it keeps going on and I don't know of any court that makes money. But you got all the judges and you got all the deputy sheriffs in there. So that's the issue that you see in the larger cities and larger counties. And I'm sure the city could get up here and come up with 11 things that they felt, well, that's what we have to deal with. So my point to you is try to do something. Now we came up with a couple ideas in the J.I. If you don't roll your eyes. But someone wanted to take all the lost and just put it in the general fund and then do a countywide rollback dollar for dollar, whatever generated it generated. Now that depends on whether you've been in municipalities and your county is using all their money for add to the law or tax relief or whether they're using it to fund as revenue. And when you look yourself in the mirror, you got to answer that question because there's really nothing inherently wrong with rolling back everything you make and lost among the various and do it on population base. So that was one thought. Someone suggested putting all the money in the general fund and then chopping it in half and the county gets 50% of that in the city split up the other 50% based on their population. Now if I was from the city, I don't know how I'd feel about that. And that number might change. It might be 60, 40 or whatever. But that's the idea there. The final one we came up with was I feel your pain. And that was somewhat similar to one of the suggestions made. And that was you need to start about six months out before the deadline drop dead date is. And you need to tell the cities and the counties you got to come to agreement guys and oh, by the way, in order to incent you. If you don't have it in 90 days, then 10% of your loss funds are forfeited. If you don't have it in the next 60 days, another 10% is forfeited. And if you don't have something by the time we get to 30, you've lost 30% and you're very foolish. Now that takes the charm out of all the game playing. And I found every one of the lost negotiations I've been involved in. These came down that one person or group of persons felt they had such an unfair distribution that they would be willing to blow the whole thing up. And nobody wants that. But when you get down to a deadline, it seems like you do better. And so what I was thinking is if you did intermittent deadlines where everybody filled the pain in the same way, maybe they get serious a little bit earlier and we wouldn't be doing this at the end of the year. Or I think the last petition was found within a few minutes of the deadline. So that's my advice. I think you got a good idea. I think what you got from the county government did a great job of laying out where the law was, what the issues are. Green County had a very good presentation on things. But I found they're not data driven. I found that people get fixated on the percentages. And I could talk I was blue in the face about these are actually out of pocket expenses for services. Nobody else is providing that we are. And you would get a look because there wasn't any way to defeat that because the numbers were the numbers. But that was just ignored and nobody really changed negotiating positions. Negotiating positions changed at the very last. And we ended up with a formula in which the county got an increase and we ramped it up over a period of years. And then we got into the argument over which ramp we're going to use. Okay. County ramp or the city ramp. But eventually we got there. And I don't know of any easy way to do this other than doing it. But everyone I've been involved in until there was some sense of urgency and reality to it that we're going to lose this. And oh my God, this will do what it will do to our budget. And some of the little cities rely very heavily on. We've got one city that doesn't even have any local tax. So loss means everything to them. So I wish you guys all the luck in the world. And don't listen to anything, Jay said, I miss messing with you. No. I thought we had a brisk negotiations, but I don't think anybody ever got ugly about it. I'm not saying the scenes that maybe people had hard feelings. But we've got too much going on in this community between the municipalities and the county that this is just one issue among many. And you got to move to the next issue. So anyway, thank you for your time. I think this is well worth it. And good luck. Thank you. Next Heather Scott, the manager in Jeff Davis County. I think John, you mentioned somebody turned in like three or four minutes before the deadline. I think this is the person that turned it in. Well, actually, I was going to introduce myself as I am Heather Scott, the county manager in Jeff Davis County. And I was your last one to turn in the law certificate on December 30th of 2022. And if I tell you that I still don't have nails for that reason, I do not. So just a little bit, just listening to the two before me, I have first let me tell you a little bit about myself. I have only been in Jeff Davis County for four years. I was the county clerk for two years. And actually this month has been two years for me as a county manager. This was my very first law negotiation. And with that, when I tell you I studied and I read and I read some more and I asked questions and I think ACCG for every bit of every call and probably aggravation I was to them. They were if they one couldn't answer the question, they led me to another one that could. But with that being said, you know, the questions I asked and the questions I asked, I had to go and take that to my board. And so that we could prepare the data that went along with what we had to get ready for. And yes, I was we were the last county to turn the certificate, but it wasn't because we didn't prepare. It wasn't because we didn't have ample time to get everything out there and the data out there and the mediations and the meetings and things like that with our cities because there were times where we would schedule a meeting with the city and it wouldn't go through. You know, something would come up or this would happen or that would happen. And when they talked about negotiations being ugly, they're ugly. They are. They're I can honestly say that and this is, you know, I will say let me read back up a little bit of I'm not here to down cities. I think that we only have one city and they are great, you know, the people in the population are great people. But again, negotiations are ugly. Cities. They would come in and like counties, you want to have that income and that revenue to help your city. And that's what they're there for as well as the counties are here for us to get that revenue to help our people in the county as well. But we give this that and you go in there with the numbers of population and when you get told that we're going to do this our way or no way. It takes it, it takes it to a another level, I guess, of negotiations. And I say that because we went in going population driven. We are started out at 60 40, county 60 city 40. And so we put out that population where an estimated around 15,000 in the city being around four. So we went in and said look, if we can agree to it right now, we'll leave it the same. We were told no very quickly and they wanted to reverse it to 70 30 city. With that being said, that was a no go and that ended that meeting very quickly. But we come back about two weeks later and put out there with the SDS information, the services that are provided. And as they were talking earlier the other two, you know, and also with Clint saying, you know, yes, there are services that the county provides that city gets to also, you know, use. Magistrate, EMS, EMA, we actually provide E 911 for both city and county. We have a split fire, yes. But we provide direct departments, library, senior citizens, the county funds, all of that. But the city benefits off of it as well. We put that out there and it was a no go very quickly. We then found that a formula had been presented to the city to use for their data. And again.\n\nWe were the example for that. We were actually the county and the city that was used for that data. But the thing that come off of that was we weren't asked for our data. They were given from an SDS negotiation that had not been updated yet. So they were getting data. They were given data that was not all correct. So it looked like they were getting everything they needed and it was in the better for the city, but not the better for the county. So we ended up in a mediation in which again because of not full out education and understanding for both commissioners and city council. And I say this for both because the education part of it needs to happen. It's got to happen. Education for both city and county. Because of that first the city told they were they were very adamant that they did not want to go into mediation. And they didn't have a choice at that point. So because the 60 days were up we had no choice but to go into mediation. Well with that being said, mediation we actually had our mediator come in after about four hours of mediation because neither would budge. She said I'm not going to waste tax pay your dollars and continue this because we're not going anywhere. The only thing that ended up helping us was having to lose, you know, almost losing that tax for both the city and the county. And that's not again, I tell you negotiations is not it is a horror story, especially for small, especially for small counties. Because heart feelings are there, hurt relationships are there. And when I tell you that I don't I don't think that our commissioners and councilmen some of them spoke for I know months at the time after this. But they had to come together because and honestly I will tell you a big thing that helped is our local newspaper put out an article. And told the good of what lost is for both city and county. And I call it I guess keyboard warriors got on and and went in there and and told both city and county that this is what you have to do to help both. But with also that being said, looking back of how things were done, it was more of who could help who more as far as their selves. And yes, that is how it needs to, you know, you look to what to help the city and the county, but you also make sure that I try to go off databases. And this is what we tried to do is what the county tried to do. And I know I'm jumping around a little bit on this because I don't want to kind of repeat everything that both of the other two said. But I will say that I am all for education of both our fellows though that it should be a mandated training for both city and county officials and even not elected officials is. Because and it should be the same training and I say that in this in this part of. GMA and ACCG are two great organizations. GMA is here to help you municipalities and cities and ACCG are here to help counties and that's what they're here for and they work together wonderfully as well. But I feel as if they need to come together along with coral wints and and put together a mandated training that everybody has to go through the same training sitting in the same class understanding the same information because the information that I just got up from here. Each and every one of you is going to take something different from that information. And you're going to take it home because you're going to find what works best for your county and your city and you're going to take that first. Versus seeing the big picture of what all this information put out there. So I would recommend that for you all to look at is the mandated training as well as if we are going to do a formula. I have a I sit on a fence with a formula because again I feel as though the only way formulas would you know work. The only way certain ones would want formulas is if it benefited them. But before I allow our county to really push to lose attacks. Then that would be the last. That would be the last thing we look at and have to use is a formula because I would rather use a formula that helps at the end. Then to lose the tax completely are the lose to law lost completely. But I also feel as though it's the as negotiation should happen at the same time as loss negotiations. Because where data that was given from our county from SDS is that had not been updated. It don't help when you're giving data wrong data things that weren't updated in the correct amount of time for that you see one thing. So I feel as though if we're going to SDS negotiations and loss negotiations really need to work hand in hand with each other yes again they're two separate certificates yes they should you know they have to be signed you know two different things but they should be working hand in hand but the biggest key. And I can say over and over the biggest key is education on this subject. And I feel as though it should be mandated with that so that would be my recommendation. I appreciate you all listening to a little bit of our fun that we had with negotiations but if I never if you all decide to take away negotiations that'd be great we wouldn't be mad about it. But again it was an experience and it I hope that Lord willing he will let me be will go through another one in 10 years. But I really pose that you all will look into that and look into the education part of it and look into the way that will make it easier for counties and cities to really work together to do this. Is there any questions yes I have one question for you. You talked about the newspaper putting out the pros and cons and one of the things that I have observed in loss and the loss negotiations is there done so without John and Jane Q public and that the citizens don't have an opportunity to sit in and hear and they're actually who hold all of us accountable especially those of us that are elected. And any time that they don't have the opportunity to understand if you live in the city you may have a perspective to the city if you live in the county on incorporated county you may have that perspective. But also the citizens have the ability to influence their commissioners and their city council people but oftentimes they quite don't know because they are not a part of those discussions. They just know that hey they put it out in the newspaper if loss goes away your county and city taxes are going to go up and people like wait a minute you know this is serious hey what where hey and that's where we get called right is our citizens say hey they're about to mess this up I need you to go down and see what you can do because I can't you know my taxes can't go up 40% or this much if they go away. Can you go down there and fix it and oftentimes you know we'll tell my constituents well it's not really what we do and then they remind me but you're the center to aren't you you go down there fix it. And so I think all of my colleagues have the same experience as that we get pulled into a lot of things but yes we do set and write the laws and pass them but would that be something that would be helpful us to have John and Jane Q public a 10 or have you know those hearings discussed like you would the military you have to ask them to do that. You have to advertise and give the public the opportunity to come and provide feedback should loss be the same way that if you're negotiating it at the county and city that you open it so the public will have the opportunity to provide feedback. Oh absolutely I mean anytime the public can get involved that's great. Now as far as I feel as though you should have a public hearing but I also feel as though you should also have those meetings like we do is the negotiations because there is pros and cons again like you said there are pros and cons when you bring the public into do things yes you are held accountable but then what happens when let's use Facebook for an example and I call it keyboard warriors because they won't come to your meetings and they want to dress yes they want to dress you in public but they will make sure that they put all of your dirty laundry out on on the comments of anything that they're not happy with. I feel as though that if somebody is not happy they're going to put it on on these social media sites and they're not going to come to your meetings and I feel as though they should have an opportunity to ask the questions and understand lost as well as I feel as though anybody else should be educated on because the thing with lost is the first thing that most people do is say well splos did this no there are two different things. And that's what people do not understand is there are different things and they work in different ways to help every community. But yes I think public meetings and public hearings would be a great thing for this but also still keep the negotiations so that you can work together as a council and a board and both boards but also give the public a little bit of letting them say hey well what do you think is going to do. And then say hey well y'all can't lose this you can't you can't go without this because we're the ones who are going to suffer and we're the ones who are going to not get the rollback and we're the ones who are going to have to pay this this and this and this. But I also want the public to also understand that commissioners and councilmen also have those taxes to pay. They also have their they're thinking that way as well so they're thinking of themselves as well as far as yes we can't lose this but I also can't turn around and get you know lose what they were asking for from us is literally flip what happened because at the end of our day all of this that we went through to the very last minute. On December 30th of losing holidays and losing everything with family and things like that because they couldn't make a decision guess where we ended up. 60 40 county and city the exact same that they started with that we could have. Just literally within two hours it been over. But here we are so yes I agree I think there should be some public hearings along with it yes. And with all the economic development one of the things that I'm mindful of and I'm on throw Department of revenue not under the bus but one of the things that they experience is that the state of Georgia with all of the economic development of the growth that we're seeing we're going to have a growth in collection so you're 60% and you're 40% if you collect more. If you collect more is different and it's a different dollar amount so are we talking percentages are just real dollars and I think that's something that I have asked Department of revenue and he's in the back. It's a move but it'll come back in five seconds about so that Joshua so that we can talk about percentages and collections like are we talking dollars are presents because counties are talking and cities are talking dollars but we're putting them in for the first time in the country and we're talking about the same things because we're also banking that maybe collections do go up or maybe they stay the same in flat but one of the things that I know for certain we're seeing is an increase in collections because we have more tourism we have more people visiting more people paying the tax population is growing so more people paying the one cent tax so what's the J the Chatham County City Savannah metrics. That they agree to the collections are going to be higher based off what they initially forecast it and so my concern is with new dollars in ACZG maybe you all can can answer this when you agree to the the formulary it's not based on real dollars is based on a percentage right. What happens when those dollars increase because then when you have a growth in your your sales tax and your your dollar figures go up that's what becomes the fight is that we had a growth in the collection of this and this percent while it may be a percent it's the dollars we're talking about that we've seen this increase in dollars and if we go below this percent we won't get this dollar amount that we're looking for it's not the percent it's the dollars. So current law requires percentages that's not us that's the law says percentage is that's what we follow DOR that's what's required but you're absolutely right percentages mean something very different when you look at real dollars we have counties where the sales tax is growing up going growing 10 20% a year we've got others words flat and maybe some words decline so it's very different costs are state but you know I think theoretically when the law was first created the general so we wanted it to be a little bit more important to the general. So every new dollar in sales tax you got should be a dollar you eliminated property tax so over time the sales tax grows I think the theory is your property tax should be coming down at the same rate so if you get a 20% growth in your sales tax you apply that extra 20% growth or that extra dollar amount in sales tax you're given that dollar reduction in property tax but as we know it reality that it only happens. Well that's my concern is I think each county in city could say we're actually probably not doing that so what is the mechanism to kind of get us to that that place where folks who do have who live in counties and cities can see some type of rollback if collections collections exceed a certain threshold what does what does that look like or is that some kind of way to factor that in is that a formula I don't know I'm just putting it out for discussion amongst the committee because you know as taxpayers for example we live in Savannah Chattam County and I have constituents who call me about this little college small private college that's happened to be in Savannah let's call the Savannah College of Art and Design and they pay no property taxes but they do have students they do have folks they do place a strain on infrastructure they are in the city and they are absolutely in the county but they don't pay necessarily a property tax. But what many of my constituents want to know is well we have to feel the burden of them not paying taxes and they don't pay taxes on buildings because they're nonprofit and that is a question that has come up more and more in fact myself and Senator Dixon had this conversation about that as well at some point citizens who are taxpayers want us to find a medium to help them find some equity so that they're not feeling the the brunt of that and I don't know what that looks like so maybe we can talk about that. And I'm going to talk about that and answer that and maybe that comes up in our next meeting but I'm on yield to the manager for the seat of Savannah. But I think the question about like what comes first the revenue or the rebate is a really interesting one to pose and then you know Clint in your example as Senator and I were just talking about your example yes in theory the property taxes should come down if revenues are increasing if the cost of those services are going to be in the state of the state. So the services remain the same as well but as the counties attested to and the cities will attest to the cost of delivering those services increases as well and it gets back to everything being a zero sum game whatever that sum is in Savannah. So we're really trying to get the value we're very fortunate our sales tax numbers are growing it made it it made it much more easy for the municipalities to to grow the county share of the lost revenue this year because of that growth. And so we both see a benefit but as you said there are other counties that aren't experiencing that type of revenue growth and that might not always be true for Savannah Chatham County as well. So it's a really interesting question about I'm thinking about my own budget formulation processes where admittedly we look at sales tax as a revenue and this is part of our budget and not necessarily a rebate that's applied at the back end like the governor's rebate that was just applied right of course it's calculated that way and shown that way on tax bills and this is how much is offset or the revenue but it's a really interesting concept to think about what's coming first the revenue or the rebate. And I will say looking at how small our county is we do not have a lot of growth in our county so the rollback the biggest thing that I used with commissioners of making sure we could do everything possible not to lose it and I will say the host was discussed towards the end it was never threatened. To our city but it was discussed especially when it got to the point of I think we got told that we would just lose it actually they would let it lapse and so that's when our county started actually just discussing that amongst ourselves but the rollback is a huge thing for us because our county has rolled back for over 15 years now in Texas have not been raised so our county is actually you know our people in our county are happy with that they're happy that their taxes haven't gone up now with that being said that does hurt the county a little bit because you don't have that increasing your budget. So that does hurt us a little bit but without the rollback we would absolutely go up in millage at ridiculous amounts and like you know like Clint was saying people getting voted out that is a very quick way for it to happen. Because it would end up putting us up at the three to four meals and you can't there's no this is not possible in certain aspects of it so especially in a small county like we live so with that I know that you look at the dollar amount the percentage and yes percentage helps and we kind of every budget that you look at of course is projected and you never know if you're going to bring in all the revenue you're praying that you're going to bring in all the revenue you're praying that you're going to bring in all the revenue you're going to bring in all the rest of the day. So you're going to bring in all the revenue but if something were to bottom out you do what you can but lost is a huge thing especially for small counties like us because it does make up for that additional revenue that is needed to help make sure that everything functions in a way in a smooth way and everything goes the way it needs to because most of our county employees live right there in that county there's not a lot that comes over and works from another county. So we have to depend on that and depend on that loss to help not only keep their property taxes down but also pay their bills every day. I just really hope that you'll look at ways to make this work and run smoother and work for everybody in the best. So any more questions? Thank you. Stuart is going to help us draft some of the most amazing awesome loss legislation of this decade. No pressure, Stuart. Do we have any other presenters? That's it. Well, I asked members of the committee to text me some meeting options that in the next three weeks would work we want to build consensus and you know what the irony is when you text me three dates. Many of you will have the same date that you text me and then I'm going to just you know put I was scratch sheet of paper right your name all the dates and then draw a circle around the ones that all align. I learned that in elementary school so positive for public education there but appreciate you offer for coming today. Thank you to all of our presenters and at our next hearing in Spalding County there is a out of state presenter that has some ideology on law. We'll hear from them and we'll also have Senate research kind of give us what other communities are doing. Commissioner Farrell. You don't provide some commentary. Well, we are in Chatham County commissioner so I will absolutely indulge if members of the committee are fine with that. I always want to check with the senators. Well, and would you use one of these mics we're streaming it and shout out to Todd Edwards from ACCG. I texted him. I didn't see him and he is listening so I want to make sure you have it. Okay, well listen, I've been through two new negotiations, reading negotiations. They're very difficult. Everybody's protected the cities in the counties are just you know trying to get the biggest piece of pie. Please consider some sort of formula that takes it out of the city in the county's hands and is centric to the taxpayer that's fair to all the taxpayers in the cities in the county. Wherever they live that you know with maybe an option to negotiate because a formula is hard to make that fits every one of the 159 counties. But if you could come up with something that says okay and do it soon so everybody could be thinking about it for the next eight ten years and be ready for it. Don't wait till the you know year before this thing goes live because then it's more difficult. So if you my my hope would be that y'all could come up with some sort of data driven formula that would say this is how much this citizens get. Look at the citizens and try to be fair to them and then we'll figure out at the city level and the county level what to do with our share. And if that formula is not perfect give us the options to negotiate where we don't have to get in this. Knows bleed fight every ten years because that's that's just what it comes down to and I'd like to get away from that so appreciate your. Listen to my two minutes. Thank you. Absolutely thank you commissioner Farrell and thanks to members of the committee and you all have the information from ACC G to take home and digest with you. And let's also maybe just trade us emails as members of the committee to you know put together a couple options that we can see a path forward on that the general assembly can take up. And we'll share those with Lieutenant Governor Bert Jones who's said he'd like to see something come out of the committee that that could be put on paper coming out of this committee said I don't have a committee just to meet just he's that come up with something so. Would like for the committee to do that so we can maybe have some some guard rails and put some some rules back and play and let's get something on the books. Thank you all so much and thank you all for coming to Savannah. Thank you all so much.",
  "updated_at": "2026-02-14T00:35:57.609922+00:00"
}