{
  "video_id": "UM2pFhXNaJM",
  "url": "https://www.youtube.com/watch?v=UM2pFhXNaJM",
  "title": "Appropriations Meetings 2026 -  Day 12 AM Session 1",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 12,
  "video_date": null,
  "duration_minutes": 35,
  "summary": "Here is a summary of the Georgia Appropriations Meetings 2026 - Day 12 AM Session 1 session:\n\n**Overview:** The session focused on reviewing and approving changes made by the House to the Governor's budget recommendations across various state agencies and programs. There was no substantive debate or controversy reported.\n\n**Key Actions:**\n- **Approved:** Changes to the education, economic development, transportation, and general government budgets.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:** \n- The meeting was chaired by multiple committee members, with one filling in for the regular chair who was tending to family matters.\n- There were brief explanations of the various budget adjustments, but no significant discussion or debate.\n- Votes to approve the changes were unanimous, with no opposition noted.\n\n**Votes:** All budget changes were approved unanimously by voice vote.\n\n**Attendance:** Quorum was present, though the exact attendance numbers were not provided.\n\n**Adjournment:** The session adjourned without a specific next meeting date mentioned.",
  "transcript": "Ladies and gentlemen, welcome, so glad that so many people are so bored this morning\nyou decided to get up and join us at 7 a.m. Thanks to everyone for being here, at least\nif you would, open us an order to pray, please.\nLet's pray.\nHeavenly Father, I thank you that we have the opportunity\nto do this good work here for the good people of Georgia\nthat we represent and I do pray that throughout this morning,\nwe will operate with wisdom, justice, courage,\nand moderation.\nYou're only my pray, amen.\nAmen.\nThank you.\nI will kick us off and call this education appropriations\ncommittee meeting to order.\nWith that, we will get started, I believe everybody.\nRoad does have a copy of the budget.\nIf you will go over with me to 24.2.3,\nwe are adding money to take care of some facilities\nthat are in dire need of that.\n24.6.3, if committee members, if you will remember,\nthis funds our PSAT, our IP and our IB test,\nand the reason that we continue to see this here\nin the amended budget. This is above and beyond. This is the demand. This is the demand\nfor those tests that we're paying for, but these are actual costs. And so probably a\nbigger discussion in the big budget that we need to have about increasing the base. There\nhave a number of true ups in 24.18. Then if we come across to 24.22.3, if any of you come\nto Chairman Erwin's Education Committee meetings.\nWe talk about focusing on literacy and we talk about focusing on safety and learning.\nThis is one of those safety initiatives.\nThis is a school safety pilot program that we'll see across four high schools in the coming\nyear.\nWe're really doubling down on not only the 3D mapping that's required by law, if you'll\nremember that we passed but this is also adding a very intriguing program from\ncampus guardian angel and adding drones happy to share that with you and tell\nyou more about it. This is a program that the likes of which I have seen that I'm\nvery very excited about. You'll go over with me to section 25 and ERS 25.4.1 we're\nmaking a $50 million infusion of cash there to ERS that will help improve our funding ratio.\n27.13.2 this is a program that is sunsetting with a set date of April 1st so we're able\nto find some savings there and with that we're done with that part of the budget are there\nany questions? Chairman Jones. I have no questions but at the appropriate time\nsir. It is the appropriate time. Motion due pass. We have a motion we have a\nsecond we have a second. Any further discussion? Hearing none all those in\nfavor please say aye. All opposed like sign? We stand adjourned.\nYou\nYou\nYou\nYou\nWell it's quiet, we'll go ahead and we're a little early but we'll go ahead and get\nstarted.\nI'm filling in for Chairman Meeks.\nHe's home taking care of family.\nHe's fine, but we have our multiple roles we've got to fill.\nSo he's doing that today.\nWe'll start today with section 13, Department of Agriculture,\n13.3.5, a little adjustment for increase\nand lost from COLA and shortfalls over the last few years.\nIn it 13, 3.6, 3.7 and 3.8, those are additional funds of 250,100 and 105,000 per software\nupgrade for animal health, plant protection and structural pest divisions.\n$13.4.5 is $250,000 for other agriculture improvements.\n13.8.3 and soil and water conservation commission\non 31,443 for a new plan reviewer position and 13.8.4 is $57,120.\nor some retention money for his plan reviewers.\nThat turnover rate has been very high,\nso we're trying to help them there.\n16.8.1, the Governor put in 35 million\nfor the George Environmental Finance Authority\nfor natural gas infrastructure. We were keeping that at 35 million and at 16.8.2 we\nadded 50 million who increased funds for rural infrastructure for economic\ndevelopment. The rural parts of our state. 23.1.4 under economic development the\n$100,000 for an entrepreneurial support program at $23,4, the Council for the Arts,\na special project of one-time funding of $250,250 for community art grants.\nAt Tourism Under Economic Development, $23,10.3 increased funds for the Georgia Humanities\nfor the American 250 initiative.\nIncrease that to $250,000, $250.00.\nUnder Georgia Forestry, Section 26, 26.1.4, $100,000\nto support the leadership program for agriculture forestry\nand veterinary medicine.\nat 26.3 under parstery protection provided $532,293 for own call pay effective April 1st of 2026 and under section 40 the public service commission\nline 40.3.3 added some additional funds for an engineer effective April 1st, 2026 of $36,125\nand at 40.3.4 $31,875 for a financial analyst for the Public Service Commission.\nThat is all of the changes under the Economic Development Section. Any questions?\nI don't see any questions.\nChairman Green. Thank you, Miss Chairman. I move to pass.\nAll in favor?\nSay aye. Aye. All right. Thank you.\nYou\nWe're going to proceed with the transportation budget and we're going to review the changes\nthe House made to the Governor's recommendation starting with $47.1.3. We added $15 million\nto the airport aid. Followed by $47.2.3, $85 million for the rehabilitation and replacement\nof rural bridges. The Governor's recommendation had this in capital maintenance. The G.Dod asked\nus to move it to capital construction, so they could better administer that. $47.3.1. This\nis the item that we moved to capital construction. So it zeroed that out. 47.11.4 million, $245,000 for\nrepairs, replacements, and upgrades to state-owned short-line rail. And finally, 47.16.1 billion,\n$715 million, $747,000 for the extension and bidirectional expansion of the R-75 express\nlanes in Clayton and Henry counties.\nSo that concludes the changes the house has made.\nDo we have any questions?\nI don't see any questions.\nWe have a motion.\nAll right.\nWe've got a motion.\nDo we have a second?\nAll in favour?\nSay aye.\nAll right.\nDo pass.\nThank you.\nYou\nYou\nYou\nAll right.\nGood morning.\nThis is general government walk through for the house changes for mental physical year\n26, start with the Department of Audits and account section 4 page 1. Audits is a legislative\nbranch agency so we added their statewide changes throughout the budget. 4.1.4, we direct\naudits to use existing funds to fill vacancies and phase in public school system audits\nover a three year period. State accounting offices, no changes. Department of Administrative\nServices Section 12 page 4, 12.2, 12.12.1 cybersecurity funds for GTA or Truda, 12.3\nunder GTA, we authorize the use of interest for having you accrued in the Technology\nEmpowerment Fund to help fund call center improvements for the Department of Labor.\nbanking and banking and finance, no changes,\nDepartment of Driver Services, no changes,\nalso the Governor, no changes,\nalso the Commission of Insurance, no changes\nto Department of Labor, no changes\nother than what I've reflected on a minute ago.\nDepartment of Natural Resources, 34.1.4\nand 34.1.5, 1 million, 250,000\nfor Coastal Preservation Projects,\n34.3.3 under EPD, the House recommends $1 million to support the air emissions program operations\nto delay a physical shortfall. Under 34.7, the Parks and Recreation Historic Sites program,\nthe House added a total of $6,911,250 for various outdoor parks and recreation projects throughout\nthe state. 34.9.4, 8.2 million is provided to expand and improve an update wildlife\nmanagement areas. 34.9.5, 150,000 to mitigate the spread of invasive plant species in\nSouthwest Georgia. The Department of Revenue, no changes. Secretary of State, 43.2.5.\n15 million for grants for county elections offices. Workers' Confensation Board, no change.\nAny questions? Hearing none, do I hear a motion?\nWe've got a motion, we've got to say, oh, we've got it.\nAll right.\nReps in the Mitchell.\nMr. Chairman, I rise to speak to make the motion to do pass,\nbut it seems like it's already been made.\nOK, all right.\nThank you, sir.\nAll right, we've got a couple of motions to pass,\nand maybe a couple of seconds also, so everybody in favor?\nAll right, thank you.\nMotion passes.\nThank you.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nOkay, thank you.\nstart with Section 5, Appeals Court, in the judicial area, as you'll see, consistently\nthrough it, 2,000 times one time bumps for salary employees as well as reflected employer\ncontribution rate from a state health benefit plan coming down.\nSo we won't talk about those going forward, but there's no changes in the Appeals Court.\n6th Judicial Council. There is a change 6.1.3, personal services to reflect the actual start date of\n$66,302, the 6.1.4, one-time fund, payment for accountability court for the case management system, $150,000.\n6.2, sorry, I ran over here, so I'm breathing tough.\n6.2, there's no changes there.\n6.4, there's a one-time change or 6.4.3, $27,150,\nfour actual start date of a position.\nA lot back of that, 6.5, 0.3,\nreduced utilize funds for legal fees of $50,000 callback.\nSection 6, Judicial Council, there is a $6.8.3\nincreased funds for one-time costs of annually payout.\nThat's a callback there, from $41,000,\n$6.10.4, that's a callback for actual, sorry,\n6.10.2, 6.10.3, and 6.10.4 for Georgia Tax Court.\nThat's just funding reductions based on the actual numbers there.\nSection 7, Judicial Council.\nThere are no changes there outside of the one-time fees.\nSection 8, there are no changes there.\nSection 9, Superior Court.\nThere are no changes there either.\nOh, sorry, just kidding.\nSo 9.3.8, there is a reduced-\nreduced funds to reflect Superior Court judges\nwho have not opted into the new salary structure.\nThat was $704,493.\nSupreme Court, there were no changes there.\nActually, there was 10.1.3.\nIt was the increased funds for a state patrol,\ntrooper agreement for the Supreme Court.\nBut that was no change from the governor's recommendation.\nAnd lastly, section 37, 37.1.2.\nThat's just the contribution rate for the health benefit plan.\nbenefit plan. There was a cloud back there, like we did everywhere else. Public\ndefenders, 37.2.2. This is to reflect, I'm sorry, that's a, let's say you've been\na family plan that we talked back, cloud back, 37.2.3. The ARPA money funds to\ncontinue representation of the multi-definite cases. That was, they asked for\nfive million five hundred twenty one thousand seven hundred twelve dollars. We're still looking for additional information to understand\nHow they're doing their conflict cases\nSo for the time being that's a zero dollars\n37.2.4\nThis is to increase the and align the assistant poet defender salaries to the 80 a's\nAnd it starts April 1st. So that's something we added two million seventy four thousand forty six dollars\nhave any questions for goody? Do you have a motion? Move to pass, have a second. All\nin favor say aye. Thank you all.\nYou\nGood morning, everyone. We're a little ahead of schedule, but I'm going to call the appropriation\nsubcommittee on higher education to order. If we can go to Section 41 under the University\nsystem of Georgia or 25 systems there, 25 units under agriculture experiments section\nand 41.1.2 you'll see a true up that's related to delayed start dates and positions that\nare not filled that were budgeted last year. So you'll see several of those as we go along\nand I'll just call those a start date true up. That's 180,000 true up on that 41.1.2\nin the Agriculture Experiment Station due to actual start dates.\nThen down to 41.1.3, provide one-time funds for operational and equipment needs to support\nblueberry breeder research.\nThat's a $500,000 edition.\nThere's a request for a million, but the House is putting together that 500 is recommending\nthat $500,000 there.\nIf you go on down to Cooperative Extension Service, 41.3.2, that's a start date true\nup of $112,000. If we keep progressing on under 41.13, the Medical College of\nGeorgia Hospitals and Clinics, there's an additional 200,000 to increase funds\nto expand the current partnership with Clark Atlanta University for prostate\ncancer research. So very important position there. If you keep going to 41.14.2,\nWe have an addition for the Pines program that's the Public Information Network for Electronic\nServices to assist our public libraries going down to the Regent's Central Office in\n41.16 on their 41.16.2 we have an additional, we have a recommendation for $300 million\nis an endowment for the dream scholarship, a life-changing potential there that we're\nlooking forward to working on.\nThere is an additional 25 million that's been discussed.\nWe're waiting for some exact details from the Board of Regents in writing so the appropriations\ncan be properly delineated.\nIf you go down to 41.16.3, we've got some delayed implementation of an alternative college\nadmission test of $15,000 change.\nWe have an increase on 41.16.4 for Galileo access of $67,000.\nWe have some other true ups in the George Commission on the Holocaust and public telecommunications.\nIf you're going down under Student Finance under Section 44, we have several of our scholarships,\ngrants, and service-cancelled loan programs which due to the appropriations and differing\namounts of participation and applicants, eligible applicants, we have significant reserves\nin many of those programs.\nSo I'll list a few of those.\nThe hero scholarship, under $44.6.1, $280,000 true up, under $41.11.1, a million true up,\n44.15.1 public service memorial grant of $540,000 true up and then service\ncancelable loans under 44.17. Several of those there are true ups based to\nsignificant reserves exceeding a typical annual appropriation under those as\nwell. Let's see. And under the technical college system of Georgia under section 46, we do\nnot have any direct adjustments to that. So those are the higher education budget recommendations\nfrom the subcommittee. Is there any questions for higher education subcommittee? If not,\nIt is about here.\n",
  "updated_at": "2026-02-12T10:51:25.65411+00:00"
}