{
  "video_id": "UNotK0HmXGM",
  "url": "https://www.youtube.com/watch?v=UNotK0HmXGM",
  "title": "03/05/2025 Sen.H.Jones II  Press Conference w/ ACLU and NAACP on DEI",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 35,
  "summary": "Here is a summary of the Georgia 03/05/2025 Sen. H.Jones II Press Conference with the ACLU and NAACP on the DEI session:\n\n**Overview**\nThe press conference addressed the recent passage of Senate Bill 120 in the Georgia Senate, which bans promoting, supporting or maintaining any programs or activities that advocate for diversity, equity and inclusion (DEI) at post-secondary institutions. Speakers strongly criticized the bill, arguing it is an assault on American and Georgia values of inclusion and diversity.\n\n**Key Actions**\n**SB 120**: Bill banning DEI programs and activities at post-secondary institutions in Georgia\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Sen. Minard Lear criticized SB 120 as a \"retreat from the American and Georgia spirit of inclusion\" that diverts attention from important issues like healthcare, housing, and income inequality.\n- Sen. Nikki Merritt called SB 120 a \"tone-deaf legislative tragedy\" that rejects Georgia's legacy of diversity and the civil rights movement.\n- Former Rep. Roger Bruce questioned why lawmakers need laws dealing with diversity to help descendants of slavery, arguing the \"playing field is not level\" due to past injustices.\n- Nancy Flake Johnson, President of the Urban League of Greater Atlanta, said SB 120 limits constitutional rights and that DEI is one of the best strategies to bring people together and achieve parity.\n\n**Votes**\nNone recorded\n\n**Attendance**\nNo specific quorum notes\n\n**Adjournment**\nNot mentioned",
  "transcript": "Good morning. Good morning. Good morning. My name is John Moe. I'm the senior\ndirector for policy at the Urban League of Greater Atlanta. And on behalf of\nour partners, the Georgia NAACP, the NAACP Legal Defense Fund, the ACLU of\nGeorgia, the League of Women Voters, leader Carolyn Hugley, leader Harold Jones, we welcome\nyou to this press conference to address Senate Bill 120 and its effects on the communities\nwe serve. At this time I'm going to bring to you our leader, the leader of the Democratic\nparty in the Senate Senator Minard Lear, Harold Jones.\nThank you.\nRecently the Georgia Senate has taken up SB 120, which bans promoting, supporting or maintaining\nany programs or activities that advocate for diversity, equity and inclusion.\nAccording to the bill, post-secondary institutions\nthat violate its provisions would have state funds\nor state administered federal funding withheld.\nBut it is actually bigger than that.\nThe salt on diversity is actually an assault\non American values.\nDiversity, equity, and inclusion brings people together.\nIt basically brings us together to solve\nAmerica's and Georgia's problems.\nThe salt in SB 120 is a retreat from the American\nand Georgia spirit of inclusion.\nIt's that a retreat from our shared values\nof finding out what makes us better as a nation\nand as a state.\nThis in assault is one that diverts our attention.\nAt this particular point in time,\nwe should be bringing people together\nto solve such issues, such as health care,\nhousing, income inequality, and childcare issues.\nBut instead, we've passed bills like SB 120,\nwhich tears us apart.\nBecause make no mistake, our nation in this state\ncan only solve these problems together.\nAnd diversity, equity, inclusion brings us together,\nall bringing us with unique perspectives,\nbut all having a singular focus\non how we can improve the lives of the people of America\nand the people of this state.\nThat is why it is bigger than just losing state funding.\nIt actually is an assault on our American values\nand Georgia values.\nThank you.\nThank you.\nThank you, Leader.\nNext, the honorable Nikki Merritt, who serves as a member\nof the State Senate, who serves as chairperson\nof the Georgia Legislative Caucus.\nSenator Merritt?\nGood afternoon, everyone.\nand greetings, members of the press.\nSB 120 is an legislative, it is a tone-deaf legislative tragedy.\nAnd it is designed to tear us apart in the state of Georgia.\nDespite overwhelming feedback against SB 120,\nthe authors and the committee members who push this legislation\nthrough have continued to force this bill\nthrough this system and abusing the legislative power\nthat they have been given.\nIt is an insult to the entire state of Georgia\nand the diversity that we enjoy in this state and celebrate.\nFirst of all, it's a complete rejection\nof our state's legacy and what makes our state exceptional.\nWe are one of the most diverse states in the entire country\nAnd our history is built upon a sense of pride\nrelated to Georgia's core role\nin the civil rights movement.\nSecondly, the evidence shows that diversity programs work.\nBut they're not even enough.\nAs of 2022, Black faculty comprise of only 6%\nand 3.6% of full professors at UGA and Georgia Tech.\nRespectively, between UTA and Georgia Tech,\nmoreover, Black students only account for 6.4%\nof the students enrolled at UGA,\nand 8% of the students enrolled at Tech.\nBlack Georgians make up one-third of the overall state's\npopulation.\nCutting back DEI programs that help recruit and retain\nstudents and faculty will only make the disparity worse. Lastly, it reveals again how\nunserious some legislators are about using our power to improve the lives of our\nconstituents in all Georgians. There is a massive amount of funding\nstate here, massive that many of our institutions rely on. It creates a legal\nrisk by weaponizing civil rights laws against the very people those laws were\ndesigned to protect. This was threatened the vital pipeline programs for\neducators and how again is this benefiting anyone? I keep seeing legislation\nthis this session that benefits no one. I'm calling on my federal fellow\nsenators to reject SB 120 and I'm asking members of the public and hear me\nclearly. I need you to call these legislators that pass that pass through SB 120\nring their phones off the hook and if you need their numbers I'm gonna put them\non my website and you start calling them now call the lieutenant governor\nCall the governor and tell them this is unacceptable and we want you to reject 120 and don't even bring it to the Senate floor\nGood after nims\nThank you chair person and now former state representative Roger Bruce\nI told everybody I wasn't coming back down here. Let's they pissed me off\noff. And they pissed me off. Why do we need laws that deal with diversity and deals with\nhelping the descendants of slavery? Why do we need to support diversity? The main reason\nis because slavery was real, it was not a myth.\nPeople died, people were lynched.\nAll kinds of things happened in this country.\nThey caused people, there were descendants of slaves,\nto not have an equal opportunity and equal chance\nto be able to participate in democracy,\nas they said, democracy was supposed to be.\nWe didn't do that.\nThe playing field is not level.\nWe're not in a situation where everybody starts\nfrom the same point.\nAnd when that doesn't happen, some people\nhave an advantage that others don't.\nAnd admission to segregation and admission\nto all of those things that went wrong is a starting point.\nIt gives us an opportunity to determine what has happened\nbad in this country that we need to fix. I really want to call on those people\nthat are sponsoring this bill to tell us what's really bothering them. What's\nreally wrong because it can't be this because you can't be totally ignorant\ntoward this happening. There's something else that's on your mind. I think you\nWe need to bring it out so we can address what's really bothering you.\nWe can all stay any all day long and try to guess what that is.\nI think we all know, but you need to come out and say it.\nWhat's the real problem and what do you want to do about it?\nI want to thank all of those that have come out today because a lot of people seem to\nbe afraid for whatever reason to speak out and speak up for things that are wrong.\nin this city, in this country, and in this world for that matter.\nI don't know what's on people's mind and make them fearful,\nbut I'm glad to see these people that came out,\nbecause what is going on is wrong.\nThis bill should not even get to the Senate floor,\nand I hope that if it does,\nthat you will stand up and do what's right and vote it down.\nThank you for allowing me to come and say something today.\nThank you, Representative Bruce.\nThank you, Representative Bruce.\nAt this time, ladies and gentlemen,\nI have the high privilege and distinct honor\nof presenting Nancy Flake Johnson,\nPresident CEO of the Urban League of Greater Atlanta.\nPresident Johnson.\nThank you.\nI want to thank everyone who showed up to support\nour firm and solid opposition to SB 120.\ninformed by history, the Urban Leaks understands the harm that SB 120 will bring to our public schools,\nour public institutions and most importantly to our communities across this state.\nThis bill limits our constitutional rights to freedom of speech and equal access for all families\nto the critical resources and needs that we all require to live a quality life.\nBut most importantly, diversity equity inclusion is actually one of the best strategies that our country has employed\nto bring us together and achieve parity for all citizens in our country.\nDEI supports women, minorities, people with disabilities,\nthe LGBTQ plus community, and we too are citizens of this state.\nIn fact, when all of those constituency groups combine, we make up more than half the population of our state.\nSo we are imploring our elected officials to listen to your constituents, to think through carefully the impact,\nthe trickle down but devastating impact that the passage of this bill will create.\nWe've already seen in the last 30 plus days the ripple effect of these policies,\npeople losing their jobs, institutions having to limit access to care,\nThere, students fearful that they will not receive their scholarship so they can complete\ntheir education.\nThis bill is designed to support people, all people.\nWe know our history in this country.\nThis bill would even ban our ability to talk about race and diversity, equity, and inclusion.\nThe way civil society solves problems, it's through communication.\nIt's through the sharing of ideas and solutions.\nAnd so we are prayerful that our elected officials will listen to their constituents.\nWe participated in the hearing last week on this bill, not one single solitary person\nwho testified was in favor of this bill, yet there were 30-40 diverse individuals present\nall expressing our concerns.\nAnd we have elected officials who don't listen to their constituents and serve them in an\nauthentic way.\nWe put our democracy and our society and our state at risk.\nSo thank you for being here.\nLet's stand together.\nAnd I'm going to reiterate the points that our elected officials who preceded me stated.\nIf our government does not hear from the people, they are in a position to put forth their\npersonal agendas.\nSo pick up the phone, make the calls, write the letters, send the emails.\nWe've got to have our voices heard.\nThe urgency is now.\nThank you very much.\nThank you, President Johnson, at this time, the honorable Carolyn Houdley, House\nminority leader.\nGood morning and thanks to everybody for being here.\nYou know the United States of America is not just a place on the map.\nIt's an idea.\nIt's a promise.\nis a beacon of hope from our very founding people\nfrom all over the world have come here seeking freedom\nand opportunity.\nOur statute of liberty says, give me your tired,\nyour poor, your huddle masses, your name to breathe free.\nAnd President Reagan called America a shining city\non the hill because we welcome all who dare to live free,\nwho want to believe in American dream.\nDiversity, equity, and inclusion\nis a part of the American dream.\nAnd that's because anything is possible if you work hard.\nOur diversity is not our weakness, it is our strength,\nit inspires innovation, it strengthens our economy\nand it enriches our culture.\nWe are a nation of white and native, black and brown, young and old, men and women rich\nand poor.\nWe are people all the same, all the same because we are Americans.\nAmerica is the greatest nation on earth, and I believe you think as I do, that we cannot\nbe great if we embrace hate and Senate Bill 120 is about embracing hate and I call on every\nGeorgian of Goodwill to call on our senators to reject this awful bill because it was one\nsaid that this was a place that was too busy to hate.\nThank you.\nThank you, Alita.\nAnd now Chase Petifert will bring remarks the student and president of the Georgia Tech\nNAACP.\nChase?\nGood morning.\nMy name is Chase Petifert and I serve as the president of the NAACP unit seated at Georgia\nTech.\nI stand here before you today, not only as a student leader speaking on behalf of many\nstudent leaders, not only as a Georgia resident speaking on behalf of many\nGeorgia residents, but as a person who is scared about the future of our\ncommunities on my campus and on campuses around our state. I was asked to speak\nabout the impact of anti-DI policies on students at Georgia Tech, and the\ntruth is we are terrified. These policies do not create fairness, they only\ndeepen any quality. When I first considered attending Georgia Tech, I was told I\nI might not find a place there,\nbut those fears were unfounded.\nGeorgia Tech welcomed me my peers\nand because of this commitment\nto fostering a campus where everyone belongs.\nTo watch this come under fire this week\nhas been the lowest point of my academic career.\nThese spaces, places, and conversations foster community,\nnot some unfair advantages or an ideology\nthat harms other groups.\nWe are watching our institutions\nthat have made great strides in the last 50 years,\nregress in front of our eyes and it is heart-breaking.\nAs Senate Bill 120 currently stands,\nthere is no carve out for student organizations.\nAs entities registered through our institutions,\nit is unclear how student organizations,\norganizations that we have built\nfrom the ground up will survive if this bill passes.\nThis bill is a direct attack on students from all angles.\nMoreover, Senate Bill 120 isn't just about the present.\nIt's about Georgia's future.\nThis bill threatens and undermine Georgia Tech's legacy\nas a leader in education and innovation.\nIt risk restricting the free exchange of ideas\nand perspectives that are crucial\nto the growth of our institution and our state.\nIf this bill passes, we will see that students leave Georgia\nto pursue education in states that value inclusion\nand belonging.\nWhat kind of future does that create for Georgia?\nResearch has shown that diverse educational environments foster innovation,\ncollaboration, and better outcomes for all students.\nThese programs are essential to preparing our students to be leaders in a globalized world.\nCutting them off will only hinder our state's ability to compete in an increasingly diverse and interconnected world.\nI strongly believe that Senate Bill 120 will harm not only Georgia Tech students,\nbut all students in this state.\nIt will prevent us from living up to the ideals of fairness\nand opportunity that Georgia has long stood for.\nTherefore, I respectfully urge you to vote no\non Senate Bill 120.\nLet us not allow the progress we've worked so hard\nto achieve to be reversed.\nOur students deserve better, and Georgia deserves better.\nThank you.\nThank you.\nThank you.\nPowerful.\nThank you, Chase.\nAnd next, Rainy Reinhardt, a student.\nRainy, are you with us?\nSee you, Senator.\nHey, Rainy, please.\nHello.\nMy name is Rainy Reinhardt, and I'm an organizer\nwith the Georgia Youth Justice Coalition.\nAs well as a first-year student at Georgia Tech,\nstudying communication and biology.\nRight now, in the two-hour gap\nbetween my chemistry lecture and lab,\nI should be catching up on homework and grabbing lunch.\nInstead, I'm here standing in front of you\nbecause I refuse to stay silent while our legislators\nattack the programs that make Georgia's colleges\nan accepting place of belonging.\nTo the legislators pushing this bill,\nI ask you to think back to your first week of college.\nDo you remember what it was like to be surrounded\nby strangers, the nervous, surreal energy\nwhen everyone made small talk of the drop of a hat?\nYou didn't find your people in that first week.\nYou may not have found them in your first year,\nBut when you did, how did it happen?\nWas it through a club, a campus program?\nYou know that these spaces are crucial to student success.\nSo what happens when they're gone?\nMy first semester of tech was lonely.\nI wondered if I'd ever find the friendships\na dream defining in college.\nThat changed when I found Georgia Tech's LGBTQ plus resource\ncenter and the student-run Pride Alliance.\nThese spaces bring students of all genders\nand sexualities together in community.\nThese spaces became my go-to between classes,\nmy relief after stressful exams.\nThey gave me community and belonging.\nThat's why last month I ran for Vice President of Operations\nfor Pride Alliance because I want to help every first-year\nstudent feel the same sense of belonging that I found.\nBut I stand here today because I worry for students\nacross Georgia who may never get the chance to experience\nthat feeling.\nSB 120 has already forced Georgia Tech to dissolve\ncrucial student support programs, including the LGBTQ Plus Resource Center, Black\nCulture Innovation and Technology, Intercultural Student Programs, and the Women's Resource\nCenter.\nThis bill is part of a larger effort to whitewash our communities and our history to control\na political narrative, erasing Black, Brown, and LGBTQ Plus voices from our institutions\nwhile propping up a world where only a few privileged people belong.\nWe know that throughout history, certain politicians have tried to divide us by race, gender,\nbackground to hold power. They tell us the funding programs for black students, queer\nstudents, and other marginalized communities is unfair while they rig the system to benefit\nthe wealthy few. We won't fall for it. I'm here to ask, on a campus full of people from\ncountless backgrounds and countries where students speak dozens of languages, how can\nwe thrive without programs that advocate for diversity? In a state, in a country that\nhas refused to provide its citizens with equal opportunities,\nhow can we thrive without programs that advocate for equity?\nOn a campus with over 50,000 students\nin an intense academic culture that can be isolating\nand overwhelming, how can we thrive without programs\nthat advocate for inclusion?\nWe can't.\nThe students of Georgia cannot thrive under SB 120.\nI speak for students across the state\nwhen I demand at the very least that our legislators carve\nprotections for student organizations within the language of SB 120. This would\nalign with executive orders limiting DI programs and public institutions.\nFailing to carve out these protections would be a blatant violation of our\nFirst Amendment rights. A few of my peers are here today including someone who\nworks for what was the LGBTQ bus resource center. Hundreds of tech students are\norganized in the past week to fight SB 120. They're making calls. They're\nshowing up. The students of Georgia will not sit back and let our constitutional rights\nbe stripped away by the people that we elected to represent us. We are organizing, we\nare speaking out, and we will not be silenced. Thank you.\nThank you, Rainey. Next, our Executive Director of the ACLU of Georgia, Attorney,\nAndrea Yom.\nThank you very much.\nI want to ask everybody to listen to our students.\nWhen I graduated as an honor student from an Atlanta public\nschool, I did not even consider the University of Georgia.\nBecause only a decade before, students\nintegrating this University of Georgia\nhad been yelled at and isolated and treated\nlike they did not belong.\nMy daughter was able to go to University of Georgia\nwith the kind of programs that are now being attacked\nby this bill.\nShe was able to thrive in her NAACP chapter.\nShe was able to thrive in the student government association\nwhere children's students from all backgrounds\nall across Georgia came together and learned how to work\ntogether and how to lead.\nAnd so these are the things that are at stake.\nI mean, there's really nothing I can say more than looking\nat these young people to understand what is at stake.\nWe're not talking about admissions.\nYou know, there's no affirmative action in admissions\nin public universities in Georgia.\nWe are talking about the students who have the test scores,\nhave the grades, who were excelled in their high school\nprograms, will they be able to thrive\nin our demanding research settings like Georgia Tech\nand University of Georgia and our other research institutions.\nYou know, our very selective institutions,\nthe students who qualify to go\nto these highly selective schools,\nwill they have the services that they need\nto thrive and do their best work\nand fulfill the potential\nthat they have already demonstrated that they have.\nAnd so that is what is at stake in this program\nand this denial of the reality of our diversity.\nAnd of course, I have to say that in Georgia\nAnd in Metro Atlanta, we know diversity has been our strength.\nBut we are still behind.\nThere is a new, as they are considering this bill,\nthere is a report that says Metro Atlanta is dead last\nin terms of economic mobility for our children.\nSo these are children who have beaten the odds.\nWe have kids who beat the odds.\nBut let's understand, we are leaving far too many children\nbehind and Charlotte, up the road, when they heard about this,\nWhen they heard about this report a decade ago,\nthey got busy and did something about it.\nWe need to do something about moving our children\nout of poverty into prosperity.\nWe are behind nationally in that endeavor,\nand this bill will make it even more difficult\nfor our educational institutions,\nwhich are the engines of opportunity\nto address the specific needs of our diverse students\nand help them thrive and become the prosperous adults\nthat we all need them to be,\nbecause I don't know about you,\nI need somebody paying into social security for me.\nSo we need our students to fulfill their fullest potential,\nnot just for them, but also for our entire community.\nThank you.\nThank you.\nThank you.\nThank you, Ms. Young.\nAnd now, Hamid Alavi,\nSenior Policy Council for the NAACP, legal defense fund.\nHamidah?\nWoo!\nWoo!\nGood morning.\nCan you hear me?\nOK.\nOK.\nGood morning.\nMy name is Hamidah Suat LaBee.\nI serve as Senior Policy Council at the NAACP Legal Defense\nFund, the nation's oldest racial justice legal organization.\nAnd as the organization that litigated Brown versus Board\nof Education, we are here today to urge the Senate\nto oppose the ongoing attack on diversity, equity,\nand inclusion and vote no on Senate Bill 120.\nToday we are proud to stand alongside these fierce advocates\nfighting back against the onslaught of attacks\non racial justice and educational equity.\nSenate Bill 120 is a dangerous effort\nto politicize our public educational system\nand it puts Georgia's educators and students last.\nThis legislation threatens to exacerbate\npre-existing racial inequality through its vague prohibitions,\nlack of substantive or procedural guard rails\nand penalties like we heard today\nthat could also strip schools of billions of dollars\nin federal funding, resulting in substantial harm\nto Georgia's public school students,\nentire school districts, and across college campuses\nacross our state.\nMuch like we saw with the attacks on critical race theory,\nthis legislation broadly mischaracterizes\ndiversity, equity, and inclusion.\nAnti-stable rights advocates have co-opted the term\nto refer to anything related to race, gender,\nor sexual orientation, while also distorting its goals\nto wrongly suggest that they are discriminatory.\nWhen in actuality, they are used to prevent\nand remedy discrimination.\nLDF is deeply concerned that this bill may lead\nto the targeting of black students and educators\nthrough the elimination of racially inclusive\ninstruction, programs, and services\nthat help us to overcome unfair barriers\nand better integrate into non-diverse environments.\nAs highlighted today, we have already seen examples of this,\nhow ironic that in Georgia,\nwhere we first integrated or desegregated,\nrather our college campuses and universities,\nonly 64 years ago,\nare we having a conversation\nabout how Black Georgians receive preferential treatment\nor special benefits?\nDenying the existence of the persisting vestiges\nof the legal subjugation of Black people in our state\nand across our country is what this bill does.\nThis is not just about acknowledging truthful history.\nIt is also about acknowledging how that history contributes\nto existing disparities.\nThe proposed justification for this bill\nbelies the real life experiences\nof black educators and students from Atlanta to Savannah\nand all across the black belt.\nBlack professors and students remain grossly underrepresented\nas highlighted in Senator Mayor's comments.\nAnd prohibiting diversity equity and inclusion\nwill exacerbate those disparities.\nWe also know that black students attending\nthe least racially diverse schools\nexperience discrimination most frequently.\nOur K-12 education system has similar concerning disparities,\nand Georgia is one of the top 10 states in the country\nwith the highest rates of school segregation\nfor black students.\nBut here we are today trying to justify\nwhy diversity, equity, and inclusion programs should exist.\nAs a product of Georgia's public school education system,\nI know from personal experience what this looks and feels like.\nHow can we justify certain public school students having access to high quality, diverse\neducators, robust and inclusive school curricula, computers and books that are not falling apart\nand wrap around services while others within the same state and oftentimes within the same\ndistrict lack access to these same resources.\nToday we should be gathering to talk about policies to close the racial achievement gap,\nlike improving funding for low income students,\nculturally responsive approaches\nto strengthening school climate,\nand other ways that we should uphold our constitutional mandate\nof equal protection in our public schools.\nIndeed, the success of our multiracial democracy\nrelies upon pathways to academic and professional achievement\nthat are open to all.\nThis legislature must wield its authority\nto effectuate laws designed to truly remedy\nlegacies of racial exclusion that persists today.\nnot erect new barriers to those very communities\nharmed by racial discrimination,\nby dismantling lawful efforts\nthat help schools comply with federal civil rights\nand anti-discrimination laws.\nNow is not the time, never is the time\nfor Georgia to take a step backwards.\nVote no on Senate Bill 120, call the governor,\ncall the lieutenant governor,\nfollow all the call-stay actions that we hear today.\nLet's keep fighting.\nThank you.\nBoth no, both no, both no, both no, both no, both no, both no, both no, both no, both no.\nOur last speaker and a powerful advocate on behalf of all people, my good friend attorney,\nChristopher Bruce, Policy Director at the ACLU of Georgia.\nGood morning.\nYeah, I'd love to hear that.\nGood morning.\nI'm Christopher Bruce, the Policy and Advocacy Director\nof the ACLU of Georgia in organization for over 70 years\nthat has protected Georgia's constitutional rights\ncommunity, in the courts, and especially in the classroom.\nAt its core, Senate Bill 120 is an attack on the values that\nmake our schools and universities places of learning, growth,\nand opportunity.\nThis bill prohibits people from walking in front of the speakers\npodium, as well as prohibiting educational institutions\nfrom advocating for diversity, equity, and inclusion,\nbut tellingly, it all allows opposition\nto these very same principles.\nThis viewpoint, discrimination, and its direct violation\nof First Amendment rights of students and educators alike.\nEducators have the right to express diverse viewpoints\nin the classroom.\nAnd students have the right to receive information free\nfrom government interference.\nSenate Bill 120 was stripped those rights away.\nBy silencing discussions on diversity equity and inclusion,\nthis bill seeks to erase critical parts of our history.\nLimits students' ability to engage\nwith realities of the world around them.\nThis censorship is seen.\nIt is plain and sensual.\nIt is plain.\nIt is seen.\nIt is a violation of your rights.\nSenate Bill 120 is also a blatant attack on student organizations.\nUnder this bill, student groups that would promote diversity and inclusion could be shut down\nor even worse defunded.\nWhile groups opposing those values would be allowed to remain, this is a direct assault\non students rights to freedom of association, another fundamental constitutional protection.\nWe have already seen the harmful consequences of similar legislation and other states\nlike Texas, where multicultural centers have been closed and students have been forced\nto this ban.\nAs Senate Bill 120 becomes law, Georgia will follow the same dangerous path already.\nGeorgia Tech has had these issues surrounding several other student groups you heard earlier\ntoday.\nFinally, Senate Bill 120 provides no clear guidance on what is prohibited, leaving educators\nin the dark or what they can and cannot say.\nThis certainly will lead to self-sensorship and the erasure of important discussions in\nour schools.\nWe urge every lawmaker to vote on this bill and we urge the people to wake up on what\nis attacking your diversity, equity, inclusion, and history that has made this state great.\nThank you.\nThank you, Attorney Bruce. That concludes our press conference for today. What do we say?\nVote what? Vote no. Thank you all very much.\n",
  "updated_at": "2026-02-12T18:58:30.886459+00:00"
}