{
  "video_id": "uo4DWjTbkyE",
  "url": "https://www.youtube.com/watch?v=uo4DWjTbkyE",
  "title": "Ways and Means Subcommittee on Income Tax Meeting 2026 - Day 16 PM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": null,
  "duration_minutes": 16,
  "summary": "Here is a structured markdown summary of the Georgia Ways and Means Subcommittee on Income Tax Meeting 2026 - Day 16 PM Session:\n\n**Overview**:\nThis session featured discussions and votes on several tax credit bills, including measures to extend and expand tax credits for shortline railroads and historic preservation.\n\n**Key Actions**:\n**HB 1070**: Extends and increases the Georgia Shortline Railroad Track Maintenance Tax Credit\n**HB 519**: Establishes a Work Opportunity Tax Credit for employers hiring certain individuals\n**HB 376**: Increases the cap on the state's Historic Rehabilitation Tax Credit program\n\n**Bills Introduced (First Reading)**: \nNone detected\n\n**Notable Moments**:\n- Representatives provided testimony on the positive community and economic impacts of the historic preservation tax credit program\n- Committee members expressed strong support for the bills, noting the programs have been highly successful\n\n**Votes**:\n- HB 1070 passed unanimously \n- HB 519 passed unanimously\n- HB 376 had its first hearing, no vote taken\n\n**Attendance**:\nQuorum present, no issues noted.\n\n**Adjournment**:\nThe meeting adjourned. The next session date was not specified.",
  "transcript": "Good afternoon, if I can have everyone's attention, we're going to go ahead and start the income\ntax subcommittee, the ways and means committee. We've got several measures before us today.\nAnd the first one we're going to hear today is going to be.\nNo, we're going to hear House Bill 1070 for Chairman Hagen.\nThank you, Mr. Chairman, thank you committee.\nI'm sure you remember the first hearing last week, House Bill 1070, is regarding the\nGeorgia Shortline Railroad Track Maintenance Tax Credit, which was enacted back in 2018\nat the recommendation of the Royal Development Council to support our shortlines.\nbill extends the date's five years and it would increase the credit cat per\ntrack mile from $3,500 to $5,000 and that is what the bill does and this is the\nsecond here and we have any questions from the members of the community got\nmove do pass in a second any further discussion here in none all the\nfavorite favorite secret pop I see and I motion carries congratulations thank\nyou was that intimidating enough chairman thank you okay next will be\nchairman Stevens bill house bill 519 can I do it from here okay thank you\nMr. Chair.\nMembers of the committee, this is a second hearing on this bill.\nThis is a work opportunity tax credit for these employers that will take a chance on these\nemployees that have gotten into trouble over a period of time, or maybe veterans, if you\nwill, that are physical or mental problems or impairments.\nAnd it's an opportunity for them to extend a hand to get these folks off welfare and get\nback into productive citizens. This might even be folks that have had a felony. So the\nchances of them getting a job is slim and none so they wind up on our welfare payrolls.\nIt is a state tax credit of $500 and $10 million in that is the bill.\nWell, again, this has been for the subcommittee one time, this is second hearing, is there\nanyone from the audience who will speak for against the bill?\nIs there any questions from members?\nRepresentative Buckner.\nNo, the limit is the $500 cap per employee.\nAny further questions?\nHere, none.\nWhat's the will of the committee?\nA motion.\nSecond by Representative Prince.\nAll in favor say to him.\nHow about saying aye?\nOpposed, same sign.\nHere's unanimously.\nCongratulations, Chairman.\nChairman Hilton, House Bill 376, this will be the first hearing of this measure.\nThank you, Mr. Chairman, members of the committee, I bring to you House Bill 376, this bill increases\nthe cap.\nGive me the LC number on that one since this first year.\nYes, sir.\nLC 501202S.\nThank you.\nThis historic tax re-abilitation, we've\nseen it in a lot of our communities,\nhelps with redevelopment of some historic properties\nand revitalizes a lot of downtown areas.\nThis program has been highly successful.\nThe cap has already been met on a program that\nis set to expire in 2029, hence the need to come back\nand raise the cap.\nI know I've been working Mr. Chairman with you\nand members of the committee to make some additional changes\nand we'll probably have those in the following meeting,\nbut I've got some folks here to speak to the bill.\nThat's okay.\nHearing, do we have any questions from members of the committee?\nWell now, if not, okay.\nMr. Chairman, the beauty of this bill\nis that all of the expense and all the liability\nis on the person doing the development, not on the state.\nSo when the state provides that tax,\nit's after it's all been spent,\nand the good, there's been,\nI think it used to be almost $4 for one ratio\nfor the state of Georgia, so it's a really good program.\nLet's help the rear of the line of structures\nacross the state.\nAnd I understand we have two speakers.\nThe bill being set in, if you can come forward, please.\nJust for the record and the microphone you just share with us who you are and who you\nrepresent.\nGood afternoon.\nMy name is Ben Sutton.\nI'm the Senior Director of Preservation for the Georgia Trust.\nWe are the statewide nonprofit supporting historic preservation.\nThis is a critical tool for communities around the state.\nWe really appreciate this committee taking it under consideration because it's\nvital to the work that we do. Thank you. Thank you. Do they have any\nrumors? Have a question for the gentleman? Do I have the\nrepresentative prayers? Thank you, Mr. Chairman, but not so much, I guess, for the\ngentleman, but maybe kind of the accent right. Well, let me recognize, if you\ndon't have the general, it's not quite a gentleman. I'm sorry. Hold on, I'll\nrecognize it just for a minute. Mr. Sutton, can you just educate the\ncommittee about how many years this start renovation tax credit program has been\nslated Georgia.\nState of Georgia has had a state credit since 2002 and do you have any and I have not asked\nfor this so I forgive this for not please forgive me if I'm not asking up front but do you\nknow how many structures and or how much money is gone into start renovation efforts\nover the 24 years now?\nI don't have numbers for the total.\nI can tell you in the last five years,\nthis incentive has spurred over $800 million\nof private investment across the state.\nWell, that's the kind of number I was looking for.\nSo is it not true that it's been very impactful\nfor the communities across the world?\nIt has had a tremendous impact\nand is a catalyst for redevelopment in every state,\nin every corner of the state.\nWell, thank you for coming and sharing those thoughts\nwith the community today.\nNext, I will recognize Representative Anissa Jones.\nChairman, members of the Ways and Means Committee, subcommittee, thank you for the opportunity\nto speak today in support of Georgia House Bill 376 and the continued investment in\nin Georgia's historic tax credit.\nAgain, my name is Representative Anisa Jones\nof House District 143, and I stand before you,\nnot only as a legislator, but as a direct recipient\nof this program through the revitalization\nof the 419 Cherry Street Project in Macon, Georgia.\nHistoric credits are not simply incentives.\nThere are catalysts for economic development,\nsmall business growth, and community pride.\nIn cities like Macon, where history lives\nin every brick and storefront,\nthese credits make the difference between vacancy\nand vitality.\nThe restoration, excuse me, a 419 Cherry Street\nhas brought new energy to our downtown corridor.\nWe created jobs, it attracted visitors, it supports surrounding businesses, and it preserved\na piece of Georgia's architectural heritage for the next generation.\nFor many families like mine, legacy is not just about what we leave behind financially,\nbut what we build that endures.\nrevitalizing historic projects and properties,\nstrengthens neighborhoods,\nencourages entrepreneurship and create space\nwhere families can gather, work, dream,\nand have an impact on their community.\nGeorgia House Bill 376 ensures that projects like mine\nand countless others across our great state\nremain viable investments that honor our past\nwhile driving future growth.\nThe return on investment is visible,\nincreased property values, expanded tax basis,\nand renewed confidence in areas that once felt overlooked.\nThese are not theoretical benefits.\nThey are measurable outcomes that I have witnessed firsthand\nin making Georgia.\nI respectfully urge this committee\nto continue supporting policies that recognize preservation\nas progress by strengthening the historic tax credit.\nYou empower local leaders, small business owners,\nand families to transform aging structures\ninto engines of economic development and community legacy.\nThank you for your leadership and your commitment\nto building a stronger Georgia, one historic cornerstone\nat a time.\nThank you, Representative.\nWell said.\nThank you for your investment and enthusiasm for the communities of Georgia.\nIs anyone else from the audience like to make any comments on this particular measure?\nAgain, this was first hearing only, so thank you, I'm sorry, Chairman Newton.\nThank you, Mr. Chairman.\nRepresentative, I wanted to just echo what you said about the revitalization.\nI grew up in Macon, used to work down there a long time ago.\nBut I also was privileged to go back, I think, on the 300 block, just about a block away to a waiting reception this December, and the transformation there has been incredible.\nKeeping the historic sides, but updating the inside.\nYou know where the Rookery is is a great place.\nI just wanted to echo that.\nThis is making a difference in towns all across Georgia.\nCertainly I've seen it in my own Augusta area.\nI want to thank the sponsor for the bill.\nThank you Chairman Newton\nChairman Prince\nThank you chairman and\nI support this 100 percent. I mean, it's done a lot of things as you mentioned in making but also in the Augusta area and\nJust with how much participation we've had in here. I was talking to the author here about line 29\nMaybe we do raising that rate back to instead of 25 going back up to I mean instead of 20 going back to 25\nAnd really because of the cost of actually doing this type of renovation, I mean with the labor costs as well as the\nThe products that we need to\nOr as wood and everything else going up\nWe want to keep this thing going and so hopefully you can look at that prior to\nthe next reading and\nSomething to consider. Thank you. Thank you. Thank you Chairman Prince. You know, this is first hearing only so\nSo anybody has any further questions?\nThey think I'll have later if you just get with the\nauthor of the bill and next where your concerns are\nsuggested, let us know.\nSo next we have House Bill 1159 from\nfor leave a gamble.\nWell, good afternoon, Chairman,\nmembers of the committee is good to be with you all today\nand have the opportunity to present to you\nthe Farmer's Bridge Assistance Program Tax Detection,\nwhich is a part of the governor's legislative package.\nOn December 8th, 2025, President Trump and the United States Department of Agriculture\nannounced $12 billion in one-time bridge payments to American farmers in response to temporary\ntrade market disruptions and increased production costs that are still impacting farmers following\nfour years of policies that resulted in record high input prices and zero new trade deals.\nThese federal bridge payments are intended in part\nto aid farmers until investments\nfrom the One Big Beautiful Bill act,\nreach eligible farmers on October the 1st, 2026 this year.\nSome disruptions, farmers are facing include reference\nprices which are set to increase\nbetween 10 to 21% for major covered commodities\nsuch as soybeans, corns, corn and wheat.\nof the $12 billion provided, up to $11 billion will be used\nfor the Farmer Bridge Assistance Program,\nwhich provides broad relief to the United States\nrow crop farmers.\nThis legislation that you have in front of you House Bill 1159\nwould provide farmers with a state income tax deduction\nequal to any amount of payments received as income\nthrough the FBA program.\nThis is similar to last year's Hurricane Helene Relief Package Senate Bill 203, which\nexempted federal disaster relief payments from state income tax.\nThis legislation ensures that farmers receive the full amount of these funds and can use\nthem for their intended purposes.\nYou know, I know there's probably some questions in here about the federal part of the bigger\nbill that is affecting this, and I can't comment on federal trade policy, but what I can tell\nyou is that our governor is committed to lowering taxes for Georgians, and in this instance,\nit is the Georgians that make sure we have food on our table every night. So I have Calvin\nSorby with me who is the governor's policy advisor in this space, and I'm happy to answer\nany questions that you might have, but that in a nutshell is what we're trying to do here\nwith this legislation well thank you for later I will appreciate the governor's\noffices efforts on this measure do we have any questions from members of the\ncommittee here and that's first first hearing and a good measure look forward to\nhearing it again thank you thank you\nI believe that was our last measure before the income tax subcommittee so the income tax subcommittee stands adjourned.\n",
  "updated_at": "2026-02-12T10:49:39.83671+00:00"
}