{
  "video_id": "UQY8qG9j9WA",
  "url": "https://www.youtube.com/watch?v=UQY8qG9j9WA",
  "title": "Senate Day 35 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 35,
  "video_date": null,
  "duration_minutes": 188,
  "summary": "Here is a summary of the Georgia Senate Day 35 session in 2025:\n\n**Overview**:\nThe Georgia Senate session on Day 35 of the 2025 legislative session focused on the introduction of several new bills and resolutions, as well as the advancement of some bills through committee. There was routine procedural business but no notable moments of debate or controversy.\n\n**Key Actions**:\n- **HB 92**: Passed\n- **HB 360**: Referred to committee\n\n**Bills Introduced (First Reading)**:\n- Senate Bill 352, 353, 354, 355\n- Senate Resolution 441, 444, 445\n\n**Notable Moments**:\n- The Senate president recognized a group of 24 student pages from across Georgia who were assisting in the chamber.\n- There was some brief discussion between senators about their children's soccer games over the weekend.\n\n**Votes**:\nNo recorded votes are mentioned in the transcript.\n\n**Attendance**:\nA quorum was present, as the session proceeded without any notes about lacking members.\n\n**Adjournment**:\nThe transcript does not provide the specific time of adjournment or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you a good father would and we spent the weekend playing soccer and watching basketball and playing basketball. I can still, well, my boy is in basketball. You'd be amazed with my two inch vertical. Mr. President, we've got a great group of pages here today, 24 of them. Out of Lathonia, we've got Miles Allen from Atlanta, Sherina Allison from Commerce, Isabella Bennett from Locust Grove, Tagan Brinson from Bremen, Brigham Brock from Atlanta, Cresette Crume from Peachtree City, Kindle Estes from Lathonia, Amari Hagler from Atlanta, Jeremiah and Ramaya Henderson from Hogan'sville, Stormy Howard from Dunwoody, Joshua Miller from Johns Creek, Studi Mohan from Boudosta, Arthur Monroe from Marietta, Alessane Sullivan from Chatsworth, we have Paisley Patterson from Kathleen, Eleanor Perdue from Jonesboro, McCuy Ratcliffe from Decatur, Nyaris from Commerce, Emma Ricketts from Jonesboro, Kaylee Robinson from Bremen or Ion Smith from Marietta, Morgan Vicaro and from Bremen Jack Williams. I'll give these pages a big round of applause. We appreciate y'all being here to help us do the people's business here in the Georgia State Senate. Mr. President, this journal has been read and found to be correct. So are y'all in the club soccer right now? Are you doing recreation? I've got one club and one wreck. How many games y'all had this weekend? We had three games total between the two of them. We went two, oh and one. So tied one, my wreck, wreck team tied. Which one of your kids are playing in right now? Say that again. Which one of your kids are playing in it? Who's it? You're kidding. Freeman is doing club soccer and Archie is doing the wreck soccer. So Freeman, Freeman, okay. Yes, that's correct. Well good man we'll enjoy that because those games will keep coming. They will. We have enjoyed it. All right. Is there objections to dispensing with the reading of the journal? Chair here is none. The reading of the journal is dispensed with. Is there objections to the confirmation of the journal? Chair here is none and the journal is confirmed. All senators who have bills and resolutions introduced, please bring them to the sector. He's dancing at this time. First reading references to Senate bill. Secretary? Senate bill 352 by Senator Williams to the 25th and others. Bill 2010. Senate bill 353 by Senator Harold the 40th and others. Senate bill 354 by Senator Harold the 40th. A bill between Title 9 to amend Title 51 of the Fish Killer George Anitya. Waited towards us. Senator Bill 355 by Senator Ann Lvittart. Okay, the 31st and others. Bill Tumintel and I to find a home. Senate resolution 441 by Senator Halpern of 39th and others. Resolution urging action. Interstate cooperation. Senate resolution 444 by Senator Halpern of 39th and others. Resolution creating the Senate Civil Rights Protection Study Committee and further purposes. Rules. Senate resolution 445 by Senator Jane to the 28th and others. Resolution encouraging. Mr. President, that completes the order. First reading and revis is the House bills. House bill 730 by Representative Petrie the 166th and others. Bill Tumintel and I. House bill 742 by Representative Osteen and 169. House bill 743 by Senator Fleming and 114th and others. House bill 744 by Senator Williamson and 112th and others. Bill Tumintel and I. House bill 745 by Senator Martinez and 111th and others. House bill 746 by Senator Williamson and 112th and others. House bill 777 by Senator Halpern of 39th and others. Bill Tumintel and others. House bill 775 by Senator Grover of the 18th and the bill Tumintel and I. House bill 776 by Senator Jones and 47th and others. House bill 777 by Senator Jones and 47th and others. House bill 777 by Senator Mr. President, that completes the order. The Secretary of the House. Secretary of the House. Reward reports the Standing Committee. Mr. President, this is a thank-and-thank-and-thank-you. Finance has had unreconcorded consideration of the following legislation. I instructed the Senate to report the policy to the Senate. The Senate to report the following recommendation. House bill 129 to pass. House bill 2977 to pass. Rejectly submit it. Senator Hustler of 50 second district chairman. Mr. President, the Senate can be on public safety. Has had unreconcorded consideration. The following legislation has instructed me to report the same action. I would say that with the following recommendation. House bill 308 to pass. House bill 61 to pass by committee. So I have two exactly submitted. Senate Albert of 56th. The District Chairman. And, in the presence of the Secretary of the Senate. It will do to the next 1.6. I hear right. I will introduce a minority portion, along with the majority portion. House bill 61. We are handed by the Committee on Public Safety. on Monday, March 24, 2025, since the early Senator Jackson. Mr. President and Senate Committee on Rules has had under consideration the following legislation. I just directly meet for the same act to descend with the final recommendation and pursuant to Senate rule two, issue 1.10 B. The Committee on Rules is referred to the following legislation from the general calendar. House Bill 233 and House Bill 454 to the Committee on Rules are secondly, submit its interbraces to the district chairman. Mr. President, thank you, Committee on Science and Technology has had under consideration the following legislation and I just directly meet for the same act to descend with the final recommendation, Senate bill 332, do you pass? House Bill 147, do you pass? By Committee steps two. Mr. President and Senate Committee on State and Whole Governmental Operations has had under consideration the following legislation and instructing me to put the same act to descend with the final recommendation. Senate bill 332, do you pass? House Bill 7a1, do you pass? House Bill 714, do you pass? House Bill 719, do you pass? House Bill 720, do you pass? House Bill 722, do you pass? House Bill 724, do you pass? House Bill 697, do you pass? House Bill 698, do you pass? So, exactly two minutes and a dixon of the 44th district chairman. That can be the order, Mr. President. Secretary Rebuilds and Resolutions for the second time. Senator Resolution 237 by Senator Hickman of the Fourth and Others, Professional Standards Commission, provide recommendations to support the state's K-12 Education Workforce and teacher and teacher pipeline or Senator Resolution 292 by Senator Kausel of the 46 and others. Senate Special Committee on Investigations, Investigate Additional Matters to authorize the use of compulsory process to secure the attendance of witnesses, authorize Senator Resolution 391 by Senator Albers of the 56 and others. Senate Committee on Artificial Intelligence and Digital Currency, create House Bill 54, represent a clerk of the 100th and others. Health, advance practice, register nurses and physician assistants to order home healthcare services, authorize House Bill 707 by Senator Franklin, the 160th and others. More vehicles encountering funeral procession on two lane highway, revised responsibilities, House Bill 131, Representative Riesel, the one-nine-any-any-th and others. House Bill himself Service Storage Facilities, revised advertisement requirements before an owner can enforce an owner's lien. House Bill 154, brothers and a Richardson, 125th and others. Emergency medical services, designated ambulance services as an essential service. House Bill 162, brothers and a Hagan, the one-56 and others. Georgia Bureau of Investigation, Restriction and Seal of First Defender Accidences, until such status would be revoked. House Bill 187, brothers and washroom of 144th and others. Professions of businesses, contractors, change certain provisions. House Bill 192, brothers and a gamble with 15th and others. Top state for talent act and at House Bill 217, brothers and a hung, the one-third and others. Education, make dual achievement program and permanent statewide program. House Bill 238, brothers and a Lums and no 12th and others. Georgia Peace Officer, Senator, Senator Centraining Council, create and maintain and add risk adult training courses focusing on officer response to individuals with Alzheimer's disease or dementia. House Bill 288, brothers and a gain to the 120th and others. Appeal and error, declared jury judgments and instances involving accusations made by approximately attorney regarding credibility of a Peace Officer provide. House Bill 291, brothers and a retailer, one-73rd and others. Health certification of community health workers provide. House Bill 307, brothers and a ballot, one-47th and others. Quality basic education act, students significantly at risk of not achieving grade level reading provisions. See with or with characteristics of dyslexia, include provisions. House Bill 322, brothers and a Halkins of the 20th and others. Georgia Board of Dentistry issuance of a dental or dental hygiene license for the sole purpose of teaching in and accredited dental dental hygiene school or academic medical center provides provisions. House Bill 371, brothers and a Corvette, one-74th and others. Quality basic education act, states maximum authorization of capital outlay funding provide for an increase. House Bill 378, brothers and a multi-an of the 17th and others, state courts and counties online publishing of terms provide. House Bill 48, brothers and a Franklin 160 and others. Health codify right to Envigio for disillation for individuals. House Bill 407, brothers and a goal of the 19th and others. Crime and offenses, gifts of gift card theft, gift card forgery and gift card fraud provide. House Bill 471, brothers and a Chioca, one-51st and others. Health license, general hospitals and nursing centers made available. A water safety education video to parents or guardians of newborn infants require. House Bill 44, brothers and a Vierta, one-52nd and others. General Assembly, digitization and electronic publication of Georgia laws provide House Bill 560th and representative Dempsey of the 13th and others. Provisioning some businesses, authorize and regulate tele dentistry by licensed dentists. House Bill 635, brothers and a Vierta, one-21st and others. State licensing board for residential and commercial general contractors. Revise provision, submit the press and complete the order. It is now time for the more roll call. There are any motions that excuse the recognize center from the 40th. Recognize center from the 33rd. Thank you, Mr. President. And good morning, y'all. I ask we in that missed consent to excuse the senators from the 38th, 35th. 7th and 5th for business inside the Capitol. What was that last one, Senator? I'm sorry. Five. 38, 35th, 7th and 5th. Correct. Yes, sir. The objection to those senators are excused. Any other motions to excuse? Senator from the 40th? She turned it off. Secretary will call the roll senators to signify your president's presence by voting the yay switch. Secretary and Lentner, she. It is now time for our morning devotion. All senators please take your seats and see all conversation. I would ask that the doorkeeper is secured the chamber at this time. I now recognize the senator from the 16th to lead us in our pleasure legions and introduce our pastor of the day. Senator? Good morning. American flag, please. I pledge allegiance to the flag of the United States of America and to the Republic of Wichit Stands, one nation under God, indivisible, liberty and justice for all. State flag. I pledge allegiance to the flag and to the principles of Wichit Stands, wisdom, justice, moderation, and courage. I have a great privilege this morning of introducing my pastor, Josh Sethco, from Flank Creek Baptist Church. He is originally, you are going to like this, he is from Ohio and he has been really having a good time with the national championship in Ohio. We have had our times with the judges down here. He is a past president of Georgia Baptist convention. He is a good friend and he is a man who loves God. He leads our church and he has done a phenomenal job in that respect. His family, his wife are great. He is also a horseman. He rides horses. I said this to him, I ask him, I think I know why you are riding horses. In the book of Revelation, it says that Jesus will come back on a white horse and he hates to be on foot. He figures he better learn how to ride before Jesus comes back. I give him a hard time on that. With that, I wish you would welcome Pastor Josh, please. Thank you, Senator Harbin and Mr. President and happy early birthday to you, Mr. Harbin. Appreciate your friendship and more than you will ever know. It is always a privilege to stand before you and in just a few minutes I want to give you something the Lord has given me over this past year. I went to an event last year and I wasn't anticipating what was going to take place. Mark Clifton was speaking and I leaned in and God gave me some things that day that I knew was for me and I pray for you because before I even hit the parking lot I would enter into one of the most difficult seasons of my life. Last year was by far one of the most difficult seasons personally and professionally for me. I want to share some things with you out of the book of Mark that are going to be very brief. I just want to read Mark chapter 4, verse 35, share a few observations and I hope give you some things. I know the Lord has given me. The Bible tells us this on the day when evening had come he told them Jesus tells us disciples let's cross over to the other side of the sea so they left the crowd, took him along since he was in the boat and the other boats were with him and a great wind storm arose in the waves were breaking over the boat and the boat was already being swamped. He was in the stern sleeping on a cushion so they woke him and said teacher don't you care that we're going to die. He got up or buke the wind in the sea said silence be still the wind ceased and there was great calm. Then he said to them why are you afraid do you still have no faith and they were terrified and asked one another who then is this that even the winds in the seas they obey him. Friends this is what I know whether you're in the gallery you're a senator you're either coming out of the storm you're in a storm or you're heading to a storm you're going to need these next observations from this text that we're looking at and here's what I've discovered you will encounter storms. Another single one of us a storm will come to no matter how skilled you are these were skilled fishermen yet a sudden storm came upon their life no matter how skilled you are and there are some brilliant people in this room yet storms still come. The best time to prepare for a storm is before it hits. Just a few weeks ago we had tornadoes come through our areas and we were preparing before that storm came and I submit to you today the best time to prepare is now before the storm comes. The good news I have for you is the wind still know the voice of the master King Jesus. Jesus didn't hear the winds if you will that day he heard the cries of the disciples and that's when he woke up and then he combed those winds and here's the other thing I need you to know from this text that others are watching others are watching how you go through your storm there are other boats that day they are watching how they were facing this storm. So here's my application for you today there are four things that you're going to need in a storm and I pray that you'd write these down. The first thing you're going to need is a text you're going to need a text of scripture that you can grab a hold of in the day that your storm comes and in the past ten months of my life it's been Psalms 139 for me search my heart O God see if there's any wicked way in me the reflection of my own heart before a holy God has been so important a text that you can grab a hold of like he would never leave you nor forsake you he will always be with it's him being confident that started this good work in you that will be faithful to complete it until a day of Christ Jesus our Lord you need a text that you can grab a hold of when the storms of life come but you also need a song you need a song that you can sing before the Lord as the storm comes sing that song to the Lord and for me I reached into the 1700s and I found a beloved him afflicted one to Saint Christ draw near I love the words of that the battle is fierce but the victory is one so sing with joy afflicted one today if you're in that storm you sing with joy to the one who knows you best but also you're going to need a battle buddy you need a godly friend that will pray with you in that storm senator harbors one of those men in my life friends I pray that you have a scripture you can grab a hold of a song you can sing to the Lord you need a battle buddy that will walk with you in this storm but lastly you need a spiritual discipline that will hold you for me it's been journaling chronically the things that God is doing in and through my life and I pray as the storm hits your life whether you're in that storm you're coming out of a storm or you're heading towards it that these four things would encourage you from Mark chapter four grab a text sing a song get with a buddy and write it down let's bow together father in the name of Jesus and by your Holy Spirit I thank you that you are with us in the midst of the storm Lord for those who need this word today I just want to thank you for never leaving us nor forsaken us God thank you for your promise it says you're a very present help in a time of need Lord I'm so grateful for these men and women who serve our state but Lord they don't just serve our state they're serving you today their tools in your hands their ministers their servants of you King Jesus and today I pray that we would bless your holy name by our service for it's in Christ name we pray amen\n\nyou you you how 38. Introduce our doctor. Good morning colleagues. I am very honored to welcome our doctor of the day. It's always a privilege when you actually know them. So I am excited to introduce Dr. Delphine Head with family practice primary care in the southeast permanent a medical group. She provides care at Kaiser Permanente Cascade. She chose family medicine because she enjoys developing relationships with her patients and treating generations of families. She truly believes that she was born to be a physician and is excited to to fulfill her purpose in life. She is an Atlanta neighbor, native who graduated from Benjamin E. May's high school received her medical degree from the University of South Alabama College of Medicine and completed her internship in residency through the more house school of medicine family medicine residency program. In addition to her clinical work, Dr. Head has served in a number of leadership positions, including her current role as lead of government relations for the west area of the south eastern Permanente Medical Group. In her past role as president and chair of the board of the Atlanta Medical Association, she joined the southeast Permanente Medical Group in 2015 and has prestigious honor of practicing medicine in the same community where she was raised. Outside of the office, she is active member of her friendship community church who we had as a pastor of the day. And that is where she teaches and serves on multiple ministries. She is an officer, an active lifetime member of Delta Sigma Theta Sority Incorporated. I give you Dr. Delphine Head, our doctor of the day. Thank you, Senator Kim. All right, so Mr. President, Senator's to see what you guys. Thank you so much for having me here today. It is an honor to be a part of this great tradition us to serve as doctor of the day. What some of you may not be familiar with our practice, we are the largest physician-owned physician-led medical group in Atlanta. And that is the southeast Permanente Medical Group of Kaiser Permanente. I and the other 800 members of my group work with you, not an insurance company, to make our care decisions. I am a family practice physician with over and we have over 40 specialties without which all work together to deliver care to over 300,000 individuals. As an Atlanta native, I have lost count of how many times I have driven by this iconic building. So being able to serve here once again, it is more meaningful than words can say. So thank you again for the warm welcome. I look forward to serving you on today and I promise as I say every year there are no co-payments involved. Thank you. Thank you. We have several special presentations here today and recognize the senator from the 16th to introduce our special guest after Secretary Reed the caption. Senator Resolution 392 by Senator Harbin of the 16th and others of resolution recognizing the civil air patrol for the services assistance of Georgia and for other purposes. The Civil Air Patrol is founded on December 1, 1941 as an organization of volunteers meant to assist the United States military, national defense, by performing aerial coastal patrols and emergency services within the continental United States. Whereas the Georgia wing, the civil air patrol consists of almost 2,000 volunteer members in a 44 squadrons and six groups located throughout the state. And whereas Georgia wing members volunteer their services time and resources to actually support the civil air patrol by conducting missions and Homeland Security disaster relief and emergency services. And heavily supporting hurricane relief ever sent Helena Milton by providing FEMA and GEMA with thousands of aerial images and conducting sundown patrols in South Georgia. Now therefore we are resolved by the Senate that the members of this body recognize the selfless contributions of the volunteers of the civil air patrol have made to the state of Georgia. Mr. President that completes the order. Is there objection to the adoption resolution chair here is none and the resolution is adopted. Recognize senator from the 16th to speak to the resolution. Good morning, senators. We're here this morning to recognize the civil air patrol. A lot of people aren't aware of all that they do and where they are they are actually a congressionally chartered group that in a nonprofit that is an auxiliary of the U.S. Armed Forces. They help search and rescue find people that are lost. They do a great job of getting young people involved in aviation and search and rescue as well. Today we have a crowd upstairs of the civil air patrol patrol. I'm told there's at least a thousand or so but it's about 200 here. If you're a civil air patrol raise your hand. Let's see what we got. All right. We got a whole bottle. Give them a applause. They have been active in the search and rescue with all of our hurricanes and other things and do a great job of introducing young people to aviation and to the Air Force. With us today we have Colonel Michael Willis, cadet lieutenant Colonel and grammar and also cadet major Katrina Conley and major Lucy Vergero and Sergeant Favour Ajean. With that I'm going to present you with a resolution and let you give us a word. Thank you. Good morning everyone. Thank you for the recognition especially for the cadets behind me cadets that are up on the balcony. This is a very quick example of the work that we do. When Haleen struck we had 85 members go to Augusta. Serve over a thousand vehicles and over 3,000 people with water, food and other necessities for the first 72 hours after the hit. Thank you. You have a good time. All right. We're moving on. We've got some more special guests here. Secretary, read the caption. Thank you. Thank you. Thank you. The resolution is adopted. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Good morning. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nMade some moves this past season. We want to recognize that. Get the head coach and OK. Yeah, Excuse me. originally Northeast High School Raiders Football Team for participating in the 2024 GHSA Class A Division One State Championship and further purposes. Whereas I'm the exceptional leadership of head coach Jeremy Wiggins, the Northeast Raiders, achieved a remarkable 12 to 13 record showcasing their talent and dedication on the field. Whereas the Raiders made history by advancing to the GHSA Class A Division One State Championship game for the first time in school history, bringing pride and excitement to the Eastmaking community. And therefore, we are resolved by the Senate of the members of this party, and gradually the Northeast High School Raiders Football Team on its outstanding 2024 season. Its historic run to the State Championship game and its positive impact on the community as well as celebrate its achievements and bright future as it represents for making bib counting. Mr. President, I completely see you order. Here's your objection to adoption resolution chair. Here's none. And the resolution is adopted. Recognize a senator from the 26th to speak to the resolution. Thank you Mr. President. Ladies and gentlemen, I like to introduce you to staff, the Superintendent of the Be of County Schools, and the Northeast Raiders Football Team stand up. They went to the State Championship and had make them behind them, and we didn't make it. But they had a community that supported them, got charter buses to come watch them represent make them. I like to introduce the Superintendent of the Schools, Dr. Sims, the Principal, Ms. Walker, Tanger-Harnett, Athletic Director, Jeremy Wiggins, who's a head coach, and then Robert Mays, Quinn Peabee, Trent Allen, and Terence Redmond. I also, in the resolution, you saw that a young kid by name, Nick Wuffford, a rush forward 2,000 yards. And ladies and gentlemen, he's not only athlete, he's a student. He is the valedictorian of his class, and will attend Moorhouse College. I'd like to introduce the head coach, Jeremy Wiggins, that I've known ever since he was a little kid. Well, we just want to take this time to say thank you for giving us an opportunity to come and visit a capital and be recognized for our accomplishments this year. This is a testimony to the hard work to these young men and these coaches, and for them bringing a community together through football, and we just, you know, so blessed and so proud on the being of this opportunity. We just want to use football to impact kids and continue to do God's work. So, thank you all. Are there any unanimous concerns? I can get the sentence attention real quick, please. I can add the sentence attention. We're about to start points of personal privilege, but I'm about to take a point of personal privilege. Last week, the senator from the 21st, Mr. Brandon Beach, he informed me that he has an opportunity to go on to serve in a different capacity in the United States, and it's going to be, y'all are going to be looking at your, he got a call last week from President Trump, and just so happens, he's tapped Brandon Beach to be the treasury of the United States, right there, the treasury of the United States. And if y'all don't know what that role is, anybody who has some money on their own, pull out your money and look in the bottom left hand corner, and it will say the name of the person, now see, this is a hundred dollar bill right here, I asked Brandon if he got a change for a hundred, and he tells me he thought a hundred was changed. So, he obviously, he's obviously fitting in that role pretty well, but if you look in the bottom left hand corner, it will have the name of the treasury of the United States at the bottom left hand corner, and that will soon have displayed Brandon Beach's name on it. So, let's get Brandon to be round the call. All right. We obviously, we hate to see the Senator go, but I will tell you this, Brandon has been one who has been always been a dear friend of mine. He's somebody who's been a very loyal friend, and I will tell you that I never will forget he and I got elected at the same time in the state senate, and never will forget, a few years ago, there's about eight or ten of us that came down to one of my places of business, and we all huddled up together, and we said that we would all, if we stuck together, if the ten of us stuck together, we'd be all right in the senate. Well, that old self interest thing got in everybody's way, and instead of having ten that stuck together, we had about four that stuck together, and two of them are back there ramp brassing, Greg Dole's all myself and Beach, and we can remember the time right before I got elected Lieutenant Governor, I can remember when the four of us could clear room in the Capitol, because nobody wanted to be seen with us, you know. We were toxic, you know, we were outside the establishment, and we, so we weren't welcomed in any party affiliation, and we were welcome in very few meeting rooms, and the Senator from the 53rd can appreciate where I'm coming from with this, so all that, all that, all that, I will tell you, it all cycles out eventually, and usually, if you stay the course with whatever you do, and things will start going your way if you do it the right way, and Brandon Beach is a perfect example of somebody who, who stayed this course, he stayed loyal to his friends, he stayed, somebody who's very passionate about what he was believing in, and he's very passionate about supporting the President Trump and the current administration, and it pays off, I never will forget, I got a call from the President's folks, and they were said, who down in Georgia can we give some appointments to, you know, because Georgia was a key place, and I said, I can't think of anybody more deserving than Brandon Beach, you know, and so, I know he was a little down when he felt he got passed over on something pertain to transportation, but I told him that day that he knew he wouldn't go get that position, I was like, just be patient, there's something else that's going to come up, and I believe this is a better gig, Brandon than what we initially thought you were going to get, so, y'all let get Brandon a big warm welcome, we'll let him say a few words and congratulate him. Thank you all, thank you, thank you, thank you Mr. President, thank you for the kind words, you know, we did come in together 13 years ago, and I tell you, I love this institution, the Senate, I love this chamber, I love the people in it, and it's a great body, and it's going to be a great memory for me to know that I served in this Senate chamber, but as Lieutenant Governor said, I was very involved with him, and I wouldn't have been as involved in the Trump campaign without him making the introduction, so thank you, Lieutenant Governor, and but I really do look forward to serving in this next role as Treasury of the United States. I will tell you when I first got the call a couple of Saturdays ago, I wasn't sure they dialed the right number because I was expecting something in transportation or commerce, but after I talked to him and they said that the boss wanted me to be the treasurer, I said yes, I'll accept, so it's going to be a great opportunity, it's going to be life changing, going to Washington DC, but I will never forget you guys, I'll never forget where I came from, and thank you for all you've done for me, thank you very much. Move your own to points of personal privilege, I recognize the center from the 45th. Thank you, Mr. President. Today, I rise to honor Brightside for Ever Foundation. They are a nonprofit organization dedicated to creating more inclusive future by empowering individuals with special needs. Brightside for Ever Foundation breaks barriers, celebrates differences, provides resources, and foster independence belonging for all throughout advocacy and education initiatives. They also have a cafe in downtown Buford called Brightside Cafe. It creates jobs, opportunities, promotes inclusive work environments, and educate others, other employers about the value of hiring individual with diverse abilities, diverse abilities. They also, the foundation also provides financial support to individuals with special needs, attending specialized college programs that cater to their unique education, career and social development needs, ensuring access to higher education opportunities that nurture their potential and open doors for future success for all folks with special needs. Brightside Cafe, their owner, employees, or their several of them up in the gallery today, if you would, stand up and recognize, be recognized. We've got a resolution here for you today, colleagues, if you would, give them a round of applause for what they do for our community. Thank you, Mr. President, I yield the well. You recognize the center from the night for point of person privilege. I'm going to ask the center from 38. Good morning, colleagues. Today, I would like to ask you all to join me in welcoming some principals that I have here from Senate District 38 at the Capitol. Very honored to have these principals because we all know that principals do amazing work across the state. We have principals here today representing schools from Fulton County, APS, charter schools. These principals, I understand very well the work that they do as a former principal myself and know the importance of good leadership in our schools. Studies have consistently shown that effective school leaders significantly impact student achievement, teacher engagement, and school climate. In fact, leadership is one of the key influencers of student learning. Second only to cut classroom instruction, which means that good principals make good schools and good schools make great young Georgians ready to take on the world. I am very proud to represent these amazing leaders in education here in a metro area and I just want to recognize them there in the back of the chamber. We have Miss Ingotty from Oakley Elementary School, Miss McDaniel from Camp Creek Middle School, Mr. Washington from Cape Atlanta Collegiate High School, and Miss Bentley from CH-Gulette Elementary School in Fulton County. Please join me in giving these school leaders a round of a hand. And with that, Mr. President, I yield the well. Thank you, Senator. The chair recognizes the senator from the 39th for a point of personal privilege. Thank you, Mr. President. I rise today to recognize the 100 Black men and 100 Black women legislative day at the Capitol, a day that highlights the power of mentorship, leadership, and service in our communities. For decades, 100 Black men of America and 100 Black women have stood as pillars of strength investing in the next generation, advocating for equity and ensuring that our young people see pathways to success. Today, as they walk these halls engaged with lawmakers and make their voices heard, they remind me why I serve to build a future where opportunity isn't limited by race, gender, or zip code. I stand here today because I, too, was once a young Black girl who needed to see what was possible. Like so many of us, I have been shaped by mentors, elders, and organizations like these that saw something in me before I fully saw it in myself. That's why their work is so personal. To the members of one under Black men and one under Black women, thank you. Thank you for the work you do every day in education, health, economic empowerment, and justice. Colleagues, let's not just recognize them today. Let's stand with them, work with them, and ensure the policies we create reflect the values we fight for every single day. Thank you very much. Thank you, Senator. The chair recognizes the senator from the 41st or point of personal privilege. Thank you, Mr. President. I rise today to honor the women in our lives and throughout history, who have made and are still making life-changing contributions to our society. This women's history month, we could spend hours talking about the social progress that we've made, thanks to the efforts of women worldwide who have continued to stand up and speak out for their rights and for the rights of others. Though we often honor names like Rosa Parks and Eleanor Roosevelt, Harriet Tubman and Coretta Scott King, and countless other well-known figures who dedicated their lives to human rights and the advancement of women, we frequently forget about the women who have changed literal day-to-day lives. So I want to talk today about women like Ada Lovelace, the first computer programmer, a Maria von Britten Brown who invented the home security system. Shirley Ann Jackson, the woman who played a key role in the invention of the caller ID and call waiting. I want to lift up Heady Lamar, the actress who also co-developed the frequency hopping concept that ultimately led to Bluetooth and Wi-Fi technology. It was a woman, Mary Anderson, who invented the first windshield wiper and another Stephanie Kool-Ack, who invented the Kevlar Vest that is used to save lives today. Melita Bens was the inventor of the coffee filter Josephine Cochran, the dishwasher, and more ways than we could possibly honor this month, women throughout history have led the charge as pioneers in their fields and often go unacknowledged with their accomplishments instead claimed by men. So for this women's history month, for this hour history, I want to lift up and celebrate the strides of so many female scientists and artists, politicians and writers, business people, clergy women of course, and athletes. We stand here today celebrating the success of women and our fight to continue to advance the calls for all girls and women. With that, I yield the well. Thank you Senator. The chair recognizes the senator from the ninth or point of personal privilege. Good morning members. I rise the day to celebrate women's history month as well by recognizing the legacy and contributions of Ida B. Wells. She was a trailblazer for all women due to her civic activism and her work within the journalism industry. Ida was born as a slave in 1862 in orphan at the age of 16. She took a job as a teacher and successfully earned a living in order to prevent her siblings from being broke apart into different foster homes. After teaching for many years, she was dismissed from her post for criticizing the unequal conditions that Black schools experience in local in the local school district. She pivoted to investigative journalism. She worked for and eventually owned newspapers based in Memphis, Tennessee. Despite the fact that Wells was constantly targeted with death threats and mob ransacked the offices of newspapers that she owned, she was able to thoroughly investigate and document the circumstances around lynchings and other racial violence. Her books, Southern Horrors in the Red Record, continued essential first hand accounts and analysis and statistics about racial violence that took place in the 1800s. Wells was an advocate for the political and economic rights of women as a whole. She established several influential groups advocating for the rights of women the vote hold office and participate in the workforce. She ran for a seat in Illinois in the state senate in the 1930s which made her one of the first Black women in the United States to ever run for elected office. Some of her other notable achievements include founding the first kindergarten open to Black children in Chicago and conducting an international speaking circuit to bring global attention to the causes of racial justice and women's suffrage in the United States. Ida B Wells is an icon for so many people advocating for the civil rights of people and is also a fundamental foundational figure for the generations of Black women who continue to push the boundaries in the name of equality. I am proud to share her story today and I hope you all will take a moment to learn more about her accomplishment and her legacy and her fearless leadership and with that Mr. President I yield the well. The senator is yielded the well. Chair recognizes the senator from the 14th. Thank you Mr. President. My name is the senator from the 14th and this is Trump Morning News. Trump Morning News, your number one leader in Trump news entertainment, keeping you apprised of the health of your democracy today. In Trump Morning News we reflect on an unfortunate circumstance yesterday in which the national security advisor of the United States added the editor of the Atlantic a journalist to a principles committee text chain set up for the defense secretary about planned military strikes in layman's terms. That's a signal group chat that a journalist got added to that was discussing sensitive military information before it happened. Here are some quotes from secretary of defense Pete Hegseth about the mishandling of classified information in 2023. He said that Biden handled classified documents flippantly if at the very top there's no accountability that we have two tiers of justice in 2016. Secretary Hegseth said the people we rely on to do dangerous and difficult things for us rely on only one thing from us that we will not be reckless with the dangerous things they're doing for us that's the national security implications of a private server that's unsecured. In 2016 secretary Hegseth said how damaging is it to your ability to recruit or build allies with others when they are worried that their leaders may be exposing them because of their gross negligence or their recklessness in handling information. In 2016 he also said if it was anyone other than Hillary Clinton they would be in jail right now because the assumption is in the intelligence community if using unclassified means that there is a potential for and likelihood that foreign governments are targeting those accounts and that's only one of the many quotes that some of the people on this group chat have made historically about the handling of sensitive information only when democrats were involved. This is unfortunately a clown show folks we've got people at the highest levels of government who are recklessly endangering sensitive national security secrets but right now it's just a blip in the news that's all we've got for you this morning thank you as always for listening to Trump morning news as a quick reminder your state legislators and that's nothing you can do about this directly and there's nothing the Republican party could have done the last 20 years to stop this from happening thank you mr. resident i yield the well do you recognize is the distinguished senator from the 50th from Habersham county for a point of personal privilege thank mr. president i rise today to recognize a very special group of people who are here we've got a number of students from Habersham counties ninth grade academy if they would please rise a bunch of great leaders in their school one the daughter of a former state senator butterworth she's up there she would please there she is and another very interesting thing to say is their teacher ginger kennedy is related to president potem so i just want to welcome y'all to the state senate and i'll come meet with y'all soon but thank you for joining us and if we please give them around the past thank you senator for that kind introduction of my cousin ginger thank you all right there's anyone else wish to rise on a point of personal privilege okay you have before you a consent calendar of privilege resolutions does any senator wish to remove a resolution from the consent calendar is there objection to the adoption of the resolutions on the consent calendar the chair here's none and the resolution is on the consent calendar are adopted chair recognizes the senator from the 22nd president i ask your nameless consent that sr 393 be withdrawn from the committee on children and families and be committed to the committee on rules both chairmen's are in agreement much thanks are you please read the caption sent resolution 393 by senator jones the 22nd and others resolution creating the senate study committee on improving family caregiver services and for other purposes mr. president i complete the order\n\nThe senator has moved. Is there an objection? The chair here is none and the motion is granted. All right, moving on to the local consent calendar. You've got the consent calendar of privileged resolutions before you to any senator to remove from the consent calendar. Is there objection to the resolution adoption of the resolution on the consent calendar? The chair here is none of the resolutions on the consent calendar are adopted. Are there any motions to withdraw and commit? All right, sorry. Here. All right. All right, you've got the consent calendar now of local bills before you, Mr. Secretary. Are there any objections filed to any bill on the local consent calendar? Mr. President, no objections have been filed. All right. Is there objection to the agreeing to the report of the committee on the state and local government operations which is favorable to the passage of the bills on the local consent calendar? And the chair here is none and the report of the committee has agreed to. The question is now on the passage of the bills on the local consent calendar. All those in favor will vote ye and those opposed nay, the secretary will now unlock the machine. You have to be careful. On the passage of the bills of the local consent calendar, the a's are 52 and the a's are zero. So these bills having received the requisite constitutional majority of the bill. Chair recognizes the majority leader for a motion. Mr. President, I ask for unanimous consent that the following bills being grossed House bill 92 and House bill 290290. Mr. Secretary, please read the captions for House bill 90 and House bill 290. House bill 92, by resident of Blackmore, no one 46 and others, the bill between town and act to mend code section 48-5-44.2, the official code of Georgia and here to lead to home base year homes that exemption. So as to propose, boom, the date by which local governing authorities are authorized to opt out of homes that exemption, try to regulate matters for people, compilating laws and for other purposes, House bill 290, by President Carson, the 46 and others, the bill between town and act to mend chapter one, the total 48, the official code of Georgia and the lawsuit to John Provisions of revenue taxation. So as to revise the terms internal revenue code and internal revenue code in 1986, children corporate certain provisions of federal law and to Georgia law, try to regulate matters to provide for an effective date and applicability to repeal conflicting laws and for other purposes. Mr. President, that completes the order. Thank you, Mr. Secretary. The majority leader is moved at House bill 92 and House bill 290, B, and grossed is earned objection. There is an objection. Recognize the majority leader. Do you wish to speak to the motion? We're not a majority leader. No, majority leader waves as the minority leader wishes to speak to the objection. She waves. All right, the majority leader is moved at House bill 92 and House bill 290, 290, B, and grossed. All those in favor of the motion for an grossment will vote ye. Those opposed will vote nay. Mr. Secretary, please unlock the machine. Thank you. All in the motion to engross the ye is 31 and the nays are 22. So this motion having prevailed on engrossment for House bill 92 and House bill 290 is earned grossed. Let's move on now to the third reading and consideration of general bills and resolutions. Mr. Secretary, please read, caption for House bill 53, the first one on the rules calendar. House bill 53, Barbara, Senator Bonner, the 73rd and others, Bill Twin, town of Nighto, Men, Part of the Read article 2, Chapter 4, Title 38 of the official going to George Anatary, to allow certain persons to be buried in Georgia veteran cemeteries to write for definitions, write for fees, write for legislative findings, write for related matters to repeal conflicting laws and further purposes. Mr. President, the Senate Committee on Veterans Military and Homeland Security recommends this bill due passed by substitute, or separately submitted to the repained chairman. Mr. President, the Senate Committee on Veterans Military and Homeland Security, our was telling substitute to House bill 53, Bill Twin, town of Nighto, Men, Part of the Read article 2, Chapter 4, Title 30 of the official going to George Anatary, to allow certain persons to be buried in Georgia veteran cemeteries to write for definitions, write for fees, write for legislative findings, write for related matters to repeal conflicting laws and further purposes. Mr. President, that completes the order. Thank you, Mr. Secretary. The chair recognizes that the distinguished senator from the 25th to present House Bill 53. This is bringing the Georgia veteran cemeteries in land with the Federal burial equity for guards and reserves act of 2021. This is very important to allow members of the Guard, the Military, various guards, Georgia National Guard, and the reserves to be eligible for burial in the veteran cemeteries here in Georgia. Big glad to take any questions, Mr. President. Thank you, Senator. You have no questions. Ask for your favorable consideration on yield the way. Thank you. Does any other senator wish to speak for or against the measure that chair hears none? Is there objections to the previous question being ordered? The question is now in the adoption of the Committee Substitute. Is there objections to the adoption of the Committee Substitute? Is there objection to the report of the Committee which is favorable to the passage of the bill? The question is now in the passage of the bill by Substitute. All those in favor of this bill will vote. Those opposed, nay, Mr. Secretary, please unlock the machine. The bill is now in the passage of the bill. On the passage of the bill, the yays are 54, the nays are zero. We're off to a good start, y'all. This bill having received the requisite constitutional majority is therefore passed. On now to House Bill 92, Mr. Secretary, please read the caption. House Bill 92, by the present of black one, on the loan of 46 and others, bill between 10 and 9 to amend, goes section 45-44-4.2 of the official agenda of Georgia and interior, related to base your homestead exemptions, as to propose, to the date by which local governing authorities are authorized to opt out to such homes that exemption, to rise related matters, to repeal conflicting laws and for other purposes. Mr. President, the Senate command rules recommends that this bill do pass by substitute, which likely is submitted, and are brass, chairman. Mr. President, the Senate command rules are following substitute to House Bill 92, bill to mean 10 and act to amend, title 48, the official agenda of Georgia and interior, which your revenue taxation has to rise for the contents of property tax bills, to revise a statewide base your homestead exemption and for other purposes. Mr. President, I can please the order. Chair recognizes the Senate from the 52nd to present the bill. Thank you, Mr. President. As many of you remember, we had House Bill 581 for a local government being able to have an exemption that doesn't exceed the rate of inflation. There was an opt-in and opt-out clause put in there by the House. So there were several bills from the House to try to clean up some of the language, some of the unintended things from the initial bill, and we combined them all into one bill here. House Bill 370 was wanting language that said if there is no need to opt out if you've got already a base or a freeze or some sort of exemption in your county or city or schools that you didn't have to go through the opt-in opt-out procedures in the future. That's in the bill. The original bill didn't have the five acre limit on a homestead, which we've done on everything historically in Georgia, and that was left out. So that's been put in there. That's line 61. We had something in there, line 72 for surviving spouses because sometimes someone would die in the middle of the year. And it's already too late to ask for the homestead exemption, which is April 1st. And so this means that the surviving spouse automatically gets it in that case. We've given some more opt-in opportunities. There wasn't an opportunity to opt back in. We're letting that be done on an annual basis as of March 1st. If people want to opt back in, and this year we're extending it to April 30th for those that may want to, and there's some reasons they might want to. And then we have that they will revisit that decision if they don't have anything in place in 2027 as well. There is some language put in there for school construction that says the school construction would be tax exempt, but only for school systems that have opted in. And that's the house thought. Maybe that was a little bit of a carrot. We also had to fix something for the cab. We tried to take care of all the special taxes last year. We missed the cab, March attacks and didn't want that to interfere with their ability to have a floss. So there's some language in there for that. And then we had a situation where there was a county that had a very small city that was in two counties that was the only thing that did not opt in. And so this says if 95% of the county opts in that that it's okay. And those were the the main fixes in here. I think the house is wanting to move on this pretty quickly. So I'll be trying to meet immediately transmit this if the if the Senate's favor will on this bill. I'll entertain any questions. Thank you, Senator. Good job. No questions. Does any other senator wish to speak for or against this measure? House bill 92. The chair here's none and the objection to the previous question being ordered. The chair here's none. Is there a previous question? Excuse me. The question is on the adoption of the committee substitute. Is there objection to the adoption of the committee substitute hearing none. The committee substitute is adopted. Is there objection to the green to the report of the committee which is favorable to the passage of the bill. The chair here's none. The report of the committee is agreed to. Is there objection to the main question being ordered? The chair here's none and the main question is ordered. The question is now on the passage of the bill by substitute. All those in favor of the bill vote. Yay. Those of pose will vote nay. That's your secretary. Please unlock the machine. The chair here's none and the main question is now on the passage of the bill. All in the passage of the bill the a's are 52 the nays are two. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes the senator from the 52nd. Mr. President, I would ask for unanimous consent that the Senate immediately transmit House bill 92 to the House. The Senate is requested for unanimous consent to immediately transmit HB 92 to the House. Is there objection? Chair here's none. The motion is granted. Moving on down. Mr. Secretary, please read House the caption for House bill 143. House bill 143. The bill 134. The bill is passed. Chair recognizes the senator from the 11th. Chair recognizes the senator from the 11th to present House bill 143. Chair recognizes the senator from the 11th to present House bill 143. Chair recognizes the senator from the 11th to present House bill 143. Chair recognizes the senator from the 11th to present House bill 143. Chair recognizes the senator from the 11th to present House bill 143. This is dealing with our Ag Water Meadering Program. As many of you know, most of my district is our Ag Water Use is metered. We're just making a few changes in returning some of the responsibility back to EPD. When it comes to permitting and metering, turning it back over to them, removing some requirements that the farmers have, revolving around the meters. Also authorizing EPD to do some installation work and some maintenance work. It's just good for agriculture. I appreciate the department bringing this forward. Jeff Cowan and his team and what they're doing over there. It's a good bill. I'd be glad to take any questions if there are any Mr. President. If not, I'll yield a will. Good job senator. No questions. Does any other senator wish to speak for or against the measure House bill 143? The chair here is none. Is there objection to the previous question being ordered? Chair here is none. Is there objection to the green of the report of the committee which is favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Is there objection to the main question being ordered? The chair here is none and the main question is ordered. The question is on now the passage of the bill. All those in favor will vote yey and those opposed will vote nay. Mr. Secretary, please unlock the machine. Mr. Secretary, please. On the passage of the bill, the a's are 53, the a's are 0. This bill having received the requisite constitutional majority is therefore passed. The bill has been ordered to be the last one. It's a good bill. The bill on the passage of the bill, the a's are 53, the a's are 0. The bill has received the requisite constitutional majority is therefore passed. Moving on next, House bill 290. Mr. Secretary, please read the caption. House bill 290, by the represent of Carson, 46, and others, the bill is being turned to 9th to men. Chapter 1 to 1040, the official go to Georgia annotated, led to general provisions of revenue taxation. The bill has been assessed to revise the terms internal revenue code and internal revenue code in 1986 to incorporate certain provisions of federal law into Georgia law. So I have related matters to right from effective date and applicability to repeal the listing laws and further purposes. Mr. President, thank you for the finance. I would recommend this bill to pass. Mr. Secretary, please submit a House statler chairman. Mr. President, a fiscal note has been attached and that can be see order. Thank you, Mr. Secretary. The chair recognizes the senator from the 56th to present House bill 290. Thank you, Mr. President. I'm proud to bring you House bill 290 today, which you will know commonly is our annual IRS cleanup and date adjustment bill. Each year, we work with the Georgia Department of Revenue, as well as the IRS to make sure that the tax codes match up. You'll notice on this bill, beginning lines 12, we're simply moving the year from 2023 to 2024, and then two lines below from 2024 to 2025. The existing language cites all the different IRS codes that are there. If you continue through the bill, on lines 59 and 60, we once again are addressing those two dates of 2023 to 2024, and then again 2024 to 2025. I'd like to direct you to the fiscal note, which is in your folders, the yellow sheet, and you will see there is a very small impact for fiscal year 2026, which will begin for our state on July 1 of this year of just less than a million dollars, and then goes down in 2027 and 28 to being even in 2029 and 2030. This bill is very important because without it, it is going to put all of our constituencies taxes in a challenging problem with your CPAs, or if you're doing that online to make sure they can map up to the code. We'll take the time to get the code and get it done with tax day looming, and all of us who are doing a great job here in Georgia for lowering the income tax rate, kudos to Governor Camp, our Lieutenant Governor, Speaker, and all the members of this body for the great work we have been doing to lower the tax burden on hardworking, Georgian families, and we will continue to do such because we believe that our constituents are the best use of their dollars, not the government. Mr. President, I will be glad to yield for any questions, senators may have. Thank you, Senator. The chair recognizes the senator from the 50th. Thank you, Mr. President. Does the senator yield? Certainly for the floor leader. Thank you. House Bill 290, is this a department bill? That's a great question, Senator. I'm glad you brought it up. This is, in fact, a department bill from the Georgia Department of Revenue. Their teams came up with the Finance Committee, the chairman from the Finance. Thirdly, we've vetted this bill in committee with the House sponsor, and I was glad to then continue to carry that through the Senate for them. Thank you for that. And I've gotten a few calls on this, and you touched on this a little bit, but the date changes where, I guess, on line 12, you're going from 2023 to 2024. On line 14, you're going 2024 to 2025. And then it looks like two more times on line 54 and 59. This will actually benefit and will help the taxpayers in Georgia. It cleans it up a little bit, and will also help CPAs across the state of Georgia as well. That is exactly right. I know that many of the folks are on a tight deadline to try and get their taxes done. This will also help out for all those people that might be using a Turbo Tax or other tool. And then even for some members of my family, they're still doing it the old fashioned way by hand, but they need this. It's critical in order to get that done. I know a lot of families are waiting on a tax refund sometimes, that they will might be using to help their family or maybe planning that vacation. It also helps our businesses, which is something we probably haven't talked about enough, how critical it is for our, especially our small businesses here in Georgia. Does the Senate yield? Please. That's one thing that I was going to ask is this bill will not only impact individual filers, but also businesses and corporations as well. Yeah, that is exactly correct. I know many of us are small business owners. This applies to us, also our employees, to make sure we can follow through it that promise and process to get everything done in a timely manner. I know our businesses are critically keen on these because they also, in some cases, have to pay quarterly taxes on top of their normal business process. And this allows them working with the Department of Revenue to do everything they need to to make sure they're achieving the rules set forth in the law. Thank you very much. Thank you. Great questions. Senator, do you have no other questions? Thank you, Mr. President. Senator Zadazsfear, favorable consideration. The senator has yielded the well. The chair recognizes the senator from the 14th to speak to the measure. Thank you, Mr. President. I rise in enthusiastic support for this legislation. One of the reasons that this legislation is so critical is because the IRS is going through a storm right now that there was a Washington Post article three days ago, reporting that Treasury and IRS officials expect a 10% decline in collected revenues. I'll say that again, a 10% decline or $500 billion. And the reason is because IRS officials have noticed an uptick and online chatter that people are planning to refuse to pay their taxes or to claim deductions or credits for which they are ineligible because they are wagering that the IRS will be understaffed and gutted enough that nobody will notice. The IRS is planning to eliminate 20,000 jobs, 11,000 of which have already happened, but are pending court cases. So it may not be unreasonable for taxpayers to assume that the IRS may not be capable of enforcing the law if they choose to willfully buck their obligation to pay. 10% $500 billion, that's why this legislation is so needed. Thank you, Mr. President. I yield the well. I yield for a question. You do have one question. Thank you, Mr. President. Is the Senator yield? I yield to my friend from the 56th. I appreciate your enthusiasm for this bill. You cited a report which I believe was actually just a news article from the Washington Post. Is that not true? I think it was a Washington Post reporting which I will give it to you. The Treasury officials who were asked about it called it sensational and baseless. So I suppose there is a dispute effect. Isn't it true that the prior administration sought to hire 80,000 new IRS agents? Some of the fill up a huge football stadium worth the new IRS agents? I'm glad you asked about that. It is true that the previous administration wanted to staff up the IRS. This was mostly to staff investigations of high net worth or corporate taxes. Those investigations that goes without saying have all but been abandoned under the current administration. And of course that is some of the most efficient investigations the IRS capable of doing. Because if you investigate a single taxpayer who is bucking a several million dollar obligation, obviously that saves a lot of time instead of chasing after middle class families for the same amount. So most of those employees were meant to go after the big fish but those investigations are no longer possible. Will you further yield Senator? If the prior administration hired 80,000 new people and the current one is being efficient by only eliminating a quarter of those. Which means almost 60,000 people are still there. Wouldn't you just call that good efficient government? Well part of the problem is the uptick in the online chatter as I cited about people who are planning not to honor their obligation. So so much of this is not just about actual staffing levels. It's also about the haphazard way in which people are being departed from the IRS without sort of a reasonable connection to their job duties. And on top of that the culture that is created in the American public when people believe that they will not have to pay their taxes. So you've got kind of a double edged problem here where there's a culture of noncompliance that's being created by the gutting of the IRS and haphazard way in which people are fired irrespective of the actual staffing numbers. Final question, Senator. Sure. Isn't it true though we're citing a news article from a biased publication and based on all of this we're basing it on online social media chatter. Isn't that true? Senator this is the IRS and treasuries estimations as per the paper now as to the paper's credibility. The only comment I'll make on that is that Jeff Bezos has seemed pretty friendly to the Trump administration in recent months. If there are no other questions, Mr. President I will yield the well. Yeah, no further questions. Does any of the senator wishes to speak for against the measure? Chair here's none. Is the objections for the previous question being ordered. Chair is none the previous question or the center from the 56. Would you like to close debate? Is there objections to agree until the Board of Committee which is favorable to the passes of the bill. Chair here is none the board of the committee has agreed to. Is there objection to the main question being ordered. Chair here is none of the main questions or the questions on the passes of the bill. All those in favor will vote yay all opposed nay secretary and lot of machine. Chair here is none.\n\nyou But One One the passes of the bill the a's are 54 in in a sаст increase The House Bill 360. House Bill 360, by the way, the Senate of Estration, the one on the wrong fourth, and others built between the act of a men article two, Chapter 7, Title 48 of the Efficient of Georgia and the state. Why do you income tax and position rate computation exemptions and credits? To revise a tax credit for the rehabilitation of historic structures, to authorize the credit to be claimed in a taxable year. The year a certificate of occupancies obtained for certain pre-approved rehabilitation, so right for a late amount of sure people with looking laws and further purposes. Mr. President, the Senate Committee on Economic Development of Tourism recommends that this bill do pass to the Assembly's Minister and the Senate, or be chairman. That completes the order, Mr. President. Senator from the 45th, you wish to. Thank you, Mr. President. Mr. President, I move that the Senate table HB360. Senator from the 45th has moved that we table HB360, is there objection? No objection, it is table. Secretary Reed, House Bill 392. House Bill 392, we are as in Martin of the 49th and others, Bill's being town of NAC2 Men, Chapter 5B, Title 15 of the Efficient of Georgia and NATAT, or like to tax court, just to rise the dates for certain events regarding Georgia tax court, to provide new dates for the beginning of the term and duties of the chief court judge, to rise for a date of the beginning date for accepting cases by the court, to rise for the transfer and to his position of certain cases, depending for the Georgia tax tribunal, to rise for late amount of sure people with looking laws and further purposes. Mr. President, the Senate Committee and judiciary recommends that this bill do pass, or so I please submit it, Senator Strickland, Chairman. That completes the order, Mr. President. We're going to see Chairman of the Judiciary. Thank you, Mr. President. Members of the Senate, House Bill 392 is just a little clean up bill that changes some dates to make sure that we have the right timing we need for the transition for our new tax court that the voters approved last year. So this is just some changes to enable legislation from last year to help us with getting the new judge online and appointed and also to help with the moving of existing cases from our current tax court to the new tax court. Happy to answer any questions. You do have one question, Senator. We're going to have Senator from the 19th. Maybe that's a sign. You want to try again? You want to say it real loud and not repeat it for everybody here? You want to ask me off line? You're sitting next to me. We could have talked about this before. I came up here today. Anything else you want to say? The question was, why move the date from July to April? And that's to make sure that the judge is appointed in time to start their administrative duties as we start the moving of the cases into this new court. You have no other questions. Thank you. Does any of the senator wishes to speak for against the measure? Chair, here's an order. Is there objection to the previous question being ordered? Chair, here's an order. Is there objection to agreeing to the board of committee which is favorable to the passes of the bill? Chair, here's an order. The board of committee has agreed to. Is there objection to the main question being ordered? Chair, here's an order. The main question is ordered. Questions on the passes of the bill? All those in favor of the bill? I'll pose nay, secretary and a lot of machine. All the passes of the bill, the yeas are 54 and the nays are zero. This bill has received requisite constitution. Majority is there for pass. Secretary Reed, House bill 475. House bill 475, represent Macamble, the 15th and others. The bill is being taken to amend. Code section 48-7-40.26. The official court of Georgia annotated will add to income tax credits for a film, gaming, video or digital production. So it will serve as a definition. It will serve as rules and regulations. Authorized certain fees to repart companies to pay court costs. The denial of certification is upheld by court on appeal. It's a relative-related matter. It's a relative-effective date and applicability to appeal to the bill's looking laws. And for other purposes, Mr. President, this thank you for the economic development of tourism. Recommends that this bill do pass. It's definitely submitted to Senator Bees, chairman. Mr. President, Senator Tillery, the 19th and others offer the following amendment number one to amend House bill 475 by adding after the word subsection on line 40 and such fees shall be remitted to the state general fund. Mr. President, Senator Moore, the 53rd offers the following amendment number two to amend House bill 475 by striking section one in its entirety and re-numbering section two, three, four accordingly. Mr. President, that completes the order. We're going to ask the Senator from the six. Thank you, Mr. President, I bring to you colleagues, HP 475 is a department bill from the Department of Economic Development. Simply cleaning up the film tax credits, making it clear that social media platforms and little videos that are shot on line are not eligible for the tax credit and it's got some other clean up language in it. I'll speak real quickly to the amendments. Amendment two, I do support. I'm sorry, I'm sorry. Amendment one, I do support. This does make it clear that any of the fees that will be collected during this process, that they will go to the general fund. And then on amendment two, while I appreciate my colleague's passion against the film industry, I think what he's doing here is actually going to backfire on him because when you strike section one and leave section two, you're actually giving the Department of Economic Development the full authority to promulgate rules and regs around the world. All these projects would no oversight from the legislature. So good try. I am against amendment two. I'll yield for questions. We have one question, Senator. Bring it on. The Senator from the 50th. Thank you, Mr. President. Does Senator yield? I yield. Isn't it true that the Georgia Department of Economic Development is in support of amendment one based on some conversations that I just had with the second floor? I'm sure amendment one or those, which he speaks. Thank you. Senator from the 28th, you have a question. Will the Senator yield? I will yield to my good friend from the old district. Thank you very much. Well, as an advocate for the film industry, not just for the big companies, but also for independent who have been. And helping to bring a lot of revenue to the state of Georgia, not just in a cameraman, a actor or writer, but in dry clean and in transportation and renting cars and renting buildings, etc., etc. And they're strong. étaient strong enough to reduce that 돈 White. Congress astr a huge difference matters is not asking for은 going toninwash it's most self- juvenile. question please. Yes I would like to know thank you senator like to know why are we adding fees to independent and that might even include uh Tala Perry studios it looks like to me which was here before we even had tax credits and who definitely employs a lot of people in Georgia. So well the well first off we're not requiring the fees it says the department may charge a reasonable fee associated with the certification process. There are many many certification applications that are coming through and it does cost money when we have to allocate resources towards that and so that is the purpose of the fee but is my hope too that as we have some of this clarification language throughout the bill on what exactly is eligible for the credits and whatnot as we're cleaning that up then hopefully the amount of applications should go down because of that process is cleaned up. Yeah will you further yield? Absolutely. I'd like to know what reasonable fees mean how much are they? It's a $50 $100 $10,000 you know what is reasonable? We didn't specify in this legislation you know we found that when when here in in the state when we put a number on a on a fee or we put an actual number on something as you know you've been here long enough I've you've been here longer than I've I'm in my ninth year and it seems like every single year uh a department or someone is coming back to us to ask us to raise that fee or lower that fee and it's and so trying to get out of the fee naming business and so the the it was left a little bit more generic and we feel if if the department is doing something that we do not feel is reasonable then we could come back next year and address that. Well and I know that many of the lobbyists for film industry said it's okay but then I talked to some of the independents we had filmed day in Georgia last week and they they uh said they paid already to get a license in other fees and permits so they were very distraught over this bill so I'm voting no against it because I am number two signer for the tax credit in Georgia in the first place and and uh it passed and we went from number 39 to not almost number one one two or three win that top three uh in film industry in Georgia in the United States so thank you you are certainly um you are on on certainly on the team for the film tax or film industry in this state and I appreciate all your work I understand your concerns but uh I think a reasonable fee is is is reasonable thank you but I think reasonable ought to be explained thank you very much thank you senator from the 44th thank you um will the german yield are you thank you so much I'm just looking at upcoming amendments um in terms of amendment one that would say the fees shall be remitted to the state general fund what is your understanding of where the fees go currently yes so it really wasn't specified in the bill um as it came out of committee and so this really the way I read it I would say it probably would go directly back to the department of economic development as written and so we're clarifying that this will go to the general fund and then be reallocated through the the proper budget process maybe I'll um ask the author of the amendment the question um the is but isn't it true in conversation with department of economic development they said it automatically goes back to the general fund which that's possible uh clarifying language never hurts thank you oh all right thank you ladies and gentlemen I urge your favorable consideration of hb 475 I you'll probably have you back to close the bay datcher the authors of these amendments comes comes to pass senator from the 19th would you like to speak to your amendment figure your bias got it huh senator from the 53rd like to speak to your amendment thank you mr. president i would say that the fact that this legislation is coming from the center from the six is good for the film industry and if it's good for the film industry the way art law is structured it's not good for the citizens striking one it's an entirety keeps the definition the same you know this is title 48 in my opinion this legislation autumn went through the finance committee should have been debated there but it wasn't so it says paid subscription based platforms so what is that that's like paramount plus that's like uh you know the was it 1923 or one of those people pay a subscription to watch these types of services primarily streamed on the internet so we're expanding the film tax credit I thought that this conservative senate might be reducing the film tax credit in this state not making it stronger and i think it's kind of humorous that when we talk about the department of economic development saying that they want to tighten things up on the film tax credit it's kind of ridiculous because to my understanding they've only said that it's a great thing for this state for those in the democratic party who constantly come up here and say you want to expand Medicaid why do you want to expand corporate welfare in section one you know we're never going to be able to do those things until we hone in on the corporate welfare in this state it's out of hand and i don't think a lot of you even understand how it works what is a transferable tax credit if the center from the six and i want to go make a movie we could go make a movie and let's say for simplicity state we spend a hundred thousand dollars on that movie we would go to the department of economic development we would show them our receipts and they would give us a tax credit and as long as we put that little peach logo at the end of it i believe it'd be 30% all right yes what the center from the six and i we don't have the same humor as everyone else in our movie is a bust doesn't make any money we don't owe any Georgia taxes so what do we do we sell it to the poor farmer from the center from the 49th because he probably owes a lot of taxes and it's currently ninety cents on the dollar so say he owes thirty thousand dollars in Georgia taxes we're going to collect twenty seven thousand dollars and we can take it off and go back to Hollywood with it we can do whatever we want with that twenty seven thousand dollars that he now paid us he's not paying it to the general fund of the state he's given a voucher a transferable tax credit you can't pay teachers with that voucher you can't build highways with that voucher can't pay police officers with that voucher but yet section one is just going to expand and make more vouchers so offer amendment number two and ask that you vote favorably for it and i'll yield to any questions mr. president then i'll yield the well thank you senator is yielded does any of the senator which speak for against measures senator you want to close recognize the senator from six to close ladies and gentlemen my friend and colleague from the 53rd calls it corporate welfare i look around my district i call it jobs i call people i see plumbers that were making forty thousand dollars a year now making over two hundred thousand dollars a year i see a dead town that had no reason for people to to visit i see restaurants i see local businesses thrive because people are coming from all over this country to visit what you call corporate welfare jobs are created by this it is an investment it is an investment in the lives of our citizens are urged or by it are urged or favorable consideration senator has closed the bay okay we're going to take up the amendments amendment number one authored by the senator from the 19th amendment number one is there objection to amendment number one without objection amendment number one is added amendment number two authored by the senator from the 53rd is there objection amendment number two there is objection on the author of the bill all right all those in favor of amendment number two will vote yay all opposed nay secretary and lamp machine the yays are three and the nays are 49 and this amendment has failed all right moved on to is there objection to agree to the report of the committee which is able to the past of the bill chair here's done the report of committee is agreed to is there objection to the main question being ordered chair here's done the main question is ordered questions all the passes of the bill all those in favor of vote yay opposed nay secretary and lamp machine you you own the pass of the bill the a's are 49 and the nays are three this bill have received requisite constitutional bazaar is therefore passed as amended secretary sr 310 senate resolution 310 by senator car pastor because of 30 second and others resolution creating the senate study committee on additional services and resources for transition age youth and foster current further purposes and it's the president this senate committee on children and families recommends that this resolution do pass was speculated in our Kirkpatrick chairman that police you are mr. president we're going to ask senator from 30 second thank you mr. president senate resolution 310 creates a study committee on additional services and resources for transition age youth and foster care all children need a loving family to support their lifelong growth the desired outcome of permanency for kids and state custody comes in one of three ways reunification adoption or guardianship for youth aging out emancipation as the outcome which means exiting the system without a permanent family about 19,000 young people aged out of the us foster care system each year and there are lifelong consequences that can occur including housing instability joblessness involvement with the legal system academic difficulties early parenthood and substance all these outcomes are harmful not only to the youth but to the entire state although we made some steps to address this issue in our state by sending the age to 21 for some of the programs there's much more that can be done the purpose of this committee is to identify existing resources including gaps in our programs and to identify possible solutions to improving outcomes for this vulnerable population I appreciate the support of the president of the senate for this study committee and his overall support for the important work of the children and families committee and with that I'll yield for questions thank you are you does any of the senator which speak for against the measure chair here's none is there objections to the previous question being ordered chair here's none previous questions ordered is there objection to agree to the board of committee which is favor to the past of the bill chair here's none the board of committees agreed to is there objections to the main question being ordered chair here's none the main question order this question is only adoption resolution all those in favor of resolution vote yay opposed nay sir tanlon the machine on the adoption of the resolution the a's are 54 the nays are zero this resolution hadn't received registered constitution majority is therefore adopted regina secretary read house bill 340 house about 340 were representative hillton the 48th and others the bill between talent act to amend chapter 2 title 20 the official to judge and table with the elementary and secondary education so as to enact the distraction free education act to acquire local school systems and public schools to enact policies and procedures for use of personal electronic devices at school and school sponsor events by students in kindergarten through eighth grade so I for permissible student use of personal electronic devices to authorize to the part of education to write guidance and technical assistance to write certain waivers to write for definitions to write for related matters to people clicking laws and for other purposes mr. president this thing coming down show in the family recommends that this bill do pass to suspect this minutes are in court senator Kirk Patrick chairman miss president minority port to house bill 340 is been attached to the complete see order we're going to sit in front thirty first good morning everyone thank you mr. president i'm honored present house bill 340 today the distraction free education act first and foremost i want to thank the bipartisan collection of legislators throughout this building who have come out and supported this bill i want to thank the lieutenant governor for the discussion and thoughtfulness um over the last several months on this topic speaker department of education teachers the Georgia Sheriff's Association school superintendent to most of all\n\nparents and many communities across state. The evidence is clear, one of the biggest threats to academic performance, students' mental health and public safety, or cell phones in our schools. The average student receives over 237 notifications a day, and some as many as 4,500. Students spend on an average, spend on average, an hour and a half on their phones, they're in school hours, pulling attention away from learning, and turning our teachers into cell phone police officers. Research shows it takes over 23 minutes to regain focus after a distraction, meaning many students never fully get engaged in their education. Our teachers are seeing the impact firsthand. Over 85% of high school teachers and 68% of middle school teachers report that cell phones are a major problem in their classrooms. Educators overwhelmingly support cell phone-free classrooms, with 90% saying phones are a major distraction. The data backs it up. Schools that have implemented bell-to-bell cell phone bands have seen fewer disruptions, higher grades, and a decrease in disciplinary incidents. Beginning with the 2026-2027 school year, public schools grade K-8, shall be cell phone-free from bell-to-bell beginning to the end of the day. Beyond that, we will allow school systems to design a program that works for them. Again, we will allow local school system to design the best program that works for them. So each local community will have a say in what this should look like in only grades kindergarten through eighth grade. Finally, schools are required to have clear policies, procedures for field trips, emergencies, daily transport, or other student needs. This bill isn't just about academics, it's about students being well-being. Studies link excessive phone use to mental health issues, decrease in social skills, and increase in bullying. We want students engaged in school, socializing with friends during lunch, and focusing in the classroom. As a parent of three young children and my wife is a school teacher, my first thought every day when dropping our kids off at school is that their safety and public safety is taken care of, and those experts that are on the front lines of public safety agree. Removing phones creates a safer school environment. In an emergency, we want our kids fully and undivided attention, clear phone lines, no misinformation. Kids listening to teachers, kids listening to school resource officers. If God forbid there's an incident in the school, I want my child and your child to be able to follow instructions very clearly without distraction to get out of the building, get out of the classroom, and be safe. Schools that have implemented a self-free policy have seen hallway fights bullying and other violence decrease. We are not alone from Virginia to Alabama, states across the nation are taking action. The results speak for themselves, reduced threats, higher grades, and better student engagement. Let's do what's right for Georgia students. Let's get cell phones out of the classroom so a teacher can teach, and our brightest minds can learn. Let's pass House Bill 340 and bring focus back to the classroom. With that, Mr. President, I'll give you a couple questions. You do have a couple questions. Senator from the 53rd. Thank you, Mr. President. Will Senator Yeal? Yes, Senator. This legislation only includes K through the 8th grade, is that correct? That is correct. Okay. Would you also agree with me that this legislation is a sign that our teachers cannot maintain a standard of discipline in the classroom? Could you repeat the question more time? Would you agree with me that this type of legislation making it this far in the legislative process is proof that teachers lack the ability to maintain a standard of discipline in the classroom? And we as a legislature should do more to empower teachers to maintain a standard of discipline. Well, Senator, I will say this to your question and your comments also so I can go home and sleep tonight with my wife being a teacher. I think this Senate and legislative body needs to do everything in our power to empower teachers to have a greater save of what happens in his or her classroom. I believe that this bill also demonstrates that when there are distractions in the classroom, a teacher is scared to death to empower themselves or even sometimes maybe a family member because they're worried about reprisal punishment or something in a school district from basically doing what's best for what they believe is in the classroom. So I think whatever we can do on this issue or other issues, we need to empower teachers more. Thank you, Senator. Thank you, Senator. Any other questions? We're going to send it from the 56. Thank you, Mr. President. Does the Senate re-ealed? Yes, sir. Senator, I commend you for carrying this bill in the Senate. I do have a question, though, specifically if a school system either provides devices such as a laptop or a tab, but or they have a BIOD policy of allowing them to use them in a class for certain types of things are working on? Would that still be allowed under this bill? Yes. If a school district is basically providing devices and they already have kind of a system set up, this does not infringe on the school districts. Current practices, this bill very specifically states that local districts shall create policies that are best for them and their community as in terms of what they do with devices during the bell to bell time for. Thank you. Thank you, Senator. We're going to as soon from the 55th for a question. Well, the district was Senator Yeild. Yes, Senator. Is there a provision that parents will still be able to be able to be in contact with their kids in cases of emergency? Well, how is that envisioned to be taking care of? Yes, Senator. Great question. So when it comes to cases of emergency or checking on their kids, all of those types of instances would be covered in the policy that a local school district would basically design in terms of where and where and how that device is handled during the bell to bell time for them. I mean, my advice during an emergency at a school, well, you know, we know that parents are scared, parents are worried about where their kids are, parents are worried about kind of, you know, what's happening at a moment's notice. Trusting law enforcement, trusting the first responders and following the instructions when emergency text messages alerts or other things are put out by an individual school or school district. I think are important in this bill does not in fringe on any of those communication methods that school districts use now or would develop or using the future. We're going to as soon from the 50th. Thank you, Mr. President. Does Senator yield? Yes, sir. Isn't it true that when I was in elementary school, in middle school, I didn't have a cell phone with me that I brought to school every day? That is true, Senator. And isn't it true that if my mom or dad needed to get in touch with me, there was a land line that they can call at the school and someone picks up the phone and they ask if they have a message. And if they had a message for me, they could leave it and there's a loud speaker on the in the school that can say, would this student please come up to the principal's office and they can relay that message and those that technology is still around today. That is correct. That technology is today back in the day. I had a beeper. A moment a little bit older than you. So that's how our parents would get in touch with us. But we would still have to go to the front office and the front office would still have to call our parents to basically get in touch with us. So if they were to let us respond to that beeper. Does it center for real? Nothing in this bill prevents a teacher from having a cell phone into school, does it? No, this is not about taking phones away. This is about putting phones away so they're not a distraction during the belt of bell time frame. And does the center for the yield? I'm going to show you that right now I have multiple children elementary school and that if I need to communicate with their teacher, their apps such as class dojo that I can literally while we're in this chamber sending message to their teacher. So if there was any reason I needed to get in touch with my elementary school student, I could do that here without them having their own cell phone in class. So the center that's correct currently, whether it's through an app through group text messaging through email and other direct classroom connection or communication methods between parent and the teacher do exist in hundreds of our schools today in Georgia. Thank you. Thank you Senator. Great questions. We're going to ask for the 27th for a question. Are you waving? Yes. We're going to ask Senator from the second for a question. Thank you, Mr. President. Senator, do you? Yes, sir. Senator, is it not true that I was raised by my grandmother? Is that not true? That's correct. And Senator, is it not further true that one of the first things that my grandmother taught me was to remember our house telephone number which was 912-238-335 for is that not true? That's correct. And Senator, is it not further true that I probably got in a little trouble for talking too much in class? And the teacher's recourse would be to call my grandmother on the house phone because my grandmother didn't have a landline and she was always able to reach my grandmother at home and never needed to reach me at school. And Senator is not further true that when my grandmother called the school to give me a message, would it not be a seven cent of my grandmother would say, children just had a grown folks businesses that not further true? That is true. And my mother growing up, we had a landline, 770-447-9386. And that school would contact my mother and tell me and my brother were getting in trouble that day and it never ended well, but they had a way to find us. Thank you, Senator. I'll take it to the question. You have no more questions, no further questions. I ask for a green vote on this to help our classrooms in kindergarten through eighth grade and to continue to raise fantastic kids and George. That and that's President Yeal Delwell. All right, we have a amendment, Secretary Reed, the amendment. Mr. President, Senator Island, works for the seventh and others. I'll put the following amendment number one to amend House Bill 340 by our placing lines 93-95 with the following. G, nothing in this code shall be considered or applied to one, but a bit of a local school system or public school from providing school equipment, including what I'll limit it to laptops and tablets for students, use for educational purposes and further purposes. Mr. President, I can please see your order. I'll get a center from the seventh, speech and amendment. Thank you, Mr. President. I recognize the good intentions of this bill, but with many good bills, there are sometimes negative externalities that come out of them. If we look at line 28 in the bill, where it defines personal electronic devices, it means any portable electronic device capable of transmitting receiving or accessing communications data or media such as includes, but is not limited to smartphones, smart watches, tablets, e-readers, headphones, and other devices. Right now, this bill would ban devices like e-readers, banning e-readers in 2025 is basically like banning books. Kids aren't just reading paperbacks anymore. They're reading on kindles, on nooks, on tools that are built specifically for learning. E-readers don't have TikTok. You don't text on them. They don't let you scroll. So, you know, I agree with banning distractions, not learning. So, my amendment makes sure that we carve out a place for technology that supports education and devices that only serve the classroom, not the group chat, electronics or tools. And so, I would like to make sure that we don't take them away from teachers and students. Thank you, Mr. President. I yulubo. Senator Seniors, you did recognize Senator from the 29th, like speech of the measure? Thank you, Mr. President and colleagues. I want to commend the Senator from the 31st and the House member and good friend of mine for actually not to offend anybody, for actually bringing the first legitimate school safety bill before this body. Cell phones have become a serious cancer in our classrooms. Just a few minutes ago, about an hour ago, I met my page today, young lady named Stormy from Maryweather County, goes to a small private school there. They implemented this very policy last year at her school, and her school is kindergarten through 12th grade. And I asked her, I said, what did it do to you? And she said it gave me back my focus. She said, kids are doing a lot better, interacting with each other. They're not as distracted with each other. But, from a public safety standpoint, I don't think anybody really appreciates the chaos around an incident that happens at a school. When, if you're looking at a large school, you've got about 600 children texting 911 or calling their parents. You have about 1200 parents calling 911 or calling the school during these incidents. And you have people texting rumors galore about where the bad guy is or where the storm hit. And you have first responders trying to get there, and they're being fed a lot of misinformation. Because it's coming from all different directions. And this is a huge first step in clearing up the communication lines. And as I was sitting at my desk, I was handed the minority report. And I have a saying sometimes I use, and I know my brain doesn't work like many people in this room. And I think that's to everybody in this room is advantage probably except mine. Because I think there are people in this room, a whole lot smarter than I am and a whole lot more articulate than I am. But reading the minority report reminds me of what I say where sometimes I believe this is the building that you bring a plastic plant to if you want to die. Because there's zero logic, zero oxygen, anything in this building at times. And in the minority report, I read it is the responsibility of teachers to maintain the attention of their students. Absolutely. So let's do what the senator from the 53rd said. Let's empower those teachers to run their classrooms again. Let's take the fear away from them of running their classrooms again. Let's take the fear away from them for sending an undisciplined student whose parents choose not to take care of that student to the office. And let that child be disciplined and removed from those children that want to learn in the classroom. It said, what if parents try to contact their students to make sure they are safe? Well, that is not the time for parents to reach out to their students to make sure they are safe. Students, every school in Georgia is required to have an emergency action plan. We mandated that and it's on file at GEMA. And they are required to follow that plan. And part of that plan is not to have Randy Robertson call Wendbrook School and ask if Andy Robertson is safe. My problem is to sit down, be a responsible parent and trust. Trust the school to follow their emergency action plan. Their calls will go unanswered because their children's phones will be locked away. And what if a student needs to film an incident that isn't called on school security camera? I can't even speak to that. We should teach students to catch the proverbial fish for themselves. Amen. We should teach children to be responsible. And to teach them to be responsible, they need to understand that they go to class. They sit in their desk. They follow the instructions of their teachers. If there is an emergency, they follow the instructions of their teachers. If it's a weather emergency, they follow the instructions of their teachers and the drills they have been given. If it's a much more dangerous situation than that, they follow the instructions of their teachers. We keep communication lines safe and clear. I cannot thank the Senator from the 31st enough. I cannot thank the House sponsor enough for doing this. I know my brother from the 30th understands exactly the passion we have when we have to respond to something that involves children. Whether it's an active shooter, whether it's a tornado or any other thing. But we need to go there with the confidence to know what we're going into. And it cannot be a hurricane created by thousands of phone calls going in and out of 9-1-1 into the phones of everybody in the community. Thank you all, Mr. President, I yield the well. Seniors yielding. We're going to send from 38, speak to the measure. Thank you, Mr. President. Colleagues, I was really torn on this bill. As a former teacher and principal, I know the distractions that phones cause in the classroom. Just this morning, I met with school leaders from my district. We had five of them here and each of them mentioned the drama and the issues that cell phones cause in the classroom. From third graders, 16 and sending explicit videos to fights being caused as a result of phones. So let's not forget that some kids can use their phones to bully. They're fellow classmates during the school day. According to the National Center for Educational Statistics in 2022, about a fourth of students, age 12 to 18, reported that they were bullied as a result of online or from text. These harmful online posts or text messages can be shared across the school in a matter of minutes during the school day. We have to make sure we protect our kids from facing this kind of bullying or harassment so all of our kids can get a good education. However, I can't help but shake the what if. What if that phone could save lives in an active shooter situation? These are true concerns as apparent that all of us will typically think about. What if that phone is the last opportunity for my child to communicate with me? We've already seen this happen, not just here in Georgia but across the country. Time and time again when a craze gunman decided to take the lives of our children while they sat in their desk. It was a cause of students that got emergency services there. It was their text to their parents letting them know they were alive. They gave every parent a glimmer of hope. While I support this bill, I actually think it should go up to 12th grade. I implore I beg my colleagues for the sake of our children and educators to do something about guns. Do something so that we no longer put ourselves in this position where we make sound policy decisions but neglect what our students are really asking for to be safe in their classrooms. And with that Mr. President I yield the will. I'm going to have a senator from 35th speak to the measure. I rise in partial disbelief because I'm in complete agreement with the senator from the 29th. This is indeed in my opinion and apparently in his opinion the first and only school safety bill, true school safety bill that we've heard so far this year. I also rise today in strong support of the distraction free education bill which takes a critical step towards fostering a better learning environment for our students by banning cell phones from K through 8th grade. This is a common sense measure to reduce distractions, support, mental health and ensure that our classrooms truly remain a place that is focused on learning. But let's be honest the challenge does not end in 8th grade. High schools across our state are grappling with the same issues. Study after study has shown the detrimental effects of excessive excessive screen time particularly on teenagers and we have some teenagers here in this chamber right now. We can no longer ignore the impact of declining academic performance and increased anxiety and depression. We know that phones are more than just communication tools. They are constant sources of distraction and teachers are competing with TikTok, YouTube and Snapchat for students attention. And in a world where algorithms thrive on keeping our students hooked we are setting them up for failure by allowing them to continue to be distracted by cell phones and classrooms. Therefore regardless of what this bill does in K through 8th I call on our school systems across the state to act now. Even without a statewide mandate local districts have the authority to implement policies that ban phones in high schools. Some schools across the country and in this state like Mary at a city schools and Atlanta public schools have already begun to do this and they've seen remarkable success. They've reported higher grades among students fewer disciplinary issues and more engaged students. I have an example of a midtown high school where parents and teachers reported that after banning school banning phones in classrooms students were automatically suddenly talking to each other during lunch. What a novel idea. It is time that we follow the lead of these school systems. This bill is a step in the right direction but let it be the beginning and not the end. Let's ensure that every student from kindergarten to 12th grade has the opportunity to learn free from unnecessary distractions. Colleagues I urge you to support this bill and encourage school systems to take bold action for the sake of our students future. Mr. President I yield the well. I recognize senator from the 40th. Thank you Mr. President to my senate colleagues. My kids were the first generation who got those cell phones when they had become ubiquitous. They were the guinea pigs. I knew they were a problem. My husband and I were very careful to make sure we set up rules in our household in regards to checking your device in before you go to bed. It did create struggles in our relationships with our kids because the poll of those phones is so strong. We did our best to struggle through that and get those devices put away before bedtime. We sent them to school and the schools worked against us. My kids were required to sign up for Instagram because there was a school assignment that was a very clever assignment but there was a school assignment where they had to create Instagram characters that had to do with the crucible. It was very cute but they required that my kids have an Instagram account. They used apps on the phone to keep track of homework. So when we said to our kid at 11 p.m. It's time to turn your device in. They said I can't give you my device because my homework is on the app and I haven't finished my homework. And we as parents couldn't stay up until 1 a.m. And the kid still had homework to do so the device didn't get turned in. I support this bill. I am so thrilled that we can do this for parents that are out there struggling in the same way. We can help them put limits on these phones and I wish that we could have done this sooner and it could have helped me 8 to 10 years ago but at least we can do it now. So I have full support of this bill. I will give you two questions. You do have a couple questions, Senator. I recognize Senator from the 36. Thank you, Mr. President. Senator, you may have been familiar with this isn't it true that I have read accounts that the folks in Silicon Valley who come up with all these advanced technical breakthroughs with phones technology? It has been widely covered that they in fact strongly control their children's access to these instruments. The very folks who are at the top of the Silicon Valley. Yes. In fact, I remember hearing 8 to 10 years ago when my children first got these devices, started using them, and the people who invented them did not allow their children to have them. So they knew that what they were putting into kids' hands was not good for them. Thank you. And here we are 8 to 10 years later. Finally dealing with it. Thank you. Thank you, Senator. There are no other questions. You have one more question. Senator from 37. I appreciate your presentation. I was going to go to the well, but you said everything I was going to say. Thank you for that. This is big policy. Isn't it true that this is going to make a really big impact? And if you've seen an issue before that has this big of an impact, we have almost overwhelming bipartisan support for this chamber. This is, this can have a huge impact. I predict that many, many measurements will change. Reading scores will go up. Social skills will improve. Because all of those measures went down when cell phones became ubiquitous. So if we can pass this, then I think a lot of the measures we have in terms of measuring the health of our children will begin to go up. Does Lee, you have one further question? I do. Is there a good first step? It is a good first step. I would love to see it through 12th grade. But this is a good first step. Absolutely. If there are no more questions. Thank you. I yield the well. We have another amendment. We need Secretary read that amendment. Mr. President, the Senate is on parts of the 7th and others. The Senate will have about 1-1 to House Bill 340 by striking exclusively on line 7 and striking lines 11-15 in their entirety. Mr. President, that completes the order.\n\nis is there any other senator which speak for against the measure chair here's none the senator from the forty first to speak to the amendment thank you mr. president i want to speak just very briefly to amendment one a so what amendment one is seeking to do is to try to provide some space for to acknowledge that children do have access to devices like e readers things that allow and really enhance their educational experience and so one is seeking to make those so that those can be used still in the classrooms but the parameters around one were a little bit too tight and so one a seeks to make it just a little bit clear it says if it's a school provided device of course that will be allowed and then the second one is you can have personal devices but they have to be for exclusive educational use and they have to be related to reading studying or institutes or educational activities so we're just trying to make it clear while also by also trying to maintain the spirit of this idea of really keeping cell phones out of the classroom which I will say I support the underlying bill 100 percent I'm glad that we're taking this step and I do want to make sure that our children have access to some of these personal technologies that do in fact help them enhance their reading and enhance their educational skills with that I will yield for questions for amendment one a you have no question senator or thank you senator from 31st would you like to close thank you Mr. President the green vote read on amendments thank you all right so so now we're going to take out the two amendments one is authored by the senator from the seventh one is one a and we'll start with one a is objection to amendment one a there is objection all right all those in favor of the amendment one a will vote yay all pose nay secretary and lot of machine all the adoption of them adoption the amendment one a the a's or 23 the a's or 32 and the amendment has failed all right moving on to amendment one authored by the senator from the seventh is the objection to amendment one we do have objection all those in favor of amendment one will vote yay all pose nay secretary and lot of machine all right so now we're going to move on to the next one all the adoption amendment one the a's or 15 the days are 39 and amendment one has failed all right now move on to the underlying bill is there objection to agrees to the fourth committee which is favor to the passes of the bill chair here's nine for the committee is agreed to is there objections the main question being ordered chair here's none main question is ordered question is on the passes of bill all those in favor of the bill vote yay opposed nay secretary and lot of machine all the passes of the bill you as are 54 the nays are to this bill haven't received the rest of the concessions from the jury is there for pass for the center from the 13th for motion thank you miss president this president pursuant to senate rule seven dash one dash ten ten b I give notice on the next legislative day I intend to move senate for the senate to consider house action on Senate bill 13 secretary read the caption Senate bill 13 by senator Somerset 13th and others built me ten elect to amend chapter 23 title 50 the fish coach and it's head away to the Georgia environmental finance authority says to authorize the authority to finance and perform certain duties and connection with projects relating to national gas facilities to rise the definitions to write for rules and regulations write for limited liability to write for later matters for effective dates for bill clicking laws and further purposes miss president that completes the order all right recognize the majority leader for motion mr president I move that the senate standard jr.n pursuant to senate resolution six until 10 a.m. on Thursday March 27th secretary the announcements miss president the rules committee will meet upon adjournment before 15th the capital at 2 p.m. the ethics committee will meet room 310 in the CLOB a 3 p.m. desiccation youth committee will meet room 415 in the capital at 3 p.m. the retirement committee will meet room 307 in the CLOB at 4 p.m. the insurance and labor committee will meet in mes one and 4 p.m. the higher education committee will meet room 307 in the CLO B and at 5 p.m. the regular industries and utilities committee will meet room 415 in the capital miss president I completely see order all right any other any other announcements No announcements. Majority later has moved that we stand adjourned until 10 a.m. Thursday morning, March 27th. All those in favor of the motion are seeking to file by saying aye. All these opposed no. Aye, I clearly have it. We're adjourned.",
  "updated_at": "2026-02-13T13:58:08.545451+00:00"
}