{
  "video_id": "uTph8tVRSnU",
  "url": "https://www.youtube.com/watch?v=uTph8tVRSnU",
  "title": "3/20/23 - Committee on Health & Human Services",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 47,
  "summary": "Here is a summary of the Georgia 3/20/23 Committee on Health & Human Services session:\n\n**Overview**: This session focused on passing a bill related to Medicaid coverage for continuous glucose monitors and made a minor technical change to a bill regarding financial requirements for assisted living facilities.\n\n**Key Actions**:\n- **HB 143**: Provides Medicaid coverage for continuous glucose monitors via the most cost-effective delivery channel. Passed unanimously.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- The committee discussed a technical change to HB 143 to make the language more aligned with the Department of Community Health's preferences.\n- For HB 309, the committee heard an explanation from the Department of Community Health on why the original CPA certification requirement was modified to allow a negative attestation instead of a positive statement of financial stability.\n\n**Votes**:\n- HB 143 passed unanimously.\n- HB 309 passed unanimously.\n\n**Attendance**: Quorum was present, no issues noted.\n\n**Adjournment**: The committee adjourned after considering the bills on the agenda. The next session date was not specified.",
  "transcript": "You\nYou\nI'm going to go ahead and call the Senate Health and Human Services Committee to order.\nReverend Jackson, Senator Jackson, if you don't mind, open this up in prayer.\nThank you so much.\nLet us pray.\nGod, we give you thanks for the opportunity to gather with one another.\nWe pray for all who are in the health and human resources area and field.\nWe pray especially for those who are sick, who are lonely and afraid.\nWe ask that you would help us to make good decisions that all might find comfort and well-being.\nAmen.\nThank you.\nWe have four house bills and one Senate resolution today.\nAnd we had the meeting for one hour.\nSo we can go ahead and sort of just sort of go down the list there.\nHouse bill 143, representative of Mathis, a few of mine coming up and we do have a, we\ndo have a substitute for you.\nLet me make sure you have that is LC-339515S.\nI apologize.\nDo you mind sharing it?\nSenator Eckles is, you know, y'all had companion bills in the house in the Senate,\nand hers is in the house now, and I just wanted to make sure that the language mirrored\neach other. The change, and I'll apologize to not giving you a heads up on this, I thought\nyou had, but it's a very minor change. If you'll look online, 13 continuous glucose\nmonitors as a benefit under Medicaid via the most cost effective benefit delivery channel,\nand that was what was agreed upon. You got to remember this continuous glucose monitors\nwhich we're all in favor of, but the ones to administer, the Medicaid is DCH, and this\nis the language that made them comfortable, and so that's sort of where we are.\nI didn't think you would have any, we always want to be, you know what, it's a good idea,\nif I turn my mind, that would be better.\nSo if you don't mind just being brief, because we've heard this bill, and that's where\nthere we are, the floor is yours.\nYeah, we were just changing the governor's office.\nI've wanted to be the most cost effective\ninstead of a medical deformity.\nAnd that is the only change, everything else does you sign.\nDoes the committee have any questions\nfor the author or Senator Eccles or myself\nsince we have a little bit of change?\nWe have no question.\nSo if we'll enter, like to enter a motion.\nMr. Chairman, I make a motion do pass.\nDo pass and we've got a second.\nLet me say if, let me make sure that the, where are we?\nNobody signed up to testify any further discussion\nbecause we've already heard this bill and no further discussion.\nIf you have a question, the distinguished rules chair.\nChairman, briefly, can we go over the changes again?\nOkay, so in line 13, it starts on 12 coverage for continuous glucose monitors as a benefit\nunder Medicaid via the most cost effective benefit delivery channel.\nAnd that's it, DCH and the executive branch, I wanted to make sure that we had that language\nin there to make it more doable from their perspective.\nOkay.\nOkay.\nThank you.\nOkay.\nAny other questions or discussion?\nWe've had a motion to do pass and it's LC-339515S and we've had a second and all those\nin favor say aye.\nAll those opposed, like, sign, pass unanimously.\nThank you so much.\nWe appreciate it.\nThank you, Ms. Carey.\nI presume Senator Eckles would carry this since it's her bill.\nShe's carried it already there.\nThank you.\nWe got it.\nThank you.\nAll right, chair lady Cooper, we're going to move you up in the agenda there.\nAnd then we'll do Representative Townsend.\nWe got House Bill 309.\nIf you give us just a minute to get that bill in front of us.\nAnd you had the podium House Bill 309.\nIt is coming to us without a substitute there.\nOkay, you ready?\nThank you.\nThank you, Mr. Chairman and members of the committee.\nI have House Bill 309.\nThis is a department bill two years, three years ago,\nwhen we made some major changes trying to protect people\nwho moved into assisted living facilities.\nAnd one of them is that we wanted to make sure\nthe people that opened these facilities\nwere financially stable and able to run these\nso that we wouldn't have them closing.\nIn doing that, we put in some things\nwhere we were going to ask certified public CPAs\nto certify certain things.\nWell, when the department started working this out,\nthe CPA said they don't do things that way.\nSo this just clears up the language so that it meets\nwhat we wanted to just to protect\nand make sure people were financially able\nto run these facilities,\nbut so that the CPAs could do what they normally do\nwhen they give an evaluation of somebody's finances.\nDo we have any questions from the committee?\nSenator Satsr.\nIt was Chairman, to the lady. Is there, are there standards that are already established\nthat say this is what solid, what financial stability means, are there cash reserve requirements,\nare there things like that that are established, or have this not yet been established before?\nNo, I think, and Joe Hood is here with me if I might be allowed to answer it, but it's my understanding that CPAs have sort of guidelines about how they evaluate this kind of situation.\nCould you help clarify the situation?\nJoe?\nAnything further, please.\nYes, sir.\nJust, if you don't mind going to the mic and just identifying yourself.\nGood afternoon. My name is Joe Hood. I'm the Chief Operating Officer for the Georgia\nDepartment of Community Health. To your question, sir, we will rely upon a certified public\naccount to certify the pro-foam of financial statements or audited financial statements\ndepending on what's available to, and what, and their concern, and the reason for the\nchange is originally we had asked that they certify that the business was a going concern\nin a positive statement and they've stated that they cannot do that.\nWhat they can do is that they can state in the negative.\nIn other words, they would state that we do not see any findings or efforts that show\nthat the business is not a going concern.\nThere's nothing relative to say that we should be concerned about.\nAnd we had to limit it to one year worth of financial statements\nversus the two years that's currently in statute.\nMr. Chair, the only reason I asked the question is does this give any more authority to establish\nsort of a baseline requirement?\nI asked that because I know there's been some facilities when we were dealing a couple\nyears ago with pregnancy homes, they had to maintain.\nWhat I thought was a very high level of cash reserves on hand, that was meant to have\nout of the department.\nAre we creating an issue that gives rise to that kind of rulemaking?\nWe're not seeking or establishing a standard in that way, it would just be a statement by the Certified Public Accountant that they're attesting that they don't see an issue that that's aware in the financial statements that, you know, for the business to operate within the upcoming year, given the scope of the licensee.\ntransparency is yes basically got you okay any other questions any further\nno questions happy to entertain a motion from vice chair yeah be happy to move\ndo pass to House bill 309 33 92 95 is the else you know second from Senator\nHuff settler any further discussion all those in favor say aye all those opposed\nThose like son pass unanimously.\nThank you.\nThank you, Mr. Chairman.\nWho's, who's carrying that bill?\nDo we establish them?\nYou carry it?\nOK.\nAll right.\nThank you.\nShe doesn't have enough bills as it is, so she don't, OK.\nI got you.\nThank you.\nSo, we're representative Townsend.\nWe're on a house bill 181.\nAnd by the way, we didn't have anybody signing up\nto test five for 309.\n181, I understand you had a little amount of testimony.\nI think it was 10 hours, maybe 12 hours,\nfive, 12 hours, only five committee meetings.\nI'm sorry, I didn't have your mic on.\nSo that was 12 hours of testimony, five committee meetings,\nand a couple of rewrites here there.\nSo every, I understand all parties are in agreement.\nThey are, sir.\nWe worked well together at some bipartisan bill.\nIt's what we hooked up with the creative ministry\nas well to make sure that we monitor it well\nand make sure the bad actors aren't bad actors anymore.\nSo what we're trying to do is make it a safer place\nfor Georgians.\nWell, we sure appreciate Jones' diligent work\nin the house, and if you don't mind taking us through the bill, 181, and any updates\nthat we need to know about the floor's years.\nI'd be glad to, and I think we're speaking from the same one, LC-339513S.\nOkay, I'm just making sure.\nOkay, basically it started off as a constituent-based issue.\nWe had a couple issues.\nI'm an educator, not known for being in the medical field, and we had two.\nTwo young men, one who committed suicide,\nhe was on other drugs as well.\nCratum was one of them.\nAnd one of the causes of death was Cratum.\nThey said that led to that.\nSecond one where he was given Cratum at a half way house\nlike the other student and other people\nto get off other drugs such as opioids.\nUnfortunately, while he did that,\ndeveloped psychotic behaviors.\nHe wound up at a mental health institution\nand just got transferred about a week and a half ago\nfrom St. Simon's to Augusta to get additional mental health care.\nThat's how I came across my desk and I'm a freshman and I'm like,\nokay, what can we do and we start looking into it?\nThen we asked medical professionals and one thing we realized real quick,\nit wasn't labeled at all.\nSo if you buy something off the store shelf and convenient stores,\nyou're not sure what you're getting.\nYou're not sure if you're getting a heavy dose or light dose,\na tainted dose or whatever kind of dose it is or no dose.\nAnd so we learned real quick, we had to do more things.\nYou guys passed the bill a few years ago.\nI believe it was led by voting Jones,\nwhere it was just basically had to be 18.\nThat was pretty much it.\nWhat we tried to do is make it a lot more safer\nfor Georgians than that bill wise.\nSo we need your help to do that in the process,\nlike we said, we picked up.\nAnd so we put amounts on there.\nThe dosage has to be labeled.\nIt has to be labeled effectively.\nIt has to be behind the counter.\nYou have to be 21 years, 21, 8, 21 or older for that to happen.\nIt does not allow for vaping anymore, that product.\nIt does allow for business owners who do it the right way.\nWe met a couple of one from Atlanta area nearby here and one from the\nloan that actually did it the right way and labeled it and\nmake sure her constituents knew what she was selling.\nAnd that's what we're going for in this bill is to make sure it is\ndone in the proper manner.\nYes, I'm trying to keep it short and sweet, Mr. Chair.\nIf you have any other questions, I'd\nbe glad to answer it.\nThe biggest thing was, getting to label correctly,\nmaking sure it is what the people know\nwhat they're putting in their bodies,\nand make sure there's a little enforcement to it as well.\nThe first, it does allow for the, if it\nmanufactures, it doesn't do it properly.\nThe first defense will be a Mr.\nMeanor, the second defense would be a felony.\nSo they do they get that pass and we're not going after the store owner or the\nconstituent if the manufacturer doesn't do a popular or the distributor it's\nnot it's not the store owners fault if they catch it just because they\nreceive the shipment or if somebody buys it that way it's not their fault as\nwell so no harm for them if that happens and there's more in there I'd\nbe glad to go over and answer any questions I can Mr. Chair thank you\nI represent Townsend, I know that we've had one or two discussions on this bill too.\nYes sir.\nAnd I think we do have some questions from the committee, my vice chair, sort of\nKirkpatrick.\nThank you.\nYes ma'am.\nI, we've been having a fairly robust discussion about some other products, but in the Senate.\nBut what I wanted to ask is which department is accountable for sort of being in charge\nof this whole process?\nI can't see a department that's accountable for it anywhere.\nI'm sure it's in a code section, but...\nYeah, basically it would be, you know, help them.\nLaw enforcement, basically. Yeah.\nIt basically law enforcement, enforcing it as in if it's behind the counter,\nand if it's not labeled crackly or...\nCrackly.\nOkay.\nAnd we've talked to Sheriff's Organization and the Chief Supplies,\nand we have their support as well.\nThank you, Mr. Chairman. I apologize for my ignorance. I'm not exactly sure what\nCREDIM is and I've done a little bit of research before I walked in. I heard of it.\nIs there a medical use or their prescription there?\nIt's not a medical use for it. No, it's not a prescription. We talked about going\nthat direction first. The first bill, we're just going to ban it totally.\nAnd then as we got more into it, worked with the Cain and Ministry.\nThat part was lowered to an extent.\nbut basically it's an over-the-counter food product from Southeast Asia.\nIt's on the danger of less from DEA.\nYou will see opponents of cratum, such as mayo,\nclemenclinic others, and you have others who profess to endorse it.\nSo it's one of those where it's not monitored right now.\nIt's not regulated at all.\nIt's not a safe substance for George's to take right now.\nIt's considered an over-the-counter food supplement.\nIt is.\nCan I follow up?\nSure.\nOne question I have is I read somewhere\nthat it can be used as an aid to come off of pain mass.\nIs that...\nHave you heard...\nThrough...\nYeah, the 12 hours of testimony, I talked to many professionals.\nOne of them here was Dr. Lopez and George\npoison control center. One of the things we've learned is if they use it the right\nmanner, such as the low doses we're talking about, or some people use just the\nleaves, the substance itself, the plant base, that's the leaf form, that are the\npowdered from crushed leaves. You won't see you see people like that who are\nusing it properly to get through their pain or whatever else. It's when they\nstart up in the dose or putting the other products in there or the\na daltradicine or using this I equated to now with this bill. It's like alcohol. You\ncan go out and buy a case and you can drink it in one day, you can drink it over 12 days\nor 24 days. 12 days, 24 days a case and I can hurt you if you drink one or two a day. Two\ncans of beer. Same way with this bill with cratum is it still allows for that down the\nroad just like any other substance where you can abuse it if you really want it to, but\nyou really have to try hard to do it. Right now you don't have to try hard to do that.\nOkay. Thank you. And the age was increased from 18 to 21 also. Yes sir. Any other\nGerman huff statler?\nI've got a question on it, but I was going to state I believe it works on the mu receptors\nWhich is the same that the opioids work on the bodies. It was very mild, but on the same receptors\nBut you've got in here that it can't be smoked. I mean it that's kind of unenforceful at none of our\nThat's going to be hard when it probably keeps some of your vape shops who are just to advertise\nit that way.\nJust smoke it and vape it.\nIt's like anything else if you want to really abuse it you can go home and abuse it and\ndo what you want.\nNot much we can do about that, but it wouldn't limit the bad actors from advertising that\nway.\nGood.\nWe're encouraging others.\nRight now you'll see some kids for some reason.\nI think it's because it's like when I stopped home I live in South Georgia and I stopped\nand make it on the way back to make sure I can get through our sixteen and how that goes.\nAnd I was a little tired, so I had the choice of a\ncratum right there for on the counter,\nskittles, knickers, five-hour energy.\nIt's like, which one do I take?\nWell, I knew better than take the cratum.\nSo that's the kind of the situation in now where it's not\na good situation.\nAny other questions from the committee?\nWe did have some folks sign up for this.\nWe had Jerry Keane sign up.\nYou can certainly become an introduced yourself\nand tell us who you represent and podium years.\nThank you, Mr. Chairman and members of the committee.\nI'm here on behalf of the American Cradle Association,\nwhich is 15 million users around the country\nand over 200,000 in Georgia.\nWe're here to support Representative Townsend\nhis good work to make sure those products remain available\nto the consumer in a healthy, safe way.\nUnfortunately, like many other industries,\nthere are those, as Representative said,\nare bad actors who mislabel, who adulterate the product,\nand then cause problems.\nBut for many, many Georgians and millions\nacross the country, this is a valuable product\nthat they use, including two or three members\nof the General Assembly.\nAnd we want to keep safe access to them\nwhile at the same time protecting Georgia consumers.\nSo we support this bill in its current form.\nWe've encouraged a committee to vote it out in its current form.\nSo we can get it back across for a degree and down the governor's office and we will join 45 other states\nin passing a consumer protection bill protecting consumers rights to use\ncredit but also penalizing the bad actors.\nThank you.\nAny questions for Mr. King?\nJust, you brought it up so I apologize just for my education.\n45 other states do regulate this.\nYes.\nAnd are they behind the counter most of them?\nNo, some are and some are not.\nOkay.\nAnd did they mostly, and did they increase it\nfrom 18 to 21, or is 21 to age?\nNo, we're one of the few that did that.\nSo it's gonna be even stricter here at the most days.\nOkay, any other questions?\nOkay, we're creating questions here.\nSorry about that.\nThe bill on line 56 says it shall be modified\nchemically or otherwise, but then when you get back\nThey've talked about salts, isomers, optical isomers, salts\nof their isomers.\nI mean, that sounds like a chemical modification to me\nif it's the same as some other products.\nWell, no, when the product is manufacturing process,\nthere are food products only that are used to modify.\nThe problem center is that the bad actors use some other stuff\nthat's pretty dangerous by itself to mix with this.\nThere's a lot of counterfeiters out there\nwhat Representative Townsend's done,\nso we put labeling dosage amounts,\nwhat the products are,\nthey can only be used food,\napproved food additives to process it,\nand no other items.\nAnd if we find out someone's adulterating the product,\nthen we've got a penalty mechanism built in.\nBut if you're creating these isomers,\nit may be food products,\nbut you're chemically modifying the food product\nto get there with solvents and acids.\nI am I'm I'm I'm not sure about that part of it. Okay. Well, I I'm really not\nable to address that directly other than that. The product when it's presented in the right\ndosage is it poses no threat. It's when it's adulterated or abused in the amount of dosage that\npresents a problem. We have a poison control expert here, right? Yes, a\nYou have probably Dr. Lobas could answer that question for us, maybe.\nDr. Lopez, just introduce yourself.\nGive us your background quickly and we may repeat the question for you if we need to.\nGood afternoon, everyone.\nMy name is Gay Lord Lopez.\nI'm the executive director of the Georgia Poison Center.\nI've been there now for 34 years.\nThere's our poison centers, the only poison center\nin the state of Georgia.\nGreat.\nAnd Chairman Huffsell,\ndo you mind repeating the question?\nWhat my question is,\nearly in the bill, it says it shall not be,\nyou know, it's gotta be natural, great on plant,\nshall not be modified chemically or otherwise,\nprocessed or synthesized,\nor otherwise treated in any way.\nAnd then you go back to the products and it's saying\nit can any quantity of these products,\nincluding their salts, isomers, optical isomers,\nsalts of their isomers and salts of these optical isomers.\nYou know what I'm talking about, that's on line.\nWell, I guess it's 11, is this the same?\nOh, this is a different bill.\nMiners stuck together, I'm sorry.\nYeah, that's the, that paper club up there, you know?\nOkay, all right.\nSo we're not doing, there's nothing used in the process\nthat does that then, I'm.\nAll right, who's gonna dissect this force?\nMr. Ken, you sound like you would like to.\nAll righty, okay.\nYes sir.\nThank you Chair, my name is Eli Cohen,\nI'm also the most attest five.\nI'm an attorney at the Weatherington Law firm\nand I have the lawsuits that are suing the credit ministry\nfor credit and products causing my client's death.\nAnd we have worked with the American Creative Association.\nWe were both in favor of this bill.\nTantzier question center, that point\nabout should not be otherwise modified.\nThe finality of that line is that increases the product's\nstrength, because what you have is\ncredit and sold generally in two different forms.\nSo you'll have it in raw leaf or like powdered form, right?\nAnd this is generally just like the leaf\nas it would have come off the tree.\nBut then what you also get is you get companies\nthat synthesize and make extracts.\nAnd this is an incredibly potent form of cratum.\nAnd that's what this bill is really focusing on\nis these extra potent cratum.\nSo for example, the powders often sold in powders\nor pill forms, it would take 26 of these pills\nto equal this small amount.\nSo that's what that bill is focusing on.\nEnsuring that cratum cannot be enhanced\nin order to over strengthen it,\nbecause that's what's going to kill Georgians.\nWe have it all in here.\nSo yeah.\nI'm trying to do it quick.\nSenator Lovis wants you to what else\nthere in your pockets there.\nI got you.\nAll right, we're good.\nWe're good.\nSenator Satsler, floor cheers.\nThank you.\nThat was one of my questions that was going to be about the distillation of it.\nI heard some states have made the schedule one, which means just not available.\nHow many states have made the schedule one?\nIt's my understanding that if six states that currently have it banned completely, I think\nMr. Kean stood up and told you to tell you that one or two of those are\nconsidering. Ms. King, get to the mic if you don't mind.\nVermont just rolled that back and to regulation and Rhode Island's in the process\nSpeaker of the House is carrying the bill up there. So how many states now I guess is the question?\n45 regulated. 45 regulated. So there are five where it's banned. One of\nthose is in the process of rolling it back. And the USDA DEA chose not to\nregulate this treated as a food supplement they did not weigh in on it and\nthat's if you remember correctly some of you were here that that's Chairman\nMullis passed a bill out of this committee relating to Cratham and so\nthat's it's it's been an ongoing issue and we're tightening up further\nregulation that we're carrying that forward.\nGreat. Thank you.\nThe thrust of my question was really the percentages.\nI mean, I've heard the examples of where the leaves themselves\nare having effect and that's sort of how people became aware of it.\nAnd then the distilled version is what's much more potent.\nWhat are we talking about in the context of the Four Corners' Bill?\nWhat is authorized in terms of the distilled product?\nHow distilled is that?\nAnd how do we understand what we're voting on here?\nSure, so in line 61 through 63,\nthat goes over the actual specific numbers.\nSo there's two main alkaloids, or one alkaloid,\nand one metabolite inside of cratum.\nThe main alkaloid is metragene,\nand that is the substance that attaches\nto the immunoid period receptor\nto give you those opiate-like responses.\nAnd that is a product that is less dangerous\nthan the second alkaloid, which is then seven hydroxymetragene.\nThat is a highly dangerous one,\nand even the A.K.A. has testified\nfor the General Assembly that that is the danger substance,\nthat is the thing that can really kill you.\nAnd we have limited that in both amounts per milligram,\nso how much you can have as a ratio of the entire product,\nand amounts per serving in order to make sure\nthat you can't serve an ultra-strong product.\nFor example, this product would become outlawed in Georgia\nif this bill passed, the product that killed my client.\nSo that's where we really get to the heart of making sure\nthat these kind of extra strong products\nare not authorized in Georgia,\nand then tightening up the labeling requirements,\nand then actually putting some teeth behind it.\nBecause currently, while Georgia has a credit regulation,\nit has no teeth that has no enforcement mechanism.\nSo the desired end state is to create\nthose enforcement mechanisms for law enforcement.\nFor the questions from the committee.\nI appreciate that.\nSo we've gotten everybody on the list,\nexcept Mr. Jeff Breedlove, he is also if needed,\nhe is waving and we appreciate that.\nRepresentative Townsend, I'll let you have the last word\nand then we'll do the will of the committee.\nThank you, Mr. Chair.\nI'll ask you for your favorable vote on this.\nWe've come with the industry.\nWe've come with medical professionals.\nWe had quite a few more, as you would know,\nin 12 hours the testimony to testify before you.\nBut I promise we'll keep it a limited group.\nI think you've heard from all everybody\nthat we work together and work well together.\nThat's what's nice.\nAnd that's what I think we're supposed to do here\nin the legislature.\nAnd I just appreciate your committee here in this.\nAnd again, thank you so much for your time.\nWe appreciate that.\nI like your definition of working well together.\nSo the, but I have seen bills has been worse.\nSo we're good.\nSo I want to make sure we've exhausted all questions\nfrom the committee.\nNo questions, everybody feels comfortable.\nGot you.\nWe have a motion from Senator Brass,\nChamber of Brass.\nMotion do pass, LC339513S.\nOkay, we'll make sure we got the S on there\nand the correct number.\nSo we have a motion, we have a.\nWe're doing 181.\nWe have a second, second, Senator Jackson\nand any further discussion.\nAll those in favor, let's raise our hand.\nAll right, so it's unanimous, okay.\nAll right, so thank you very much.\nSenator Townsend, did any, who had,\nrefers to my memory on who was carrying this?\nSenator Albers.\nSenator Albers, okay.\nYou guys have got a great one that would also.\nOkay, all righty, so we'll got you.\nOkay, thank you.\nI was asking if Representative LeHood was here.\nhe was high beside Senator Lucas there.\nSo if you give us a minute to get to 497,\nHouse Bill 497, Representative LeHood,\nlet's see it passed unanimously out of the house.\nAnd okay, so the floor is yours,\neverybody, is everybody on 497?\nOkay, all right, floor is yours.\nHouse Bill 497 is a bill with broad support from two departments. One is the Department\nof Corrections, the others, the Department of Community Health.\nAnd what section one does is simply take certified medication aids and applies the same\nlanguage that they are working under today in assisted living communities and skilled\nnursing centers and a planet to state correctional institutions and the\nDepartment of Corrections has asked for this bill and the reason is because of\nwell it's been proven that medications can be safely administered with\ncertified medication aids over the last decade plus in these other settings and\nAnd also, there's, you know, severe workforce challenges in health care, namely, and this\nbill would help to alleviate some of those.\nSo again, there's a lot of underlying language here, but it's just simply restating what's\nalready happening in these other workplaces.\nAnd Section 2 pertains to certified nursing assistants and how they become certified.\nAnd what I've done here is work with the department to establish professional and educational\nexperience standards that must be met for a certified nursing assistant candidate to\nsit for the test.\nSo no standards are being changed.\nThe same testing standards will remain in place, but the requirements to be eligible to\nto take the test, the department's gonna look at that\nand put some reasonable standards\nand for professional and educational experience.\nAnd I'll be glad to take questions if there are any.\nSenator Hatchett.\nThank you, Representative.\nAnd I just wanted to say I was able to speak\nto the Georgia Department of Corrections folks\nand I know the new commissioner is all on board this bill.\nSo I just wanna say thank you for bringing it.\nThank you.\nI see in line 39 that they will be administering a commercially-repaired\nenum on still the physician. Did the physicians put you up to carrying this bill?\nYeah, I think they were tired of giving in them as to they wanted the nurses'\nmedication needs to start doing that.\nOkay, okay.\nAll right.\nAny other pertinent questions there?\nAll right.\nThey have follow up here.\nThank you. I'm not going to ask you about animals, but\nwhat I did want to just clear up is\nI don't see the qualifications\nthat make someone certified medication aid in here\nand I know the department.\nyou said they were going to write that up but if we're already doing that in\nassisted living there probably some in existence already and I just didn't\nknow what those were. Right so Mr. Hood here could speak to that if needed but\nthere is a pathway to become a certified medication aid and the prerequisite\nis that the candidate first has to be a certified nurse's aid and then they\ntake a medication aid course which is pretty short it can happen over one or\ntwo days and then they take a test that's a state test to state standards and there's\na database that the department manages in correlation with a certified nursing assistant database.\nThank you.\nAll right.\nAny other questions?\nWe have a couple of folks that signed Sheila Humberstone and John Watson.\nI think they're if needed, both are waving in support, both are in full support, and anything\nfurther to add?\nIf there's no other questions.\nAny questions?\nI'd be happy to entertain a motion.\nHave a motion to do pass on LC-339-442S from Senator Jackson, House Bill 497, second by\nSenator Kirkpatrick, any further discussion?\nAll those in favor say aye.\nAll those opposed, same sign, passes unanimously.\nThank you, and Representative LaHood, who was carrying that for you?\nI've spoken to my friend Senator Eccles, and she's agreed to carry it.\nOkay, great, okay, thank you.\nAll right, thank you.\nAll right, thank you.\nAnd last but not least, Senator James.\nWe appreciate that the yeah, if you might want to back up and I think you can move that\nThere we go. That's good take your time\nIt's almost out of power\nIf this charge I know what's going on it's tired of me all right. We're on Senate resolution 250\nCenter James\nThank you, Mr. Chairman and members of the committee.\nThis is a resolution urging the City of East Point and the City of South Fulton to take\njoint action to activate the East Point and South Fulton Hospital authorities to establish\na new hospital to serve the citizens of South Fulton.\nYou know, it's been a recent closure of the Atlanta Medical Center, South, as well as\nthe other medical center in downtown Atlanta.\nAnd it adversely affected our area, and this leaves more than 150,000 people without\naccess to emergency health care.\nAnd consequently, it also poses a problem for the world's busiest airport with the nearest\nhospital being approximately 10 miles or more, which is in downtown Atlanta.\nSo I have worked with Senator, how, rather, Councilman Joshua Butler in East Point, and\nabout 10 other Council persons in South Fulton, one in Heyville, one in East Point.\nare all in that area where the hospital closed and is affecting us not having anyone there.\nAnd I've talked to about 200 medical professionals, mostly doctors who were at one of those\nhospitals of steel servant in Wellstar.\nAnd they've been meeting like almost every week to see what we could do.\nAnd the reason we're asking for a hospital authority is because the sources of money for\na new hospital, if we aren't able to purchase the existing brick and mortar place that was\nthe well-stuffed.\nIf we can't purchase that, we have a place laying already on Camp Creek Parkway that\nis available.\nWe have money sources, but we need a hospital authority.\nI've talked to, I've gone before both of the City Councils for East, for East Point as\nwell as for the City of South Fulton. And we had a meeting November 9th, that was our first.\nSince then we've had three other meetings and we've had numerous conference calls.\nSo everybody is a board, but we need to have our CON and also our hospital authority.\nAnd we can get that if we create a hospital, a joint hospital authority.\nAnd so that's what we're trying to do now.\nAnd this will just give us an opportunity to go to the next level.\nSo hopefully by this time next year we'll have a new hospital.\nSo I asked for your favorable consideration,\nbut I can answer any questions that you may have.\nCertainly, any questions from the,\nyou got a couple of questions.\nWe're gonna go with Senator Brass with his hand up.\nThank you, Mr. Chairman, and...\nThank you, Senator James, for bringing this forward.\nI'm curious, what's gonna be the strategy\non the certificate of need?\nYou said 10 miles is the closest hospital.\nhospital closest hospital we we just had a hearing a few weeks back on a new\npotential hospital and had strong opposition from hospitals that were\nexactly 10 miles away so is there some strategy I'm unaware of that could\nhelp no grates is the hospital that I was referring to that was over 10\nmiles that were a little over 10 miles away. And they are now the trauma unit. They have\nto service all of Georgia. And so we still need a hospital in our area that can service\neverything. Hey, Bill, East Point College Park, Union City, Fairview, Palmetto, Chattahoo\nChieels, the city of South Fulton. And I might be leaving now. Palmetto, do you say Palmetto?\nYes, that's your city. Palmetto and Chattahoo Chieels. So, yeah, I think it's certainly\nan area that's going to be underserved and I'm just I'm just wondering how in the world\nwe're going to get a certificate in need when they won't just the department doesn't seem\nto want to we've been working with nobody wants to support that just seems like\nby to work with well star still we're not trying to well star is one of the ones opposing\nwell they might the last hospital that was 10 miles from them okay this might not be\na problem because they won the only other one both of them close that was\nservicing those in and grates now has a huge risk more responsibility than\nthey've had before so we've talked to will saw we were trying to see if they\nwould give us the CON that they have already and so we've been what they say to\nthat they want to see money they want to know what we're talking about so we\nWe don't, the doctors who I've been working with want to sit down with them because many\nof them are employed, I will start still.\nAnd so they're not going to leave.\nPlus, we have some of the other medical schools, including the More High School of Medicine\nthat's interested, and they told us we have to get to a certain point, and they'll come\njoin us.\nBut we have to be organized more, and they want us to be organized.\nWe know we've had probably more than 35 means and we are organized to be all professionals\nbut they want us to have a hospital authority so we can be under it or we need to identify\na private and a public source of money that will back up what they get.\nAnd we do have money that so many different groups are offering but we want to be under\nthe state so that it'll be all authorized and that's what happens with the\nhospital authority. All those places can get a hospital authority according to\nour Georgia law by just requesting it and they can join with any other\nhospital authorities that is in the area and so that's why we've talked to\nmore than just those two cities because we want to know what they want to do.\nOr a quick one last question, Mr. Chairman, if you'll allow, do we have to hospital authorities, do we have to set those up in statute?\nOr did they do that locally?\nNo, we don't.\nIt's done locally.\nSee you later.\nThat's, yeah.\nI don't.\nWe?\nSo authority goes through CON?\nNo.\nNo.\nDo you know that?\nNo.\nThey put on their own authority.\nOkay.\nI'm just never dealt with a hospital authority in my seven years. I'm just trying to learn here.\nI would legislate a council can answer that too.\nThere's a general law that as the center said basically authorizes every city and county\nat the state to activate their hospital authority. So what they would be doing is they\nwould have to have a city council or if you have a county called the county commission basically\nthe adoption of life resolutions that they want to do this.\nSo we'll take action on the part of that as well,\nthat we'll go back to the activities.\nSo our general counsel said that there is general law\nand both city councils would have to enact their resolutions\nto form an authority.\nDid I?\nThat's right.\nAll right.\nSenator Lucas, you got a question.\nLet me just say I'm that this is only a resolution,\nAnd so, you know, I don't, I don't sell problem with it, no problem from Senator Lucas Kirkpatrick, Senator Kirkpatrick.\nYeah, I certainly think there is a need and if we didn't have to go through this sort of going to need process,\nwe wouldn't even be having this conversation. But, so if you, did you say you've sat down with Wellstar about trying to get their, um,\nCON, East Point, and some of the doctors, including Dr. John Ross, who I've been talking to almost\nevery day for months now, is there. They have been in talks where they actually sit down trying\nto find out if they would be able to get the CON from them. And also, we can get a CON from\nAny of the other hospitals that have closed within the past 12 months, but we'd have to be in negotiate. Yes, the COM will stand for Georgia.\nFollow up, Mr. Chair. I thought that the CON of the hospitals being moved had to be within\ncertain number of miles, maybe three or like some small number of miles.\nWe have federal support, too, from some of our elected researchers.\nSo this is an urging resolution, and any further questions from the committee?\nNo.\nMove do pass from Senator Sessler, second, Senator Brass, all those in favor.\nsay aye. All those opposed like son passes unanimously. Thank you committee. We appreciate\nthat. Thank you, Senator James and thank you everyone. So we have our final meeting at\nthree o'clock on Wednesday to make sure everything gets out to the rules committee in time\nand that's it, any further business if not meeting adjourn.\nYou\n",
  "updated_at": "2026-02-12T10:39:00.763113+00:00"
}