{
  "video_id": "uw09kfWjx20",
  "url": "https://youtu.be/uw09kfWjx20",
  "title": "Georgia House - Day 24 (2026-02-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 24,
  "video_date": "2026-02-26",
  "duration_minutes": 44,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview:**\nThe session focused on a variety of privilege resolutions recognizing individuals and groups, as well as a substantive debate around House Bill 275 which would allow inmates in Georgia's correctional system to receive firefighter and emergency medical training. There was significant discussion and questioning from members of the \"funeral home caucus\" regarding the potential impacts of the bill.\n\n**Key Actions:**\nNone detected.\n\n**Bills Introduced (First Reading):**\nNone detected.\n\n**Notable Moments:** \n- Representative Connell delivered a passionate speech in support of HB 275, using Shakespearean references and rhetoric. \n- Representatives from the \"funeral home caucus\" extensively questioned Rep. Connell about the potential benefits and impacts of the bill for their industry.\n- Reps. Bentley, Ridley, Collins, and Williams all engaged in back-and-forth questioning and debate with Rep. Connell over HB 275.\n\n**Votes:**\nNo recorded votes detected.\n\n**Attendance:**\nNo explicit quorum notes.\n\n**Adjournment:**\nNo adjournment time or next session date provided.",
  "transcript": "This house will come back to order, house will come back to order, the clerk will ring the bill.\nLarker read the caption to a group of privilege resolution.\nCommending Nancy Gayle half for her service in the Armed Forces and recognizing February\n16, 2021 as female Veteran State Capitol.\nCommending Jacqueline Perry Blaylock for her service in the Armed Forces and recognizing\nFebruary 16, 2021 as female Veteran State Capitol.\nRecognizing commending Helen Ho, honoring the accomplishments of Barry Gordy and Jr.,\nhonoring the accomplishments of George Edward Simmons Sr., honoring the accomplishments\nof Australia, Darden Cochran.\nHonoring the accomplishments of Dr. Alan E. Gray, honoring the accomplishments of Pastor\nof Henry Lewis Tanner, honoring the accomplishments\nof Annie Ruth Darden Gilbert, honoring the accomplishments\nof Nancy T. Brockston, recognizing the Islamic Holy\nMonth of Ramadan, recognizing May 2021\nas Jewish-Georgian Heritage Month, and honoring\nthe contributions of the Jewish community, the state\nof Georgia, recognizing graduating Dr. Mark P. Becker,\non its retirement as President of Georgia State University.\nWe're recognizing commanding the Atlanta Black Chambers\nand for other purposes that completes the reading\nof the Provincial Resolutions.\nYou\nIs there any objection to adopting the privilege resolutions?\nThe chair here is none in the resolutions are adopted.\nWe are going back to the rules calendar, going back to the rules calendar, or a read\nDecaption to House Bill 275.\nHouse Bill 275, Representative Connell, the 26th and others.\nWe can title an act to amend.\nChapter 4, title 25, an Article 3 of Chapter 11,\nand Title 31 of the fiscal to Georgia.\nAnd Tate relaying the general provisions,\nrelative to fire, fire, fire, standards, and training,\nand to emergency medical services personnel,\nthat's bill ever referred to the Committee of Public Safety\nand Homeland Security.\nThat committee recommends that this bill do pass\nby committee substitute.\nYeah, we met.\nWe have, okay.\nThe word has it you're a member\nof the funeral home caucus.\nYou know, they used to say\nlawyers are in this place.\nNow it's under takers.\nMr. Speaker, ladies and gentlemen, with this great house, arise before you ask your\na favorable consideration on House Bill 275, LC392928S.\nHouse Bill 275 is a clear bill that dates back to the mid-70s,\nwhich its tenured version allows for inmates\nin our Georgia Correctional Institutional Program\nto go through a firefighter 101 program\nand to be a certified firefighter under these statues placed\non our Georgia Firefighter Standards and Training Council.\nThese inmates are hence selected by the chief\nthe Georgia correctional firefighters system and the wardens of their state prisons.\nHouse Bill 275 is a jobs creation bill.\nIt's an education bill.\nIt's a reform bill and a bill that can help rule Georgia and bill hope that will give\nthese inmates an opportunity better themselves when they return to our streets of Georgia.\nThis bill does not change that the exendmates described in the legislation cannot after being\nreleased get a job as a firefighter.\nWhat this bill does is gives them an opportunity to get their EMT and paramedic training while\nthey're incarcerated and after they have completed their basic firefighter 101.\nThere's a part of this bill that mandates that new civilian firefighters that had had\nhad formerly been incarcerated shall be drug tested twice in a two year period.\nsunsets after two years. This bill does not affect firemen, EMT, and paramedics that have\nnot been incarcerated. Mr. Speaker, Dean of the House, Mrs. Smirre,\nJardel-Eater, Minority Leader, they'll have a great freshman class. I want to thank\nmy 26-signees on to this bill and the support of my freshman class to present this today.\nI want to use a little Shakespearean passion and wisdom\nin my closing.\nQuoting one of these smart people\nworked for my freshman colleague, Mr. Leveritt,\nas he used to escape this well.\nHe used someone that I think lawyers like to quote.\nI'm going to use someone that funeral directors like to quote.\nTo be or not to be, that is the question.\nWhether it is nobler in the mind of a freshman legislator\nto suffer from these yields I'm about to face,\nthe slings and arrows of outrageous fortunes\nof these microphones in this room\nor to take arms against a sea of troubles\nwhich lies upon these boards with all these names.\nAnd by posing into them to die,\nto sleep, or to quickly yield this well.\nThis is a little Shakespearean McDonald's blend used in Hamlet.\nYou got that from representative Levart?\nWell, he used something to get him out of the well.\nWell, I thought he only knew Porter Wagner.\nOh, he does.\nDo you, uh, have you finished?\nYes, sir.\nOkay.\nI didn't know I was, I was pretty enthralled with Shakespeare\nthere, and your version of him, but I think people heard that and they didn't get their\nquestions answered. You've got several questions, Dee, and I'm sure you don't want to yield.\nI'll try it, yes, sir.\nOkay. Well, let's start with one of your colleagues, not a freshman, but a funeral home owner.\nChair recognizes Representative Bentley to the left, to your left.\nThat's a gentleman's yield.\nThank you, Mr. Speaker.\nThat's a gentleman's yield.\nI sure do.\nYes, ma'am.\nIt's not true that you did not recognize me\nas the funeral home caucus queen in your speech this now.\nI was getting to that, but I had to stop,\nbecause I could feel what was going on behind me.\nOK.\nIs it not further true, Mr. Representative,\nthat the real question in the funeral business is,\ncan you pay for this bill or not?\nCan you pay for this funeral home bill?\nAlways ahead of time, yes ma'am.\nAnd the last question is, and not further true\nthat if I support your bill, that you will help me\ndraft a bill to ensure that Walmart cannot sail cascus\nin the state of Georgia.\nNorcasco.\nThank you.\nI will support your bill.\nYou got some more questions?\nIs it like a Christmas tree back there?\nExcuse me?\nWe like a Christmas tree.\nI think a forest might be their accurate.\nLet's see.\nChair recognizes representative Ridley to your right.\nDoes my fluffy friend, Yoldo Wilman?\nYes, sir.\nAll right, so you said in this bill here\nthat it provides education and role modeling?\nIs that what you said?\nI said reform.\nReform?\nYes, sir.\neducation. Yes sir. All right. So up there in 612 you've been getting an\neducation and have you been getting any reform up there? Not in the\nfrat house. No sir. No. How about role models? Have you found any up there?\nYou are my role model every day. Because you waking me up at 4 o'clock in the\nmorning. Lord have mercy. I wouldn't be telling everybody that way what time\nwe get up in the morning. Chair recognizes Chairman Collins to your left\nThe funeral caucus is just not satisfied right now.\nThank you, Mr. Speaker.\nIt is a gentleman.\nWhat yield?\nYes, sir.\nIs it not true that this bill is going to bring much needed help to fire service in\nGeorgia?\nYes, sir.\nRule Georgia and throughout other areas where the NTs and Paramex were tired during the\nCOVID.\nA lot of job changing, yes, sir.\nand one more question, is it further not true\nthat when you came to my office asking to have this hearing\nthat you did say that I had the best tear I've been wanting\nthe funeral home caucus and not the queen, is that right?\nNo, sure, that is not correct, sir.\nThank you for this, Bill.\nDo you further you?\nYes, sir.\nTear recognizes representative Al Williams\nto your left for a question.\nWell, gentlemen, you always for you, yes, sir.\nYou look very familiar.\nAnother guy I know that's about 60-shorting you,\nbut is it not so?\nThat like the speaker, I was so moved.\nI'd never heard a freshman present\na bill with so many pluses for the consumer.\nI was taken by your concern for the living.\nAnd so, is it not so that you want to take care of us on this side of the river and get\npaid to go to the other side?\nThat is true, sir.\nThank you for the bill, Mr. Speaker, I yield the well.\nGentlemen, as yielded the well, is there any objection to the previous question being\nAny order to the chair, here's none, the previous question is ordered, is there any objection\nto adopting the committee substitute?\nThe chair, here's none, the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair, here's none, the report of the committee has agreed to shall this bill.\nNow pass all those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nMembers voted, have all members voted, if so, the clerk\nwill lock the machines on the passage of House Bill 275. The eyes are 132. The\nnasal zero. This bill having received the requisite constitutional majority is\ntherefore passed. Clerk will read the caption to House Bill 409. House Bill 409\nNumber nine, members and I'm gunner of the eighth to be entitled next to amend Article 4, Chapter 15 and Title 45.\nThe official go to George Antetti, relating to council for public officials and agencies.\nSo as a survivor, a process for state funded representation of certain judges and legal actions,\nresulting for performance or non-performance of their official duties.\nThis bill I've referred to the Committee on Judiciary.\nThat committee recommends that this bill do pass by committee substitute.\nChair recognizes representative Gunter\nto present the bill.\nThank you, Mr. Speaker.\nLadies and gentlemen, this is the\nJudicial Legal Defense Fund Bill.\nGenerally speaking, when lawsuits are found\nagainst judges, the Attorney General's Office\nwill represent them as a courtesy.\nBut if the lawsuit happens to include the governor\nor any other member of the executive branch,\nthey are conflicted out.\nand that leaves the judges without representation.\nThis bill is designed to take care of that.\nThere's a commission that will be formed in this bill.\nFive members appointed by the Chief Justice of the Supreme\nCourt, the Speaker, the President of the Senate,\nthe Governor, and the Council Spirit Court judges.\nThey'll serve for two years and they will make a recommendation\nto the governor after following the procedure\nthat's also set up in this bill.\nWhen you get sued, you have 30 days to file an answer\nand this sets out the timeframes for the judge\nto notify the commission and for them\nto go through their process and make the recommendation\nto the governor.\nHopefully there should be a few days left at the end\nof that that would allow for an attorney\nthat's appointed in the case to file an answer.\nThe governor controls this.\nThe commission only makes recommendations to the governor and the fund that this comes\nout of is the governor's emergency fund.\nSo I yield for any questions.\nYou do not appear to have any questions.\nThank you.\nI yield the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nCommittee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill will vote aye?\nThose opposed will vote no and the clerk will unlock the machine.\nhave all members voted.\nHave all members voted.\nIf so, the clerk will lock the\nmachine on the passage of House\nBill 409.\nThe eyes are 134.\nThe nays are zero.\nThis bill having received the\nConstitutional majority is there for past.\nClerk will read the caption to House Bill 509.\nHouse Bill 509, I represent a gains none of 17 to be\ntaught on the act to amend Article 1 of Chapter 30,\na ton of 33.\nThe fish go to Georgia annotated relating to general\nprovisions relative to group or blanket accident and\nsickness insurance.\nThis bill I refer to the committee on insurance that\ncommittee recommends that this bill do pass.\nChair recognizes representative Gaines to present the bill.\nThank you, Mr. Speaker.\nHouse bill 509 is a measure that will ensure that surgeons are pre-existing conditions\nor continue to be protective for Georgians.\nIf the Affordable Care Act is found to be unconstitutional in the Supreme Court or Congress or to repeal\nportions of the Affordable Care Act that protect pre-existing conditions, this will ensure\nthat we continue to do so here in Georgia.\nHappy to answer any questions.\nDo you do you for a question?\nI will.\nChair recognizes representative Davis\nin the gallery for a question.\nDoes the gentleman yield?\nI will.\nIs it not true that on lines 32-33,\nit is stated that insurance policies\nin this state shall make at least one reasonable price comprehensive major medical health insurance\npolicy available to residents. Is that not true? It is true. Does the gentleman better yield?\nSure. When it comes to reasonable price, would you not say that a $400,000 home is a reasonable price\nfor a millionaire, but unattainable for someone working on a living rage.\nSo the question is, what would you consider reasonable?\nSo what we did in this legislation is the Department of Insurance has to approve insurance,\nwould have to approve the rates and the plans offered by insurance companies and that\ngives legislative intent to the rates that they would approve and so that's why we include\nthat language in the bill do you\nfurther yield I will chair\nrecognizes representative park in\nthe gallery for a question thank\nyou mr. Speaker does the gentleman\nyield I will is it not true Republicans\nhave led at least 70 attempts to\nrepeal the affordable care act and\nfailed if that's the number is it not\nthat's true. Thank you. Do you further yield? Oh, yield for one more. Chair\nrecognizes representative McLeod in the gallery to your left for a question.\nIs it not true? Does the gentleman yield? I will. Is it not true that Georgia has\nhas never expanded the Affordable Care Act on the expansion of Medicaid?\nThat is true.\nOkay.\nThank you.\nUltimately what this measure is about, that it's protecting pre-existing conditions,\nand that's what this bill will do, and I'm going to speak, I'm happy to yield for one more question if there is one.\nThere recognizes the majority caucus who are representative Kelly to your right for a question.\nThank you Mr. Speaker for the gentleman yield.\nWill.\nRepresentative Gaines, isn't it true that this body in the last term, a worker that\na governor to pass a Medicaid waiver opportunity said that more Georgians would be covered?\nThat is true, and I believe that measure is going to, as we've discussed in the last term,\nis going to increase access and lower costs for Georgians across this state.\nAny way you yield for one more question?\nI will.\nIsn't it true that we here in this body don't have any control of what they're doing in Washington\nmail or at the Supreme Court. That is true. And will you further yield? I will. Isn't it true that\nthat what we're doing today is giving us an opportunity should the Affordable Care Act ever be\nstruck down that makes sure that George has continued to be protected for the preexisting conditions?\nThat's right and that's what this measure is all about is protecting preexisting conditions for\nGeorgia families. May I ask for your favor for the body's favorable consideration and we yield the\nwill? Is there any objection to the previous question being ordered? The chair here is none. The\nThe previous question is ordered, is there any objection to agreeing to the report of\nthe committee, which was favorable to the passage of the bill?\nThe chair here is none.\nThe report of the committee has agreed to.\nShall this bill now pass all those in favor of the passage of the bill will vote aye.\nThose opposed will vote no in the clerk will unlock the machines.\nhave all members voted, have all members voted. If so, the clerk will lock the machines\non the passage of House Bill 509, the eyes are 121. The days are 11. This bill having received\nthe requisite constitutional majority is therefore passed.\nThe House Resolution 77, a resolution supporting the creation of a state veteran cemetery in Augusta Richmond County, Georgia and further purposes.\nIt's brought by Representative Prince of 127th to refer to the Committee on Defense and Veteran Affairs and that Committee recommends that this resolution be adopted.\nChair recognizes Representative Brian Prince to present the bill.\nResolution.\nThank you, Mr. Speaker. House Resolution 77 basically supports the creation of a state veteran cemetery in the Augusta area.\nThis is part of a packet that the Senate has already done a resolution.\nWe have congresspeople who also are supporting this effort and we go to the Veterans Administration\nas part of their annual grant program to get funds to have a veterans hospital in our\narea.\nTo your questions, Mr. Speaker, I'll you go.\nDo you yield for questions?\nI do.\nChair recognizes Chairman Fleming, to your left for a question.\nThank you.\nThank you, Mr. Speaker, to the gentleman in the well.\nWell, is it not true that I appreciate your efforts in the whole Augusta area delegation\nworking on this project and isn't it further true that because we have so many veterans\nin the Augusta area that this is the next logical place in Georgia for one of these\ncemeteries?\nI think the gentleman knows what he speaks.\nDo you yield for one more question?\nYes, sir.\nChair recognizes the majority leader of the house.\nDo you arrive for a question?\nGentlemen, yield.\nYes, sir.\nWhere is the nearest cemetery to Auguston and Richmond, Canada?\nIt's in the Millage Vale area.\nMillage Vale.\nSo thank you for bringing this bill.\nThis is really important and sorely needed.\nThank you so much.\nThank you for your support.\nYou have no further questions.\nI get the well.\nThank you.\nIs there any objection to the previous question being ordered?\nThe chair hears none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the adoption of the resolution?\nThe chair here's none the report of the committee is agreed to shall this resolution now be adopted all those in favor of\nThe adoption of the resolution will vote aye those opposed to vote no and the clerk will unlock the machine\nwhat purpose does\nrepresent the or chairman House to rise\nI would like the roof\nI thought you had a parliamentary inquiry, maybe.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the adoption of House Resolution 77.\nThe eyes are 132, the nasor zero.\nThis resolution having received the requisite constitutional majority is therefore adopted.\nHouse Bill 395.\nHouse Bill 395.\nI represent a Belton on the 12th,\nbeing an act to amend chapter 10A of Title 43,\nthe fiscal of Georgia and today\nto relating to professional counselors,\nsocial workers, and marriage and family therapists,\nso as to buy certain licensing provisions\nis bill I refer to the committee on regulated industries\nthat committee recommends that this bill\ndo pass by committee substitute.\nChair recognizes the chair of the industry\nand the labor committee.\nChairman Warkhizer to present the bill.\nThank you, Mr. Speaker.\nMust be nice to have somebody bills\nthat need some of these substitutes.\nWhen Chairman Powell presented,\nChairman Belton's first bill, he was at 35,000.\nI believe he's been cleared to 42,000.\nThis bill, as I believe I'm keeping count,\nis the eight compact bills that this house has done\nover the last couple of years.\nand this is for professional counselors.\nIt merely allows those,\nespecially military spouses\nwho have completed all the requirements in their own state\nand then meet the minimum requirements in state of Georgia\nto hold that license and to practice in state of Georgia.\nNow, I'll stand for any questions.\nYou do not have any questions.\nThank you, Ms. Speaker.\nAnd I'd ask for your federal consideration\non House Bill 395.\nIs there any objection to the previous question being ordered?\nThe chair here is done.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is done.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill.\nThe chair here is done.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no, and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the\nmachines on the passage of House\nBill 395.\nThe eyes are 133.\nThe nays are zero.\nThis bill having received the\nrequisite Constitution majority\nis therefore passed.\nHouse Bill 86 will be postponed\nuntil the next legislative day.\nFor what purpose does chairman\nChairman Hauston rise.\nThey tell me you should be good now.\nI move that the roots be temporarily suspended so that a bill can be read\nfor the first time and assigned to committee.\nChairman Hausten has moved that the rules of this house to be temporarily\nSuspended to allow a bill to be read for the first time and assigned to committee the clerk will read the caption\nOn number house bill and representative Hausten in the hundred and seventy is me Todd an act to mend\nToddled to the fish go to Georgia. I had to relate in the agriculture\nSo it's a great the Georgia farmers market produce terminal development authority\nOn the motion of Chairman Hausten that the rules of this house be temporarily suspended\nto allow a bill to be read for the first time in a sign to committee is their objection.\nIs their objection?\nChair here is none and it is so ordered.\nAgriculture and consumer affairs.\nYou\nWhat purpose does Chairman Cantrell rise to make a motion?\nState your motion.\nMr. Speaker, I'd like to move.\nI'm not prepared to make my motion yet.\nI'm sorry.\nWell, let me let me help you out here in the interest of time. Are you wanting a bill to be\nRed for the first time in a sign to committee that is correct\nSorry, I'd like to move to suspend the rules so that a bill could be read for the first time. It's a good job\nThank you Chairman Cantrell great recovery\nChairman Cantrell has moved that the rules of this house be temporarily suspended to allow a\na bill to be read for the first time and assigned to committee the clerk will read the caption.\nUnnumbered House bill by Representative Cantrell, the 22nd me title of the act to amend Code Section 281,\neight of Article 1 and Chapter 7 of Title 45.\nIf it should go to George Annotated relating salary and allowances and memories and officers.\nMembers and officers of the General Assembly and General provisions regarding salaries and fees for public officers.\nOn the motion of Chairman Cantrell, that the rules of this house be temporarily suspended\nto allow a bill to be read for the first time in a signed committee.\nIs there objection?\nIs there objection?\nChair, here's none.\nAnd it is so ordered.\nThe measure will be assigned to the working group on public service compensation.\nreferrals from that group will go on to the committee own rules.\nThe clerical read that you might want to hear this now, you might want to hear this\npiece of business.\nClark will read the caption to an unnumbered House Resolution.\nUnnumbered House Resolution by Representative Burns 159th, a resolution relative to meetings\nand adjournments of the General Assembly.\nThe chair recognizes the majority leader of the House to present the resolution.\nThank you, Mr. Speaker.\nColleagues, you can see the Resolution, the German Resolution on the Board.\nAnd certainly, I'll express my gratitude to George Lee to do good in the Senate and their\nwork as we all pooled together to make sure we had a German Resolution here that's respectful\nof everyone's time and our efforts as we work through the remainder of this\nsession and as you can see we will we will next week we obviously a resolution\nwe're working under now has us in on Monday then we will have a committee\nworkday Tuesday session on Wednesday committee workday on Thursday and\nsession day on Friday and then crossover day day 28 will be on Monday\nMarch the 8th. I'll let y'all read it down to the date we all are paying\nattention to and that's Friday March 26th is a committee work day Monday March 29th\nwe will convene for legislative legislative date 39 then a committee work day\nand Sunday night on Wednesday March 31. We will be out of here in time for good\nFriday, which is important to us all. I thank this adjournment resolution, as I say, in conjunction\nwith the Senate's respectful of the members across the hall and will allow us to get the work we\nneed to get done in order where we have the remains, the remainder of this session that has begun\nhere and it will come to us from the Senate. So I would ask for your favorable consideration,\nI'll answer a question, but I think it's pretty firmly stated forward there.\nAnd we hope you will support our adjournment resolution.\nAny questions, Mr. Speaker?\nI'll take them if not, I'll you or the will.\nWell, I just want to be real clear that please express to the Senate the appreciation of the chair\nthat they corrected their topographical error on crossover day.\nI think the message was just delivered, Mr. Speaker.\nBut we do appreciate them working with us.\nAnd this I think is a good adjournment resolution\nand allows us to do the great work.\nWe're doing under your great leadership.\nThank you, Mr. President.\nYou have a question if you care to yield.\nYes, right, we yield for one.\nAll right, it's a good one I know.\nIt's from the Dean of the House.\nDean Smiley, to your left.\nI can remember the days when I used to work on the calendar\nand knows what goes into the fix of the calendar\nfor this Georgia General Assembly.\nSo I just want to tell you and my hats off to you\nand to speak in the leadership of this house\nfor bringing us something back that is so certain.\nAnd now we know when we're going home\nand leaving the people's business.\nSo I just want to make that comment to you publicly.\nAnd Calvin the setting is not an easy job.\nAnd especially when you have to deal with the Senate\nin setting it, so congratulations.\nThank you, Representative Dean of this House,\nCalvin Smurry, we appreciate those kind of words\nand you are correct, but with the great leadership\nof our speaker and our leadership team\non both sides of the aisle, this is worked out.\nWe appreciate the Senate as well.\nThank you Ms. Speaker, I'll yield the will.\nIs there any objection to the previous question being ordered?\nThe chair here's none, the previous question is ordered.\nIs shall this resolution now be adopted?\nAll those in favor of the adjournment resolution\nwill vote aye, those opposed will vote no,\nand the clerk will unlock the machine.\nto\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the adoption of the adjournment resolution.\nThe eyes are 121, the nasor zero.\nThis resolution having received the requisite constitutional majority is therefore adopted\nand the end is in sight.\nThorke will read the caption to a group of privileged resolutions.\ncongratulating commending ZEP, recognizing commending.\nMacau will let better, the 2020 volunteer of the year\ncongratulating commending, it's about time,\nboutique, the 2020 small business of the year\nand for other purposes.\nThat completes the reading of the privilege resolution.\nIs there any objection to adopting the privilege resolutions?\nThe chair here's none and the resolutions are adopted.\nBefore we go on to announcements,\nWe don't have many.\nI want you to join with me in wishing a happy birthday to, we had a number of members\nthat have birthdays tomorrow, February 27th.\nRepresentative Buddy Deloche is celebrating his 39th birthday tomorrow and he's already\ngone to begin the celebration.\nchair wishes a happy birthday to representative Vant Smith, chair wishes a happy birthday\nto representative Matthew Gamble, chair recognizes or wishes a happy birthday to representative\nBeth Moore, Representative Moore.\nAll right, we're going on now to announcements.\nPay attention to the announcements.\nThe chair recognizes Chairman Timothy Barr\nfor an announcement.\nHey y'all, Code Revision Committee,\nWe have a meeting, a quick meeting in 341.\nWe do have a measure to address today.\nSo we need folks there, 341, upon adjournment.\nThank you very much.\nChair recognizes Chairman Dollar for an announcement.\nThank you, Speaker.\nThe telecom subcommittee will meet immediately upon adjournment.\nRight upstairs in 403.\nI know everybody wants to get home.\nWe just have one bill so hopefully not a short hopefully a short meeting. Thank you\nIt appears that there are no other announcements\nChair recognizes chairman Martin for an announcement. I just want to make sure everybody got the announcement\nBut we are, we have canceled the House Higher Ed Committee due to the late hour.\nThere will be no House Higher Ed Committee today.\nWe'll meet next week.\nNow, I think more announcements.\nAll right, recognizes Chairman Newton for an announcement.\nAlso, HHS today will be canceled as well.\nHHS meeting is canceled.\nChair recognizes Chairman Dickey for an announcement.\nThank you, Mr. Speaker.\nMonday morning, nine o'clock,\nagriculture and consumer affairs committee.\nAlso, Monday is peanut butter and jelly day,\nbut it cannot be in the capital,\nso it's gonna be over at the sloppy.\nSo you're welcome to get your peanut butter and jelly\ntoasted sandwiches,\nor you might get sneaked something back\nin the offices, I don't know.\nbut maybe down in the ag room, I'd have some.\nHave a great weekend, thank you, Ms. Baker.\nLast call for announcements.\nChair recognizes the majority leader of the House\nfor a motion.\nThank you, Ms. Speaker.\nWe've had a great week.\nThank you for your leadership.\nMs. Baker, I'm moving to this House.\nStand adjourned until 10 a.m. Monday, March the 1st, 2021.\nMarch the first 2021.\nThe majority leader has moved that this house be adjourned\nuntil Monday, March 1 at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nIt appears that the eyes have closely carried the day.\nThis house will stand adjourned until Monday, March 1 at 10 a.m.\n",
  "updated_at": "2026-02-12T14:47:55.666676+00:00"
}