{
  "video_id": "uwaVfaHfzwM",
  "url": "https://youtu.be/uwaVfaHfzwM?t=1706",
  "title": "Georgia House - Day 40 (2026-04-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 40,
  "video_date": "2026-04-04",
  "duration_minutes": 213,
  "summary": "## Georgia House - Day 40 PM Session Part 1 (April 4, 2026)\n\n### Overview\nAfternoon session continuing the final day of the 2026 legislative session. Marathon session with extensive bill passage and conference committee reports.\n\n### Key Legislation\nThis session included passage of numerous bills through Senate substitutes and conference committee agreements, including:\n\n- Tax and budget-related measures\n- Education policy updates\n- Healthcare regulations\n- Criminal justice reforms\n- Local government bills\n\n### Session Characteristics\n- Fast-paced voting on final bills\n- Multiple conference committee reports\n- Senate substitute agreements\n- Sine Die preparations\n\n### Notes\n- Part 1 of the extended afternoon/evening session\n- Members working through backlog of legislation before midnight deadline",
  "transcript": "Mr. Clerk, how about ring the bell, let's get our folks in.\nhere and we could get started on our next house bill. Pretty important when if you're\nanybody else?\nAll right. All members, please come into the chamber. All members come into the chamber\nand look for your seat. This would be the appropriate time to do all of that.\nday is this. Day 40. Day 40. There you go. That's what day it is. Day 4-0.\nThank you members, hope you had a good lunch, nobody needs to take a nap.\nI've got some important business to take care of this afternoon.\nSo with that, I'm going to recognize Representative Matt Hatchett for a motion, Chairman Hatchett.\nMr. Speaker, I move that this House agreed to the conference committee report for House\nBill 68.\nMr. Clerk, will you read the caption to the conference committee report?\nThe committee of conference on House Bill 68 recommends both the House of Representatives\nand the Senate recede from their positions\nand that the Attach Committee of Conference Substitute\nto House Bill 68 be adopted, respectfully submitted,\nHonorable Matt Hatchett, representative of 155th District,\nHonorable Jan Jones, representative 47th District,\nHonorable Chuck Hestration, representative 104th District,\nfor the Senate, Honorable Blake Tillery, Senator,\n19th District, Honorable John F. Kennedy, Senator,\n18th District and the Honourable Stephen Gooch, Senator 51st District.\nThe gentleman is recognized to explain the conference committee reporting.\nThank you, Mr. Speaker.\nBefore I call Tyrone, I'd like to take a moment of it.\nThe gentleman will suspend.\nI don't know anything about each Tyrone.\nI thought I'd just loosen things up here in a little bit.\nThe best be careful, though, time runs, I'm gonna tell you.\nOkay, the gentleman's recognized.\nThank you.\nI'd like to take a moment of personal privilege and introduce three pages that I have today.\nTwo of my pages is their third and second year for doing that.\ndoing that, and they happen to be the children of our budget office, the director, Christine\nMurdoch, their, her children Maya and Miles Murdoch stand up.\nHow about that?\nI'm sure they'll get me back for that one day.\nthe other is Miss Danica Risha. She's from Millageville, but her mother grew up in Dublin\nand moved to Millageville for some reason. But she has been paging for us at least once\nand on several sunny days, but this is her seventh year paging, Danica Stanhope.\nThank you.\nY'all, it's been a journey to get to this point on the FY26 budget, but we have arrived.\nAnd I believe that we worked with our partners in the Senate and the Governor's Office to\nThe craft of budget for the next fiscal year that both makes the needs of Georgians and\nlives within our means.\nBased on interest earnings at Treasury to date, the governor has increased the revenue\nestimate this morning by $50.4 million.\nThis additional recognition of revenue helped us close gaps in the budget where the general\nassembly sought to ensure that the base was correct for programs with higher than anticipated\nutilization, like out-of-home care in DHS.\nIt also allowed the General Assembly to maintain its additional support for enhancements in\ncorrections and education.\nAs I told you in the budget left this house, the budget is highly focused on public safety\nand education.\nThat position still holds in the conference committee version.\nThere are a number of items that you won't see on your\ndifferences sheet because the Senate agreed with the House\nposition, like $22.7 million, including $10 million in\nnewly appropriated funds for recommendations by the Georgia\nCouncil on Literacy and adds in corrections for new\ncorrectional officer positions in state prisons and\ntechnology upgrades.\nThere were a number of differences between the House and the\nSenate that did not have to be resolved.\nDecisions like whether or not to utilize bonds\nor fully fund the promised scholarship\nwere never policy differences with the governor or the Senate.\nRather, they were simply different strategies\nemployed to balance the budget.\nHere are a few highlights of differences in the budget.\nAs I left this chamber, and as the conference committee\nhas recommended them. The House agreed with the Senate and the governor to utilize cash\nfor one more year to find capital projects. There are no bonds in the final version of\nthe budget. The conference committee returns to the governor's position of funding the\npromise scholarship at 1% of QBE earnings or $141 million. I know many of you have been\nreceiving updates on the number of applications and know that of the 10,000\napplications started, 5,100 have been deemed eligible for the scholarship\ntoday and that's as of today. This full funding allows for more than 21,000\nstudents the opportunity to participate in the program. We spent a lot of time\nperfecting the school safety legislation, funding for the S3 database that was\nincluded in the House version of the budget has been removed and the\nconference committee version includes $6.9 million for reimbursable grants\nfor qualified student advocacy specialists as authorized in House Bill\n268. I've heard from many of you who were concerned about apex. The Senate\nhad moved the funding for APEX to the Department of Education for Mental Health Services.\nWe understand that that funding mechanism would not have worked to continue the successful\nprogram.\nSo in the conference committee version, $9.2 million in APEX funding is restored to DBHCD.\nFunding for the new student support services program at DOE is preserved.\nI'll be at it a slightly lower number, this includes nearly $20 million for mental health support grants for middle and high schools, and $2.3 million to provide funds for school systems that, due to their size, do not earn full funding for a school social worker, the Senate added to the out of school care grants or boost 2.0, bringing the total to $12.5 million.\nFinally, one of the items that I'm most proud of in this budget is the poverty weight.\nIt's funded at $15.2 million.\nThese funds will impact more than 94,000 students in 59 school systems with more than 40%\nof their students meeting direct certification poverty criteria.\nIn health care, we were able to make a number of improvements to medical rate, Medicaid rates.\nUltimately, we were not able to include all the adjustments requested, but adjustments\nwere made for primary care physicians, dental codes, applied behavior analysts, neonatologists\nand maternal fetal medicine, and to provide AMS reimbursements upon patient pickup.\nThe federal Georgia is always on our mind to help address health care needs.\nThe House and Senate have provided $3.9 million to expand the newborn add-on payment for\nMedicaid delivery services in rural Georgia.\nThese funds will provide a $2,000 add-on payment for a total of $3,000 per delivery in rural\ncounties with a population of less than 35,000.\nAnd in rural counties with a population between 35,000 and 50,000, there will be a $1,500\nadd-on payment.\nWhile the amended budget was the vehicle for Hurricane Helene relief, this budget includes\nother item tied to HB 223 which is $17.3 million for a grant for local governments to provide\nreimbursements for timber severance taxes not collected. In the Department of Agriculture,\na number of reductions from the Senate version have been restored including an emergency management\nspecialist position and two meat inspector positions. The Senate also agreed to set up a\nfun with the Forestry Commission to provide speedier overtime payments to our\nforestland firefighters who are frontline responders when natural disasters\noccur across our country. This was an important priority for many of you. Also\nimportant to a number of you was maintaining the 2% provider rate increase for\nchild-caring institutions, child-placing agencies, foster parents and\nrelative caregivers. These agencies and people are meeting a need for our state and the\nyouth in their care and it was important to recognize the increased cost they're incurring.\nThe House has added to the Governor's recommendation for the now comp waivers and the Senate\nagreed to the House position to find a total of 115 new slides.\nIn the conference committee version of the budget, the Department of Correction receives\nan infusion of $200 million over the current budget.\nThis is $75 million more than the Governor's original recommendations, but the House and\nthe Senate agree on staffing and safety increases.\nHowever, the House went further and wanted to recognize the increased costs for food\nand health care in the base budget, but ultimately, we recognize that some of these additions\nare multi-year process and can be adjusted next year.\nThe commissioner has been a good partner and we appreciate it and he always picked up\nthe phone whenever we needed to just call Tyrone.\nFinally, gentlemen's out of order.\nBoosting the financial stability of the Employees Retirement System has been a priority\nof many in this chamber, and we worked hard in the budget over several years to boost\nthe long-term outlook of the system, while also addressing the needs of state retirees\nwho gave service to our state.\nWhile not as high as initially recommended by the House, the conference committee version\nof the budget includes an additional $10 million to ERS to increase the one-time supplement\npayment that retirees receive.\nMr. Speaker, that's a very high-level review of the most significant changes in the budget\nsince it left this chamber first.\nThis document and the accompanying highlights have been on your desk since about 1040 this\nmorning.\nI appreciate the opportunity to work on this budget on behalf of you and the citizens\nof this state.\nI want to thank our colleagues in the Senate, Rick Dunn and Lauren Curry in the Governor's\noffice, the subcommittee chairs, and the greatest budget staff in the country.\nFor all of their hours they put in to get this document for you to this place.\nBefore I go call Tyrone again, I'll take some questions.\nI've got to gather myself after you call Tyrone.\nGentlemen's going to yield for some questions, and I-\nYes, sir, Mr. Speaker.\nThis recognizes Representative Barry to your left about two-thirds of the way back.\non the left.\nThank you, Mr. Speaker.\nDoes the gentleman you?\nYes, sir.\nIs it not true that this budget increases the hope equalization grant for our HBCUs, which\nis a crucial benefit for our HBCUs students, but there is still not further true to do more\nfor full hope parity for our HBCUs students in the state?\nI believe that is correct.\nThank you for this bill.\nRepresentative Jasmine Clark to your left is recognized for a question.\nThank you, Mr. Speaker.\nDoes the gentleman you?\nYes.\nI'm using the tracking sheet for this, on 145.7.\nWhen it's talking about the voucher program,\nit references SB 82, which I believe is a bill\nthat we just passed that compels local school systems\nto not deny the charter school petitions.\nAnd in that bill we said the state will give you $250,000\nand start up costs.\nIt looks like the only appropriated $500,000.\nAnd that's $145.7, correct?\nYeah.\nWe did appropriate $500,000.\nThis is a grant program as we do in many items\nthrough the budget.\nYou never know how many will apply.\nSo this allows if we do have two that apply between now\nI'm saying I'm inded we do have the money to do what we have said we would do in the bill right but if we have three\nThen they would not get the 250 it'll be divided by three instead of two no we will they will be funded at 250\nThey just might have to wait a little while. Thank you\nRepresentive you looked into your left is recognize for a question\nThank you does the gentleman yield yes\nThank you for working so hard on our budget.\nIs it not true that on 228.4, line 228.4, we have although I am a little disappointed\nthat we did not end up with the 8.1 million to fund for the fall off of the victims\nof crime act money, we have settled on $3.1 million to give to victims of crime, sexual\nsalt centers, things like that, which is more than the governor's recommendation.\nIs that right?\nThat is true.\nThank you.\nThank you so much.\nThank you.\nIt is, you know, I think this is something that we need to all remember and consider from\nnow on that, you know, we are the state and we cannot, cannot replace all federal funds\nif they go away, so we have helped them and propped them up for a little while.\nFor everything that's stints and in the back to your left, recognize for a question.\nThank you, Mr. Speaker, with a gentleman yield?\nYes, to my favorite strawberry queen.\nThank you.\nIs it not true that my seatmate standing with me wanted to say that she really appreciate\nyou calling Tyrone, but you can't use her phone, is that not true?\nI believe I've heard that before.\nI won't say the rest of the song. I might get thrown out of here.\nWe thank you for your work on the budget. Thank you.\nMr. Speaker. Representative Holcomb has a question.\nMr. Chairman, if you'll take his question, then you have.\nYes, sir.\nThank you, Mr. Speaker.\nthis gentleman yield yes our budget is predicated on a revenue estimate and I\nthink it's fair to say that since we reconvened in January the macro\neconomic picture has changed pretty dramatically and just over the last few\ndays the Atlanta Federal Reserve estimates that were likely to see a negative\ndrop of 2.8% and GDP for this quarter and JP Morgan and Goldman Sachs both\nstate that the probability of a recession now is quite high because of the\nrecently imposed tariffs which represent the largest tax increase since 1968.\nSo my question is how comfortable are you with the probability that the\nrevenue estimates that make this budget will hold throughout the year?\nWell, I'm not an economist and I don't play one on TV, but you are correct, I believe\nthat things have changed and are changing.\nI would think that this, I would think this budget could stand.\nthere are huge slings then you know our role is this is our number one job and I\ndon't think anybody in here would have we could not object to coming back and\ncorrecting something that all of a sudden unforeseen by us we have to correct\nthank you\nMr. Speaker with that I would ask for the body's favorable consideration and I\nYou're the well the gentleman's you to the well. Are you suggesting that I should call Tyrone?\nOkay, use your phone. I don't have his number so we'll move on from that one\nGentlemen is you to the well on the adoption of the conference committee report on House Bill 68\nAll in favor of the adoption of the conference committee report, we'll vote yes.\nAll those supposed, we'll vote no, and Mr. Clerk, will you unlock the machine?\nAll members voted for what purpose is representing part Ken and rise.\nParliamentary inquiry.\nIs it not true that on today the commemoration of the assassination of Dr. Martin Luther\nKing Jr. this budget includes a cut to the King's Center?\nYes, I think I saw that line and I know that Chairman was, it worked diligently to maintain\nthose numbers and I think he's going to share some light on that for us, so for what purpose\ndoes Chairman Hatchett rise?\nParliamentary inquiry.\nMr. Speaker, is it not true that that particular line item for the Martin Luther King Center\nThere's a 125 increase to a line on it that approaches a million dollars a year.\nI'm sure the gentleman has washed out over the years and has embedded in our budget.\nAnd we're continuing to support.\nAn institution is important to our state and our country.\nFor what purpose is represented the race prize?\nMr. Speaker, parliamentary, agree.\nMr. Speaker, is it true, I'm not sure if I'm asking you, is it true that the budget chair\nis singing, calling Tyrone because when he went into the conference, he told a governor\nis in it. I'm getting tired of yours.\nGentlemen knows there's one more signature that has a\nI'm not going there, I have all members now voted, all members voted, if so.\nFort Purpose Reflective Barnes rise.\nParliamentary inquiry, thank you.\nState inquiry.\nIs it not true that based on the budget, there is a reduction in nutrition funds, but only because as many kids as we fed last year does not need to be fed this year.\nThat's a true success story and I know that Chairman has worked hard on those funds and has very\nclose to his heart and his mind to share it as it will. This house as well. Have all members\nnow voted? Thank you. If so, Mr. Clerk, will you lock the machine? On the adoption of the\nthe committee report on HB 68, the A's are 170, the Nays are five, and the\ncommittee of conference report is adopted.\nThe members, I want to thank the members of the staff of H Bro, all the committee subchairs,\nthe committee members and this house for standing behind the great properties of this house\nto make sure we took care of all these hardworking Georgians.\nChairman Hatchett, especially I want to thank you, your dedication and your commitment to\nthe people of Georgia getting this budget out.\nThank you, sir.\nMr. Leader, Majority Leader, Abstration, I think our work's done here.\nWhat do you think?\nI'm ready to make the motion when you give me the word.\nI think we could get you down to us on that one.\nThat's not a motion, that's of the E-Motion.\nThank you, Mr. Chairman.\nThis day off, Chairman Wheat-Hour is recognized for a motion.\nGive the gentleman the will of your attention, please.\nThank you, Mr. Speaker.\nI move that we agree to the Senate's substitute to Senate Bill 630.\nHouse bill or Senate bill?\nHouse bill 630.\nHouse bill 630.\nMr. Clinton, will you read the caption?\nHouse bill 630 to be entitled now to amend chapter 47 to title 43,\nthe fiscal to Georgia and the Senate relating to use motor vehicle and use motor vehicle parts dealers.\nChairman Weedauer is recognized to explain the Senate's substitute.\nThank you, Miss Speaker.\nThis is the licensure bill dealing with used motor vehicle dealers and used motor vehicle\nparts.\nIt had a little rider on it and the Senate decided they didn't want to ride no more.\nThat's all I got.\nI yield the will.\nThe gentleman has no questions, and he's yielded the well on the gentleman's motion.\nThe House agreed to the Senate's substitute to House Bill 630.\nAll those in favor will say yes, all those opposed will vote no.\nMr. Clerk, will you unlock the machines?\nAll members voted, all members voted on a gentleman's motion.\nIt's a clerk will close the machine lock the machines on the gemma's motion the Jay's are 173 the\nNays are one and the house was agreed to the Senate substitute to house bill\n630\nChairman Corbett is recognized for a motion\nThank you, Mr. Speaker.\nI make a motion to the House agree to the Senate's substitute to House Bill 371.\nMr. Clerk, will you read the caption?\nHouse Bill 371 to be entitled an act to amend Code Section 22260, the Fish and Go to George Anitator relating to Capitol Outlay funds generally under the Quality Basic Education Act.\nChairman Corbyn has recognized to explain the Senate substitute.\nThank you, Mr. Speaker.\nSection 1 of the bill is the original section and all we did there was just raised the\nstate's maximum authorization for capital outlay funding from $300 million to $375.\nThat was the original bill that we passed.\nSection 2 of the bill, the Senate substitute, that just ensures that any new elementary school\nbuilt after July 1, 2027, which includes a playground meets modern accessibility standards\ncreating truly inclusive play spaces for all children and that's the change in the\nBill Miss Speaker and I yield a well.\nGentlemen, House of further question.\nGentlemen, House of questions as yielded the well, all the gentleman's motion that the\nThe House agreed to the Senate's substitute to House Bill 371.\nAll those in favor will vote yes.\nThose opposed will vote no.\nAnd Mr. Clerk, will you unlock the machines?\nI have all members voted, all members voted,\nAnd if so, Mr. Clerk, were you locked the machines?\nAll the Germans motion, the A's are 168, the NA's are three.\nAnd the House has agreed to the Senate substitute House Bill of 371.\nRepresentative Gaines is recognized for a motion.\nThank you, Mr. Speaker.\nI move that the House agree to the Senate's substitute to House Bill 370 as amended by the House.\nMr. Clerk, will you read the caption?\nHouse Bill 370 be entitled back to amend Code Section 48534.\nI'll be fiscal to Georgia Anitator relating to out of the law and property tax bill forms.\nRepresentative Gaines is recognized to explain his motion.\nThank you, Mr. Speaker.\nThe caption of the bill and the bill that's before you are certainly different.\nThe original House Bill 370 was incorporated to House Bill 92, so that is no longer what\nHouse Bill 370 is.\nWhat the amendment you have on your desk does is it removes any existing language from House\nbill 370 and adds in the vape registry bill that this house passed in house bill 570 7159 to 12 earlier this session\nIt's exactly the same as what we have already considered in this body and we'll speak. I'm happy to answer a question if there is one\nThe gentleman has a couple of questions\nRepresentative Allen\nThe back to your left right now. Thank you. Does the gentleman yield? I do\nIsn't it true that this substitute that's on this bill now is being pushed by the tobacco\nlobby in an effort to create a monopoly on the sale of vaping products?\nNo, and in fact, I'll tell you just two days ago, the Supreme Court ruled on this matter\nand made it clear that whether FDA is done to try to regulate vaping, the FDA's active\nproperly.\nInstead, what this is trying to do is, again, under control, the massive influx of illegal\ndisposable Chinese vape products and my hope is this house will once again overwhelmingly approve this bill\nGentlemen further you sure\nWe're going to stay see Evans to your left is recognize for a question. Thank you mr. Speaker does the gentleman yield\nI do I want to just make sure the way I read it\nThere's nothing in this bill anymore that requires local school boards to put anything on bills\nDoesn't affect them at all is that correct 100% that's all removed from the bill. Thank you for the clarification\nThank you, Mr. Speaker. I'll yield the well and ask the by joining us and trying to get this\nBaping crisis under control. Thank you gentlemen answered all this questions and he's yielded the well\nIs the objection to adoption of the House amendment?\nHearing none the House amendment is adopted on the gentleman's motion to the House agree to the Senate substitute to House Bill\n307 as amended by the House all those in favor will vote yes all those opposed will vote no and\nAnd, Mr. Clerk, will you unlock the machines?\nI have all members voted, all members voted if so.\nvoted if so, Mr. Clerk, will you lock the machine?\nOn the gentleman's motion, the Yays are 141,\nthe Nays are 31, and the House has agreed\nto the Senate's substitute to House Bill 370,\nas amended by the House.\nI'm trying to check.\nyou\nare\nSpeaker, I move to agree to the Senate amendment as amended by the House on HB 491.\nMr. Clerk, will you read the caption?\nHouse 491 to be entitled back to amend Article 1 of Chapter 3 to Article 2, Chapter 4.\nThe title 27 of the Efficient Court of George Annotated related to hunting and non-conversial fishing.\nThe representative Chastain has recognized to explain the Senate amendment and the House\namendment.\nGentlemen's recognized.\nThank you, Mr. Speaker.\nHB 491 passed the House last week, actually 171 to 2.\nThis is the air gun and the airboat bill.\nThis substitute actually just strikes through the Senate amendment.\nIt makes the bill exactly like it was when we presented it last week in the house\nThat's the amendment\nGentlemen has a question represented Cameron\nYou're right. Does this take out the extension of the deer season? Yes, sir. It does. Okay. Thank you\nGentlemen, you have one more question. Yes, we'll put this now\nYes sir.\nSo essentially this will go back to the underlying bill which was just about catfish.\nWhich was what?\nAbout catfish.\nYes sir.\nOkay.\nThanks everybody.\nYes sir.\nThank you.\nBy part is in support for catfish.\nYes sir.\nCertainly.\nThank you.\nThank you.\nWe won't go about catfish again.\nNow we did that one.\nMon is recognized for a question to your left up the center out. Thank you mr.\nSpieger as a dumb and yield just as a false that did we figure out if catfish are\nin danger or not since the last time we spoke about it. They're not in danger. No thank you.\nYou speak right here on the well. Good answer. I'm glad you you were the well\nbecause that one had gone deep six last time. Is there any objection to the adoption of the house of\namendment. Hearing in the House amendment is adopted. All the General's motion that the House agreed to the Senate amendment to House bill\n491 as amended by the House. All those in favor will vote yes. All those opposed. We'll vote no one. Mr. Clerk. Will you unlock the machines?\nAll members voted, all members voted, if so, Mr. Clerk will you lock the machines.\nThe gentleman's motion to yeas are 170 days or zero and the House has agreed to this Senate amendment to House bill 491 as amended by the House.\nmembers we'll move on to the rules calendar I'm going to ask the clerk will you read a caption to Senate bill 10 Senate bill 1-0\nSenate bill 1-0 by Senator Goodman of the 8th and others to be titled an act to amend Code section 15-6-2 with the official code of Georgia annotated relating to the number of judges and superior courts\nSo it's a revive for an additional judge of the Spirit of Courts, the Lapa Ha, Judicial Circuit.\nI spill them for the Committee on Judiciary.\nThat committee recommends that this bill do pass by a Rules Committee substitute.\nRepresentative Tray Kelly is recognized to present Senate Bill 10.\nThank you, Mr. Speaker, colleagues.\nI bring before you SBTN, which was originally a bill that was going to add a new judge to the Lapa Ha Circuit.\nThat measure was already passed by Representative Ford,\nand so it will no longer be needed.\nAnd so we use it as a vehicle for judicial officers\nin circuits to have over 15 superior court judges\nto help improve efficiency throughout the process.\nMr. Speaker, it's a simple bill passed\nthe Judiciary Committee unanimously\nwith bipartisan support.\nI would ask for your favorable consideration.\nI'd probably glad to take your questions.\nGeneral, I have no questions.\nThank you, Mr. Mayor.\nYou'll be well.\nThe gentleman has yielded the well.\nIs there any objections to the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to withdrawing the committee's substitute?\nHere in none, the committee's substitute is withdrawn.\nIs there any objection to adopting the substitute offered by the committee on rules?\nHere in none, the rules committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill?\nHearing none the report of the committee's agreed to shall.\nThis bill now pass, all in favor of the passage of the bill.\nWe'll vote, yes, all those opposed.\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nHow many?\nHello, all members voted.\nHave all members voted if so, Mr. Clerk, will you lock the machine on the passage of Senate Bill 10, the yeas are 161, the nays are 7, this bill haven't seen the requisite constitutional majority is therefore passed.\nMr. Clerk, will you be decaptioned to House Resolution 347?\nHouse Resolution 347.\nA resolution urging all high schools to establish flag football programs for girls.\nThis resolution haven't been assigned to the committee on special rules.\nCommittee recommends that this resolution be adopted.\nRepresentative Brent Cox has recognized to present the House resolution 347.\nThank you, Mr. Speaker.\nToday I come to you as an urging resolution from this body that we encourage all Georgia\nhigh school athletic programs in this state to start girls flag football.\nThe day we dropped this resolution, we have since had 34 high schools start participating\nin creating their new girls high school football.\nCurrently there's 457 schools in GHSA, 307 of which are currently participating, over\n9,000 girls.\nIn 1972 is when Title IX occurred, and that was the origin of when Flag Football began\nin this country.\nThis has gained some great recognition.\nIf you'll look up on the board, the Author Blank Foundation and the Atlanta Falcons\nCurrently, you're offering a grant and I encourage any one of you,\nwe have 150 high schools left to get programs going.\nAnd you can QR code and you can get that information and get it back to your high schools.\nBut they're offering five to $10,000 grants to each school to help them start it.\nY'all coming up in Los Angeles is the Olympics.\nThey're going to be offering Flag Football.\nThis is an incredible opportunity for our high school students to potentially become\nfuture Olympians.\nThe Falcons, the NFL, all are fully behind in supporting this.\nOur local sports broadcasters are fully behind this.\nWe will be the first legislators across the country to do this.\nSo I ask for your favorable support and strongly encourage you, let's get 100% support across\nthis state.\nMr. Speaker, I yield for any questions.\nYou have several representative Wilkerson to your left and the back is recognized for\na question.\nThank you, Mr. Speaker.\nIs the gentleman yield?\nYes, I do.\nIs it not true that the McKeecher and High School Indians flag football team is one of\nthe top ranked teams in the state?\nActually the nation and they are state jabbies. Is that not true my friend? I do believe you're 100% correct\nTo your left representative Jasmine Clark is recognized for a question. Thank you mr. Speaker does a gentleman you?\nYes, I do is it not true that I love\nWatching our girls play flag football and while we are urging schools\nI would also urge us to consider how much it cost to actually have\nhave these types of sports at schools and hopefully we can get funding so that we can help these schools start these five football programs.\nI understand and that's where author Blank and his foundation has poured into our community to do such things as that through private money.\nAnd I urge you to create resolutions to move forward with it as well.\nRepresentative Scofield is recognized for a question to your right.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nYes, I do.\nI really like this program, and I clicked on the link.\nAnd is it not true that you said that they're looking for more ways for other schools to engage?\nOr more funding?\nMay I miss something?\nWe're looking for the remaining 150, at least in GHSA, to finish out and starting their programs.\ntheir programs and that they can use this grant money to help start their programs.\nThere's currently 307.\nOkay, because I'm looking at the form right now and it says, thanks for your interest,\nbut it's closed.\nWe're no longer accepting new submissions.\nIt's on the right side.\nI clicked on the link.\nI will check and see, but right now I know that the author blank foundation and the Atlanta\nFalcons are fully behind us.\nAll right.\nThanks.\nSo, ladies and gentlemen, I had conversation with GHS yesterday and they were wide open.\nlooking and then the blank Atlanta Falcons are certainly behind it.\nRepresentative Richardson is recognized for a question to your right, yes.\nYes sir, I do.\nIs it not true that Greenborough High School in Columbia County is not one back-to-back\nstate championships?\nI know that you know what you're talking about coming from Augusta.\nThank you.\nMr. Speaker, if there's no more questions I'll yield the way.\nI do have another question.\nRepresentative Franklin to your left.\nIt's recognized for a question.\nYes.\nIs it not true that Southeast Bullock is one five,\nfive back-to-back state championships?\nAnd is it also not true that I think Southeast Bullock\nand Flagfootball team can beat all y'all's Flagfootball team?\nOh, there we go.\nWhere's Tyrone?\nLet's see.\nA gentleman knows about football.\nRepresentative, do we be clean?\nIs recognize for a question?\nThank you, Mr. Speaker, the gentleman you.\nYes, I dig, sir.\nIsn't it true that I support this program?\nAnd I know that the Lannan Falcons Foundation,\nas well as Arthur Blank, has put a lot,\na lot, a lot of money in making sure\nthat girls flag football succeed.\nAbsolutely 100% correct.\nThank you for what you've done for us as well\nwith the Falcons.\nAnd thank you for bringing this resolution.\nThank you.\nMr. Speaker.\nAny more questions, Mr. Speaker?\nYou've got a whole bunch of several.\nReps of two, you want one more?\nI want the representative Barrett\nto your left, just recognize for a question.\nOkay, last one, Mr. Speaker.\nThank you, thank you, Mr. Speaker.\nDoes gentleman yield?\nYes, I do.\nIn the spirit of this awesome, awesome program\nthat you're endorsing, so energetically behind,\nwould you consider encouraging the first annual house\nversus Senate flag football game.\nI think that is a great idea,\nand we'll, we can continue the softball,\nbut let's bring flag football to the Capitol.\nAnd it's a great idea, Mr. Speaker.\nI yield the well, and I, I just called Tyrone,\nand he said, please leave.\nThank you.\nHe just sent me his number, by the way.\nThanks.\nAppreciate you, Mr. Commissioner.\nYou're a good man.\nGentlemen, as you were to the well,\nIs any objection to the previous question be in order to your here here's none\nThe previous question is ordered is any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution\nHearing none the report of the committee has agreed to shall this resolution now be adopted all in favor of the adoption of the resolution will vote yes\nAll those opposed will vote no and Mr. Clerk will you unlock the machine\nhave all members voted all members voted yes so Mr. Clerk were you locked the\nmachine all the adoption of the resolution the yeas are 172 the nays are 0 the\nThe resolution he ever received to requisite constitutional majority is therefore adopted.\nMr. Clerk, would you read the caption of Senate Bill 101, 101?\nSenate Bill 101 by Senator Robertson, the 29th, to be entitled to amend chapter 12 of the Title 31 of the fiscal to George Annotator related to the control of hazardous conditions, preventable diseases and metabolic disorders.\nThis bill I've referred the committee on public and community health.\nThat committee recommends a disbilled do pass by committee substitute.\nRepresentative David Clark has recognized to present Senate Bill 101, representative Clark.\nThank you, Mr. Speaker.\nI bring today Senate Bill 101, it was the language in that bill.\noriginally was House Bill 87, we passed 171 to 2.\nIt has to do with the orthotics and prosthetics to,\nso that everybody can move,\nmovement that a lot of y'all met,\nElliott and Jared Wallace and Mohammed Mousquaw.\nAnd so the sponsor who has sent Bill 1801\nallowed me to remove his language\nand put my language in there.\nElsie.\nGentlemen, has no questions.\nOh, you're not doing I'm sorry, that's my bad.\nAnd with that as asked for your favourable consideration and vote yes, I'll be glad to take any questions.\nGentlemen, does have a couple of questions.\nRift the department to your whip park right in front of you to your left is recognized.\nThank you, Mr. Speaker. I appreciate the gentleman's earlier bill with respect to prosthetics.\nDo you have the LC number by any chance just to make sure that members are voting and understanding the right version of this bill?\nI do not have the else your number in my head right now to be recorded\nHelp me with that just a moment. Thank you, sir\nBut this isn't with respect to prosthetics not to\nThe muscular district symbol one zero one only has house bill 87\nLanguage in there. We remove these\nSenate bill one zero one language that came from the Senate and we added\nHouse by a seven and I talked with a sponsor and he's agreement and would send to the Senate and then he'll agree to it\nand we'll pass it to the Governor's desk.\nThank you.\nThank you.\nGrape's name is Scofield.\nI just recognize for a question to your right.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI yield.\nAs soon as we get the LC number situated,\nis it not true that this is one of the best bills\nthat you and I worked on that we'll pass today?\nYes, ma'am, and thank you for all your help.\nMr. Will, it's LC600167S.\nWhen the city Cooper is recognized for a question in the back when you're right.\nThank you, Mr. Speaker.\nWill gentleman yield?\nYes, ma'am.\nIs it not true that that bill came out of my committee and that I okayed?\nThe removal of what was in the original bill and let you put in your bill. Yes, ma'am. Thank you\nAll right. Thank you. With that Mr. Bigger. You're the well and asked for your favorable consideration of Senate bill 101\nThank you gentlemen had new further questions. He's\nMr. Speaker, colleagues, I rise today in strong support of Senate Bill 101 as substituted\nby the health committee on public and community health.\nThis legislation addresses a fundamental issue\nof equity, access and dignity in our healthcare system.\nSenate Bill 101 ensures that Georgians\nwho rely on orthotic and prosthetic devices\ncan live a full independent lives,\nmaximize their rehabilitation,\nmaximize their functional capacity.\nLet me be clear, these devices are not luxuries.\nThey are not cosmetic.\nThey are medically necessary for function.\nWe are talking about artificial limbs, custom designs,\nsupports, and mobility aids that enable our fellow citizens\nto walk, work, play, bathe, care for their families,\nand anything that you do, they will be able to do.\nAnd yet, too often coverage for these essential devices\nis either denied or limited by outdated policies\nthat don't reflect the real needs of the people\nthat we serve, Senate Bill 101, changes that.\nIt requires health benefit policies in Georgia\nto provide coverage for orthotic and prosthetic devices\nwhen they are medically necessary.\nIt ensures this coverage supports not just survival,\nbut quality of life, covering devices\nthat enable physical activity, personal hygiene\nand essential job functions.\nThis bill, colleagues, brings Georgia in line\nwith national clinical standards.\nIt recognizes that a joint may need to be replaced\nwhen a person's body changes, and that a limb may need\nmore than one device over a period of time\nand at any one time.\nIt includes not just the device itself,\nbut the education, the training, the fittings,\nand the repairs, everything a person needs to be effective\nin their mobility.\nImportantly, Senate Bill 101 sets reasonable limits,\nno more than three devices per limb over three years.\nAnd it allows insurers to deny coverage\nfor misuse or theft.\nThis is a balanced approach.\nAnd to my colleagues concerned about cost, I hear you.\nBut consider this, restoring mobility reduces long-term health care expenses.\nIt reduces secondary conditions, prevents hospitalizations and increases employment and mobility ability.\nIt empowers Georgia's to live to their full capacity.\nAnd colleagues, I ask that the members of this body do vote in favor of Senate Bill 101.\nbecause today we have a chance to say we see you, we value you, and we are not going to let insurance company stand in the way of our rights to live a full and healthy life.\nI urge your favor consideration, and I respectfully ask for your yes vote on Senate Bill 101.\nThank you, Mr. Speaker, and I yield the will.\nNice job, the lady is yielded the well.\nThat concludes the speakers on the bill.\nIf we do have a minority report, is there any objection\nto the previous question being ordered?\nHearing none, the previous question is ordered.\nWe do have a minority report.\nRepresenting part canons recognize for up to 20 minutes\nfor the minority report.\nI don't need that, I love you.\nThank you, Mr. Speaker.\nThank you, members.\nI want to be very clear this minority report\nis not about the substance of what this bill does\nfor our communities that need this health benefit.\nThis minority report is specifically\nabout an efficient government and a process\nto understand what happens once we do this.\nWalk with me through this.\nAny plan starting in 2026?\nPrivate plans in the state of Georgia must provide this.\naccess. So, 2026, 2027, 2028, 2029, 2030. So, that's a set of five years of data.\nOn line 112, it speaks to those five years. So, thank you in the bill for speaking directly\nabout what we want this report to include.\nBut online 105, it says that the report is not due\nuntil July 1st, 2032.\nThe questions that we asked in committee was,\nif this is such an important piece of legislation\nthat so many of us agree with,\nwhy would we request that a department give us a report\ntwo and a half years later?\nSo again, we're hopeful that there will be some work on this legislation to bring that report sooner and to make sure that those who are receiving this health care benefit have timely processing.\nWe want to thank those who have publicly stated that they will continue to work to get the state health benefit plan to also participate in this as currently this measure does not include it.\nAnd that's all that we have.\nI will be voting in favor of this measure,\nbut wanted to be clear that this minority report is about process\nand making our government more efficient\nwith the number of claims submitted,\nthe number of claims paid,\nand the total amount that it costs for our state.\nThank you, and I yield.\nThat concludes the speakers on the minority report.\nThe lady is yielded the well, we don't have anyone taking this chairman's time so we're\ngoing to move on.\nIs there any objection to adopting the committee's substitute?\nHere in the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill?\nHere in the report of the committee's agreed to, shall this bill now pass all in favor of\nthe passage of the bill?\nWe'll vote yes.\nAll those opposed.\nWe'll vote no.\nwhere you unlock the machine.\nI have all members voted.\nAll members voted.\nIf so, Mr. Clerk, were you locked the machine?\nOn the passage of Senate Bill 101, the A's are 167, the NA's are two.\nBill Henry see the records of constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to Senate Bill 204, 204?\nMr. Clerk, will you suspend just for a moment?\nI want to recognize a former member of this house who has had a distinguished career in this legislature and\nstate government, my friend J. Neill, let's welcome J. Neill to the people's\nhouse back, former member J. Neill.\nMr. Clerk, will you apologize, Mr. Clerk? Will you read the caption, Senate Bill 204204?\nSenate Bill 204 by Senator Jones, the 22nd to be entitled back to a men code\nsection 1777.1 of the official go to George annotated relating to trial upon\non accusations in certain felony and misdemeanor cases,\nand trial upon plea of guilty or no-one contender.\nThis bill ever referred to the Committee\non Judiciary Non-Several Act Committee\nrecommends this bill do pass by committee substitute.\nChairman Ellen Powell was recognized to present Senate Bill 204.\nThank you, Mr. Speaker and ladies and gentlemen, the House.\nI bring to you this afternoon Senate Bill 204, there's two sections of this bill which\nnormally is the things that we see in the latter days that we combine bills, so I bring\nthese to you today.\nFirst section that you'll be looking at is reinforcing the preemption clauses that this\ngeneral assembly has passed over the years about what those parts of the state law are\nthat it's important.\nNow I would tell you right now that this is a reinforcement because it raises penalties\nfor those cities and counties and political subdivisions that may violate the preemption\nclause to the weapons law in this state.\nA lot of people want to talk about that this is about the Second Amendment rights of people.\nThis is more about keeping order in the administration of the laws in this state.\nAnd I'll tell you a little bit about why this was brought over in the Senate.\nApparently, we have one of the cities in the state that decided to pass a local ordinance\nThat said that if you have a car\nAnd I'm not sure quite frankly if it was a car that was broken to whether it was locked around a lot\nAnd if somebody stole your weapon, then they charge a thousand dollar fine\nIf you didn't report it within 24 hours, they charge just secondary thousand dollar fine\nIf you didn't pay that, then it's a 30-day penalty of incarceration.\nAnd it sounds like this may be a second amendment issue, but there's a bigger issue, and that\nis the preemption status of state laws.\nI will tell you, if you can imagine it, we have 600-plus political subdivisions in Georgia,\nthese counties, towns, and if all of these cities and counties preempted state law, then\nwe would live in a chaotic situation, ladies and gentlemen.\nSo first and foremost, that's what this is really about.\nYes, there's somewhat to the Second Amendment rights because that seems to be one of the\nbiggest issues that people want to talk about, but the bigger issue to me is the preemption.\nAnd I know a little bit about preemption, when I was a younger legislator, there was\na legislator by the name of, well, he made one his name mentioned, but he and I passed\nthe preemption law back in the mid-90s.\nAnd that preemption law said that if there was a violation, it was a $100 fine.\nNow I can only tell you what I've been told, they've put these $1,000 fines on there, and\nAnd then it was reached out to the attorney general to reach out to this particular city.\nAnd what came back was that we are getting the $1,000 penalty on these $100 find that\nmean anything.\nWell, at that time, we thought a 30 something years ago, we thought that $100 might have\nbeen a lot of money at that time, but apparently not $100 in and $100 today isn't much reason\nfor these cities to bring up the state law.\nSo what we're doing today is what you see in front of you,\nand I'll go over the part section one first.\nWhat we're saying is that if you have been subject to\nor grieved by an act, rule, or regulation,\nthat you have a right to appeal to the courts.\nAnd if you're the prevailing plaintiff in that,\nthen you can get injunctive relief.\nThen there's a civil action which you can recover attorney's fees.\nIt goes further to say that then we reduced it from the 50,000 penalty that came out of the Senate to 25,000.\nBut actual damages, if you have actual damages, or whichever is greater plus expenses of litigation and\nreasonable attorneys fees, then you can collect or you can claim for liquidated damages or\nthree times the amount of expenses.\nThat is a message to send back that preemption.\nWe are the legislature.\nWe are the state government.\nAnd we are the ones who write these laws,\nbecause if not, there would be absolute chaos.\nAnd if you went through 600 different political subdivisions\nand all of them had a different law,\nwe would be embroiled in more conflicts\nthan you can imagine.\nSecond part of the bill, ladies and gentlemen,\nThis deals with the criminal procedures with district attorneys.\nAnd if these are offenses that are not considered of serious\nviolent felonies, such as sexual felonies, violent felonies,\nif these are what they call minor felonies,\nthen they can be prosecuted under an accusation\nwith that grand jury appearance.\nThat, ladies and gentlemen, is what this bill does.\nI would implore you to consider it.\nI know that those people who have concerns, whatever they may be, about the second amendment.\nI would tell you that you're about it the right way and do allow the State of Georgia and\nthe legislature to preempt and let our laws prevail.\nThat ladies and gentlemen has suggested this bill and I'll be more than glad to stand\nfor any questions, Mr. Speaker.\nGentleman has several questions, representative Isle,\nand she's in the back to your left.\nYes, sir.\nThank you, does the gentleman yield him?\nYes, ma'am.\nOkay, so so far this session, the majority party has,\nnumber one, refused to grant a hearing to HB1,\na safe storage requirement.\nNumber two, it's allowed HP 79, which offered a tax credit for purchase of safe storage equipment to be gutted by the Senate.\nAnd number three, it's now seeks to preempt local governments from enacting public safety measures involving safe storage.\nAnd in fact, exposes them to a $25,000 penalty for such measures.\nSo the question is, can you explain why the majority body continues to oppose interventions that prevent\nuntapped by criminals, and would address the number one cause of death of kids and teenagers in this country?\nTo the good lady, I am not in that position of leadership to say why these individual bills haven't came up.\nI think that maybe some of them have been heard.\nI don't know what has and has.\nI know that Georgia is a strong second amendment state.\nWe've always believed in the right to bear arms.\nMost of us who have been on board of this issue for years,\nwe promote safety, but that's all in the eyes of the builder.\nThis particular bill to the lady, if I may.\nThis particular bill, I talk about the prevention.\nOne of the things that's disturbing to me is that in this municipality,\nI'm talking about, they want to charge $1,000 for somebody who is stolen your property.\n$1,000, your motor vehicle in this state has always\nbeen treated under the castle doctrine as the same as your home, the same as your home.\nSo if your baby vehicle has been violated and someone is stole a weapon from it and you're\ngoing to penalize them for being the victim, lady, that's, ma'am, that's not justice.\nThat is not justice.\nSo the other question is a political question that you can only ask yourself why these other\nthe bills haven't come forward.\nThere's two houses of the legislature\nand let the process work.\nOne follow-up if I may?\nYes, ma'am.\nThank you.\nI'll just note that a safe storage requirement\nwould prevent against gun theft.\nSo that is a good thing to talk about as we move forward.\nI know you're just one person\nand you are not making all the decisions,\nbut I'll just ask you as the bill sponsor primarily,\nwould you support giving HB1 the safe storage bill\na hearing and a vote.\nNext session.\nI would like to see what's in the bill.\nI make no commitment on any bill until I read the bill and what I'm voting on.\nOkay, it was the first bill filed this year, so you have plenty of time to read it.\nThank you, sir.\nThank you, ma'am.\nGentlemen, yield for a question from Representative Chastain to your right.\nMr. Johnny Chastain.\nYes, sir.\nJim was recognized.\nThank you, Mr. Speaker.\nIs the gentleman yield?\nYes, sir.\nIs it not true this bill protects lawful weapon carriers when their rights are violated by unconstitutional local ordinances?\nYou're absolutely right\nJim a year for a couple more. Yes, sir. Glad to answer any question on such an important subject\nrepresent to make queen\nTo your left is recognized for a question. Thank you, Mr. Speaks. You see the yes\nThank you, Mrs. Speaker. Does the gentleman yield? Yes, ma'am\nSo, isn't it true that this bill would prevent local lawmakers from passing legislation for gun owners to prevent reckless and negligent storage of firearms to prevent unauthorized access to weapons?\nthat's find local lawmakers, this says that those local governments can't preempt state law.\nYou are nearly elected to the legislature of this state to pass laws of importance that affect everybody in the state.\nIf we had 600 plus jurisdictions that just passed the Mirage of Laws, we would have chaos to no one would know exactly what the rules were of behavior.\nThank you, ma'am.\nRepresentative Jason Ridley to your right,\nextreme right, is recognize for a question of\nthat you've read his name.\nThank you, Mr. President.\nGentlemen, you.\nYes, sir.\nIs it not true that this year that we had a house member\nthat had a safe storage unit in his vehicle,\nthey broke into his vehicle and then still at then,\nfour days later, they broke into it again,\nand took crowbars and opened up to his safe storage unit\nin his vehicle and stole his weapon.\nAnd under the if we didn't pass this in that one city he'd be fined $1,000 even though we had a\nsite to you I thought you're the exact language in that city I'm referring to whether it's a\nwhether it's a lot car an online car. But I know that if you leave a weapon in a car\nthen you're subject to have a theft of that vehicle of that weapon. We know that from experience\nthat right here in their life, that criminals\nwere target certain vehicles.\nThey loved to target trucks, SUVs.\nIn my tenure up here, I lost a couple of handguns\nover the years by driving my truck the time\nbecause criminals, they know what to target.\nThey're professionals.\nThey broke into my vehicles, didn't get anything\nbut my weapons, and I learned better.\nI learned to start carrying it in my pocket.\nYes, you heard that right.\nAnd it's something that I don't like to talk about very much, because I've always said\nthose people who talk so boisterous about care and the weapon, they're the ones that\nwill be the first victim of a criminal, but everyone has that right to protect themselves,\nBut you also have a right not to be penalized for being lawful citizen and a criminal taking advantage of you.\nGentlemen, you yield for question.\nCertainly.\nThe review is saying she is, to your right is recognized for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nYes, sir.\nIs it not true that the first four pages of this bill is essentially Senate bill 163 by State Senator Colton Moore?\nI think you're right.\nThank you.\nAnd please don't hold that against me.\nRepresentative Williamson,\nshould I ask for a question to your right?\nTo your right?\nMr. Speaker, is General Neild?\nYes, sir.\nIs it not true that the core issue we're addressing here\nis of the 600 subdivisions of approximately 600 subdivisions\nof state government you've referred to,\nthat they're not lawmakers.\nAll they can do is pass ordinances.\nIn this general assembly, it's not only law-making body in the whole state, is that clear?\nYou are absolutely right.\nThe cross section of the conscience of this state is what this body in the lower house,\nwe're the cross section.\nWe are the state lawmakers in the laws that we pass, take prominence.\nFurther question?\nYes, sir.\nIf it's German yield.\nCertainly.\nIs it not true that many of these subdivisions have not\nfigured that out yet?\nIs that, and the politicians sitting in those seats\nhave not figured out the fact that they're not lawmakers?\nIs that not true?\nYou know, we live in a time, we live in a time that\nis nothing like I've seen in my lifetime politically.\nWe have issues that people think that because they can't\nget justice over what they perceive as their position in the legislature that they can\ndo what they want to do.\nThat's disarray, that's chaos, that's not what governance is supposed to be about.\nSo what I say is that while the Second Amendment may be the deeper part of this, there's\na bigger part and that's about the preemption of these laws.\nI had said, why would a city pass a law to penalize someone who was the victim of a crime?\nFolks that gives me heartburn to think about.\nSo that being said, I know there's a lot of people that want to talk about this and I\nknow there's a lot especially maybe a partisan divide on your beliefs of the Second Amendment.\nBut I believe that that is a sacred part of the Constitution.\nI've always said that the Constitution in God Almighty gave everybody a right to protect\nthemselves and their property and their loved ones.\nBut to me, it's absolutely astonishing to believe that someone could be charged with\na crime and to a thousand dollar fine in a penalty.\nLet me tell you something about these things, $1,000 don't mean much to some of you folks\nout there, but I tell you who it does mean something to you.\nIt means a lot to those working folks out there to get charged.\nYou'll remember a little bill that we were dealing with about the cameras.\nThere's no recourse to a lot of them.\nThey just sent the check and paid it.\nIn this particular case, you get charged with a $1,000 penalty or $2,000 if you don't report\nit.\nThen they've got to hire a lawyer.\nWell, in our society, unfortunately, what the day we live in, that they can break you\none way or they can break you the other.\nIf you have to hire a lawyer and hire legal counsel to stop something, that's not fair,\nladies and gentlemen.\nThat's the reason the penalties are in here so that they can be reimbursed for their legal expenses, but somebody's got to pay for those legal expenses first.\nMr. Speaker, if there's no other questions, I'm sure we have plenty of folks who want to speak on and against this bill probably, but I would certainly appreciate your considerations to the argument.\nI would ask that you vote against violations of preemption.\nI would ask that you vote quite frankly for the base issue that creates this preemption.\nAnd with that, Mr. Speaker, I'll yield the will and appreciate your favorable consideration.\nGeneral, as you were to the will, he did answer most of his questions and we do have a lot\nof speakers on the bill.\nhave a number of folks signed up to speak opposed to and in favor of chairs going to hope\nyou'll take four minutes and 30 seconds, but I will give you up to five minutes to speakers\non the bill. You'll have the yellow light at 4.30 and you'll have the red light at 5.\nSo we're going to hold all of those opposed and in favor, per person, knowing anybody\nget excited. I thought you had a minute each. We'll move forward. Representative Crawford,\na Murray Crawford. Virginia is recognized to speak to the bill. Representative Crawford.\nThank you, Mr. Speaker. Now, try to be as briefed within your time allotted. Friends of\nthe day, I rise in opposition of Senate Bill 204. The bill started off as a bill that\ndealt with prosecutorial efficiency and then language was added that would preempt local\ngovernance from trying to do what's right and that is to protect their citizens. As a person\nthat stands in as well, I know a little bit too much about hijacking of bills. And as you can\nimagine, I'm against it. Nonetheless, the speaker performed me and he is completely right that\nthis is a bill that deals with the Home Room Act and Preemption. Georgia counties of municipalities\nright now have the opportunity to draft ordinances, not laws, but ordinances that can protect the\nthe citizens within their local government.\nThose ordinances can only be drafted so long\nas it does not preempt what the state government says.\nSpeaker, before me is right,\nthat under OCGA 161173,\nthere is already a preemption of any type of sale, transfer,\npurchase, or storage of firearms.\nIndicat County, we have tried to draft ordinances\nthat would allow storage ordinances to be implemented,\nbut preemption prohibited us from doing that.\nAnd so a lot of counties has tried to work around\nhow do you save the people's lives in your districts\nby creating ordinances that would not be challenged\nby preemption.\nSo the issue that I have is allow people in their counties\nto come up with some creative ways\nthat they can decrease the amount of gunshots,\nthe amount of deaths that occur inside of their counties\nbecause they have the numbers.\nWhat you see on your screen right now is a story\nfrom the Cap County, the county that I'm from,\nwhere someone was actually murdered.\nA teenager was murdered because they were able to get inside\nof a safe, get inside of someone's home,\ntake a gun and use that inside of a fight,\nand someone died.\nThis happens all too often.\nI'm gonna give you a few stats.\nIn 2024, there were approximately 200 deaths\nand injuries that occurred with teenagers\nthat were at least 17 years or younger\nbecause they were either killed again or injured\nfrom accidental discharges when they were able\nto get inside of closets, cars,\nand they killed themselves or others\nbecause they had access to guns.\nThere have also been nationwide approximately\n15,000 deaths similar in Georgia.\nThere have been about 2,000.\nSo we have about 2,000 deaths that occur in this state.\nNow, the problem is that those 2,000 deaths that occur in this state are centrally located\ninto Metro Atlanta area.\nThe reason why I'm bringing that up is because there are counties in Metro Atlanta area\nthat are trying to create safe ways for people to have guns.\nI am not against the second amendment.\nIf you have a gun and you are a lawful owner, have your gun.\nI don't have a problem with that.\nBut if Fulton County, Decap County, Clayton County wants to create an ordinance that says,\nIf you don't want our children to get inside of closets to get inside of cars, take those\nguys and commit other crimes, then let the people in the Cap County and Fulton County\nare whatever county to come up with creative ways to pass those ordinances.\nIt should also be noted that this is a bill that is trying to do what really is already\nthe law.\nIf you look at, and if you have time and if you're so interested, if you look at an\n11th Circuit case, the United States versus gun, no pun intended, but if you look at\nthe United States versus gun, there was already a law that says that the state can preempt\nlaws that deal with storage.\nSo there was already a law for this, so you really don't have to pass this bill.\nThis is something that is already in the law, so we don't really need to pass something\nthat is already there, but what this does is that it doubles down on any type of effort\nfrom local governments to create, once again, safeguards and safe rails for ordinances.\nIf you don't like a gun ordinance and whatever county that you come from and let's say\nit's a small county that does not have that type of issue, then my suggestion is go to\nyour city council, go to your commissioners and tell them that you don't want the bill\nor the ordinance rather that would preempt or attempt to preempt gun safety storage.\nBut if you come from a county like some of us come from where that is a big deal, then\nagain, let us do something to protect the children.\nAnd that's what I am asking.\nI am asking that you oppose Senate Bill 204 because there are,\nagain, there are areas in this state where we need to be able to create these ordinances.\nI am a person from the Cap County that understands the importance of allowing us to have the power of home rule.\nAnd I'm asking that you vote down to O4 so that people who are from areas where this is an issue that happens on a daily basis,\nallow us to do what we need to do to protect our children.\nAnd with that, Mr. Speaker, are you the well?\nThe gentleman's yielding the well.\nReptile to Roberts is recognized, speak to the bill.\nThank you, Mr. Crawford.\nThank you, Mr. Speaker.\nGood afternoon, colleagues.\nThat's not quite evening, I guess.\nI would like to start my speeches on guns.\nI know you all know I'm opposed to this bill with.\nI own a gun and it's stored safely at home.\nI am not anti-gun, but I'm wondering how many of you took the time to speak with the\nstudents and staff from at Bellaghi High School?\nStudents and family members who came to the Capitol while still in mourning.\nLast September, two 14-year-olds Mason, Shermerhorn, and Christian and Gula were gunned down\nat school, coach Richard Aspenwall and Christina Irami, both teachers, died, protecting their\nstudents. Children ran for cover, parents got the call, no parent should ever receive,\nthat their child might not come home. The students, staff and families of Appalachee\nwill carry that trauma of that day for the rest of their lives and they are not alone.\nFrom Metro, Atlanta to rural Georgia, gun violence has become routine.\nJust two years ago, Amy St. Pierre was shot and killed at a Medtown doctor's office\nright up the way.\nHer husband lost his wife and her children lost their mother.\nThese aren't isolated incidents.\nIn 2024, an average of 2005, Georgians died by gun, 52% by suicide, 45% by homicide.\nyet what have we done? Nothing except expand access to guns. The Appalachee\nfamilies have come here again and again asking you to pass common sense safe\nstorage laws and how do we respond with a bill that precludes safe storage\nlaws? SB 204 is a slap in the face to those families and for what? To punish\nSavannah for trying to prevent gun theft and violence.\nAll they proposed was a civil penalty if someone left their gun and cured in a car, stolen,\nand used in a crime.\nInstead of supporting them, this bill blocks local leaders from protecting their communities\nand lets private citizens sue local governments for trying.\nLet's be clear, we're not just tying the hands of mayors and police chiefs.\nWe are threatening them with legal and financial punishment.\nThe hypocrisy here is out astounding,\nor earlier this session.\nMany of you in this room voted for tort or form,\nsaying Georgia is a judicial hellhole.\nNow you wanna create a new private ride of action\nagainst cities and counties\nthat are trying to keep people safe.\nWe haven't even passed the bill\nthat encourages safe storage and safety training\nthrough a simple text rebate.\nWow.\nAnd don't say that's the Senate's fault.\nWe all know when House leadership wants to get something done,\nit gets done.\nSo let's be honest, this majority party has prioritized\ngun lobbyists over Georgia's children.\nYou're creating a $25,000 legal threat against local government,\nsmall towns that can't afford the risk.\nAnd you're doing it to support a senator who\ndisrespected two of our speakers and threatened our House staff.\nYou're siding with him over grieving families in Barrow County.\nIf you won't pass safe storage laws, at least don't slap these families in the face with\nthis political retribution bill.\nTo those of you supporting SB204 out of concern for the Second Amendment, I understand.\nBut rights come with responsibilities and our responsibility as lawmakers is to protect\nlife.\nNot just the rights of gun owners, but the lives of the innocent.\nThe students of Appalachia were just trying to learn.\nTheir parents were just trying to get through a normal day.\nSB204 won't make anyone safer.\nIt won't stop the next shooting.\nIt might make it harder to prevent.\nWe should be passing laws to support safe storage,\nbackground checks, and red flag laws.\nNot bills that prioritize lawsuits over lives.\nThis isn't a theoretical debate.\nIt is life and death, it's lockdowns, ER visits, funerals,\nit's trauma children carry into adulthood,\ndreams ended by a single bullet.\nWe cannot keep expanding gun rights\nwhile ignoring gun deaths.\nSo today I'm not just asking, I've done it before, I begged,\nand I'm begging again.\nVote no on SB204 for Appalachie,\nfor your communities, for your conscience, thank you.\nI yield the well.\nThank you, the lady is yielded the well.\nRepresentative Barry is recognized to speak to the bill.\nThank you, Mr. Speaker.\nI rise today in the strongest opposition to SB204.\nI would love to support the original version of SB204\nin a bipartisan measure that would reduce\nrecidivism rates in our state, but instead,\nhere we are debating another big government control bill\nwith SB1C3 or two or four, whatever you want to call it.\nThere is too much to begin with what's wrong with this bill.\nThere are the process and procedural issues.\nThere are the issues of local subversion,\nand there's issues of constitutionality.\nBut the biggest issue for me is that we are here to talk\nabout a bill that is so dangerous, so absurd,\nand so deeply unserious that I have to wonder,\nwhat's made in the signal chat full of gun lobbyists?\nDoes somebody say, hey, you know what'd be fun?\nMaking it easier to sue cities for keeping\npeople are getting shot and everyone just sent a fist in an American flag and\nfire emoji. It is funny but it would be even and it would be even funnier if it\nwasn't a slap in the face to local control to public safety and to basic common\nsense. I am tired of watching this chamber make it easier to carry guns than to\nvote than to get health care than to afford rent. The people of this state are\nsick and tired of that false choice too. And instead of listening to the people of Georgia,\ninstead of tackling gun violence, what does this bill do? It lets people sue cities and counties\nfor trying to protect their own residents. Let's break down just how ridiculous this process has been.\nThis bill was Russia committee, failed, and then brought back from the dead. No real public hearings,\nno real input from law enforcement, no consultation with communities that will suffer the most,\nThe people who are begging for gun safety laws, ignored.\nThe city leaders that are trying to keep our streets safe, ignored.\nThe parents who don't want their kids caught in the crossfire, ignored.\nBut guess who wasn't ignored?\nThe gun lobbyists.\nThey had a front row seat while this thing got pushed through.\nThis tort scam intensified.\nAnd guess who pays?\nNot the gun companies.\nNot the lawmakers that are pushing this.\nThe taxpayers.\nLook, this bill basically says to cities not only can you not protect your own people,\nbut don't worry, we will let gun activists sue you for trying.\nThat's like banning seatbelts and then letting reckless drivers sue the DMV\nfor suggesting they buckle up.\nLook, we just had an election where George is made it clear\nthey want stronger gun safety measures.\nThey voted for leaders who promised to take action against gun violence.\nBut instead, respecting the will of the people, this bill does the opposite.\nIt silences their voices and overrides the very officials\nthey elected to protect their communities in the first place.\nThis isn't just bad policy,\nit's just a blatant disregard for democracy.\nAnd you know what else is the matter under this bill?\nLocal governments.\nYour mayor was comments since gun laws too bad.\nYour city council wants to keep guns out of parks\nand playgrounds, sorry, can't do it.\nYou want to stay for streets.\nWell, you better cross your fingers\nbecause SB163 says, good luck with that.\nLook, by trade, I'm a numbers guy.\nI mean, I'm an economics major for more house,\nso we talk about that a lot.\nCycling with facts, not fear-mongering.\nAnd here's the fact, gun violence\nis the number one cause of death\nfor children in America, not video games,\nnot TikTok trends, guns.\nAnd yet instead of addressing that,\nwe're debating a bill that does nothing\nbut create more lawsuits, more legal fees,\nmore headaches for local governments.\nall will make it harder to keep people safe.\nI don't know about y'all.\nI did not come to this chamber\nto be a glorified defense attorney for the gun lobby.\nIf this body actually cares about law and order,\nthen let's start by keeping guns out of the hands\nof criminals.\nBut instead, SP163 or SP204, whatever you want to call it,\ndoes the opposite.\nIt punches local leaders for trying to keep their city safe.\nIt shields dangerous policies from accountability\nAnd it ignores the people we were elected to serve.\nSo to my colleagues who are still indecided,\nI urge you to think about the communities we represent.\nOur job is to listen to the people of Georgia\nand make decisions that keep them safe.\nThis monstrosity of a bill does not do that.\nI'm close with a scripture, Zechio 2230.\nI looked for someone among them who were built up a wall\nand stand before me in the gap for those who\ncannot stand from themselves.\nRight now, our children, our families, and our communities need us to stand up for their safety.\nLet us not be silent in this moment.\nLet us not be found unwilling to act.\nInstead, let us do what's right.\nThank you, Mrs. Speaker, you're at the well.\nThank you, Mr. Speaker.\nAs I said here today, and I listened, as I sat here today and listened to all the statements\nthat were made, and I saw what this bill was all about, and I'm going to tell you, if\nyou recall when I first got here, I had a nephew that had been killed in the city of\nSavannah by someone that went in stole a gun and shot him stole his car and\nthank God for our police officers. They were able to get him. He's still in jail\nbut has not come to trial. But this morning as I was reading my email I received an\nemail regarding this bill and I was ordered to vote for this bill and I was\nordered that why I should vote for it was because the City of Savannah is\ntrying to make us safer by saying that you must lock your cars and that you\nYou must lock your glove compartments because you know that there are people going around\ntrying to break into them.\nThat was to protect me and every resident in our community.\nBut the problem is, is that I was told that we did need to listen to what our city government\nwas doing.\nBut I should listen to people that want to do whatever they want to do with their guns.\nI want my city to help to protect our children, our senior citizens and all of the people\nthat come to our community.\nWhy am I standing up here?\nI want to tell you because in this communication that I received, I was told that\nEither I do it, or, and I'm going to read it verbally.\nSavannah, it says, join your gun owners.\nWill keep me informed of your vote.\nAnd what happens to this bill?\nIn capital letters, I will be watching what you do,\nhow you vote and will tell everyone I know to vote for our against you depending on your\nperformance on this and other gun issues.\nWell, y'all know I don't like guns.\nI will try to vote you out of office if your performance is not acceptable on this issue.\nWell I say to you, think about residents in your community that need to be protected.\nThink about the children in your communities that need to be.\nI am happy that we made a decision to protect it by saying if you're not going to take care\nof what is inside your car that could take a life, then you don't even need to be there.\nSo I want you to know my colleagues as I stand here this afternoon.\nI want you to know that I need your support and I need your support so that communities\ncan make their own decisions of how they're going to protect our people against gun violence\nby telling them to lock them in their cars and lock boxes in their homes.\nI have a gun.\nBut it's locked up.\nAnd I don't even like guns.\nBut I want please vote with me.\nAnd I'm making it a personal thing\nsince it's a personal attack.\nPlease vote no.\nThe gentle lady has yielded the well.\nMembers, I'm going to take just a moment of personal privilege and recognize a former member\nthat's on the floor. If you'll join me in welcoming the former Camilla\nHobson who is now Camilla Jackson, she represented Albany and House District\n153 and she's here with her husband Derek Jackson.\nThank you for joining us, Representative, former representative Jackson.\nWe're moving on to the proponents of the, I'm sorry, we do have another speaker to speak\nagainst the bill.\nThe chair recognizes representative Ramon to speak to the bill.\nThank you, Madame Speaker of Pro-10.\nColleagues, it appears some of you have misplaced a pair\nof spherical objects today, and it is making me furious.\nAnd let me explain.\nWith deep respect to those who are engaging on this issue\nseriously, and I mean that sincerely,\nmy opposition to this bill, in addition\nto what we're going to be talking about from policy position,\nis the fact that I firmly believe we should not\nbe rewarding those who threaten our staffers with policy.\nAnd what do I mean by that?\nThis bill, as one of my colleagues mentioned,\nis actually Senate Bill 168.\nAnd unfortunately with Senate Bill 168,\nthe supporters of that bill actually posted a video\ncalling out by name a staffer who works for us\nand said, come burn their desk.\nAn actual staff member that works for us,\nthat has never done anything but do their job\nand who was essentially doxed on the internet.\nAnd for what?\nFor following orders?\nAnd the thing that really boggles my mind is that,\nsure, the name of the original author, the bill,\nand those supporters are not at the top of this legislation.\nBut the thing I've learned being here for three terms now\nor three sessions now,\nis that when you're in the minority party,\nyou sneeze wrong and your bill dies.\nIt happens, it's fine, it is what it is.\nWhen you're the majority party you sneeze wrong and a bill moves out of rules.\nAlso fine, it happens, we saw it happen on Wednesday, it was great.\nBut for me personally, I really think that there should be a red line, a line that none\nof us will ever cross no matter how much we want this policy.\nI don't care if this bill is about puppies and unicorns and everybody gets a free one.\nI don't care if it's my most important policy positions.\nYou do not get to threaten our staff and then get your policy and your bill on our floor\nwithin a week.\nThat is a deep and sincere belief in mine.\nThere has to be a red line.\nThere has to be something that says, sure, you want to be a part of the legislative process,\nwhether you are elected or not elected, you are an advocate, a friend in the hall, whatever\nit is, a constituent.\nIt doesn't matter.\nWe love to hear your voice.\nWe love to have you come down.\nI beg my constituents.\nI beg my people who aren't my constituents to come here all the time, all the time, please\ncome and work on these bills with us.\nBut I will tell you this, if any of them ever threaten a staffer, ever, to me that is a\nred line, it should be a red line for all of us.\nThe reality is that we will always debate bills, we will always debate policy, we will always\nhave different positions.\nthat I deeply believe this is one of those\nthat there should be no daylight between any of us.\nBring it up next year, bring it up as a clean bill\nby an author from this chamber.\nSomething that we own.\nAnd here's the other thing speaking of procedure.\nLast I checked, in addition to sneezing correctly in here,\nyou're supposed to be able to go toe-to-toe\nwith the speaker's general counsel and win\nto get your bill on our floor.\nNot lose and still get your bill on our floor.\nYeah, I said what I said.\nColleagues, I don't like the precedent we're sending here.\nI really don't.\nI actually think it's way bigger than this bill, like deeply and sincerely.\nAnd again, with all due respect to the amazing policy discussions we're having,\nthe stories we're hearing, the sort of like moving stories of victims\nthat we are going to continue to hear about today.\nIt should not have to take somebody from the minority party\nand a woman is stand up here and say,\nyou know what, we are going to protect our honor\nand our dignity in this chamber.\nIt should not have to be me saying this.\nIt should not have to be me saying,\nwe should be protecting our staff\nand drawing this red line.\nAnd I am deeply, deeply disappointed\nto see this bill on our floor.\nI really, really thought we were better than this.\nAt some point, we have to have a red line.\nAnd I hope, as you hear about the policy,\nyou think about the policy, you consider it.\nI hope you also think about the bigger picture of what it means to pass this bill today.\nThank you Madam Speaker, I yield to you all.\nThe lady has yielded the well.\nThe chair recognizes Chairman Jasper's to speak for the bill.\nYou know, we talk about prevention a lot here in the last little bit, you know, it's common\nto be used here.\nIt's where the higher levels of government tell the lower levels what they can do, what\nthey can't do.\nYou know, we do it a lot.\nThere'll be bills passed today or passed on Wednesday and on Monday that tell counties,\nschool systems, law enforcement, and on and on what they have to do.\nAs a member said earlier, we are the lawmakers, so we do get that opportunity to do that.\nYou know, these bills are hotly debated in preemption.\nThe cities and counties do try to defend their role, but we get to make the decision.\nMost chairman Powell said a few moments ago, we passed preemption on 2nd Amendment rights\nyears ago, and we've adjusted our laws many times over the years making them better, making\nthem better for Georgia citizens, and making for sure, and one thing that's been my goal\nover these years is to make sure that they can't carry a weapon where they choose to,\nand they don't have to store it in their car.\nAnd we've worked very hard to do that.\nI'm very supportive of this bill.\nAnd I think we get lost in some of all the rhetoric,\nbut the important part about this is that a Georgian\nwhen he goes into my town, your town, any town\nknows how to act, knows how to carry their weapon,\nknows where to put it, knows where not to,\nnor they can't go, and where they can't go.\nIt makes it clear and uniform laws.\nAnd I hope you vote for this,\nand join Chairman Powell in need of us\nto support our Second Amendment rights.\nThank you, Mr. Speaker.\nThe gentleman is yielded the well.\nThe well.\nIs there any objection to the previous question being ordered?\nThe chair here is none of the previous question is ordered.\nThere is a minority report and the chair recognizes\nrepresentative Evans for the minority report.\nGood afternoon colleagues, I rise in opposition to Senate Bill 204.\nNow we know state law preempts nearly any local gun rule regulation ordinance or resolution\nthat's already true we don't have to do anything to change that.\nlaws relating to guns are only allowed in the areas where we say they can exist.\nAnd in this bill, we're adding storage laws to the list of things where we are not going\nto allow a city to regulate.\nSo without this bill, local governments have been able to regulate storage laws, for\nexample, like requiring folks to lock their car doors if they have a gun inside so\nthey won't get stolen and commit a crime.\nAnd others have talked to you about why that's a bad idea not to allow those kinds of common\nsince laws by local governments, but I want to spend a little bit of time talking about\nanother problem with this bill that we haven't talked about yet, I don't think.\nThis bill, if you look with me at line 81, this bill says that anyone, quote, who is or\nhas been subject to or aggrieved by a rule regulation ordinance or resolution that they\nthink is in violation of the limits that this legislature set on laws that local governments\ncan set can haul city officials to court to defend those laws. Now let me say that again.\nYou don't have to be aggrieved by a local law. You just have to be subject to it. And you\ndon't even have to be subject to it. You could have been subject to it in the past. You\ncould have moved. You never got fined. You never got arrested. You never got charged.\nYou just think the local government has passed a law that goes beyond the preemption and\nyou want to make somebody prove it.\nYou haul them into court, this bill allows you to do it.\nOld law didn't do that.\nOld law said you had to be aggrieved.\nThis bill does not say that.\nYou don't have to be damaged.\nYou can bring them in for injunctive relief.\nThere's two sections about how you haul them into court.\nOne for injunction, one for damages.\nSo just again, you don't have to be charged, you don't have to be arrested, you don't have\nto be fined, you don't have to be convicted, you don't even have to live there anymore.\nYou just have to think that one of these laws goes too far and you want to bring the city\nofficial in to account for it.\nThat seems like a lot.\nWe're setting up a system where a person who is or did live in a jurisdiction where a local\nThe law was passed.\nCan Hall City officials end to make them defend the law?\nAnd there's no place in this law that says\nif the city official was hauled in and they found\nthat the law was just fine, that the city gets paid back.\nNo, no.\nThink about the advocacy groups in this state\nor across the country that would love to gin up residents\nor form a residence just to make them prove it.\nY'all know I'm right.\nThis is going to chill local governments.\nfrom doing even what we allow them to do.\nBut I do wanna talk about storage again for just a moment.\nAs I said, when I started,\nthis law would add gun storage as an area\nwhere we are not gonna allow local governments to try.\nNow this house had a priority this year\nand at least last year and probably before that too,\nto make encouraging of storage of guns safely a priority.\nLet me say that again, this house had a priority to encourage the safe storage of guns.\nWe passed House Bill 79 this year, 165 to 8.\nLast year we passed a bill House Bill 971, 162 to 3.\nBoth of those bills would have provided a tax credit for gun owners who bought a safe storage device.\nOur priority, that house's priority, was to encourage safe storage.\nAfter this bill, when a local government does exactly what we wanted to do, encourage\nsafe storage, they're going to get sued, and that doesn't even have to be by anybody\nwho's been damaged by it.\nThis is not our priority, y'all.\nOur priority is the opposite.\nThis is the Senate's priority.\nThe Senate didn't pass our bill last year, obviously.\nThey didn't pass it this year.\nto add insult to injury, they got it in.\nThey don't care about our priorities,\nbut somehow we are chopping at the bit to grab theirs.\nAnd not just any Senate priority,\nbut a Senate priority lead sponsor,\nthe Senator who disrespected this house over and over,\nour current informer speaker sued our staff,\nessentially spit in our face any chance he got.\nAnd we're like, give me what he wants.\nI wanna do that.\nThey got our bill, we pick up theirs.\nThis first section, Senate Bill 163, is Colton Moore's bill.\nThis is not anyone else's bill, this is his bill.\nSo once again, we yield to other priorities, not ours.\nI'm going to close with this because I'm reminded of a song.\nI won't sing, but I'm going to talk about the song.\nIt reminds me of a song by the late great Toby Keith.\nI want to talk about me.\nI want to talk about me.\nI want to talk about I.\nI want to talk about number one, oh, my, me, my.\nWhat I think, what I like, what I know,\nwhat I want, what I see.\nI like talking about you, you, you, you, you, usually.\nBut occasionally, I want to talk about me.\nOccasionally, can it be about the house?\nDoes it always got to be about the Senate or somebody else?\nThey ignored our priorities on storage for multiple years.\nAnd now we just pick up their priority.\nfrom someone who disrespects this body every chance he gets.\nI just don't get it, y'all.\nPlease join me in vote, no.\nI yield.\nThe lady is yielded the well.\nThe chair recognizes Representative Willis to speak\nfor the bill.\nThank you, Madame Speaker.\nGood afternoon, colleagues.\nI rise today in opposition to Senate Bill 204.\nThis bill, as originally drafted by the Senate Minority Leader, was a really good bill.\nOriginally aimed at procedural criminal justice reform.\nQuite simply has been hijacked to undermine local authority.\nAnd I don't know about you, but I stand with my local leaders and not against them.\nAnd for me, that's the city of Atlanta and that's Fulton County.\nThis substitute allows individuals to sue local governments for regulating weapons.\nAnd the weapons carrier can file a lawsuit and recover damages and attorney's fees,\nopening the floodgates to harassment lawsuits against not only city councils but law enforcement.\nNow what works in your county may not necessarily be best for mine.\nAnd in Atlanta and Fulton County, we're doing something right.\nnationally ranked number four in the nation for economic development. We do. All right.\nSo hold up, wait a minute. If y'all thought I was finished.\nWe've spent the bulk of this legislative session hearing about how frivolous lawsuits are\nrunning people and businesses out of Georgia, that they are the bane of our existence,\nAnd yet, less than a week later, once again, we are presented with a bill that sets the\nstage for what actually sounds magnetic for more lawsuits, but go off.\nHow will we defend taxpayer-funded lawsuits from anyone who says their gun rights were\ninfringed by a city ordinance?\nSo who are we? Who are we as a state body to continue to reach into localities, to dictate\nto them what we feel is proper? What message does this send to any mayor or to a city council?\nWilliam Haslet once said that the only vice that cannot be forgiven is hypocrisy.\nelected local officials should regulate public safety.\nAnd we should stay in our lane.\nAnd we should stay in our lane.\nAnd with that, Mr. Speaker,\nI yield the remainder of time to the gentle lady Westbrook\nof Savannah's 163rd District.\nThank you.\nThe lady is yielded the well and the chair recognizes\nRepresentative Westbrook to speak on the bill.\nThank you, Madam Speaker and good afternoon colleagues.\nI rise today in strong opposition to Senate Bill 204 because it retaliates against the\nduly elected leadership of the city I represent and against my constituents themselves.\nIt makes Georgia's communities less safe and it violates the public policy that this\nHis body communicated to Georgians that we value, which is safe firearm storage.\nThis is not a reinforcement bill, this is a retaliation bill.\nIt was Fulton County's turn on Wednesday, I guess it's Savannah's turn today.\nBut I'm here to speak for my community.\nThis is a Franken bill.\nIt started out as a perfectly good bill, and it was hijacked.\nhijacked by a far right senator who I am confused as to why this body wants to carry his water,\nbut that's apparently what we're going to do.\nThis senator openly stated that he was targeting the ordinance passed by my city council,\ndespite the fact that he represents a district nowhere near my district, suburbs of Chattanooga\nbasically, but he wants to tell us how we need to handle our business in Savannah.\nI represent a district that is mostly comprised of\nin-town neighborhoods within the city of Savannah.\nIt is a dense urban district made up of some affluent neighborhoods\nand also some neighborhoods that still show the persistent\nlingering effects of segregation,\nof under-investment, of poverty.\nAnd social science data and criminology data tell us\nthat in districts that are suffering from those persistent lingering effects of our past sins\nthat there are challenges, and some of my district has those challenges.\nFood insecurity, housing insecurity, lack of access to quality education, lack of access to good jobs,\nlack of access to childcare.\nAnd so we have some challenges and safety can be one of those in my district\nSo on top of considering the needs of Sivanians all Sivanians\nWe've got an additional challenge\nWe are a district. We are a city that is visited by people from all over the world\nFrom all over the US and from all over the state of Georgia and we have to worry about them too and we do\nBut we welcome them. We ask them to come and walk our squares and eat our seafood,\nincluding the Georgia shrimp. We've done so much to promote and protect in this chamber.\nWe ask them to have a good time, eat, drink, be merry. All we ask, all we ask,\nis after you have enjoyed yourself, when it's time for you to go home,\nplease do not leave our community less safe than you found it. Tell me what is\nunreasonable about that. We have an ordinance. It does not contrary to some of the\nmisinformation that you heard earlier. It does nothing to people who lock\ntheir cars. Nothing. All our ordinance asks is if you bring your guns to town and\nAnd Johnny Cash said you shouldn't do that.\nWe don't go that far.\nIf you bring your guns to town, lock them in your car\nif you leave them.\nJust lock them in your car.\nThat's it.\nIn Georgia, you can take them everywhere.\nYou all made that available.\nYou can take them in a restaurant.\nYou can take them in a bar and have a few drinks.\nYou can take them with you.\nIf you leave them in your car, lock your car.\nIt's not that hard, y'all.\nThis is a particular issue for our district.\nI know y'all think that we need to make all the rules up here\nand just tell all the cities how to do it,\nbut my city's not like your city.\nMy city's not like your town.\nMy city is not like the 2000 strong and population town\nof the Senator who filed this bill.\nOur issues are different.\nWe have a dense urban plan.\nIt's why people love to visit us.\nWe've got sidewalks right next to On Street Parking\nand we have a problem with people walking down those sidewalks\nand trying car door after car door after car door.\nWhich one is gonna be unlocked?\nWhich one can I pop into quickly\nand see if I can find a gun line right there?\nThat is what they are looking for.\nevery time I go to a neighborhood meeting in my district every single time we\nstart with a public safety report and a Savannah police department officer stands\nup and says to the neighbors please lock your car please lock your car if you\nleave a firearm in it every single time we get that that request in 2024\n266 guns were reported stolen from vehicles in Savannah.\nOf those 266, 228 were stolen out of unlocked vehicles.\n86%.\nAgain, we're just asking that people lock their cars.\nI'll also mention, our ordinance also protects you when you visit our city.\nIt protects you from being victims of theft.\nOnce your firearm is stolen, you've lost your personal property.\nYou can't use it for protection.\nYou can't use it for anything at all.\nA thief can.\nThe thief who gets your gun, they get to use it.\nBut you don't get to use it anymore.\nSome of y'all are so worried about a propaganda's government\nthat is coming for your guns.\nYou are actually up here fighting a local government trying to help you hang on to them.\nMake it make sense.\nFor my constituents and me, our ordinance also protects us.\nIt protects us from what can happen when a gun, which is otherwise just a tool in an object.\nFor what can happen when that gets in the wrong hands?\nAnd that happens.\nMy community now has yet another firearm in the hands of someone who did not buy it from\na federally licensed firearm stealer and did not go through a background check.\nTo state the obvious, if someone is willing to steal a gun by definition they are not\nlaw abiding.\nThey probably don't have a lot of reservations about using it for another unlawful purpose\nor selling it to someone else who wants to use it for an unlawful purpose.\nwho cannot just walk into a gun shop and pass it back ground check.\nSo that is what my city's leaders were trying to address to keep our people safe.\nSavannah passed this ordinance on April 11th of last year, it has not even been a year.\nBy May 1st, a test plaintiff had been found to sue the city of Savannah.\nSo much for cracking down on frivolous lawsuits.\nHis test plaintiff was not a citizen of Savannah, had never been cited pursuant to the ordinance.\nHe basically said, I don't have power locks and it's just too much effort for me to walk\naround to the other side of my car and lock the door so that y'all can be safe.\nJust couldn't muster up the effort.\nIn November of last year, his lawsuit was dismissed because he had suffered no injury, in fact,\nthat will change if y'all pass this law.\nWe lacked standing to bring the suit.\nThe lawyers know about standing and probably a lot of y'all do too, but quite literally,\nit's just not his business is essentially what the court was saying.\nThe people whose business it is, my constituents, they are not suing the city council that passed\nthis ordinance.\nThey are electing and re-electing them.\nSavannahans are not suing their city over this ordinance because they welcome it.\nThey know it's needed.\nThey are tired of having the debates on their neighborhood Facebook pages.\nEvery city dweller in Georgia knows this.\nWhat was that sound?\nGunshots or fireworks?\nWhen irresponsible people shoot into the air in rural parts of Georgia, the bullets come\ndown on pine trees.\nWhen irresponsible people do that in our metro communities, they come down on roofs, they\nThey come down on hoods of cars, ask me how I know about that particular one, and sometimes\nthey even come down on people.\nSo what works in Yoll's area might not work in my area, my constituents are living with\nthe real costs of this, the costs of how unwilling Yoll are to ask gun owners who you have\nassured us are all completely responsible people to perform the simplest tasks related\nto safety and responsibility.\nThis bill also violates the expressed public policy.\nWe told Georgians that we hold.\nWhen we passed the Safe Storage Tax Credit,\nwe told Georgians that Safe Storage of Firearms\nis something that we value.\nAnd I think it's worth remembering a little bit\nabout the history of that bill.\nThat was an idea brought by one of my Democratic colleagues.\nSome of y'all kind of got the idea that was a pretty good bill.\nAnd by the time we passed it, your names were all over that bill.\nOne of your caucus was the author.\nYour names were in the 2, 3, 4, 5, and 6 spot.\nAnd some of y'all during the last campaign season went back to your districts\nand you told your constituents and your voters\nthat you care about safe storage.\nAnd I hope that's true,\nbecause we're about to find out in just a few minutes.\nWe're about to find out how much y'all value that.\nWe're about to find out if you care about safety for Georgians\nor if you care about appeasing extremists.\nAnd I'll tell you, I've got a bad feeling\nthat when we adjourn tonight, the only legislation,\nThe General Assembly will have passed to address the number one killer of Georgia's children\nand teens is one that makes it easier for people to sue cities that try to pass safe storage.\nMy time is running out.\nThere are a lot of things we could do on this issue.\nWe could pass background checks.\nThey cut every category of gun violence in half.\nThey cut trafficking down.\nMy city is also near on 95, kind of important for the iron pipeline of gun trafficking.\nThere are so many things we could do we have not done, but y'all want to micromanage local\ngovernments instead.\nYou said you've done things to make it better.\nWhat you've done is you passed guns everywhere.\nYou've decimated our permit carrying system.\nThe only real background check system we had.\nYou have failed to keep George in safe and your voters are going to watch and they are\nare going to hold you accountable if you go after cities today instead of living up to\nwhat you said were your values of safe storage for Georgians.\nThank you Madam Speaker, I yield the well.\nThe lady has yielded the well for what purpose does Representative Park rise?\nThank you Speaker Pro Tem.\nI move that the Rule Substitute to Senate Bill 204 be laid on the table.\nThe minority whip has made the motion that the bill be laid on the table, all those in favor will, is there objection?\nThere is objection.\nAll those in favor of laying the bill on the table vote yes, all those opposed will vote no, and the clerk will unlock the machine.\nhave all members voted have all members voted\nMr. Clerk, will you lock the machine on the gentleman's motion to table?\nThe motion is failed.\nYees are 75, the nays are 95.\nWe're moving on to chair's time, we have up to 25 minutes for chairman's time.\n20 minutes, I apologize.\n20 minutes.\nHouse will come to order.\nhave up to 20 minutes for the chair's time. Chairman Tyler Paul Smith has\nrecognized to speak to the proposition. Thank you, Mr. Speaker. We'll get\nafternoon members of this August body. I'm going to end up yielding some time\nto some other members on this but I won't point something out here that's\nvery important, not one, not one person in opposition to this legislation pointed out\nwhere the home rule statutes allow a city to circumvent not only this issue before\nbut any issue. I'll call to your remembrance. From municipalities at least those\nare a creation of this body and if they are circumventing the laws of this\nstate it needs to be corrected. I don't know if you all pay attention but we're\nmeet Grindr down there in 132 a lot of times. If we find something that is preempted by\nfederal code, we do are darned us to make sure that is taken out of the bill. It would\nbe very nice if municipalities and counties would pay us the same courtesy. I get aggravated\nwith it all the time. It just puts a bur under my cell. I've got some simple advice here.\nThose cities and counties worried about litigation. If you don't attempt to circumvent state law,\nyou won't have to worry about being sued. Easy motion to dismiss. With that, Ms. Speaker,\nI'm going to yield the remaining bouts of my time to the majority later this House and Chairman Powell.\nLeader, if the stretch is recognized to speak to the bill, you'll allocate the remainder of the time with Chairman Powell.\nYes, sir.\nWell, thank you, Mr. Speaker.\nI rise today in strong support of Senate Bill 204.\nAnd I want to go through some of the arguments that were made by the minority party when the bill was being debated and in Chairman's time.\nBut ultimately, this is an affirmation\nof our strong and unwavering support of the Second Amendment.\nAnd this legislation ensures that Georgians are protected\nfrom government overreach that Georgians\nare able to remain under the blanket of public safety\nby being able to defend themselves.\nAnd that ultimately, when we have circumstances\nwhere local governments are taking action contrary\nto our preemption laws that there are consequences\nin place in code to address it.\nNow at the heart of Senate Bill 204,\nthere's a clear principle.\nThe right to keep and bear arms shall not be infringed,\nnot by Congress and not by a state,\nand certainly not by a local government,\na county or municipal government.\nGeorgia's should be able to know that as they travel to different parts of the state,\nbe it Savannah or any other location, that their right to keep and bear arms shall not\nbe infringed.\nNow recent actions by the city of Savannah's liberal government have placed those rights\nin jeopardy, leaving lawful gun owners open to punishment simply because a criminal breaks\ninto their, say, vehicle and steals a firearm. Now just think about that for a minute. If\na criminal breaks into my vehicle and steals my glock and I call the police to respond\nAnd then I'm the one arrested.\nIt's outrageous.\nWe already have preemption to protect\nGeorgian Second Amendment rights in the code.\nAnd when that is being circumvented,\nit's necessary that we update the law to address that.\nNow, getting into the specifics which were raised.\nYes, there are paths here that can be sought.\nIf a person is subjected to or grieved\nby these kinds of local government,\nacts, rules, regulations, ordinances,\nthat they would have options.\nThere would be the ability to seek a petition for mandamus\nor seek injunctive relief from the court\nto ask that this violation of their rights\nis addressed in a courtroom.\nBut then there is also a damages option.\nIf they have suffered as a result of the action of local government,\nthey would be able to go to court and very clearly it is specified the damages that they could seek,\nincluding attorney's fees.\nAnd if it's necessary to pursue that through an appellate path,\nliquidated damages that would ensure recovery under those circumstances.\nThis bill doesn't just preempt local overreach now or potentially in the future.\nIt empowers citizens and it allows lawful weapons carriers to bring legal action against\na local government or local office that violates this section of the law.\nThat's not just good law.\nIt's good constitutional stewardship for Georgians protecting their constitutional rights\nfrom being infringed at the local level and giving them a clear path to address it in\nour court system.\nColleagues, this legislation is about more than just firearms.\nIt's about the rule of law.\nAnd it's about ensuring that Georgians are not subjected to the whims of local politics.\nIt's about honoring our oaths, in my view, to adhere to the U.S. Constitution, which\ncould not be more explicit in the right of the people to keep and bear arms.\nWe have an opportunity today.\nWe have an opportunity to stand together, to vote in favor of Senate Bill 204, to protect\nthe rights of our citizens, to speak clearly where others so confusion, and to affirm that\nIn Georgia, the Constitution and the Second Amendment still means what it says.\nAnd Mr. Speaker, I yield the wealth.\nI yield the remainder of the time to Chairman Powell.\nChairman Powell has recognized to speak to the bill for the remainder of the chair's time.\nThank you, Mr. Speaker and ladies and gentlemen.\nYou know, I didn't think this was going to be an easy task.\nBut I heard a lot of what is.\nI've heard some things and comments made by the opponents to this bill.\nAnd I understand politics.\nThis hasn't got anything to do with most of Yellow's minds in opposition about what's right.\nOr about what preemption really means to the law.\nYou've heard some of the skilled jurists, Chairman Paul Smith, leader of the administration,\nabout what law was really about and about the need, and that's the need that we\nhave structure. I heard comments from some of the distinguished members of the\nminority party today, but most of all of it was about their opposition to the\nSecond Amendment. I don't think I heard a whole lot about the preemption, but it\nwas about their opposition. I heard some comments who were hurtful to me, but I hear people talk\nabout and quote the tragedy of Appalachia and try to compare it to this. Shame on you. Shame\non you because there's not a soul in this building that would ever try to mix those two subjects.\nI see it, but I see the politics of this, ladies and gentlemen, it's all about what\nwe want.\nIt's about a political position that I'm opposed to the Second Amendment.\nThere's a proper way to do that.\nThere's a proper way.\nLet me tell you a little bit.\nI've sat down and I thought about the preemptions.\nSo if you think, for those of y'all who think that local governments should be able to\npreempt the law, so let's talk about the Bill of Rights.\nLet's talk about freedom of speech.\nLet's talk about freedom of religion.\nWhat if somebody didn't want a mosque?\nWhat if they didn't want a synagogue in their district?\nWhat if they didn't want to allow women the right to vote?\nAnd they just passed a preempted law?\nWhat about the Civil Rights Law?\nWhat about the Civil Rights Law?\nI'm a realtor.\nWhat about the fair housing?\nWe got a lot of people that have concerns about fair housing.\nBut what if some a local jurisdiction passed laws against the fair housing act or redlining?\nI deal with this a lot of times in my professional life, and I have to stand up and actually leave\nbefore I can even listen to that kind of talk about preempting, because my professional\nbusiness license would be in jeopardy.\nSo I want to talk about that prevention, and those of y'all who want to talk about the\nsecond amendments and the need to ban theirs or to ban that, then mobilize your forces\nand go after it.\nBut this is more about prevention.\nYes, I am a strong second amendment supporter.\nBut this is about allowing local governments\nto step across that line.\nI heard the good lady talk about shooting guns\ninto the air.\nThere's nothing says you can't discharge a weapon.\nThat's part of the provisions of local government\nunder their codes and all.\nBut when you talk about charging someone for a crime,\nfor having a weapon stolen, that is a violation.\nThis isn't got anything to do with frivolous litigation.\nThis is about doing what is right.\nAnd I'm going to part with one comment\nfor every matter before you that you\ndon't do the right thing, then it will come back at some point.\nThose things that we do that are a violation of somebody's rights, it will come back to\nyou in some other shape form of fashion.\nMr. Speaker, there's been a lot of talk about this.\nWe've burned a lot of hours on this or an hour or so, but I would ask the members of\nthis house to vote in favor of this legislation and let's stop this practice as nothing else.\nIt sends a message that the growing kudzu that creeps across a lot of the political subdivisions\ntoday that this has got to stop on this subject and maybe it might have an impact on other\nsubjects.\nThank you, ladies and gentlemen, for the time.\nGentlemen, as you were to the well, that completes the chairman's time.\nThat completes the discussion on Senate Bill 204.\nIs there any objection with drawing the committee's substitute?\nHere in under committee substitute is withdrawn.\nIs there any objection to adopting the substitute offered by the committee on rules?\nHere in under rules, committee substitute is adopted.\nIs there any objection to agreeing to report to the committee?\nWhich was favorable to the passage of the bill?\nHere in the report, the committee's agreed to, shall.\nThis bill now pass all in favor of the passage of the bill.\nWe'll vote yes.\nThose opposed will vote no.\nAnd Mr. Clerk, will you unlock the machine?\n've\nAll members voted for what purpose does chairman Petrie rise?\nParliamentary inquiry Mr. Speaker.\nState Chamber.\nMr. Speaker is not true that sadly we have 48,000 firearm deaths a year in the United\nstates 27,000 of which are suicides and 19,000 of which are homicides that exponentially\nmore than that guns are used in the prevention of crime over 2.5 million times a year including\nin the instance of 400,000 life threatening crimes avoided by the protection and the\ndefense of use of firearms. Thank you, Mr. Speaker.\nof all members now voted.\nIf so, Mr. Clerk, will you lock the machine?\nOn the past, you've sent it bill 204204,\nthe A's are 99, the names are Nays are 74.\nBill Hernsey, the records constitutional majority,\nhas therefore passed.\nMr. Clerk, will you read the caption to Senate Bill 179?\nWill I take, hold up one second, Mr. Clerk?\nI want to have this body recognize the former dean of this house a man who served\nthis state who served health care in New State and was recognized for that\nservice a few days ago from the great city of Columbus Georgia our dear friend\nthe house is friend whose portrait graces in front of this building as you\nwalk in. Former Representative Chairman Calvin Sumari.\nLadies and gentlemen, another very distinguished guest that's blessed us here on day 40 is the mayor of one of the greatest cities in America.\nour own Capitol City, the City of Atlanta, Mayor Andre Dickens, Mayor Glad to have you.\nWe appreciate you taking time to come over.\nYou've always been our friend and we're glad to be your friend.\nThank you so much for what you do.\nMr. Clerk, will you read the caption to Senate Bill 179-179?\nSenate bill 179 by Senator Dixon to the 45th and others to be titled next to men chapter two\nA total 20 of the fish Dakota Georgia annotated relating to elementary and secondary education\nSo it was required that the academic and disciplinary records of each transferring student\nShall be provided by such students previous school to the receiving school within five days\nThis bill ever referred to the committee on education that committee recommends a dis bill do pass by committee substitute\nMr. Speaker, it's colleagues as so often happens at this time of the year, the title of the original title of the bill doesn't really have anything to do with what's actually in the bill.\nbill. We subbed a language in in education committee and it was vetted by the house education\ncommittee so we don't have to worry about that. This bill requires students to take a computer\nscience class or a CTAE course embedded with computer science beginning in the 2031-31\n32 school year. It changes the reimbursement cost of tuition for the Georgia virtual school\nbecause that has not been adjusted since 2012, and it requires private online virtual schools to report enrollment to the student's homeschool district, and this is for purposes of keeping up with attendance so that we can get a handle on this chronic absenteeism policy, Mr. Speaker, that's the bill, and I will yield for any questions.\nThank you.\nLady has no questions.\nThank you, ask your favor consideration.\nI yield the well.\nLady had no questions.\nRepsync be queen is recognized and speak to the bill.\nRepsync be queen.\nThank you, Mr. Speaker.\nGood afternoon, colleagues.\nToday, I rise in strong support of Senate Bill 179.\nBecause as a teacher, I see firsthand\nhow quickly our world is changing\nand how urgently we need to ensure our students\nare ready to meet that change head on.\nThis bill is about preparing Georgia students\nnot just for graduation,\nbut for a life in a digital fast-moving world.\nSB 179 makes computer science a graduation requirement.\nStarting with the class of 2037,\nI can't believe I just said that out loud.\nI want to be clear, this is not just about learning code.\nSo when we think about computer science,\nwe think about C++ and Java is not just that.\nIt is about learning how to think.\nIt is about logic, creativity, resilience,\nand the ability to approach problems from multiple angles.\nWhether a student wants to go into agriculture,\narts, or medicine, these skills are essential.\nBut right now, less than half of 1% of Georgia high schools\ngraduates have taken a computer science course.\nAnd as an educator, I find this deeply concerning.\nOur students are growing up, surrounded by technology,\nbut they don't understand how it works,\nor how they can shape it instead of being shaped by it.\nMeanwhile, thousands of jobs in our state\nare going unfilled because we lack workers\nwith the necessary tech skills.\nComputer science is no longer just for tech companies.\nIt's for farmers using data to increase crop yields.\nIt's for nurses navigating electronic health records.\nIt's for small business owners,\nusing e-commerce platforms to grow.\nDigital literacy is essential,\nand computer science is the foundation.\nI have seen students light up from STEM lessons\nwhen they realize that they can build something real\nfrom nothing but an idea and a keyboard.\nIt's powerful.\nThat is the kind of empowerment this bill provides.\nIt tells every student in Georgia,\nyou belong in this future and you can build it.\nSB 179 also understands that access matters.\nIt allows students to take the required course\nany time between grades eight through 12.\nIt counts towards their math credit,\nscience credit, CTAE credit, fine arts,\nworld languages, or any electric credit.\nSo students don't have to choose\nbetween learning of vital skill\nand completing graduation requirements,\ngiving them the flexibility to pursue their passions\nwhile still gaining the tools they need.\nIt also increases funding for Georgia Virtual School,\nraising the tuition cap so more students,\nespecially in rural or underserved areas,\ncan take quality computer science courses online.\nThat's critical because where students live\nshould never determine,\noh sorry, because where a student live, sorry,\nshould never determine the opportunities that they have.\nJust as important, this bill invests in teachers.\nIt funds professional development grants\nto help educators become certified\nto teach computer science regardless of their background.\nbecause we know our students can't succeed\nif we don't also invest in the people\nwho are facilitating the instruction in the classroom.\nTechnology is evolving at lightning speed.\nIf you had told this chamber 20 years ago\nthat we'd one day have platforms\nthat can generate life-like images,\nanswer complex questions in seconds\nor even help write some of our speeches.\nI think many of us would have laughed.\nThe pace of change can feel overwhelming even for us\nAnd that's exactly why we must invest\nin preparing students not to just keep up, but to lead.\nWith the rise of tools like chat GPT\nand other AI platforms,\nit's clear these technologies aren't a passing trend,\nthey're shaping the future.\nAnd Georgia students need to understand\nhow they work because they're not going away.\nThey're here to stay.\nColleagues, this is about readiness.\nIt's about equity, it's about economic development,\nbut more than anything, it's about our kids.\nEvery single one of them deserves a shot at a future\nwhere they're not just surviving, but thriving.\nA future where they have understand\nthat the world they live in and have the skills\nto unchange it, to change it.\nWhat am I talking about?\nI urge your support for SB 179.\nThank you, Mrs. Speaker.\nI yield the well.\nThank you, the ladies yield the well.\nIs there any objection to the previous question being ordered?\nHere, none of the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere in the committee's substitutes adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere in the report of the committee's agreed to shout,\nthis bill now pass all in favor of the passage of the bill.\nWe'll vote, yes, all those opposed will vote no.\nAnd Mr. Clerk, we unlock the machine.\nAll members voted if so, all members voted if so, Ms. Clerk, we lot machine on the passage\nSB 179, the ASR 169, the NAZR 0, this will never see the requisite constitutional majority is therefore passed.\n.\n.\n.\n.\nMr. Clerk, will you read the caption to Senate Bill 218-218?\nSenate Bill 218 by Senator Robertson, the 29th and others to be titled.\nan act to amend Title 15 in the fish code of Georgia annotator relating to courts.\nSo it's required that the prosecuting attorney's qualifications commission\nshall be assigned for administrative purposes only to the administrative offices of the court.\nThis bill ever referred to the committee on Judiciary Non-Civil Act Committee recommends\nthat this bill do pass by Rules Committee Substitute.\nRepresentative Gullet.\nRepresentative Gullet is recognized to present the bill.\nThank you, Mr. Speaker.\nI'm sorry for those of you who got bombarded by your sheriffs, but just for full transparency\nin the rules committee this afternoon we removed the entire section that was problematic.\nI think that was a bunch of caution, but just if you share for each that to you with concerns,\nthat entire section is no longer in the bill.\nWhat this bill does is it moves the PAQC prosecuting attorney's qualifications commission from\nthe PAC, which is prosecuting Attorney's Council to the AOC to solve some conflict of\ninterest issues. It allows PAQC to issue subpoenas, and it creates penalties for the misuse\nof subpoena issuing. It clarifies the appeal process, and lays out that the PAQC is the\nfirst step, superior courts, the second step, appeals courts, third step, supreme court\nbefore step. And it also modifies a confidentiality related to DAs and solicitor generals that\nthey request so they can find out about complaints made against them but have been dismissed before\nreaching the public stage. Additionally, it will address specifically addresses their\nconcern that if a complaint at public sizes that they've filed a complaint, the PAQC can\ntell the DA or solicitor what's going on so they can respond appropriately and publicly.\nMr. Speaker, it's a clean up bill, and I appreciate your favorable consideration.\nHappy to answer a question if there is one.\nThe gentleman has one question representing more to you left as recognized for a question representing more.\nDoes the gentleman yield?\nI do.\nThank you.\nCan you tell me if this particular version of this bill includes Section Code 151610,\nthe Georgia anointed code in this.\nSo let's say that one more time.\nDoes this version of the bill include section what?\n15, 16, 10.\nNo, no, take a look.\nWhat's that section do?\nI may be give you a better idea from that.\nWell, what that section actually does is require\nthat there is a deputy, a sheriff deputy, take care\nof the every courthouse and every superior court judge.\nIn this particular version of the bill, it takes out every sheriff deputy and gives a gun to the attorneys.\nNo ma'am, that section was stripped.\nThis is LC492429S.\nThat's not in here.\nBut it still did not put back in, Georgia, 19 code, 15, 16, 10, which requires a sheriff deputy on premise at all times.\nIt's not removed as part of this bill.\nAbsolutely, it did not fit it back in there.\nThank you, Mr. Speaker.\nThank you.\nI ask for your favor, consideration.\nYou're the one.\nJune was yielded the well.\nIt is any objection to the previous question being ordered.\nHere in none the previous question is ordered.\nIs there any objection to withdrawing the committee substitute?\nHere in none the committee's substitutes were drawn.\nIs there any objection to adopting the substitute offered by the committee on rules?\nHere in none the rules committee's substitute is adopted.\nis any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill.\nHere in the other report, the committee's agreed to,\nshall this bill now pass.\nAll in favor of the passage of the bill, we'll vote yes.\nAll those opposed, we'll vote no.\nAnd Mr. Clerk, will you unlock the machine?\nhave, all members voted.\nIf so, Mr. Clerk, will you lock the machine on the passage of House Bill 218-218, the Yez are 149, the Nays are 18, the Bill enter see the requisite Constitution majority, is therefore passed.\nMr. Clerk will you read the caption to Senate bill 12 Senate bill 12 Senate bill 12 by Senate again to the 47th and others to be entitled\nan act to amend article 4 chapter 18 to total 50 the fiscal go to Georgia and it's added relating the inspection of public records\nSo it was revised, provisions related to documents and records in the possession of private persons or entities to spill them for the committee.\nAnd governmental affairs, that committee recommends this bill do pass by committee substitute.\nRepresentative Victor Anderson has recognized to present the bill, Chairman Anderson.\nThank you Mr. Speaker, my friends, I'm bringing to you Senate Bill 12, and before I start I want to confirm that we're dealing with\nwith LC473644S.\nThis is the version of the Senate bill\nthat passed out of the governmental affairs committee,\nnot the version that was presented in rules on Wednesday.\nSo this bill does basically two things.\nIt defines the custodian or lawful custodian\nof public records.\nAnd the second thing it does is it specifies\nthat those they request to view those public records\nmust come through the custodian.\nAnd then it further clarifies that any third party\nindividual or business or organization\nthat in conjunction with the government\nmay have some of those records\nthat those records would be provided\nto the custodian upon request.\nMr. Speaker, that's what this bill does\nand I will stand for any questions.\nWe're everything same part right in front of you to your lips. It's recognized for a question.\nThank you, Mr. Speaker. Does the gentleman yield?\nYes, sir.\nIs it not true that I greatly appreciate that Senate Bill of 12 has reverted back to the original version that passed out of the Senate with near unanimous support, and that also passed out of committee with carefully vetted language?\nI do believe this, sir, and as I might.\nIs it not true that Senate Bill 12 is, you know, provides narrow safe, is drafted in a manner that is narrowly tailored to accomplish its purpose?\nYes, sir, the gentleman knows what he speaks, and thank you.\nThank you so much.\nGentlemen, representing Todd Jones, your right is recognized for a question.\nThank you very much for bringing this bill but isn't it true that this clarification\nlanguage is going to protect Georgia company's intellectual property?\nIt will and also individuals, so thank you sir.\nThank you.\nMr. Speaker, if there are no other questions, I will yield the will.\nThe gentleman has yielded the well, it is an objection to the previous question being\nIn order, Chair, here's none of the previous questions ordered, is there any objection to adopting the Committee's substitute?\nHere in none, the Committee's substitute is adopted, is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill.\nHere in none, the report of the committee's agreed to shall this bill now pass all in favor of the pass to the bill.\nWe'll vote yes, all those opposed.\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nThey're there.\nI have all members voted.\nhave all members voted for what purpose is chair lady Smith rise she weighs all members\nMr. Clerk, were you locked the machine?\nOn the past, if Senate Bill 12, the yeas are 167, the nay is won.\nThis bill, haven't seen the requisite constitutional majority, is therefore passed.\nMr. Clerk, will you read a caption to Senate Bill 207?\nSenate Bill 207 by Senate, district them to the 42nd and others to be entitled to amendments.\n20, 26, 31, 33, and 43 for the Fischer Coda, George, Annotated Relay, and the Education\nFood, Drugs, and Cosmetics, Health Insurance, and Professions, and Businesses.\nThis bill, I'm referring to the Committee on Judiciary, Non-Simil, that Committee\nrecommends that this bill do pass by Rules Committee's Substitute.\nRepresentative Tyler Paul Smith is recognized to present the bill, Representative Smith.\nThank you, Mr. Speaker.\nI bring to you all today Senate Bill 207 Rules Committee\nSubstitute, and as you'll see, it's brief.\nAnd this would allow for the ability for our firefighters\nacross the state to hire someone who has completed\ntheir first offender status.\nI would be remiss if I didn't thank floor later Lauren McDonald\nfor some of his work in this area.\nAnd Mr. Speaker, that's what the bill does.\nI'll yield for any questions if there are any.\nGentleman has no questions.\nThank you, Mr. Speaker.\nI'll yield, and that's his body's favourable consideration.\nGentleman's yield to the well is any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopting the substitute offered by the Committee on Rules?\nHearing none, the Rules Committee's substitute is adopted.\nHe has any objection to agreeing to the report of the committee, which was favourable to the passage of the bill.\nin the report of the committee is agreed to, shall this bill now pass, all in favor of the\npasses bill. We'll vote yes. All those opposed? We'll vote no, and Mr. Clerk, will you unlock the machine?\nAll members voted, all members voted this so, Mr. Clerk, will you lock the machine?\nOn the passage of Senate Bill 207, the A's are 170 and A's are zero.\nThe Bill, having received the records, the constitutional majority is therefore passed.\nMembers, we're going to take up a local calendar, and then we're going to stand in recess and have some barbecue.\nOur local calendar has a couple of local bills with homestead exemptions bills and some\nfurther action.\nThree bills on the local calendar relate to homestead exemption and require a two-third\nroll call vote for passage.\nTwo bills are in the agreed disagree posture.\nBill haven't received a requisite number of signatures required.\nThe House delegation wishes to agree to the Senate's substitute.\nThe other bill haven't received the requisite number of signatures required.\nThe House delegation wishes to agree to the Senate's substitute as amended by the House.\nThird reading and passage of uncontested local bills.\nIf there is no objection, we will vote on the local calendar as a whole with a recorded vote.\nThe hearing none it is so ordered.\nMr. Clerk, will you read the local calendar?\nHouse Bill 896 by Representative Clark of the 100th Hall County, Senate Bill 332 by Senator Jones of the 10th to Cab County.\nSenate Bill 234 by Senator Payne of the 54th City of Dalton, Senate Bill 235 by Senator Payne of the 54th Whitfield County.\nSenate Bill 336 by Senator Moore of the 53rd Dade County, House Bill 685, agreeing to the Senate substitute by Representative Gamble of the 3rd.\n15th Bartow County House Bill 750 agreeing to the Senate substitute is amended by the House by Representative Cox in the 28th\nfor Scythe County\nIs there any objection to the previous question being ordered on the local calendar here in none the previous question is ordered\nIs any objection to agreeing to the report of the committee which was favorable to the passage of the bills here in\nthe committee has agreed to shall these bills now pass all those in favor of the\npass to the bills on the local calendar will vote yes all those opposed will\nvote no and mr. clerk will you unlock the machines\nFor what purpose is represented the carpenter rise parliamentary inquiry, please state your inquiry. Is it not true that the representative carpenter from the district for is\nHas a senator by the last name of pain in this legislation would\nNot be very kind of the fine people of Whitville County\nWe're what purpose is represented park rise parliamentary inquiry stage inquiry, sir\nIs it not true I greatly appreciate my friend from Don but it is also true that you reap what you sow\nOkay\nWhat purpose is represented camp rise\nParliamentary inquiry, is it not true this might not be the last local calendar of\nthe day and we have the ladies cheers committee so we'll certainly follow her lead\nAll members voted.\nAll members voted if so, Mr. Clerk, where you locked the machine on the passage of the local calendar.\nthe yeas are 112, the nays are 59.\nSo here's the posture of these bills.\nHouse bill 890, these bills required a majority.\nHouse bill 896, Senate bill 332.\nHouse bill 685, and House bill 750.\nThose four bills have received the requisite Constitution\nmajority and are there for a past. Senate bill 234, Senate bill 235, and Senate\nbill 336 have failed to get a 2-3rd majority and they have failed.\nOkay, we have a couple of announcements for dinner time.\nOh, you country boys are ready for supper and girls.\nChairman Gunther is recognized for an announcement.\nLadies and gentlemen, in the Judiciary Committee, we have Jim's smoking cue from my neck of the woods coming down here bringing ribs and barbecue, and their slogan is, you can smell their butts for miles.\nSo, it's really good. I suggest you come and eat with us.\nDid you really say that you can smell their butts for miles.\nI want everybody to hear that one.\nSo that's Dreamland.\nThat's Dreamland.\nWho's the name of the barbecue joint?\nJim's.\nOkay.\nRepresentative Sharper is recognized for an announcement.\nI'm gonna be very, very brief.\nThank you so much, Speaker.\nThank Angela Moore for the cheesecake\nand everything she did.\nThank you so much for that.\nAnd also she's gone up,\nbut she's been honored as the Trailblazer of the Year Award\nby the National Association of Women in Arts,\nBlack Women in Jazz and Arts\nand the Black Women's History Month honors.\nSo we'll appreciate a bit of celebrity publics and also working hard in the entertainment industry.\nThank you so much more.\nAppreciate you.\nThat's my sweet mate, y'all.\nRepresentative Coyote, you have an announcement.\nThis will be paid.\nOkay, everyone give the gentleman your attention.\nRepresentative Gaby Coyote, then I will tell you about the barbecue from Dreamland.\nThank you, Mrs. Speaker.\nEveryone, if you signed up to go to Nigeria in July,\nplease look out for my email.\nWe are about ready to start collecting payments.\nAnd you are going to have fun in Nigeria.\nAnd if you are interested in having signed up,\nright now we have about 48 people signed up.\nIf you are interested, please see me.\nThank you, Mr. Speaker.\nThank you, sir.\nHere's the deal, members.\nOur, your dinner and my dinner is in room 216.\nWe have barbecue from Dreamland.\nI don't think they had the same slogan\nis what Chairman Gunther's group did,\nbut they're in room 266.\nNow this barbecue is for house members and for house staff.\nSo when everyone's fed, if there's anything,\nit remains that may open the door, but for right now,\nwe wanna ensure that all of you have a nourishing dinner,\nit will be delicious house members and house staff.\nAll right members this house will be in recess until 7 p.m. 7 p.m. and then we will get\nwith the order of the day, 7 p.m. House will stand in recess.\n",
  "updated_at": "2026-02-11T21:09:10.800432+00:00"
}