{
  "video_id": "uWSQJMN-W9A",
  "url": "https://www.youtube.com/watch?v=uWSQJMN-W9A",
  "title": "House AM Day 27 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 133,
  "summary": "Here is a summary of the Georgia House AM Day 27 of the 2025 Session session:\n\n**Overview**\nThe session included a scripture reading and prayer by the chaplain, as well as recognition of a local pastor from Warner Robins. The majority of the session focused on routine procedures and did not feature any notable legislative actions.\n\n**Key Actions**\nNone.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- The chaplain, Pastor Vince Harrington, delivered a sermon focusing on the parable of the Good Samaritan and the importance of showing love and compassion in the decisions made by the legislators.\n- Rep. Biffany Ballard introduced Pastor Harrington and spoke about his work in the community, including operating a warming center and providing resources for homeless residents.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nA quorum was present, as all members were instructed to come to the floor for the morning roll call.\n\n**Adjournment**\nThe session adjourned, but the transcript does not specify the exact time or the date of the next session.",
  "transcript": "All members please come to the floor. Thank you. All members please come to the floor because the hour convening have arrived. All members please take their seats. Mr. Clerk will you ring the bell. Thank you, Mr. Clerk. All members are going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk will you unlock the machines. All members please come to the floor. All members present will please vote green to signify their presence in the chamber. All members present will please vote green to signify their presence in the chamber. Good Tuesday morning. What day is this? Thank goodness for those peanuts and that jelly. I had my share. I don't know about y'all. Appreciate those peanut growers. The number one peanut state in America. This great state of Georgia. We're glad they're with us today. Doorkeepers, will you please close the doors and keep them closed? I'll do that first. I got excited about those peanuts. I guess you could tell that. Have all members now voted? If so, Mr. Clerk, will you lock the machines? Thank you, members. Doorkeepers, now will you lock the doors and keep them locked? As is our custom, we will begin our day with scripture reading and prayer by our chaplain. We will begin our day with scripture reading and prayer by our chaplain. Today, our chaplain will be introduced by the lady from the 147th House District. Over in Warner Robbins, Representative Biffany Ballard. Thank you, Mr. Speaker. Good morning, members. I think it's my pleasure to introduce Pastor Vince Harrington, and his wife, Antoine. They are from no limit Baptist Church in Warner Robbins. And I met him last year when he came to the Capitol with a group of pastors to pray for us. And he and I have had many conversations over the past year or so. He is a nurse, and his career field shows that he has a heart for service. that his church. They run a warming center for our homeless residents during the winter months, but more than that, they brought in portable showers. They help people get documents that they need in order to get jobs and housing. So it's so much more than just your traditional homeless shelter. So he really does have a heart for service. And one of the things that's in his long term plan, which is near and dear to my heart, is a love for students. And his long term goal is to have something at his church where we can help students who don't have Wi-Fi at their house get Wi-Fi to do their homework. So that's their long term goal. And I'm so pleased to have him here today. And I hope that you enjoy his message. Thank you, sir. Good to have you, my son. Good morning, everyone. It is just good to be here. Thank you so much, Mr. Ballard. Thank you so much, Speaker. It is good to be here on this day that the Lord have made. They told me I was to do a scripture and a little word and a prayer. So if I could do a scripture, it would be Luke the 10th chapter, 25th verse, just as being behold, a certain lawyer stood up and tempting him saying, master, what shall I do to inherit eternal life? They asked me to come here and I was thinking what would I say to such a group of prestigious people? What would I say to a group of people who has the weight of the world on their shoulders? A group of people who would come and Delhi make decisions that affect people's lives. And as a thing, God reminded me of a story here in Luke, a lawyer, a scribe, a lawyer, an educated man comes to Jesus. And when he comes to Jesus, he simply asked him, what must I do to obtain eternal life? He basically asked, what do I have to do to make myself worthy? What do I have to do to make myself on that list of what they call good people? What do I have to do to make myself on the list of the ones that they say, yes, what you made it in? What do I have to do to obtain this thing called eternal life? And Jesus, being Jesus, takes them back to the law and says, what does the law says? He says, the law says to love God first, but then it says to love your brothers as you love yourself. First thing I want to tell you guys is simply, guess what? You're in a position to show love. Every day you will make laws, every day, you will make decisions, but let your decisions be in love. If you do a decision in love, it'll always be the right decision. He tells them, as he's looking, he tells them, Jesus tells them a story. He says, there's a young man he's coming from Jerusalem to Jericho and along the way he is robbed. He is stripped. He is wounded and he is left for dead. He said, while he's there, long comes the past and the priest, the bishop, the rabbi. He comes. He sees him, but he moves to the other side of the road. He looks as not only the bishop comes, but another man comes. He's a good man. He has more calls. He's going to church every Sunday, but he sees him, but he moves to the other side of the road. He says, but lastly, there's a Samaritan. Now this Samaritan you're looking and understanding something about this Samaritan, he's the type of man who doesn't deal with the Jewish people. They don't talk to each other. They're not of the same religion. They're not the same race. They don't walk to the same place. Don't go to the same places, but he looks and sees this man wounded. He stops. He heals his wounds. He picks him up. He carries him. Takes him to the end or the hospital. Pays for his care. But that's why, why would he do this to someone he doesn't know. Someone who doesn't think like him doesn't look like him. Pays the God of saying, if we want to inherit that internal life, know that the decisions you make, people are hurting. Life has hurt all of us. We can all have occasions and thoughts to realize we've been wounded in life and we all need somebody to stop and see about us. We're all going to have a time in our life that we need somebody to check on our wounds. We're all going to have a time in our life that you're going to need someone to carry you along the way. Your decisions that you were making this house were determined who was healed. We helped heal someone. Your decisions will help carry someone. Every day you make decisions just remember you know what somebody's wounded and I'm in a position to help. Somebody's hurting. I'm in a position to help. And if you just show love, we all just show love one another because one thing we know, this is a great state. This state has gone through a lot but through love we've come together. We've gone through storms, we've gone through battles but every hardship has brought us together and through love we've gotten stronger. Every day I'm just going to show love and the more we show love, guess what? One day we'll all meet that mark where we can be obtained that eternal life. I pray God bless you as I go to pray for you. Ask that you all please stand and join me in prayer as I pray for you. Pray with me. Heavenly Father in the name of Jesus, Lord we come before you now. Lord we're humble. Recognize we can do nothing without you but with you all things are possible. Lord ask right now, Lord, that you bless this house. Lord bless each and every person in here, you know their needs, Lord. Let your wisdom fall upon them, Lord. Lord that your wisdom may come through them, Lord. Let your love, Lord, touch their hearts, Lord, that love may be shown by this house, Lord. And Lord that you may get the glory, continue to bless this state. Lord bless our governor, Lord. Bless us. Speak of the house, Lord. And let that anointing run down to each and every member, Lord. And Lord we give you all the glory. It's in Jesus name we pray. Amen. Amen. God bless you. Why are you standing? Please join me as we say the pledge of allegiance. May the states of America, the southern republic, which stands for one nation under the individual, the individual and justice law. God bless you. That's strong. Thank you so much. Members, we want to thank Pastor Harrington for his ministry here today but especially for his ministry in Warner Robbins and all the lives he's impacting in Warner Robbins. Thank you for that as well. Doorkeepers you may open the doors, members you may join Pastor Harrington in the south any room and greet him and thank him for his service and get a photo. Members, our doctor of the day today is brought to us by our own doctor Dr. Newton, chairman Newton, Dr. Hong she is downstairs in the in the eight station if you need Dr. Shee. Make sure you call on. Chairman Hilton the chair of the committee on information and audits is recognized. Chairman Hilton. Thank you Mr. Speaker. Past the banyese. It is fat Tuesday. Marty Grah. Also your committee on information audits has read the journal of the previous legislative day and we found it to be correct. I'm sure it's fun down there but I'd rather be here. No doubt about that. Chairman Hilton the chair of the committee on the patient and audit reports that the journal of the previous legislative day has been read and found to be correct is an objection to dispense with the reading of the journal. Here he none the reading the journal is dispensed with is any objection to the confirmation of the journal. Here he none the journal is confirmed. Mr. Clerk will you read the resolution establishing the order of business for the day. Representative Strachan the 104th is filed. He establishes the order of business during the first part of the period unanimous concerns introduction of bills and resolutions first reading and reference of House bills and resolutions second reading of bills and resolutions reports of standing committees third reading and passage of uncontested local bills and resolutions first reading and reference of Senate bills and resolutions morning orders. Is there any objection to adoption of the resolution establishing the order of business for the day. Here he none the resolution is adopted. First reading the bills and resolutions the clerk will read House bill 697 by reps of tarvern in the second camera to the first bill be taught and act to provide a homestead exemption from city at Sikamaga independent school district ad valorem taxes. Enter government coordination House bill 698 by reps of tarvern in the second camera to the first bill be taught and act to provide a homestead exemption from Walker County school district ad valorem taxes. Enter government coordination House bill 699 by reps of weight of the ninth chest and into the seventh will be taught on act to amend the night creating board of elections and registration for Dawson County. Enter government coordination House bill 700 by reps of out of sound out of the 30-40-3rd back to the 96 draper of the 90th will be entitled act to amend codes section 10-1-393.3 of the fiscal to Georgia and Taylor relating to prohibited use of purchases credit card. Banks and banking House bill 7-01 by reps of chokus the hundred fifty first be taught and act to authorize the assessment collection of a technology feed by the probate port of tarrel county. Enter government coordination House bill 7-02 by reps of robberts the 52nd draper the 90th mark of the hundred and seventh trend in the 80th Campbell 35th bill be taught and act to amend chapter 2 title 21 of the fiscal to Georgia and Taylor relating primaries and elections generally. Governmental affairs House bill 7-03 by reps of the bottom of the 73rd made the act of the 82nd plays more than 69th Jackson the 68th bill be taught and act to amend the night providing homestead exemption from the city of peat tree city ad valorem taxes. Enter government coordination House bill 7-04 by reps of chokus the hundred fifty first Jones the 25th dupe nick of the 29th dicky the hundred and 34th black one of the hundred forty six and others bill be taught and act to amend code section 56 25 of the fiscal to Georgia and Taylor relating maintenance and statistics on architectural and engineering firms. Small business development House bill 7-05 by reps of the son of the 43rd McLean to the hundred and ninth. Ridley the 22nd bill be taught and act to amend article 1 of chapter 1 title 40 the fiscal to Georgia annotated relaying the general provisions relative identification and regulation of motor vehicles. Public safety and homeland security House bill 7-06 by reps of the son of the 43rd McLean to the 61st all the eight 59th toss into the 65th and cannon of the 58th bill be taught and act to amend article 6 of chapter 2 title 20 the fiscal to Georgia and Taylor relating the quality basic education act. Education House bill 7-07 by reps of out of son of the 53rd comics of 39th limit the 98th bill be taught and act to amend chapter 7 of the title 44 the fiscal to Georgia and it's headed relating to landlord and tenant. Judiciary House bill 7-08 by reps of out of son of the 43rd comics that thought 39th limit the 98th will be taught and act to amend chapter 7 of the title 44 the fiscal to Georgia annotated relating to landlord and tenant. Judiciary House bill 7-09 by reps of out of son of the 10th or one of the 30th bill be taught and act to authorize the city of Demarest Georgia to exercise all redevelopment and other powers. The intergovernmental coordination House bill 7-10 by reps of out of Jackson the 68th Mitchell the 88 Sanchez the 42nd Scott of the 76th and Scopefield the 63rd bill be taught and act to amend title 10 and 44 of the fiscal to Georgia and Taylor relating to commerce and trade. Judiciary House bill 7-11 by reps of out of the 76th Davis the 87th Scopefield the 63rd to build be taught and act to amend chapter 11 and title 16 in the fiscal to Georgia and tenant. Taylor relating offenses against public order and safety. Public safety and homeland security House bill 7-12 by reps of out of the 76th Davis the 87th Scopefield the 63rd bill be taught and act to amend article 11-05 by the title 48 of the fiscal to Georgia and tenant. Taylor relating to general provisions regarding ad valorem taxation ways and means House bill 7-13 by reps of out of the 76th Davis the 87th Scopefield the 63rd in Jackson the 68th bill be taught and act to amend chapter 11-10 by 20th. The fiscal to Georgia and tenant relating to general provisions regarding the general assembly rules House bill 7-14 by reps of Hitchens the 61st to build be taught and act to amend the act to bride for the creation of one or more community improvement districts in the city or dry cone. Intergovernmental coordination House will 7-15 by reps of Barry the 56th Kendrick the 95th Clark 100 and 8th Evans the 57th Hulkum the 101st to build be taught and act to amend article 4 chapter 3 title 8 in the fiscal to Georgia and tenant relating fair housing. The judiciary House bill 7-16 by reps of Barry the 56th Carpenter the 4th Frile 120 second Park the 107th Sanchez the 42nd and others bill be taught and act to amend part 3 of article 7 chapter 3 title 20 relief is go to Georgia and tenant relating the Georgia student finance authority higher education House resolution 462 by reps of rovers the 52nd Traper the 90th Park the 107th Triana the 80th Campbell 35th Resolution proposing an amendment the Constitution says provide the people the state of Georgia shall have the power to enact government affairs House resolution 463 by resident Baker the 64th Stinson the 150th Davis of the 87th Taylor the 92nd Bennett the 94th and others the resolution designated the month of Marches auto immune disease awareness month special rules Senate bill 20 by senator compatriot of 30 second summers of 13th pain of the 54th Anderson the 24th parent of the 44th bill be taught on act to amend article 7 chapter 3 title 20 the fish quoted Georgia and tenant relating scholarships loans and grants higher education Senate bill 29 by reps of by senator Williams of the 25th albors to 56 rovers of the 29th Hodges the third beard knew 30th and others bill be taught an act to amend article 6a chapter 3 title 35 for the fish go to Georgia and tenant relating DNA sampling public safety and homeland security Senate bill 30 by senator Watson of the first goods the 51st Kennedy the 18th Dixon the 45th of bill be taught an act to amend article 1 in chapter 7 of title 31 and article 1 of chapter 34 title 43 the fish go to Georgia and tenant related regulation of hospitals and related institutions public and community health Senate bill 31 by senator Donna salad the 27th the 51st Kennedy the 18th and end of art day the 31st Kupatric 30 second and others bill be taught an act to amend chapter 7 title 48 the fish go to Georgia and tenant relating to income taxes ways and means Senate bill 46 by senator harbors of 16 dollars out of the 27th tillery the 19th anit of art day the 31st Kennedy the 18th and others bill be taught an act to amend chapter 1 of title 50 the fish go to Georgia and tenant relating the general provisions relative to state government budget and fiscal affairs oversight Senate bill 51 by senator assessor thirty seven press the six dicks and the 45th ginseng 47th Jones the 10th and others bill be taught an act to amend chapter 4 title 32 the fish go to Georgia and tenant relating to state county and municipal road systems government affairs Senate bill 55 by senator hickman the 4th Halper the 39th s to vets and 30th still the 48th equals the 49th and others bill be taught an act to amend title 34 the fish go to Georgia and tenant relating to labor and industrial relations industry and labor Senate bill 56 by senator hannabartate of 31st albors the 56th Robertson 29th Kennedy the 18th Gucci the 51st and others bill be taught an act to amend part one of our chapter 9 and title 45 the fish go to Georgia and tenant related Georgia state indemnification fund public safety and homeland security Senate bill 74 by senator burns the 23rd Walker the 27th Donald's out of 27th summers and 13th hickman the 4th and others bill be taught an act to amend part three of our three chapter 12 title 16 is the fish go to Georgia and tenant relating sales or distribution of harmful materials judiciary non-civil the Senate bill 85 by senator brass the six beats and 21st and in the barter the 31st harvester the 15th wick of 34th and others bill be taught an act to amend article 12 of chapter 3 and title 20 the fish go to Georgia and tenant relating to post-secondary education higher education Senate bill 111 by senator albors the 56th burns the 23rd ramen of the fifth still the 48th sensual 37th and others bill be taught an act to amend title 10 of the fish go to Georgia and tenant relating to commerce and trade technology and infrastructure innovation Senate bill 139 by senator dixon's 45th still the 48th and cows are the 46th bill be taught an act to amend act to incorporate the city of mulberry enter governmental coordination general Senate bill 151 by senators beats the 21st albors the 56th and still the 48th bill be taught an act to create the joint development authority of north-vote municipalities enter governmental coordination general Senate bill 175 by senator robberts and the 29th beats the 21st brass the six good but in the eighth Hodges the third and others bill be taught an act to amend article 12 of chapter 21 of the fish go to Georgia and tenant relating to federal business regarding elections government Lafayr's Senate bill 185 by senator robberts and 29th goods the 51st albors the 56th summaries the 13th burns the 23rd and others bill be taught an act to amend chapter 5 of title 42 for the fish go to Georgia and tenant relating to correctional institutions public and community health Senate bill 195 by senator huff statler the 52nd capacitor to 30 second lots of the first parent of the 44th and oracle 36th bill be taught an act to amend article 6 of chapter 4 titled 26 for the fish go to Georgia relating to pharmacies health Senate bill 6206 by senator summers the 13th bill be taught an act to create the South Georgia energy authority enter governmental coordination the Senate bill 234 by senator pain is 54th of bill be taught an act to provide a homestead exemption from city adult and independent school district ad valorem taxes enter governmental coordination Senate bill 235 by senator pain is 54th of bill be taught an act to provide a homestead exemption from Whitfield County school district ad valorem taxes enter governmental coordination Senate bill 237 by senator strickland with 42nd and Anderson with 43rd of bill be taught an act to amend an act creating and establishing the Newton County public facilities authority enter governmental coordination Senate bill 302 by senator kenny the 18th bill be taught an act to provide a homestead exemption from peach county ad valorem taxes enter governmental coordination that completes first readers second reading the bills and resolutions the clerk will read House bill 682 by represent Mitchell the 88th the bill relating to the death penalty House bill 683 by represent golleter the 19th bill relating to certain residential fire sprinkler requirements for a heavy to the house bill 684 by represent Taylor the 92nd he would leave the 144th out of the 66 Williams with this 168th holly of the 116th bill relating to barbers and cosmatologist House bill 685 by represent gamble the 15th and scolcons of the 14th bill to provide creation of one or more community improvement districts in barto county House bill 686 by represent we now are the 121st Martin of the 49th of the 29th Williams of the 148th the bill relating to state government House bill 687 by represent Crawford of the 89th Oliver of the 84th wills of the 55th draper of the 90th Friday the 120 second to bill relating to security deposits House bill 688 by represent Crawford of the 89th Holcomb of the 101st Oliver of the 84th Westbrook of the 163rd to bill relating to manner for service of process House bill 690 by represent Newton of the 127th out of the 50th Cooper of the 40th Stevens of the 164th Hawkins of the 27th a bill relating to regulation and licensure of pharmacy benefit managers House bill 692 by represent Newton of the 127th Hawkins of the 27th a bill relating to mandatory reporting requirements for nurses House bill 6893 by represent Carpenter of the 4th bill relating to state\n\nThe conditions relative to tuition, equalization grants at private colleges and universities, the Civil 694, my represent, Lepton of the 83rd, them of the 98th, Wilkinson of the 38th, the Bill relating to elementary and secondary education grants, House Bill 695 by Representative Santos of the 117th, Reese of the 148th, Bell of the 75th, Barry of the 56th, Florida, of the 74th and others, they bill relating to the Georgia student finance authority, House Bill 696, my represent, Santos of the 117th, Smith of the 18th, Barry of the 56th, Neil of the 79th, five, the 120th, second, and others, they bill relating to elementary and secondary education, House Bill 717, by Representative Cooper of the 45th, Newton of the 120th, seven still talks of the 53rd, Drenner of the 85th, Al of the 50th, they bill relating to medical practice act of the State of Georgia, House Bill 718 by Representative Jones of the 60th, they bill relating to holidays and observances, House Resolution 449 by Representative Smith of the 18th, Hunter of the 8th, Kelly of the 16th, Reeves of the 99th, Roberts of the 52nd, a resolution creating the House Study Committee on Modernization of the Traffic Biulations Bureau, House Resolution 450, by Representative White Hour of the 111st Martin of the 49th, Williams of the 168th, Williams of the 148, he will leave the 141st and others, a resolution proposing amendment to the Constitution of the State of Georgia, so it's authorized the Georgia General Assembly to provide by law for sports betting in this state. Senate Bill 88 by Senator Bearden of the 30th and Chames of the 28th, the bill relating to the number of judges of Superior Court, Senate Bill 145 by Senator Bearden of the 23rd, Jones of the 22nd, Anderson of the 24th, the bill relating to the number of judges of Superior Court, Senate Bill 152 by Senator Dulles, all of the 27th, Kennedy of the 18th, to the 51st, Roberts of the 29th, Brass of the 6th, and others, a bill relating to amend the Georgia Promise Scholarship Act, Senate Bill 153 by Senator Hetchah of the 50th, Kennedy of the 18th, Jones of the 22nd, Council of the 46th, Parenthood of the 44th, and others, a bill to amend the official cut of Georgia annotated, so it's to revise modernized correct errors or emissions in and reenact the statutory portion of said code. Senate Bill 238 by Senator Anderson of the 20th, 43rd, a bill to amend and act creating a Board of Commissioners of Rockdale County through 2nd Readers. The report's of standing committees, the clerk will read. Senate Mat Hetchah of the 150th District Chairman, Committee on Impropriations submitted to the following report. And to speak, your committee on appropriations says, had an urge consideration following bills of the houses, the structure made a report the same back to the house with the following recommendations. House of Resolution 118, Deupass House of Resolution 119, Deupass House of Resolution 128, Deupass House of Resolution 129, Deupass respectfully submitted. Senate Mat Hetchah of the 150th District Chairman, of said of Ron Stevens on the 64th District Chairman of the Committee on Economic Development and Tourism submitted to the following report. And to speak, your committee on economic development and tourism has had an urge consideration following bill of the houses, the structure made a report the same back to the house with the following recommendations. House of 490, Deupass by substitute respectfully submitted. Representative Ron Stevens on the 164th District Chairman. Representative Jesse Petrie on the 166th District Chairman of the Committee on Human Relations and Aging submitted the following report. To speak, your committee on human relations and aging has had an urge consideration following bill of the houses, the structure made a report the same back to the house with the following recommendations. House of 645, Deupass respectfully submitted. Representative Jesse Petrie of the 166th District Chairman. Representative Beth Camp of the 135th District Chairman of the Committee on Intergrubble Coordination Locals submitted the following report. To speak, your committee on intergrubble coordination locals had an urge consideration following bills of the house and senate. And to instruct the immediate report, same back to the house with following recommendations. House of 534, Deupass House of 536, Deupass House of 572. Deupass House of 594, Deupass House of 596, Deupass House of 6503, Deupass House of 608, Deupass House of 615, Deupass House of 619, Deupass House of 622, Deupass House of 625, Deupass House of 640, Deupass Allissette and Senate Bill 7ie Deupass House of 7ie 8. 78 to pass. Hospital 30 to pass by substitute. Hospital 539 to pass. Hospital 540 to pass. Hospital 595 to pass. The Senate bill to pass by substitute. Senate bill 83 to pass by Senate by substitute. Hospital 648 to pass respectfully submitted. Representative Beth Camp, 135th district chairman. Representative Gunner, the 8th district chairman of the committee on judiciary submitted the following report. To speak, your committee on judiciary has had under its consideration following bills the House. And as the struck to meet report saying back to the House of following recommendations. Hospital 555 to pass by committee substitute. Hospital 618 to pass. Hospital 664 to pass. Hospital 671 to pass by committee substitute. Hospital 676 to pass respectfully submitted. Representative Gunner, the 8th district chairman. Representative Flink Crow, the 180th district chairman of the committee on public safety and homeland security submitted the following report. To speak, your committee on public safety and homeland security has had under its consideration the following bills the House has struck to meet report to same back to the House of following recommendations. Hospital 138 to pass by committee substitute. Hospital 288 to pass by committee substitute. Hospital 433 to pass by committee substitute. Hospital 646 to pass by committee substitute. Hospital 691 to pass by committee substitute respectfully submitted. Representative Flink Crow, the 118th district chairman. Representative Mitchell Skoggins, the 14th district chairman of the committee on special rules submitted the following report. To speak, your committee on special rules has had under its consideration the following bill of the House has struck to meet reports same back to the House of following recommendation. Hospital 718 to pass respectfully submitted. Representative Mitchell Skoggins, the 14th district chairman. That completes the reading of the reports of standing committees. Okay members, all members will please come to the floor. Welcome to your seats. Okay members, we do have a local calendar this morning. Members will please come to your desk. We do have a local calendar. Mr. Clerk, hit that bell a couple times please. There's no home. Okay members, here's our posture on the local calendar. There's seven bills on the local calendar that relate to home state exemption. Require a recorded two-thirds roll call vote for passage. This will be the third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. For what purpose does chair lady camp rise to make a motion? State your motion. To move House bill 615 from the local calendar, remove it and move it back to intergovernmental coordination committee. The ladies move the House bill 615 be moved back to the committee. Is that what chair motion is? Yes, Mr. Speaker. Moves back to her committee. Is the objection? Hearing none is so ordered. No objections to the remainder of the local calendar. Mr. Clerk, will you read the local calendar? House bill 534 by reps of Jackson, 68th City of Fairburn, House bill 536 by reps of Jackson, 68th City of Fairburn, House bill 572 by reps of Persinger, 119th town of Brown. House bill 594 by reps of Green to the 154th Baker County, House bill 596 by reps of Canada, 172nd Colpwick County, House bill 603 by reps of Irwin, 32nd Banks County, House bill 608 by reps of the Rees of the 140th, the Muscogee County, House bill 619 by reps of Green to the 154th City of Donaldson Bill, House bill 22 by reps of Corbord of the 174th City of the Whole Boken. House bill 625 by reps of Stillcox, the 53rd Folton County, House bill 640 by reps of Martin, the 49th City of Al Ugh trenches of Miss Smith 30ранks. House bill 625 by reps of The四. Nan claps at First City of Tubby Island, House bill 30 by substitute by reps放art the third Cattusa County House legalices, Haes 파�ta, Nova, 39 by reps of Rees, the 99thang, of Rees the 99th Gwyneth County, House will 540 by Rees and 99th Gwyneth County, House will 595 by Rees and a green with 154th early county, House will 648 by Rees and a Skullfield 63rd City of College Park, Senate Bill 77 by substitute by Senator Huffsteadler, the 52nd City of Carter's Fill, and Senate Bill 83 by substitute by Senator Huffsteadler, the 52nd Parto County. Is there any objection to the previous question being ordered on the local calendar? Here in none the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? Here in none the report of the committee is agreed to, shall these bills now pass all those in favor of the passage of the local bills on the local calendar will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machines? Have all members voted? All members voted. Mr. Clerk will you lock the machines? On the passage of the local calendar the yeas are 172. The nays are zero. These bills, every see your requisite constitutional majority are therefore passed. Members, we have several former members of this House on the floor today. I see several of them, but I don't see one, but I'm going to introduce ladies first. Ladies and gentlemen, this House is a representative of the House on the floor. There she is. It's good to have you back, Terry. Now, gentlemen that led this House and a compassionate effective manner over the years when he served here as a chairman, as a dear friend and representing Tom Rice, chairman Tom Rice. Good to have you back in the House. Thank you for being here. We'll see him maybe a little bit later, but there he is, representing William Modi. Thank you. Good to have you back. Members, we'll move it on the morning orders. I'm going to ask the members if they'll take just a couple of minutes on their morning orders. There may be a couple that need a moment longer, so if you can help us with that time, that would be very much appreciated. Okay, members, we have some important morning orders this morning. A lot of folks have traveled a distance to be with us. Our first morning order is going, I'm going to recognize the pro-trim of this House, pro-trim Jones, Ripley Glaze, and the Fulton delegation. Fulton delegation, if you'll come down front, Fulton delegation. The ladies recognize when your friends arrive. Well, thank you, Mr. Speaker, and we also have education chair, Chris Erwin joining us and former Georgia Superintendent of the Year. We are honored to gather today here to recognize Fulton Schools Superintendent Dr. Mike Looney, who was selected as the Georgia 2024 Superintendent of the Year. We're proud of him, proud to have him lead our schools. Thank you, Dr. Looney. Dr. Looney has led our school system of 80,000 students in 104 schools for the last five years. He's a retired Marine and has the unique distinction of also being the former Tennessee Superintendent of the Year. He has always put students first, and we are proud to have him lead our schools. If you would join me again in recognizing Dr. Looney, we really appreciate you, Dr. Looney. Thank you, Dr. Looney. Thank you so much, Dr. Looney, for the work that you've done, how you have increased the academic success of our students, given them pathways into the marketplace, and you have done it in innovative and excellent ways. Thank you for our school board members who are with us, and one of our newest principals, principal Bentley, down at CHGLAB. Thank you guys for what you do for our children in Fulton County. Please meet us in the annual for pictures. Thank you, Mr. Superintendent, and board members, and Madam Principal, thank you for your service to our children. We appreciate you all, and thanks for being here. Representative Silcox has recognized for morning order. Thank you, Mr. Speaker. I am delighted this morning to welcome my fellow members of the Junior League of Atlanta. The Junior League is a women's organization that has given thousands of volunteer hours to the service of the Atlanta community for over 107 years. The League provides strong leadership training and development, and connects women committed to civic transformation. Please give a big hand and a warm welcome to the Junior League of Atlanta. Welcome ladies. Good to have you, Junior League. You do a lot of good work. We appreciate you all being here today. Thank you. Thank you, Representative Silcox. Members, I need your attention. The House has some special guests here today. Representative Park Cannon has some special guests. She's going to be joined by Representative Bennett and several other members. So thank you members for coming and joining her now. Members, if you'll rise with me. Thank you for these connelluses. Thank you, Mr. Speaker. Thank you members. This week, last year, the lives of two bright young Atlanta parents change as they experience an inexplicable emergency. I want to say to you, you may feel the weight of your loss on your shoulders after doing everything right. I want you to know that today, this House shares that weight with you and will shoulder it with you. The Bible says the Lord is near to those who have a broken heart and saves us. Blessed are those who mourn for they shall be comforted. I'm honored today to present this resolution to the Burns family in the gallery and to participate in their nonprofits call to action to address sudden infant death syndrome in the state of Georgia. Today, we honor Cari Orame burns with the colors yellow for optimism, pink for innocence and white for purity. We will have a lunch today in a balloon release to pay homage to the loss of your beautiful baby girl. This is the resolution here. And I'd like to ask for a moment of silence for your beautiful baby girl. Thank you members. Thank you, Mr. Speaker. Thank you, Representative Cannon. Thank you members. To the family, our condolences go out to you. Thank you. I know it's a hard day for you to be here with us. So thank you for being here. We appreciate your efforts as well. Representative Jasmine Clark has recognized for a morning order and some friends. Thank you. No, we got, we got solid. Thank you, Mr. Speaker. This morning, I want to welcome members of Bula Baptist Church as well as many faith leaders that have come down to the Capitol to talk about civil rights. So if you all are in a gallery, could you please stand? Yes. Thank you so much for being here. Welcome to the People's House. We appreciate you. And again, thank you. Thank you, Mr. Speaker. Thank you members. Welcome to the People's House. And the Capitol. Thank you for making the trip. I hope you have a good day. Representative Bell. Representative Eric Bell has recognized for a morning order. Representative Scott, your own deck. Can you please join me? Clayton State. Thank you for the acknowledge colleagues. Today, the lake show is in the building. I'm not talking about magic, little brun and all those other ones like Karim. But the Clayton State University, all the way from Clayton County. Today, we have a president George Lewis, Michael Little and Dr. Jill, great campus of CSU right down in Monroe, Georgia, where they help educate and graduate students all across the state of Georgia. We even have some of their very own alumni here serving with us today in this house. So please, please stand and give a round of applause for Clayton State University as they help educate us here. Dr. George is on our right. Do the will. Oh, and we'll also like to acknowledge their nursing school. Thank you. I you the will. Welcome Clayton State. You're doing a great job down there. We appreciate what y'all do. It's good to see y'all. Representative Sandra Scott is recognized for a morning order and some friends. Don't talk about some veterans. I think she is. Ladies recognized. Good morning. Today is female veterans day at the Capitol. We had a great breakfast this morning. Thank you. This is our 10th year celebrated women veterans. So if any female veterans in the gallery, will you please stand? Today is your day. But you know every day inside with days. But today is your day at the house. Thank you ladies. Go army. Go army. Next year. Thank you. Thank you. Thank you. Thank you. Thank you. I'm honored to have the Georgia peanut commission, the national peanuts by points association, along with multiple peanut by points, shelling plants and peanut growers in my district. As many of you know, Georgia produces half of the nation's total supply of peanuts. The peanuts contribute over 2 billion to the Georgia economy supporting livelihoods of over 150,000 Georgians including that of my family. I hope you'll join me in welcoming members of the Georgia peanut industry and recognizing today as Georgia peanut day at the Capitol. Thank you. Thank you. Thank you. Thank you. Thank you. Leader Hewley. Thank you. Have something special. Let me get some attention here for this one. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Happy birthday. Good to have you. Your mom's proud of you. I know you're proud of your mom and two. Good to have you with us. Thank you, leader. We're representing Joe Campbell. Recognized for a morning order. We're representing Joe Campbell. Gentlemen's recognized.\n\nThank you my friends and we got some friends from from this area. We have a group visiting with us from Georgia College and State University who are the thank y'all for coming and if y'all are stand up so we can see who you are. Thank you. Thank you for coming. Thank you very much. I also want to welcome you all up here. I'm from Nillageville and I have served on the board of trustees there at Georgia College, often on for the last 30 years so I wish you all well. Georgia College, good to have y'all. Thanks for being here. Thanks members. Joe right there. I'll get you in the back. Representative Fleming. Representative Fleming here. Yes. Come on down. Representative Fleming is recognized for him morning order. Thank you Mr. Speaker. Good morning members today is Oxford College Day at the Capitol. Oxford College was the original home of Emory University located in Oxford, Georgia, in Newton County. They housed just under a thousand first and second year students. We have a group of students and faculty from Oxford College today if we could members welcome them to the people's house today. Thank you. Thank you. Thanks, Oxford College. Good looking group. Thank y'all for being here. Appreciate you being in the people's house. Good luck to you. I'm going to call on Representative Carter. Representative Dury and Carter will park your own deck. Good morning. My colleague honored Bula Baptist here a little bit ago but I want you guys to give a warm welcome to the Reverend Jared E. Black who is a pastor of Bula Baptist Church. And I believe his business is black here with you as well. And my sister may be somewhere around here Reverend Patricia Pickland. A Bula Yomis will stand up again. This is my the church did I grew up in. Yes. Welcome to the people's house. Thank you. Absolutely. Welcome. Glad to have you all. Good to see you Reverend. We're Park is recognized for a morning order. Thank you, Mr. Speaker. Good morning, y'all. It is my great honor to recognize a truly remarkable group of Georgians with H. Stat Health students taking action together. H. Stat is a student run nonprofit organization that unites professional students throughout Georgia and service and advocacy to improve the health of all Georgians. This group of passionate students is committed to creating a healthier Georgia through the development of professional leaders who affect change through interdisciplinary collaboration and embody a civic ethic that will benefit Georgians for years to come. I would ask members from H. Stat to now stand and be recognized. Members of the House, please join me in welcoming our future health care professionals and congratulate them to their commitment to improving the health of our state. Thank you, Mr. Speaker. I yield the well. Thank you. Thank you. Members, that concludes our morning orders. I think we're ready to move on to the rules, calendar now. Mr. Clerk, will you read the captions? A House bill 154154. The House bill 154, our representative Richardson, 125th and others to be entitled to men chapter 11 and title 31 of the fiscal to Georgia and its head. Relay Nate, emergency medical services so as to designate ambulance services as an essential service in the state. This bill I'm referring to the committee on health. That committee recommends this bill do pass by committee substitute. Representative Gary Richardson is recognized to present the bill. Representative Richardson. Thank you, Mr. Speaker. Colleagues, I come to you to present H.B. 154. This bill designates M.S. as an essential service. If you'll suspend just for a moment. We would all like to have our bills heard. So we'll know what we're voting on. So please give the gentleman and the well your attention. Proceed, Representative. This bill designates M.S. as an essential service. The public undeniably considers M.S. to be an essential service. It is directly connected to the 9-1-1 system and is mandated by the state to provide pre-hospital care. M.S. workers are the only emergency public safety employees in the state that are not considered essential. They regularly work alongside firefighters and law enforcement personnel both of whom are designated as essential. This designation would cover both public and private agencies. This bill does not grant new or additional authority oversight or regulatory power to any state agency or local government and will not affect current zoning practice. During COVID services that were not officially essential did not have the same access to certain federal funding options that were forced to and were forced to absorb costs through means that left them vulnerable. This bill is support for M.S. especially during disasters and pandemics when providers of 9-1-1 M.S. should have not have monetary concerns. M.S. is an essential government service that protects our communities and should be a priority. I ask for your favorable vote. Gentlemen, has a couple of questions for you? Yes, sir. How you chairman Hawkins right up the center of the half way recognize request. Thank you, Mr. Speaker. Does gentleman you? Yes, I do, sir. Is it not true that recognizing this bill will improve and increase the efficiency of amulets around the state? Yes, sir. The gentleman knows what he speaks. Thank you. Mr. Speaker, now to your left is recognized for a question. Thank you, Mr. Speaker. Does gentleman yield? Yes, I do. I want to thank you for bringing this piece of legislation. Clayton County has excellent firefighter, EMTs. And I know that because they've been to my house and they have all kind of equipment that they've used. And they also have nurses to make sure people do not have to go to the hospital. Thank you. Thank you. Gentlemen, has no further questions, but we do have a speaker on the bill, but you have no further questions. Thank you, sir. You'll well. Good bill. The gentleman's yielded well. Reptence Ramon has recognized to speak to the bill. Reptence Ramon. Thank you, Mr. Speaker. And colleagues today, I rise in support of this bill because if you are feeling a little bit of deja vu, it is incredibly similar to the one that we passed on crossover. However, because of the flurry of crossover, I didn't get an opportunity to share with you my story of how this bill came about. So my husband's a part-time EMT worker. And at the time, he had invited me out with some of his co-workers to talk through what they experienced and just get to meet them. And it was at that time that they said, hey, did you know that EMS is not an essential service? And I thought, that's crazy. There's no way. And the best part about the story is that it was just somebody that shared a story and said, hey, this is a problem that we're having. Can you help fix it? And I think this is the best part about this place. This is the best part about the work that we do is having people who talk to us during these conversations through friends, through family, through people who literally save our lives that tell us, this is a problem, this is a gap, please help us fix it. Now, originally, I was going to kind of embarrass him a little bit and talk about how great he is, but to not super belabor the point. The one last thing I want to share is that, you know, my colleague and I come from two very different backgrounds. And we come from two very different parts of the state. And we're, you know, from two different generations. And yet we both saw a common issue and realized, hey, this is worth working on. So thank you so much for your consideration of this bill. I hope that you will vote in favor of it. And I yield the well. Thank you, Mr. Speaker. Ladies, yielded the well. Thank you for your comments. That concludes the comments on the bill. Is there an objection to the previous question being ordered? Here in none, the previous question is ordered. Is any objection to adopting the Committee's substitute? Here in none, the Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the Committee is agreed to. We shall this bill now pass on in favor of the passage of the bill. We'll vote yes. All those opposed will vote no. And Mr. Clerk, were you in lock the machine? Have all members voted? For what purpose is represented? Stetson rise. Mr. Speaker. Mr. Speaker, is it not true that I do support this legislation, but however, I really want to make sure that EMS drivers know that how important it is to make sure that those amlis is always serviced so they will not break down. So no one in this state of Georgia can go through the trauma that I experienced back in 2021 when the amlis broke down, transported my deceased husband to a hospital. And Savannah Georgia, is that not true, Mr. Speaker? I'm sure that lady knows of what she speaks, and I'm sorry that she had that mishap, but those folks are very professional and things do happen. But thank you for the parliamentary inquiry. For what purpose is represented? Hepner rise. Parliamentary inquiry, Mr. Speaker. State jingwari. Yes, sir. Is it not true that this bill will make it affordable for more providers throughout the state for the eligibility of indigent care trust fund, which provides services to those in low and common rural communities throughout this state, sir. As always, the lady knows of what she speaks. Thank you for the question. For what purpose is represented to sharp arise? Parliamentary inquiry. State jingwari, sir. Is it true that I've been in the EMS industry for over 36 years started at 17 years old going to school for EMT and then becoming paramedic? And I support this bill 1000%. I'm going to follow your vote. Whatever you do is what I'm going to support, because you know what would you speak. For what purpose is represented in math this rise? I'm going to mute the ringquari. State jingwari. Is it not true, Mr. Speaker, by passing this bill that we will be taking a significant step toward improving the emergency response time and outcomes for our medical emergency across our another gentleman who knows what he speaks. Thank you for the inquiry. All members voted. If so, Mr. Clerk, will you lock the machine on the passage of House Bill 154, the Yeeser 172, the Nays 0. This bill haven't received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 244? House Bill 244 by Representative Cannon and the 172nd to be entitled, and act to amend, comment section 3681, seven of the EFISCO to Georgia and it's an early audit of financial affairs and transactions, contents, copied to state auditor and public inspection. So it's to provide for local governments to request and receive in certain circumstances due date extensions. This bill emits for the committee on governmental affairs. That committee recommends a disbilled do pass by committee substitute. We're representing Chaz Cannon is recognized to present the bill. Thank you, Mr. Speaker. House Bill 244 provides some flexibility in the state's annual audit requirements for small local governments whose expenditures are less than 2.5 million. By allowing this flexibility, it will set conditions for these local governments to receive critical state funding for their citizens. The purpose of the bill is to achieve some balance between the cost of compliance for our smaller cities and counties while retaining accountability for the taxpayers who live there. And I think we've done that with this language. So for the past several weeks, we've worked with leds council on the state auditor's office, Mr. Greg Griffin to come up with some less complex, those still rigorous and less expensive auditing requirements for our smaller locales that are below a certain spinning threshold. And again, the intent and the goal of this legislation was to achieve some balance between the cost of the compliance with these audits and while retaining accountability to taxpayers. And I think we've done that with this piece of legislation. This bill actually came out of the recommendations from the 2023 Real Development Council. And I appreciate the help from Chairman Green and helping to push this bill forward. Without Mr. Speaker, I'll stand for any questions. Gentlemen, has no questions? You're the well. Make a mystery. Gentlemen, zero to the well. Is there any objections to previous questions being ordered? Here in the previous questions ordered. Is there any objection to adopting the committee's substitute? Here in the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee's agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed? We'll vote no. And Mr. Clerk, will you unlock the machine? I have all members voted. Point purpose is represented. You're the rise. Parliamentary inquiry, Mr. Speaker. Mr. Speaker, is it not true that this House bill 244 aims to support local governments and ensures that accurately finance the bill. Yes, sir. That's what the chairman told me or the member told me when he dropped the bill. Is there any objection? Excuse me. I think we're there. I don't think there's objection. We did that part, then we're represented to canon. Have all members voted. All members voted this so, Mr. Clerk, will you lock the machine? Yes, sir. The passage of House Bill 244, the A's or 162, the A's or seven, this bill has been requisite. The Constitution majority is there for pass. Mr. Clerk, will you read the caption? The House Bill 309, 309. House Bill 309 by Representative Clifton. Of the 131st to be entitled, not to amend the chapter 8 of Title 36, the fiscal to Georgia and Tatey Rillay, the county police officers required option of resolution or ordinance and voter approval prior to a fall. The establishment of a police force that was created by such method, this bill led me through the committee and public safety and Homeland Security. That committee recommends this bill do pass. Representative Clifton has recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, we have a lot to do today, so I will be brief. This bill is for county police departments. There is no more time counting police departments. This has nothing to do with city police. Currently for a county to create a police department, the commissioners will vote on it and if passed, it goes to the citizens to vote. The way the rules and code stands right now if they want to get rid of said police department, the commissioners vote on it and it's gone. This bill requires in order to get rid of the police department for it to go back to the citizens to vote. So essentially the way it is created, this bill will enact the same standards to get rid of that police department. Mr. Speaker, would you like to ask a question? Yes, sir. Rips, if you jazzed me in Clark to your left, I would recognize for a question. Thank you, Mr. Speaker. Does it, gentlemen, you? Yes, ma'am. So I'm always curious when we see bills like this, it's probably a story behind it. So is this something that happened in a county where they abolished their police force? And now we need to, I guess, add an extra layer to this process. So what I've been told is that there have been situations where after a police department has created the power given to the commissioners allows them a lot of control over that police department. This really, again, just goes back to putting the same processes in place to create it as it is to get rid of it. Thank you very much. Thank you. Gentlemen, you are for another question. Representative, you need to your right. Good morning. Ladies, recognize. Does the gentleman yield? Yes, ma'am. Is it not true that defunding or debanding a county police force could lead to reduced public safety, longer emergency response times, and increased crime in our communities? Yes, ma'am. Thank you. Thank you. Do you have one more question? Reptile to remind to your left of the Sunrise. Recommend us for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Currently, if a county wanted to create a referendum process, could they do that? Or are they not allowed to? And that's why we need this bill. I am not aware of the answer to that. I just know that what the current code is currently states, this will fix that. Sure. Yeah, I'm just usually trying to figure out what would be preemption versus that kind of thing. So thank you. Thank you. Representative Burke Shit has recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Isn't it true that you're simply making it where a decision is made by the voters that you undo that decision with the voters versus having unilateral decision by the commission? That is absolutely correct. That's exactly what we're doing. Thank you, Mr. Speaker. Yes, sir. With that, Mr. Speaker, I'd like to yield the well. The gentleman's yielded the well. We'll let the chairman pass the parliament inquiry. I guess he'll be fine with that because he did have a question. Is there an objection to the previous question being ordered? Here he none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here he none. The committee is agreed to. This bill now passed all in favor of the pass to the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? I have all members voted for what purpose is represented crow rise. Parliament, your inquiry. State your inquiry. Mr. Speaker, is it not true, but by requiring voter approval for both the creation and disillusion of a county police department, HB309 promotes consistency in respects to the will of the community? I think the answer to that is absolutely have all members now voted. All. We'll wait just a moment. Get your steps in. That's good thing for you. Members now voted if so, Mr. Clerk, will you lock the machine on the passage of House Bill 309. The yeas are 169. The nays are three. This bill haven't received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read a caption to House Bill 314, 314? House Bill 314 by resident of the hood of the 175th annals to be entitled to amend chapter 5 and title 43. The fish go to Georgia antenna relay, an athletic trainer, so as to revise and update definitions, Ms. Bill, I'm referred to committee unregulated industries. That committee recommends this bill do pass by committee substitute. The chairman from Bell Doster, chairman John LeHood has recognized to present the bill, chairman LeHood. Speaker, thank you, Mr. Speaker. Members, I've got House Bill 314. It was brought to me by the board of certification for athletic trainers. The intent of the bill was to protect the industry from bad actors that are calling themselves out as athletic trainers and also to clarify. The practice act for athletic trainers was first put into place in 1977. This is just an update to modernize language to better fit what they actually do today and to make sure people understand what athletic trainers can do. Mr. Speaker, there's any questions I'll take any. You have a question, Representative Owl. Is recognized for a question to your right. Thank you, will the gentleman yield? You're the right to your left, I'm sorry. Yes, ma'am. Isn't it true that the difference in training for athletic trainers versus physical therapists is that athletic trainers have a bachelor's degree or is a physical therapist has a doctoral degree? That is, could be one difference. I do believe athletic trainers have a master's degree program. But the curriculum, I have an outline of their curriculum here and it list all throughout the conditions that their athletic trainers are taught and trained and show evidence of knowledge to treat. Such as a staff infection that may be in the locker room is a condition not just an injury. And so those are the kind of things that we want to to be sure athletic trainers are able to address when those things come up. Thank you. Will you yield for one follow question? Of course. And I appreciate of course the work of our athletic trainers and our PT's. My son is an athletics and he also sees an athletic trainer when he is injured in sports. But I'm correct in understanding that in this bill you propose to make the type of care offered by athletic trainers essentially indistinguishable from that offered by doctoral retrained physical therapists. Okay, thanks for the question and absolutely not. We don't want to make it indistinguishable from what a physical therapist can do. It explicitly explains in the bill that an athletic trainer will only treat conditions first that a doctor approves and refers but also that are the result of physical activity. And the whole idea is for the athletic trainer to get the patient back in the game whether it's on the sports field or the game of life whatever it is. We just don't want to restrict the conditions they're treating to injuries that resulted on a sports field. You know sometimes you could fall down the stairs in your house in the injury to your knee or ankle or your shoulder required the same treatment. I understand so that just to clarify that that delineates between injuries incurred in playing the sport that the athletic trainers assigned to versus physical activity anywhere in life. Is that the difference? If I understood your question right then yes, we're changing the word injury to condition and by condition what we mean is sometimes injury is understood to be an acute event where a condition could be a lingering issue that requires ongoing treatment. Thank you. Thank you for the question. Thank you for the valuable we must be left up front is recognize request. Thank you for speaking with gentleman Yield. Yes sir. You've almost done it. I want you to give me that explanation. I keep hearing condition and injury coming up. It was a scientific definition. What separates one from the other? So House Bill 314 restricts limits and qualifies the condition to be the result of physical activity. And a condition can mean a lot of things but in this case condition is limited. It's qualified by in the bill and it spells it out. It's qualified by an activity that resulted in a condition and activity related to physical agility which normally happened on the athletic field but not necessarily. Thank you. Thank you. To your right representative Dr. Martin Newton. Representative Newton. Thank you Mr. Speaker. Will the gentleman yield? Yes sir. I personally apologize for not his study and this is much my understanding isn't it true though that the athletic trainers generally train on people and get experience on kind of the younger side of the spectrum. The more active, the more fit, the ones more likely to want to and get back to sports. Whereas the more in depth training of a physical therapist kind of airs sometimes on the other extreme opposed hip fracture. Are you at all concerned about the potential discrepancy there in the average age of experience regarding their patients? In this by extending them to everything a physical therapist is trained to do. I guess I have a little concern that the type of training and the type of patient is different isn't that true? You make a good point and as the name implies athletic trainers that is the audience they are focused on, athletic trainers. Which is why we want to clarify that sometimes conditions that did not result from the athletic activity need to be understood and clarify that that's in the scope of the athletic trainer to treat. The athletic trainers are not going for the elderly hip fracture patient. That's not the goal. However, I will say that lots of physical therapy clinics are hiring athletic trainers to treat patients of that nature. But that's not the intent of this bill and I don't see it open in the flood gates for that happening. Because Dr. Newton that doctor still has to make the referral and bless the patient to see the provider. Crimson Phoenicia Jones to your left. Just recognize for a question. Thank you Speaker. Does the gentleman you? Yes ma'am. I am two MA doctors and do conditions include arthritis, colds, appendicitis, pneumonia, carpal tunnel syndrome, asthma, skin rashes, abscess, tooth heart conditions, etc. Thank you for the question. And I'll just reiterate that the bill, there's language in the bill that restricts limits and qualifies the only conditions that result from participation in physical activity or to be managed by the licensed athletic trainer. Does the gentleman further you? Sure. Isn't it true that House Bill 314 removes restrictions from treatment of injuries at athletic settings to expand the treatment to any conditions at all settings? Any conditions at all settings? So that what you said? Yes sir. Okay. It does not limit the condition to an athletic event. That's what you're asking. Let me repeat it. Isn't it true that House Bill 314 removes restrictions from treatment of injuries at athletic sessions?\n\nSettings, excuse me, to expand treatments to any conditions at all settings. No, not any condition. Only conditions that are restricted, limited, or qualified by physical activity. And that can be found in the bill on the first page. I'll find the line for you. One last question if the gentleman uses. Isn't it true that under House Bill 314 there is no definition for conditions? The whole reason we need this bill is because of all the questions that are being asked today. That's why we need it for clarification. Because athletic trainers today are treating conditions not just limited to injuries. And that's okay. That's in their scope today. So all we're doing is clarifying that injury is not the best word to describe what they do. They do treat a lot of injuries, but sometimes there's a condition that is treated as well. Gentlemen, you yield for one more Mr. Speaker. A representative of Washington has recognized for a question. Thank you, Mr. Speaker. Will the chairman yield? Yes, sir. Isn't it true that House Bill 314 updates definitions and certifications and consequently ensures that our athletes are receiving the best possible care? Absolutely. Thank you. Thank you. Mr. Speaker, I'll ask for a favourable consideration from this House and I'll yield the well. Gentlemen has numerous other questions, but I think do we have a speaker on this bill? Representative Powell, the chairman of the committee from which it came has recognized to speak to House Bill 314. Gentlemen's recognized. Thank you, Mr. Speaker, and ladies and gentlemen, I didn't mean to come down and speak, but it was sort of a failsafe in case, but since there were so many questions, this bill, the athletic trainers, our code section hasn't been updated in almost 50 years. Things have changed in that scope in their scope of practice. As my friend, Representative Washington said, this upgrades the language. He cleans up a lot of antiquated language under that section. There seems to be a lot of discussion about conditions in the committee. Some of the folks who were opposed to the bill, athletic trainers, said that if we would put online, 12, injury slash conditions, was not the will of the committee, because conditions are created in this section, these conditions are created by injury. But I think the key to all of this, if you'll look down on line 1617, it clearly states nothing in this paragraph should be construed to expand the scope of practice of athletic trainer beyond the determination and the advising of a consenting physician. I don't know of anybody's position that's going to tell athletic trainer to treat heart disease or anything like that. They'll strictly with injuries, and I don't think this house needs to lose the fact of that. That's all I've got to say, Mr. Speaker, and as author said, it's a good bill. The gentleman's yielded well, I think. That concludes our comments on House Bill 314. Is there any objection to the previous question being ordered? Here he none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here he none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here he has none, the report of the committee is agreed to. Shout this bill now passed. All in favor of the passage of the bill. We'll vote yes, all those opposed. We'll vote no, and Ms. Clerk, were you unlocked the machine? Have all members voted? All members voted. For what purpose is represented by a chair? Mr. Speaker, is it not true that the athletic trainers association is in favor of the athletic trainer from Georgia Southern? I think the gentleman knows what he speaks. He came from Georgia Southern. For what purpose is represented by a chair? The problem is reenquering. Mr. Speaker, is it not true that HP 314 will allow for clarity and efficiency within the profession of athletic trainers? I'm not sure if the lady knows what she speaks. Have all members now voted? All members have voted this, so Mr. Clerk, were you locked the machine? On the passage of House Bill 314, the yeas are in 93, the yeas are in 77. This bill, Henry C. The requisite constitutional majority is therefore passed. Mr. Clerk, were you read the caption to House Bill 197? House Bill 197 by Repsent of Hawkins, the 27th and others to be entitled back to amend Code Section 33, 46 of the Fisherhood of Georgia, and Attentive Relay and your requirements for certification utilization of nationally recognized accreditation standards and website identifying nationally recognized accreditation entities. This bill ever referred to committee on health. That committee recommends that this bill do pass. Chairman Hawkins is recognized to present the bill, House Bill 197. Thank you, Mr. Speaker. House Bill 197 has come about due to an issue that's been occurring over the years, where an insurer can question the medical necessity of treatment of medical or dental origin. When this occurs, we are not able to treat that patient with insurance coverage. I work, start working on this issue this spring and summer with the insurance industry, and I will say that I appreciate their work. Not all insurers were engaging in this, but I can tell you along the way I heard from a neurosurgeon and Gainesville who told me that 30% of her procedures, had been questioned for the medical necessity. That's a pretty high number. And the cardiologist who was treating me, relayed to me about the same problem. So what this bill does is simply arranges a predetermined call between the insurer and the provider. So the provider is not treating a patient when a call comes in and cannot leave that patient. So the call then gets delayed or the treatment gets denied. This provides for a predetermined call or contact on website to get the medical treatment approved. And that's all it does, Mr. Speaker. Are there any questions? You have a couple to your left, Representative Kelly. Does recognize more questions? Thank you, Mr. Speaker, with the gentleman yield. Yes. Isn't it true, Mr. Chairman, that any committee we heard far too many examples of where these health insurers, providers, are getting in between the doctor and their patient? And that this, by adopting this measure, will help provide patients in their healthcare solutions to Georgia's. That is true. This will help remove some of the delayed healthcare treatment. Thank you. To your left, Representative, Lisa Campbell has recognized more questions. Thank you, Mr. Speaker. Does the gentleman yield for questions? I do. Is it not true that this bill will provide a formalized process for patients to directly connect with their healthcare providers in order to discuss their treatment, maybe their operations or medication, thereby strengthening relationship between patient and their healthcare providers? Yes, ma'am, I'm sure it does. Thank you for the question. Thank you for bringing this very beneficial bill for Georgia's. Thank you. Representative Matthew, and you have several other questions. I'm going to recognize, Representative Matthew, and I have got the center aisle on your right. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it not true that this bill aims to delay treatment for our patients, and it will improve and enhance our patient care? Yes, it will. Thank you for the question. Thank you for the question. Is the gentleman yield for another question? Yes, sir. Representative Hethner has recognized for a question. So you're left right up the center. Oh. Does the gentleman yield? Yes, I do. Is it true that this bill does offer better relations between providers and patients, but it also does not interfere with any veterans care in this state? All of their care remains intact. Yes, ma'am. It does. You're correct. And thank you for that question. Thank you, sir, for this bill. One more question, Dr. Nisa. Dr. Nisa, Representative Jones. I got it right this time, then. Please recognize. Thank you. Thank you, Speaker. Does the gentleman yield? Yes, he does. Thank you for this bill. Is it not true that in the event a patient's insurance doesn't cover their prescription? The patient could now speak with their health care provider to ask for alternative suggestions. Therefore, reducing potential costs of everyday Georgians may face. That's a very good question. The answer is yes. Thank you. Thank you. Mr. Chairman, you may as well get all the health care professionals on one team here. That's pretty awesome. Do you have no further questions? Well, I'll ask for your valuable consideration. Thank you. The gentleman is yielding the well. Is there any objection to the previous question being ordered? Here he none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here he none the report the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will vote no. Mr. Clerk, will you unlock the machine? Have all members voted? All members voted if so. Mr. Clerk, will you lock the machine? On the passage of House Bill 197, the yeas are 174. The nasa 0, this bill can receive a requisite constitutional majority. Is there for past? Mr. Clerk, will you read the caption of the House Bill 7777? House Bill 77, my representative, franklin of the 160th and others to be titled back to a men art before chapter 6 and title 40. The official go to Georgia, Antetta, will be in the right of way for operators and motor vehicles. So the revised responsibility of motor vehicle operators when encountering a funeral procession. Mr. Bill, I'm referring to the committee. I'm motor vehicle, so the committee recommends a disbill, do pass. He is from Stilsen. General from Stilsen, now named in Bullock County, has recognized the representative, franklin, to present the bill. Thank you Mr. Speaker. So colleagues, I rise to present House Bill 77 to you today. And this bill you've heard last session, we passed out this house, this body. It went to the Senate and it got passed out of there, went to the floor and just ran out of time. But this is again the funeral procession bill. And what it does basically is when you have oncoming traffic for the funeral procession, you have to pull over to the side of the road to let that go by and just give them the right away. For many of us, we do that normally. It's a natural thing that we do, but there's the growing population in certain rural areas. Some people don't know to do that and they haven't been doing it. And what it's causing is it's causing a public safety issue because the S-corts for that funeral procession is being encountered with oncoming traffic at times. And so we want to make sure that nobody gets hurt in the future. There hasn't been any recorded injuries that I know of, but there's been a lot of almost. So we just want to make sure that everybody's safe in securing Georgia. So ask for your considerable vote on this bill. And if there's any questions, I'm happy to have to dance from. Representative Punoi is recognized to your left for a question. Thank you, Mr. Speaker, with the gentleman you? I am. So just a quick question. Isn't that true that this bill will provide for greater courtesy and safety for all those involved and also just show more respect for those that agree with you? It absolutely will. I appreciate you stating that. Thank you. Gentlemen, I have to do further questions. I want to thank him. I think this shows the ultimate respect of a life lived. So thank you for bringing this bill and provide safety as well. So thank you for bringing this bill. Thank you, Mr. Speaker. You're the well. Is there any objection to previous question being ordered? Here in none, the previous question is ordered. Is there objection to a green to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? Will vote yes. All those opposed? Will vote no. And Mr. Clerk, will you unlock the machines? Yes. All members voted for what purpose is represented? Your to rise. Parliamentary incurred, Mr. Speaker. The State's inquiry. Mr. Speaker, is it not true that House Bill 77 aims to clarify existing traffic laws to ensure that funeral possessions can proceed safely? And without unnecessary interruption on two lane highways? The gentleman knows what he speaks and additionally adds an opportunity to show folks that allow folks to show their respect. Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? In the passage of House Bill 77, the yeas are 171, the nays are two. This bill, having seated the rec, was it constitutional majority? Is there for past? Mr. Clerk, will you read the caption of the House Bill 144 or 144? House Bill 144, by the way, Senator Newton, 127 of them, others being taught on act to amend chapter 7 of the title, 48. If it's going to Georgia annotated related income taxes, so it's revised the tax credit for certain medical perceptive rotations. This bill, I refer to the Committee on Ways and Means, that committee recommends that this bill do pass. Who representing Martin Newton is recognized to present the bill? Who representing Newton? Thank you, Mr. Speaker. It's good to be with you all today. The new 144 expands and continues an important program in medical training across Georgia. Many of you know we're 40th in the nation and a number of physicians per capita. We know that may have effects on maternal mortality, mental health conditions, and others. The good news is this legislature has been working hard to expand the number of physicians in Georgia through various measures, expand the number of nurse practitioners and PAs as well. And this is an important part of it. As you know, Mercer has had a recent expansion of their medical school into Columbus. Athens now has a growing medical campus, the medical college of Georgia's expanded camp. Class sizes and we've added at Georgia Southern and Savannah a new medical school. We also have new nurse practitioner and PA programs. A crucial part of your training as a physician is, occurs in a, what's often a tertiary care hospital, that's where you get the rarest conditions and the most serious things. Also an important part is the hands on training you get out in the community in rural areas, urban areas, just practices directly with patients and instead of a long line of residents and others between a med student and a physician, you're one on one with that physician. And that's what House Bill 144 continues. It continues the program we have now with medical preceptors. There is a tax credit program for the physicians and nurse practitioners and PA, who agreed to take in a student in training and keep them for a month. There's a credit of $1,000 or $750 for that month-long training. It's an important part of how we train physicians. It's an important part of the hands-on part of what we do. We have added in this bill, Dennis, as well, that are willing to take in. We've got a new dental school at Georgia Southern and Savannah as well. So we need our dentists to do the same idea that they can train dental students who need to get some sort of community practice. So that's what House Bill 144 does. It removes an expiration that would have occurred next year. It extends it to 2030. It does limit it to $6 million a year. It's an important part of us getting the moving forward in the medical care feels that we need to have the number of physicians, PA's and nurse practitioners that are well trained in the community as well as in our major hospitals and acute care. So I hope you'll feel confident supporting this measure. House Bill 144. Gentlemen, how's the question? Reps any butner to your left? Is your recognizable question? I certainly do. It is. Okay. Isn't it true that we've been putting an awful lot of resources into making sure that we have larger classes of medical students and that when they go into the communities, these preceptorships help us keep those students in Georgia rather than leading going other places. The ladies is absolutely right. In addition to the work we're doing in graduate medical education, GME, that residency training, the being able to rotate in a rural area or with a community physician in an urban area is priceless for both their training. It's also an important way that our physicians are able to give back to those who are coming along to replace some of us that are closer to retirement than others. So I appreciate the question and the support. Yes. I hope everybody will vote for it as a good bill. Thank you. Thank you. Chairman Hawkins has recognized for a question. There's German yield. Certainly. The question is true that providers that participate in this program takes away from their patient time and gives that to the student in their education. You're absolutely right. It gives them a real-world experience with the electronic medical records, electronic health records that were all required to learn. That takes time for the physician and the staff, an extra computer. There are some significant costs involved in efficiencies if you will on bringing some in with you. But I'm just glad that hundreds of my fellow physicians are willing to do it. They did it when I was a student many years ago and I look forward to the ones who are doing it now. Thank you. Gentlemen, has there a further question? But I have a question for him. Yes, sir. Mr. Chairman, if you're yield for this question. Certainly. You have a colleague that's worked. I've done a lot of work on this one. And I want to thank before the members of this House and I know you are, I think you are joining me in thanking Chairman Butch Parish for what he's done to make sure that graduate medical education is successful in this state. Thank you, Mr. Chairman. I know you've worked an awful lot on this initiative. Thank you, Mr. Speaker. You're right. We do build on the shoulders of others and many of the builds we do here. And this is definitely one way we look forward to continuing with this, this body support. Thank you. I bet he votes yes on this one. Let's see what he does. Is there an objection to the previous question being ordered after the gentleman yielded the well? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shout out. This bill now passed. All in favor of the passage of the bill will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machine? Have all members voted for what purpose is represented? The representative has no rise. Parliamentary inquiry, Mr. Speaker. State you inquiry. Sir, is it not true that in 2024, the graduating class from Augusta University's medical program, we only maintained 12% of that student population in our internal workforce. And I am supporting this bill because we look forward to these efforts improving those percentages, sir. Lady knows what she speaks could not agree with her anymore. For what purpose is represented? Jordan Ridley-Rise? He waits. Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 144, the yeas are 171. The nays are two. The bill, haven't received the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption of House Bill 129? House Bill 129, my representative, canton of the 170 second to be entitled to amend Code Section 485, 7.4, the fiscal code of Georgia and it's headed relating to preferential assessment for bona fide, conservation, use property, and bona fide residential transitional property. So it's to remove a limitation on lease property. This bill I refer to the Committee on Ways and Means, that committee recommends this bill, Duke Pass. Who are representing CHAZ? Kenan is recognized to present the bill. Thank you, Mr. Speaker. I have House Bill 129. This is a topic I have a good bit of experience with, and that is our conservation use laws. The same bill you might recognize it passed almost unanimously out of the House last year and never got caught up in the Senate. Jessica Hungup on Sonia Dye. It also came out as a recommendation from the Senate study committee this year on preservation of farmland. The bill incorporates all the original CUVA qualifying restrictions for eligibility, but it does add some flexibility for our non-family farm entities. And you are seeing a little bit of a shift in our farming practices these days from family farms to farm operations who are owned by folks that are not related by bloated marriage. And that's the qualifying fact under a family farm. But the key component to the language is that the land must remain in agricultural use. That's the key component of the CUVA laws. So the goal in crafting this legislation was to maintain and strengthen the integrity of the conservation use law, but also provide some leeway in the code to reflect the reality of today's farming operations. That's a bill, Mr. Speaker, and I'll ask for your favor consideration. I'll stand for questions. Gentlemen, has no questions. I yield the well, Ms. Fickard. Gentlemen, yield the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to, shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? All members voted for what purposes represent Anissa Jones rise? Parliamentary inquiry. Is it not true that this bill provides family-owned forms with greater flexibility by permitting leases to non-family members without jeopardizing their conservation use status? I'll play a little lady. Certainly read the bill and knows of what she speaks. For what purposes represent it, it makes rise. Mr. Speaker, pursuant to House Rule 133, it has to be excused from this vote. Gentlemen, we'll be so noted in the record. All members now voted. All members voted. Mr. Clerk, will you unlock the machine? All in the passage of House Bill 129, the yeas are 165, the nays are 7. This bill here in the seat of your requisite constitutional majority is there for a pass. Mr. Clerk, will you read a caption to House Bill 465, 465? House Bill 465, by Representative Gillier, the 160 second and others be titled an act to amend Article 7 of the Chapter 3, Title 35. Mr. George Antietta, relating to statewide alert system for missing disabled adults, so it's to provide for the autism missing person alert system act. This bill, I'm referring to the Committee on Public Safety and Homeland Security. That committee recommends this bill do pass by Committee substitute. Representative from Chatham County, a representative called Gillier, is recognized to present the bill. Give the gentleman your attention please. Thank you, Mrs. Speaker. My brothers and sisters, I present to you today House Bill 465. This is George's bill for George's people. Many people every day we come into this House and we really don't know what individuals are going through. I am the 10th child in a family that has been girded by a lot of love, but my youngest brother is a good person that I have watched and shadowed as a big brother. He suffers from Down syndrome and autism. Last year, he was probably an instant away from losing his leg and I reached out to one of the members here to ask for some help and guidance. Sometimes he would even wander. I prayed that he would not wander and we would not be able to have another casualty. This is George's bill because there are so many individuals that have a family member whether it is a child or whether it is an adult that might suffer or I am not going to say suffer, it might be walking in their life with autistic qualities. The bill is a saving lives one at a time bill. Let me just share with you, there are other cities that this bill mimics in the matter of Maddie's law. This is a bill that simply gives an alert system to help us find our loved ones quicker if we gravitate and get lost. Let me read two individuals that we were unfortunate to lose. In 2024, there was a 16 year old named Connor Mathis who had autism. He went missing from a church camp on Jack O'Lyle in Georgia and despite a massive search by law enforcement and volunteers, Connor's body was found the next day. The search was complicated by Connor's autism which may have been made harder for authorities and volunteers to understand his behavior or how to approach him. In 2024, there was Kaira Williams, a young boy with autism, he went missing from his home in the cab county, Georgia around 6.30 pm. In despite search efforts by law enforcement and volunteers, his body was found around 2.30 pm and upon just feasts away from his house. This bill is Georgia's bill and saving lives because we can help others find their loved ones and help law enforcement with the tools to find them quicker. There are other states and cities such as Los Angeles, California.\n\nChicago illinois, New York, Houston, Texas, and Phoenix that have established this law. I'm asking for your favorable consideration and saving lives one at a time in initiating this autism missing person alert system in Georgia. Mr. Speaker, if there are any questions, I will entertain them at this time. Gentlemen, I have a couple of questions to your left representing Petri. It's a recognized for a question. How do you owe to the gentleman? My friend, is it not true that individuals at autism, when they're missing, have a high propensity as you pointed out to migrate to water, very dangerous? And moreover, a lot of people don't understand because of their lack of social skills are often highly subject to human trafficking. Is that not true? Gentlemen, those from which you speak. And does gentleman you have one further point? I'd you owe to the gentleman. Is it not true that having information about individuals specifically with autism to know their special traits allows law enforcement to more easily find and know how to deal with those individuals once they're found? That is correct. Thank you. Thank you. We're representing Holly to your left. Mr. Speaker, is there a recognized for a question? Thank you, Mr. Speaker. Does the gentleman you? I'd you owe to the gentleman. Thank you, sir. Is it not true that this bill, once its passed, will allow for our law enforcement officers to be able to get really good instructions about how to search for these individuals with autism, particularly even those who may go to water, go to places around there that are very hard to find. Does this not allow them the ability to do that? The gentleman, Bolly, knows from what he speaks. This will help save lives and help our greatest of our law enforcement help save lives also. Do you further yield? I yield. And is it not true that this bill, which requires for personal care facilities to be able to reach out within 30 minutes that they find that that individual has autism, get them the help that they need as soon as possible? I am confident that this will, and it is under the jurisdiction of the GBI. And I think that will help us feed up a lot of the surges from convenience stores to public service announcements and the light. The gentleman knows from what he speaks. Well, as a former gymnastics instructor for autistic children and why WCA, I appreciate you bringing this bill. Thank you. Representative Hilton, do you relapse as recognized for a question? Thank you, Mr. Speaker. Does General Neal? I yield to my sweet same name. Is it not true that we have a son with Down syndrome and his name is Chase, and we should not have named him that because we have been known to chase him. But we do have several friends in the disability community who have experienced exactly what this bill is for. And is it not true? This will help these families out tremendously. The gentleman knows from what she speaks. Great Bill, thank you. Thank you. I represent the hearing to your left. Thank you, Mr. Speaker. Does the gentleman yield? A yield for the lady. Thank you so much for this bill. It's personal to me as I'm a former educator. So I really appreciate this bill. Is it not true that individuals with autism spectrum disorder face unique safety risk when they are go missing, making it critical to expand Maddie's call to include them? The general lady knows from what she speaks. It mimics and plugs right into Maddie's call system. And it's been successful for those that have been disabled. And I'm sure it will be very effective in helping us save lives for those with autism. Again, thank you so much for this bill. Thank you so much. Mr. Speaker, I know it is close so much time for some folks. I ask for everyone in here if you have a family member or know someone to vote in favor of House Bill 465, saving lives when at a time. This is the guy you yield the wealth. We thank the gentleman for the bill. He is yielding the well. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Hearing none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. Shall this bill now pass on in favor of the passage of the bill? Will vote yes. All those opposed? Will vote no, and Mr. Clerk, will you unlock the machine? Have all members voted for what purpose is represented? Carlton, how are you? I'm parliamented in. Quarring with the speaker. Is it true that those with autism like my granddaughter Camille may become so intensely focused on something of interest that she will lose track of her surroundings? I know the gentleman personally knows how it can impact the families. Thank you for the question. The gentleman knows what he speaks. Fort Purpose Representative Hitchens rise. Honourable and reenquired, the state of inquiry, sir. The truth is the state patrol has 13 helicopters all that are equipped with forward looking infrared. And they spend 30%, 40% of their flight time looking for lost people, including those with autism, Alzheimer's, and just people who are lost in the woods. I'm sure the gentleman with his past knows exactly what he speaks and we're fortunate to have that resource. I would urge the state patrol does a marvelous job of public safety. Colonel Hitchens is doing a great job leading that organization. And now all members voted. All members voted if so, Mr. Clerk, will you lock the machine on the passage of House Bill 465, the Yees are 172, the Nays are zero. This bill here in the city records a constitutional majority is therefore passed. We're going to break the lunch, but we have a couple of announcements about lunch. So I'm going to recognize Representative Gabor Coyay for an announcement. Representative Coyay, then Chairman Corbett, and Representative Moore, excuse me, just a Coyay. I'm sorry, those are into the date. This was about lunch. Representative is recognized. Thank you, Mr. Speaker. Ladies and gentlemen, today we're going to have a meeting so I can give you details about our Nigerian trip coming up in July. The meeting will be in room 514 Club. There is no lunch. No Nigerian Joloff Rice. You've been asking if there's Joloff Rice, there's none. But I want to give you information. And the first 20 to sign up will be going in July. Thank you so much, Mr. Speaker. I am. Thank you, Representative. No lunch. OK. Ripley-Ronda Taylor, recognize for an announcement. Thank you, Mr. Speaker. The women's caucus will be meeting downstairs. There is much prepared immediately upon adjournment. Downstairs in 230. Thank you, Mr. Speaker, I yield. There's your lunch. All right, members, if you have pages today, I'm going to invite you to come down front. We'll take some photos we're about to state in recess. We have some privileged resolutions. The clerk is going to read. But first we're going to have one more announcement. The rules, Chairman, Chairman Parish, is recognized for an announcement. Thank you, Mr. Speaker. I'd like to ask the members of the Rooms Committee to meet me at 115 in 341. 115, 341. Thank you. The rules are going to be in the next meeting. Thank you. The rules committee, 115. 341. This all goes together. We'll be back. We'll stay in recess from this chamber until 130. But first, I want to ask the four of we recess. And we ask the clerk to read a group of privileged resolutions. Honoring the Life and Memory of Dr. William Nettles-Westinger. Honoring the Life and Memory of Esther Perkins-Frasier. Commending Kristy Todd, Georgia's 2024 teacher of the year, recognizing commending Georgia State University Commending, Combat Boots to Boardroom for the dedication of Empowering Veterans and Recognizing March 11, 2025. This combat boots to Boardroom Day at the State Capitol, congratulating the Brantley County Girls Tennis Team for winning the 2024 GHSA class and AA State Girl. Tennis Championship. Congratulations. Jonathan Westbury and Dallin Lowe for winning the 2024 GHSA class, AA traditional wrestling state championship. Commending the Southwest Georgia Area Health Education Center. Congratulations. Commending. And Brinca Y. Mickens for receiving the 2025 Yellow Rose, nicotine Randall Servant Leadership Award. Commending World Coming Together to make a difference. Honoring the South Forsyth School Co-Ed Cheer Team, the 2024 GHSA class, 6A Cheer State Championships. Honoring the West Forsyth High School Boys Swim Team, the 2024 GHSA class, 6A 4x100 Freestyle Relays State Champions. Honoring Tim Herbrew of West Forsyth High School's 2024 GHSA class, 6A Heavy Weight Boys Wrestling State Champion. Honoring Addy Spikner of the West Forsyth High School 2024 GHSA class, 6A Girls 100 Meter Fly Individual State Champion, recognizing Commending Mr. Dexter Purcell. Recognizing Commending Dr. Kinesa Metcalfe, recognizing Commending Winston-Gipsy Peters, recognizing Commending the Atlanta City Council with Byron D. Amos, recognizing and commending Neil George, recognizing Commending Farrow Kelly, recognizing Commending John Ray Martinez, recognizing Commending the Student Council Summer, a middle school, recognizing Commending Delane Roberts on the occasion of a retirement, and for other purposes. In that case, the reading of the privilege resolutions. In that case, the reading of the privilege resolutions. Is there any objection to adopting the privileged resolutions? Here in the other resolutions are adopted. Okay, everyone's heard of our announcements. You know about rules, 115 page photos down front. We're going to have to put the page today. This house will stay in a recess until 130 PM, 130 PM. Thank you members.",
  "updated_at": "2026-02-13T15:36:22.016961+00:00"
}