{
  "video_id": "v71phM2Ohtw",
  "url": "https://www.youtube.com/watch?v=v71phM2Ohtw",
  "title": "Lt. Governor Jones Announces 2024 Legislative Priority",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 8,
  "summary": "Here is a summary of the Georgia Lt. Governor Jones Announces 2024 Legislative Priority session:\n\n**Overview**\nThe session focused on the Lt. Governor and state legislators announcing a legislative priority for the 2024 session related to addressing issues around social media and cyberbullying, particularly as it impacts minors and students in schools.\n\n**Key Actions**\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced during this session.\n\n**Notable Moments**\n- The Lt. Governor stated that addressing social media and cyberbullying issues impacting youth will be a top priority for the 2024 legislative session.\n- State Senator Jason Apertori discussed plans to introduce legislation modeled after approaches taken in other states, focused on empowering parents and giving schools/teachers more resources to deal with these challenges.\n- The legislators indicated they plan to partner with tech companies like Google and Microsoft as they develop the legislative proposal.\n\n**Votes**\nNo votes were recorded.\n\n**Attendance**\nQuorum was present, with the Lt. Governor, Senate Majority Leader, and Senator Apertori participating.\n\n**Adjournment**\nThe session ended with the legislators indicating they would release a press release with more details and be available for follow-up questions.",
  "transcript": "And also our leader over here, Senator Steve Goot, for being here as well.\nYou know, we're going to have many initiatives when it comes January for the upcoming session.\nBut one of them that I think is going to be a priority of ours, and I think it's very\nreported, is not just as legislators, but also as parents of teenage children.\nAll of us have kids that are growing up in this society right now, and we're all very\nproud of what they're doing, but we are also concerned about things outside our control,\nthe confines of our home that can be problematic, and that's why we're going to really focus\non looking at legislation, pertaining to social media, you know, always tell people, you\nknow, one of the greatest things ever invented was internet and also social platforms that\nthat followed have been puts us in touch\nand gives you instantaneous information,\nwhich can be a wonderful, wonderful tool.\nBut it also in the wrong hands can be a very dangerous tool.\nIt can be one that can cause a lot of harm,\nalmost as an invisible enemy of yours.\nAnd you have so many bad actors right now\nwho are targeting our children\nAnd you're seeing it in mental health situations\nas well as cyber bully in this going on\naround the country right now.\nAnd we're wanting to take that head on.\nWe want to take that initiative head on.\nYou're going to always have to be trying to adapt\nwith what's going on in society.\nAnd we feel like making this a priority,\njust like we've done with other things\npertaining to children here in the state-grade state of Georgia.\nBut we want to be at the forefront of protecting them and the legislation that we're putting\nforward this session that our Senator Havittari is going to be carrying for us does just\nthat.\nAnd we're going to model this after other states, there's plenty of other states who have\npioneered this program to try to address a lot of these issues.\nThere's some that have gotten it wrong and they're in litigation right now, but there's\nothers have done very well with it, and that's who we're going to be focused on this\nupcoming session, and I think it's important enough to have a press conference about\nsomething like this, because if we can't, as legislators, as parents, if we can't protect\nthe ones we love the most and the future of our society, then, you know, we're in the\nwrong business, as public servants, and they need to be first and foremost.\nSo I want to yield the podium to our leader here\nand our author of the bill, Jason Apertori.\nThank you.\nI want to thank the lieutenant governor\nfor his leadership on this issue.\nI think right now in society, we have a lot of issues going\non in terms of cyberbullying and dealing\nwith social media content across George\nand across the country, especially\nwith our younger kids.\nSo I have three kids.\nIn elementary, all the way up to high school.\nof a wife that's a high school teacher,\nand I'll tell you, this is always the number one issue\nthat she comes home to me about every single day.\nSo I think it's important that we empower parents,\nI think a lot of parents don't know how to restrict content\nsometimes, even though they're doing their best,\nchecking devices, and seeing who's texting who,\nand who's on Instagram, but the problem gets really prevalent\nwhen we get into the classroom,\nand we have students that are on their phones\non their laptops, you know, a little bit distracted,\nbut at the same time, looking at content maybe\nthat is not helpful to them and their family.\nSo this legislation, when we introduce it,\nis going to be modeled after some similar states,\nlike Louisiana, there are some bad examples out there\nthat we won't be copying, because we do want to be sensitive\nto the First Amendment protection for citizens\nacross this state, we're not going to be regulating screen time,\nWe're not going to be regulating those types of things.\nI think that is up to the parent or guardian of each child\nin the state of Georgia.\nBut at the end of the day, when it comes to cyber bullying\nand empowering parents, our school leaders, our teachers\nwho are kind of handcuffed with what's going on\nwith social media in their classroom while they're teaching,\nwe want to make sure that people have the resources,\nthey're educated, but we're also making a stand here in Georgia\nthat something's got to change as the world evolves,\nwhether it's with technology, AI, whatever you want to call it,\nas we continue our leading here in Georgia.\nSo I want to thank the Lieutenant Governor\nfor making this one of his priorities\nfor the upcoming session and appreciate it.\nThank you.\nAnd Senator Dimitian, one of the key points\nthat I left out there is this is a mission\nthat we're going to be partnering with our school systems,\npartnering with our parents home,\nbecause our teachers and administrators are on their own\nthe front lines when it comes to this issue\nand they're going to need the necessary resources\nto help prevent combat and also monitor these things moving\nforward.\nSo I'm happy to take any questions.\nI think we had a list of questions, are you new?\nOK, yes, ma'am.\nIs this the first time you need a session\nin the background so far, and what's going to happen?\nOur plan is to reach out to them and actually partner\nwith the likes of Google and look at, you know,\nMicrosoft, so we are going to partner with them\nas we're crafting the legislation finalizing it\nto look for ideas, you know, on what's the best practices\nand things of that nature.\nSo it's a very good question and it's something\nthat we're going to be doing.\nSchool districts, you know, obviously, yeah.\nI mean, obviously we will be partnering\nwas looking, talking to superintendents and asking about what kind of resources is actually\nwhat they're seeing on the ground inside there.\nThe walls of their respective school system, so yeah, we want to have their involvement\nas well.\nSo, yes, sir.\nYeah, so I think right now it's in development, but I think there are some tenants and\nI think in terms of the bill that we do believe should be in it, such as age verification.\nI think we want to make sure that we're touching on the, you know, those decision points\nwhere parents can be engaged, as they look at content or about to look at content.\nAnd again, you know, we're focused on minors, we're focusing folks kind of in a 12k, 12\nage bracket, you know, so under 18, under 19, and, you know, once you kind of graduate\nout of that age, then, you know, the rules don't apply, but I think just empowering parents\nto know what's going on in their kids' life every single day,\nkeep them safe from predators.\nOne last question.\nI mean, there's going to be teeth within the legislation\nand in and of itself.\nThat's not going to be limited to a school district.\nBut there is going to be, it's going to have teeth in it,\nwhere the people perpetrating these things will be,\nwe're gonna try to hold them accountable for, you know.\nAnd what's that one?\nRome.\nYeah, we all go off topic then.\nI'm happy to ask you.\nIs there a long-forced reinforcement to this\nand the small enforcement in the schools out there?\nWell, yeah, that's why we're gonna engage\nor our local superintendent to look at what kind of resources\nthey would need when we finalize this\nand try to implement it on a broader scale.\nSo that'll be part of the discussion as well.\nWell, thank you, everybody.\nWe're going to send out a press release after this\nand then give an email to us and we'll see you next time.\nI'm on that conversation.\nAll right, thank you all.\nAppreciate it.\n",
  "updated_at": "2026-02-12T20:10:44.218681+00:00"
}