{
  "video_id": "V8d6TogwAcs",
  "url": "https://youtu.be/V8d6TogwAcs?t=758",
  "title": "Georgia House - Day 25 (2026-02-28)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 25,
  "video_date": "2026-02-28",
  "duration_minutes": 87,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 25 (2026-02-28) legislative session:\n\n## Overview\nThe session featured the passage of several bills, including ones related to workforce development boards, guardian appointments, and school bus/zone fines. There was also discussion of prior budget allocations to the technical college system.\n\n## Key Actions\n**HB 269**: Allows workforce development boards to meet via teleconference\n**HB 291**: Expands the list of providers who can evaluate the need for adult guardianship\n**HB 301**: Revises the civil penalties for passing school buses and speeding in school zones\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Skoggins joked that \"SB\" in the bill number could stand for \"Skoggins' Bill\"\n- There was discussion of a prior $60 million allocation from the Labor Department to the Technical College System of Georgia\n\n## Votes\n- HB 269 passed 153-0\n- HB 291 passed 165-0\n- HB 301 was referred to committee\n\n## Attendance\nA quorum was present and the session proceeded without any issues noted.\n\n## Adjournment\nThe session adjourned. The next session date was not specified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIt's, we're not even one sharp anymore, I'm already one dull here, it's after one, so\nI promise y'all one sharp, so Mr. Clerk for your ring the bell, we'll come back to order.\nRemember as we all come to order and please take your seats, please take your seats.\nDoorkeepers you don't need to lock the doors but if you'll close the doors that'll be great.\nIt's clerk where you read the caption to a group of privileged resolutions.\nCommending share of Colin Talton upon his 50th career anniversary, recognizing commending\nMr. Youngho Kuh.\nCongratulations commending Tony Butts for receiving the 2023 Yellow Rose Niki T Randall Service\nLeader Award, recognizing the historical importance of Belali Muhammad, a prominent Muslim\nand African American from Sappelo Island, Georgia, recognizing March 25th, 2023 as Georgia\nof barbecue day, recognizing commending grace, Elizabeth Beasley Terrell, recognizing\nFebruary 27th, 2023 as Dominican Republican Independence Day, recognizing commending\nJudge Mark Anthony Scott on his outstanding public service, honoring the life and memory\nof Mary Wilson Beasley.\nCommemorating the 50th anniversary of the establishment of the National Wild Turkey Federation, and\nCommending Dereenix, Barry in High School's 2023 Star Teacher.\nAnd for other purposes, that completes the reading of the Privilege Resolutions.\nIs there any objection to adopting the privileged resolutions?\nChair, here's none and the resolutions are adopted.\nWe are ready to move back to the rules calendar.\nChairman Blackman, are you ready?\nWell you can take your time.\nI'll just make sure you're ready.\nMake sure you're on the floor.\nIt's good to see you.\nThe clerk will read the caption to HB269269.\n69, 2, 6, 9.\nHouse Bill 269, by verbs in the black men in the 146,\nand others to be entitled an act to amend code section 50, 14, 1.\nWill the official go to Georgia, annotated, relating to meetings,\nopen to the public, limitation on action to contest agency action,\nrecording notice of time in place, access to minutes,\nand telecommunication conferences.\nThis bill, I refer to the Committee on Governmental Affairs.\nThat committee recommends that this bill do pass.\nThank you Mr. Clerk, Chair recognizes that Chairman the Ways and Means Committee, Chairman\nBlackman, to present the bill.\nThank you Mr. Speaker, fellow members.\nBring before you House Bill 269, which would allow our workforce development boards to\nmeet via teleconference, it's permissive and particularly helpful to our rural\nboards. I would especially want to thank the co-sponsors, representative Douglas\nand for applying his studies regarding space and time to this piece of\nlegislation. Mr. Speaker, I'd be happy to answer any questions if there are\nany. Well, Mr. Chairman, I don't have any and looks like the members don't have\nas well. So you don't have any questions. Well thank you. I take that we had a last\nsecond. Representative Barnes from the 86th has a question to your left. Thank\nyou Mr. Speaker. I yield. Does the gentleman yield? Sorry. I yield. Is it not\ntrue that this will allow more access for patients with the teleconference\nI believe you know what you speak thank you mr. Speaker I asked for the\nbody's favorable consideration yield the well the gentleman has yielded the\nwell is there any objection to the previous question being ordered chair\nhere's none the previous question is ordered is there any objection to a\ngreen to the report of the committee which was favorable to the passage of\nthe bill. The Chair, here's none. The report of the committee is agreed to.\nShall this bill now pass? All in favor of the passage of the bill will vote yes.\nAll those opposed will vote no and the clerk will unlock the machine.\nhave all members voted for what purpose does\nrepresent the main arise.\nThank you, Mr. Speaker. Parliamentary inquiry.\nStature inquiry. Is it not true that last year we transferred about\nabout $60 million or so from the Labor Department\nto the technical college system of Georgia\nfor the purpose of the Workforce Opportunity and Innovation Act.\nAnd this bill in particular will continue\nto help those local colleges with this.\nI know the General Lady knows of what she speaks.\nThank you for the question or the inquiry.\nAll members voted, if so, the clerk will lock the machine.\nOn the passage of the bill, the yeas are 153, the nays are zero, the bill having received\nthe requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to SB 291?\nHB, sorry, you know, this is a house in it, sorry about that.\nI have to tell you what my mind is, sometimes.\nHB 291, Mr. Clerk, thank you.\nHouse Bill 291, by the way, Representative Skoggins,\nthe 14th and others to be entitled an act to amend,\ntitle 29 of the Fisher go to George Antietta,\nrelated to Guardian and Ward,\nso as to add to the list of providers who were authorized to participate\nin the process is for appointment of a guardian for an adult.\nThis bill then referred to the Committee on Juvenile Justice.\nThe Committee recommends that this bill do pass by committee substitute.\nThat should prove to our friends over across the way\nthat I hold them in such high regard that I would grace them with calling\na house bill with an SB in front of it.\nSo I promise you I won't do that again.\nChair recognizes Representative Skoggins to present the bill.\nThank you, Mr. Speaker.\nThat SB could also stand for Skoggins' bill, too.\nI wasn't fast enough to think about that.\nIf I had been covered in the ground, I would have.\nThank you, Representative.\nThank you, Mr. Speaker.\nColleagues, I bring to you House Bill 291 LC 49 1196.\nThis has been brought on behalf of the Probate Judges Council of the State of Georgia.\nThis is a bill that simply expands the list of people who can basically evaluate someone\nthat's in need of a guardianship.\nCurrently only physicians and psychologists can do this.\nThis expands the list of people who are able to do those evaluations.\nThe judges were getting backlogged with problems having to find someone to do the evaluation\nand I think this will help solve that problem.\nAnd I'm open for questions if we have any questions.\nYou have no questions.\nThank you, sir.\nI appreciate you.\nYes, vote on this bill.\nThank you.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nChair, here's none.\nThe previous question is ordered.\nIs there any objection to adopting the Committee's substitute?\nThe Chair, here's none.\nThe Committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nChair, here's none.\nReport of the committee is agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill, we'll vote yes.\nAll those opposed will vote no,\nand the clerk will unlock the machine.\nThank you.\nhave all members voted have all members voted if so the clerk will lock the\nmachine. On the passage of the bill, the Yays, or 165, the\nNAZero, the bill having received the requisite Constitution\nmajority is therefore passed. Mr. Clerk, you'll read the\ncaption to HB 301, HB 301.\nHouse Bill 301 by reps in a riddle of the six, the others to\nbe entitled an act to amend title 40, the fish go to George\nWe're relating to motor vehicles, the traffic so as to revise the amount of civil monetary penalty\nProvilations have been properly passing the school bus and speeding in a school zone\nMiss Bill ever referred to\nThe committee on motor vehicles that committee recommends that this bill do pass by committee substitute\nRepresent Jason Ridley is recognized to present the bill\nThank you, Mr. Baker, for not confusing me with my other person who's got my last thing.\nLadies and gentlemen, I think this bill, I think we've all had complaints about the\nschool cameras and the fines that we've been getting and what House Bill 301 does is\ntwo things really simple.\nAnd we had some bad actors out there that were, they were, the fine was $25, the fee that\nmost of the fee that you could charge was $25, but what they were doing, after you got\nto fine a few weeks later, you were getting a bill in the mail for fees, but they were\nmultiple fees and they were all under $25.\nSo what we've done on the first section is we've made that say, well I'm sorry, I'm getting\nahead of myself, it's not on the first section, it's on the back page of the bill.\nWe've inserted a total of $25 and no additional fines or fees penalties or charges shall be authorized.\nThe second thing that it does, because of those bad actors, we needed to put some teeth in this bill.\nSo what it does now is if you go outside of that, you're going to be issued a $1,000 fine.\nAnd that would go to the commissioner of the public safety.\nI know kids are number one priority here and these things do work.\nhave seen the down tick in the speeding and you can see all these whenever they got the\nfines and the tickets that they issue they go down as people get used to them be there\nbut so we had to but we just had some issues. The second thing that this bill does is these\nfines were outside the 35% of the law enforcement agencies budget. If y'all remember a few years\nago when it's been a lot of years ago we had issues it was called policing for profit\nwhere these little counties were basically doing\ntheir whole budget off of fines.\nSo now what happened, the General Assembly came in,\nthey said you can only have 35% of those tickets,\ntraffic fines of your budget.\nSo this was not under that, it is under it now.\nACCG, GMA, and the Police Chiefs Association\nall was in the meeting whenever we'd done this,\nthey all agreed to it, and that's what the bill does.\nI'll take any questions if anybody has any.\nThe gentleman has a couple of questions.\nDoes he yield?\nI'll yield Mr. Speaker.\nRepresentative Jasmine Clark to your left has a question.\nThank you Mr. Speaker.\nDoes the gentleman yield?\nI do.\nSo does this bill do anything to address when those fines can be, I guess, when a person can get a ticket for,\nI get speeding through a school zone,\nparticularly outside of school hours.\nThis ticket, I've been doing this ticket.\nThis bill does not.\nI think Chairman Jay Collins has got one\nthat's going to address that issue\nabout when you can run it, when you can't run it.\nBut this right here, all that's doing is saying\nthis $25 fee and it does go under the 35% cap.\nThank you.\nGentlemen, further you?\nHi, Dave.\nChairman Collins has a question for you,\nstraight from you.\nDoes my friend yield?\nI do, to Mr. Chairman, go ahead.\nIs it not true that this bill does nothing to address\nif these civil monetary penalties are not paid?\nThis bill does nothing to address that issue\nthat we're having for our used car dealers\nand people who are trading cars.\nAnd these penalties are on titles.\nThis bill does nothing to clean you that up, is that correct?\nNo, sir, I think the one you got\nwe're working on getting that fixed.\nYou yield for another question?\nI do.\nDo you feel, as I do, representative, that these school\ncamera machines that are helping slow some of these people\ndown on these school zones, that that's a good piece\nof legislation because we want to protect our young people\nduring a vulnerable time in the mornings when people are dropping\nkids off and picking kids up in the afternoon.\nDo you agree with that?\nI do, I'm pretty sorry, with that.\nThank you.\nGentlemen, do you have for a couple more?\nYes, sir.\nChairman David Knight, to your right, has a question.\nThank you, Mr. Speaker, this gentleman here.\nI do.\nAppreciate the gentleman bringing the bill, isn't it true?\nAnd is it true we spoke about the problems\nthat are going on within this issue?\nIsn't it further true that made note and you and I discussed\nthat the fines are actually getting sent to the companies\nand then remitted back to the local law enforcement.\nYes sir, and to kind of elaborate on that a little bit\nwhat we learned in this is,\nis somebody's supposed to be checking off these\nas your local police department.\nWhenever a fine comes in, they're supposed to check it off.\nBut it does, so when it takes the picture,\nit goes to the camera company in Utah or wherever it's at.\nThey submit it back.\nThe local police department's supposed to be checking off\nto make sure that that is a viable violation,\nbut we have found out that some people have not been,\nit's just been coming straight through.\nAnd the other thing is, the current law says 30 days\nfrom the time of the infraction,\nwhat may be two or three weeks before you get\nthe actual ticket in the mail.\nWell, I wanna thank the gentleman for working on this\nand if he needs further help such as an amendment,\nmaybe looking for an alternative way\nto safely handle these school zones,\nI'd be happy to step up\nand help the gentleman.\nI appreciate your frame.\nThank you, Mr. Chair.\nTo your left, Representative Wee is married Francis Williams has a question of your yield.\nDoes the gentleman yield?\nI do.\nThank you, Mr. Speaker.\nThank you so much for bringing Section 1, especially.\nMy question is about Section 2.\nHow does the add-on, the changing and the add-on, adding on a fine's effect, super speeder\nbills?\nlike two separate isn't there one locally and then another one that's issued\nseparately? That I don't know I'll be honest with you I don't know how that will\naffect with the superspader. I'm not sure if the superspader goes under that 35\npercent or if it's outside of that 35 percent and I mean I'm not going to\nstand up here and act like I do but I don't but I do know this and I'd like to\ngive this example to Louis Falls, Georgia. There's article in the paper the other day where\ntheir entire city budget is 419,000. The police department's entire annual budget is 126,000.\nSince September of 22, they've made $697,000 in fines. That's when everybody started running\nthe problem. They're on schedule to make $1.6 million this year, off of these. And that's\nwhen you start getting in that situation,\nis it really for safety, or is it really for money?\nAnd I think our number one priority safety.\nRepresentative, you have one more.\nThis one's important.\nYes, sir.\nThis is Representative Franklin.\nUS 301 runs through the heart of his district.\nSo I figured he had a question since there was something\nabout 301.\nIt's a different Franklin.\nYes, sir.\nAre you able to be a friend?\nNo, true.\nThis is the best bill I've heard all day.\nand I'm very thankful for you bringing it.\nI would 100% agree with this is the best bill\nyou've heard all day.\nThank you, sir.\nYou have one final question to gentlemen with you.\nAll right, Mr. Baker, I'll yield for one more.\nThis is not my first time by the way.\nWell, yeah, I heard that too, but anyway.\nNow, this next question should have been handled,\nbut I'll allow it.\nRepresenting Maynard, since she sits one person away\nyou have a question. Thank you, Mr. Speaker. Does the gentleman yield? The $1,000 fine, where does that\ngo to? We're going to put a serious stop. This is a serious issue. What we're having is counties,\nthey'll get the fine for $100 on the actual infraction. A few weeks later, they'll get a\nanother bill in the mail that's not a fine. It's just the fees and it's as much or more than\nin the fine is with these little fees the current law already said $25 but we have some\nviolators out there so we want to make some serious draw some serious attention to it.\nSo that's where we came up with the $1,000 fine.\nDoes the gentleman further yield?\nI do.\nSo once the law enforcement agency is fine for the $1,000, where do they send that $1,000\nto?\nTo the public safety commissioner.\nAnd is there a but do you further yield?\nI do.\na specific place within the public safety commissioner where they're going to use the thousand dollars?\nThat I'm not sure about. I guess maybe next year we'll revisit see how many fines we got\nand see where we need to direct that to but I'm sure we'll probably look at something.\nThank you. Thank you.\nGentlemen, I have no further questions. You're a great job.\nIn the words of force gun, I thought I got to say about that.\nThank you. I yielded well.\nBut the gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee which was favorable\nto the passage of the bill?\nChair, here's none the report of the committee has agreed to.\nShall this bill now pass?\nAll in favor of passage of the bill will vote yes.\nAll opposed will vote no and the clerk will unlock the machine.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine.\nOn the passage of the bill, the yeas were 163, the nays 0, the bill having received\nthe requisite constitutional majority is therefore passed.\nMembers of you will join me in welcoming an old friend of my families.\nOur families have known each other for 100 years or more probably.\nSuperior Court Judge Curry Mingledorf from the Piedmont Circuit.\nWe've recently become acquainted with one another, but the Mingledorf family came from\ndown in Effingham County quite a while back, and we've gotten to know each other a little\nbit today and looking forward to getting to know him better.\nAnd if you, House members, if you'll welcome Judge Curry Mingledor.\nThank y'all, I appreciate that.\nThe chair, the clerk will read the caption to HB309, HB309.\nHouse Bill 309, by the way, Senator Cooper, the 45th and others to be entitled to amend\nan article one in chapter seven to title 31,\nwith the official go to George Anatetti\nrelating to regulation of hospitals\nand related institutions.\nSo as revised provisions relating\nthe financial stability requirements for applicants\nand licensees of personal care homes\nand assisted living communities.\nThis bill I'm referring to committee on human relations\nand aging, that committee recommends\nthat this bill do pass.\nChair, ladies, Sharon Cooper is recognized to present House Bill 309.\nChair, Lady Cooper.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House, I bring to you House Bill 309.\nAbout three years ago when we had a big scandal across our state on how people were being treated in assisted lending facilities and nursing homes and large personal care homes.\npersonal care homes. We rewrote the laws for them, strengthening their staffing ratios,\nand putting in rules to make sure that the people who owned these and started up at new\nstartups were financially sound. On that area, on the financial soundness, we had asked\nCPAs to do some things like certifying that they were financially stable for two years.\nCPAs don't do that and so they've worked with the department to come up with this\nchange which allows them to still, this is a requirement that if you're a new\ncompany and you have and you're going to start assisted living or one of these\nfacilities that you have to you know with CPA if you're choosing it has to\nsubmit forms and the backup information that shows that you are financially\nsound and that it's likely to be a viable institution. And they do this because\nwe had some of them close just on a moment's notice and we were left with our\ndepartment trying to find homes for 25 or 35 seniors who thought that they\nhad found there forever home only to see that the company was going bankrupt.\nthat's the bill. It just corrects this and meets what the CPAs wanted us to do\nas far as how it would, what we would call it and it's now a financial\nstability avidated, a financial stability avidated. Mr. Speaker, if there's no\nquestions I'll yield the well. You have no questions. Chair ladies, yielded the\nwell. Is there any objection to the previous question being ordered? Chair\nHere's none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nChair, here's none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll in favor of the bill will vote yes, all those opposed will vote no, and the clerk\nwill unlock the machine.\nhave all members voted have all members voted\nHave all members voted if so the clerk will lock the machine on the passage of the bill the yeas were\n160 the nays six the bill having received the requisite constitutional majority is therefore passed\nMr. Clerk of your read the caption to house bill 414\nHouse bill 414\nOverups in the black men and the 146 on others to be entitled and act to amend chapter 1\nof Title 37 of the fiscal to Georgia annotated relating to government and regulation of mental\nhealth.\nSo it's to provide for a grant program within the Department of Behavior Health and developmental\ndisabilities to provide behavioral health services to military service members and veterans.\nThis bill then refer to the Committee on Health.\nThat committee recommends a disbilled due pass by committee substitute.\nI'll find you there for a minute, Chairman.\nChairman Blackman has recognized to present the bill.\nThank you, Mr. Speaker, fellow members.\nOnce again, here to bring you a bill,\nHP414, which is designed to establish\na underneath the Department of Behavioral Health\nand Developmental Disabilities,\na grant fund that would match private dollars\ninvested to serve our military service members\nveterans and their families that's here in Georgia subject to appropriation is\nconsistent with our commitment I think to improving mental health and to our\nveterans and once again want to really put put a big thank you out to our\nco-sponsors I notice one of them is missing here but representative Al Williams\nrepresentative Mary Margaret Oliver and Chairman Hatchett along with some\nothers. Miss Speaker that's the bill I'd be happy to try to answer any\nAny questions if there are any?\nhave a couple of questions. Yes sir. First let me address an issue with\nRepresentative Jackson. I think you've had a machine issue. So we'll address\nthat issue and I think maybe you had a question on the last bill. Can I have\nchair lady Cooper come speak with you and see if she can answer that\nquestion. Thank you. That'd be the appropriate way to handle this. Thank you\nMr. Chairman, to your right, representing Maynard has a question of your yield.\nYes.\nThank you.\nMr. Speaker, does the gentleman yield?\nYes.\nFor the priority status within 50 miles of a military base, since there are so many veteran\nnonprofit associations, especially in my district in the inner city, how does the grant fund\nprocess work is it saying that it's going to give priority to those within the 50\nmiles and if those funds are then depleted, they're gone. I'm just trying to\nunderstand. The department is designed to set up the rules and regulations as\nto how to implement this particular program. We just put a few little\nfew little stipulations out there as to what we like to see happen. So I think\nthat would be part of their package, Representative Mayer. I hope that answers\nyour question. I'll talk to you later. Thank you. Thank you.\nI will, sir.\nLet's see, we have a new member with a question.\nThe gentleman from the 172nd House District Representative Chas Cannon has a question to\nyour right.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI yield.\nbill not sure that this bill would help military service members and their families.\nBlake Jimenez what he speaks.\nThank you for your service.\nThank you Mr. Speaker.\nYes sir thank you for your service as well.\nGentlemen you yield for a couple more.\nI will yield for one more question yes sir.\nRepresentative Gladney has a question.\nDoes the gentleman yield?\nYes ma'am.\nSir, as a veteran myself,\ninquiring whether or not is it true that this bill provides additional resources for\nveterans who already receive veterans care through their veterans' benefits.\nThis grant adds additional resources to that care.\nIt could be utilized in that very manner, yes, ma'am.\nThank you so much, sir.\nThank you very much.\nMr. Speaker, I know we have a busy schedule today.\nI would ask for this body's favorable consideration and yield the well.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe Chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass, all in favor of the passage of the bill, will vote yes.\nAll those opposed will vote no and the clerk will unlock the machine.\nhave all members voted, have all members voted.\nIf so, the clerk will lock the machine on the passage of the bill.\nThe yeas were 167, the nays 0.\nThe bill having received a requisite constitutional majority is therefore passed.\nMr. Clerk, you'll read the caption to HB416416.\nHouse Bill 416, my brothers and a coup for the 45th\nand others to be entitled an act to amend Article 3,\nChapter 4, titled 26 of the official go to Georgia\nand it's either related in the practice of pharmacy,\nso it's to authorize, qualified,\npharmacy technicians to administer certain vaccines,\nthis bill ever referred to the committee\non health, that committee recommends that this bill do pass.\nChair, representatives, recognizes,\nChair Lady Silcox to present the bill.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House,\nI bring to you this afternoon House Bill 416.\nHouse Bill 416 is the product of over two years\nof negotiations between the legislature, industry,\nand they have come together to this negotiation to basically extend the\nrights of qualified pharmacy technicians to give vaccines. The federal\nemergency of course necessitated the creation of qualified pharmacy\ntechnicians and that the federal order is supposed to expire May 11th of this\nyear. Under this legislation, pharmacy technicians will be required to undergo extensive training.\nThey will have to complete a course by the accreditation council for pharmacy education.\nThey will also have to have basic cardiac life support certification and complete a minimum\nof two hours of training on immunizations relating to continuing pharmacy education.\nAnd also they will only be allowed to give vaccines to persons 18 and older, no children.\nSo I would ask for your favorable consideration of House Bill 416.\nYou have no questions.\nThank you.\nI'll yield the well.\nThank you.\nThe lady has yielded the well.\nIs there any objection to the previous question being ordered to chair here's none?\nThe previous question is ordered.\nDoes there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nChair, here's none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill, we'll vote yes.\nAll those opposed will vote no, and the clerk will unlock the machine.\nhave all members voted have all members voted if so the clerk will lock the\nmachine on the passage of the bill the yeas were 164 the nays to the bill\nhaving received your requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 475-475?\nHouse Bill 475, I represent a Smith of the 18th to be entitled back to amend the official code of Georgia annotated so as the revised, modernized and correct errors or missions in and react statutory proportions of the code.\nMr. Bill I refer to the committee on code revision that committee recommends that this bill do pass\nChair recognizes chairman Tyler Paul Smith to present the bill\nThank you, miss speaker. I'm as thus august body. I bring to you house bill 475 this our annual code revision bill\nWhich revises modernizes and corrects errors or emissions in our official code of Georgia annotated\nIt reflects the work of legislative counsel in offseason with them going through and finding\nthose parts that need revision, reenactment, and for publication of the code.\nIn essence, at the end of the day, this is a bill that cleans up minor, none substantive\nerrors in the code that legislative counsel has so diligently found force of when they\nto eliminate. Well, that, Ms. Speaker, I'll yield for two questions.\nYou have no questions. Thank you, Ms. Speaker. I ask this by his favourable consideration.\nThe gentleman has yielded the well. Is there any objection to the previous question\nbeing ordered? Chair, here's none. The previous question is ordered. Is there any objection\nto agreeing to the report of the committee, which was favourable to the passage of the\nbill. Chair here's none. The report of the committee is agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWe'll vote yes. All those opposed will vote no and the clerk will unlock the machine.\nYou\nhave all members voted have all members voted this so the clerk will lock the machine\non the passage of the bill the yeas were 168 the nays zero the bill having received\nthe record was it. Constitutional majority is there for a past. Mr. Clerk, if you'll\nread the caption to hb497 497. House Bill 497 by a rupture of the hood of 175th to\nbe entitled an act to amend title 31 of the Fisher go to Georgia annotated relating health\nso as to authorize the use of certified medication aids and penal institutions. This bill\nI refer to the Committee on Human Relations and Aging,\nthat committee recommends that this bill do pass\nby committee substitute.\nChairman John Lerwood is recognized to present the bill.\nThank you, Mr. Speaker and members.\nHouse Bill 497 is a workforce bill\nthat impacts penal institutions\nand what it does is allows certified medication aids\nfor the first time to be employed in a penal institution,\nCertified medication aids have been a thing\nfor about 12 years, but focused in the long-term care areas\nassisted living and skilled nursing homes,\nand they administer medicines in those settings now,\nand so this bill would allow them to do the same thing\nin a penal institution.\nThis bill supported by the Department of Corrections\nand the Department of Community Health\nas well as advocates in the hallway,\nand I'd appreciate your favorable consideration.\nspeaker if there's any questions I'll take them.\nGentlemen has no questions.\nThanks for your favorable consideration.\nYou'll the well.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nChair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nChair here is none.\nThe committee's substitute is adopted.\nIs there any objection to agreeing to the report\nof the committee which was favorable\nto the passage of the bill?\nThat's here, here's none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill will vote.\nYes, all those opposed will vote no,\nand the clerk will unlock the machine.\nSo we don't postpone to clear off the next next second day.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of the bill.\nThe yeas are 167, the nays 0.\nThe bill having to receive the requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to hb518?\n518.\nHouse Bill 518 by President Cameron in the first and others to be entitled an act to amend Title 34 of the fiscal to George annotated relating to labor and industrial relations, so it's changed certain provisions relating to employment security.\nMr. Bill, I refer to the Committee on Industry and Labor that Committee recommends a dispelled do pass by Committee Substitute.\nRepresenting Mike Cameron is recognized to present the bill.\nGood afternoon, Mr. Speaker and thank you colleagues.\nI bring a bill today on behalf of the Georgia Department of Labor regarding administrative assessments.\nIn 1987, the legislature passed a bill creating administrative assessment for employers in the state of Georgia.\nThis small amount of wages, percentage of wages, goes towards the administrative cost of the Department of Labor.\nof Labor. It's been renewed numerous times over the years. Unfortunately in 2022 it was not renewed\nand it's sunset and reverted back to a rate that was for 1987 based on the tables from the Department\nof Labor. This bill will put it back at the rate that it was last year which is 2.64%. The second\nSecond part of the bill is Article 6, creates a percentage assessment of 0.06% that will\nbe assessed to new employers who haven't built up the experience with the Department of\nLabor.\nMr. Pickard, that's the bill.\nI don't want to answer any questions.\nThe gentleman you owe for a question?\nYes, sir.\nA yield.\nfrom the 108th representing Jasmine Clark to your left has a question.\nThank you Mr. Piger does it gentlemen you. Yes ma'am. So can you clarify you said\nnew employers will have 0.06% fee on top of the 2.64%? That's correct because\nthey don't have an experience built up with the Department of Labor. The rates\nare based on it's almost like an insurance rate. The near you are the higher\nyour rate is it's like build up experience with the department the rate will be\ncalculated a lower rate. Does the gentleman further yield? Yes, ma'am. When do you\nstop becoming new? So how long will these newer businesses be required to pay\nthe extra 0.06 percent? That hadn't been specified. Thank you. You're welcome.\nGentlemen, you have one more question. Yes, sir. Chairman Casey Carpenter has a\nquestion to you right in the room. Does the gentleman yield to my friend from\nfrom Dalton, yes.\nYeah, is it not true that that typically happens\nafter three years, after three years,\nthe rate changes after the review process?\nThat's pretty much correct.\nUnless the employer has a giant number of claims\nagainst her unemployment with the state,\nthey would drop.\nThank you.\nGentlemen, ask no further questions.\nNow, yield the well.\nThank you, Mr. Speaker.\nAnd that's for your favor of consideration.\nThere is another speaker on the bill, which who wishes to be heard.\nRepresentative Holly is recognized to speak to the bill.\nThank you, Mr. Speaker.\nThank you members for being able to hear me on this bill.\nFortunately, I can say that while it was heard in the industry labor committee,\nMany times we actually have a very good job of actually being able to bring questions\non these matters to the forefront.\nUnfortunately for that day, my high blood pressure was a little elevated, so thanks to your\nprayers, I was able to come back, but I could not actually pose these questions and in committee\nso I would like to address them here.\nAnd it's coming from a very different position than you might actually hear.\nThis is really not something that we're seeing of, you know, Republicans and Democrats fighting\nit out.\nNo.\nThis is merely a measure, I think, that we should look into particularly because we know\nthat we've already seen a pandemic.\nWe know that in order for us to have Georgia in a stable position, we need to be able to\nbuild back our accounts for our unemployment and insurance trust fund.\nright now because the rates that are particularly,\nif you're looking section one in the Alliance 37 to 41,\nwe're seeing that the contribution rates for employees\nis actually, it's becoming suppressed.\nWe know that, and I think probably all of us\ncan agree in this chamber, that we know that the Federal Reserve,\nit's not above them to actually, in order to address\naddress the inflation, we know that they are willing to put the economy into another\nrecession.\nAnd so therefore, we need to be able to make sure that we are showing up the investments\ninto our unemployment insurance trust fund, but we have to do that in a way that does\nnot have it so that only a minority of those employers are showing up those funds.\nWe need to make it so that it is broad across the board.\nIf you'll notice, just follow with me, if you will.\nI know some of this is a little granular.\nIf you look for instance, for our section one,\nwe look for line 17, where you get part A,\nand compare that for line 32, that 2.64,\nthe variance from that 2.7% to 2.64%.\nThe part is, is that really, you're looking at this on overall Georgia's employers for\nthe most part, are paying at 1.23% into that trust fund.\nAnd so, you know, we want to make sure that it actually is more balanced.\nAnd when you're only 12% of the UI benefit payouts are attributed to employers who lay off\nworkers, who then enroll in unemployment insurance, they're assessed when determining\nGeorgia's employees level of trust fund solvency responsibility, and that's compared to a nationwide average of around 45 percent\nSo we again want to be on par because we know that should Georgia\nFind ourselves in a situation where we're now having to pay money out for unemployment insurance\nWe don't want to have our state\nHave those funds\nis dwindled down to where now we're having to rely on other states to borrow money from\nother states and to borrow it at a higher interest rate.\nWe want to make sure that if we can be able to have it so that employers of themselves,\nnew employers coming in, that that 2.64 percent, that we can actually match that up.\nSo that 2.7 percent is ground leads one that employers are paying into.\nAnd we know that it's going to be able to help to be able to shore up those resources\nshould we get into a situation where we're having a recession, okay?\nSo I know a lot of this sometimes you're looking saying, well you know what, isn't that just\nat the federal level?\nWhat are we doing this for?\nCan't we rely on the U.S. government to bail us out?\nBut we already know that it's always better if we can be, I know it's probably going\nto be a surprise for you to hear.\nA Democrat say this is probably best if we be conservative\nwith our assets, making sure that our unemployment\ninsurance trust fund actually has the money available.\nHow will this help individuals in each of your districts?\nVery easily.\nYou all forget my uncle Al, he didn't aid too much and he's too many jokes right now.\nBut here's, okay, all jokes aside really, this is not a funny measure.\nGentlemen, gentlemen suspend just for a moment, respect the gentleman in the well, continue.\nThank you, Mr. Speaker.\nWe all want to make sure that for those workers who have to find those job opportunities,\nthat they're able to do so because, not because they're reliant their whole life on this\nlittle bit of money for the unemployment insurance trust fund.\nWe want to make sure that they're able to just get their resumes, be able to get, you\nknow, suits, get job training, get what's necessary to allow for Georgia to continue to remain\ncompetitive for those jobs that are coming here.\nAnd we know that that money is actually through the unemployment trust fund.\nSo we just want to make sure that while enough attention to detail has been explained for\nthat 0.06% that is going to be drawn out for the administrative assessment fee by the\ncommit that will come to the commissioner, we want to make sure that our reserves are\nstored up for those workers should they find themselves jobless so that we can remain\nthe number one state in the country for doing business.\nWe have to take care of Georgia workers and by making sure that that amount is actually\none that our employers are able to pay into that it's fair across the board, we won't\nbe relying on other states to help us pony up funds when we need them.\nAnd that is all I have, but I appreciate, I would, I would only suggest that you vote\nno on this bill.\nSo when it comes back to committee, we have an opportunity to actually have an amount\nthat's going to be fair and equitable for all Georgia businesses.\nAnd for that, I will yield the well.\nThe gentleman has yielded the well.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nChair, here's none.\nThe previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nChair, here's none.\nThe committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was\nfavorable to the passage of the bill. The chair has done the report of the committee is\nagreed to. Shall this bill now pass, all in favor of the passage of the bill will vote\nYes, all those opposed will vote no and the clerk will unlock the machine.\nWhat purpose does chairman work highs arise?\nParliamentary inquiry.\nStature inquiry.\nActually, this was a question for the author just left\nbecause I'm a little confused if the reason he's trying\nto get this body to vote against this bill\nbecause the rate is not enough, it sounds counterintuitive\nto get this body to vote for a bill down,\nwhich would give us a zero rate\nand zero times anything is zero,\nso that any time a member of this body can drop a bill\nfor a different rate,\nthe voting against this bill would be\nto do the exact opposite of what the speaker just requested.\nThat's true.\nThey didn't help me, but if the gentleman's so states,\nI get it.\nFor what purpose does representative Mayna rise?\nThank you, Speaker.\nIs it not true?\nIs this a parliamentary inquiry?\nParliamentary inquiry, please.\nStatue inquiry.\nIs it not true that I was going to ask Representative\nHolley a question, but he yielded the will.\nAnd is it not further true that I was going to ask?\nAnd his mind, if we change the 600th of a percentage point, would it be in his eyes that he would\nrather the employers, the business community, to have a higher percentage rate to contribute\nto this fund?\nIs that not true?\nI'm sure the lady believes that it would be true.\nShe says states, we're going to take a couple more and then we're going to finish\nthis one up. Representative Wilkerson, let's see for what purpose is\nrepresenting Wilkerson rise. Parliament inquiry. Stature inquiry. Is it not true\nthat if we do not pass this bill then the rate would go back up to 2.7 versus\nfalling down to 2.64? Therefore as a result of the pandemic and the run on\nunemployment that we may want to go back to 2.7 to help short that\nreserve and I believe that is what the author is looking for or the the gentleman\nthat was speaking in the wells looking for. I'm sure the gentleman has\nexpertise in this area and he's correcting what he says states last one let's\nsee he did present his ideas but we'll give him one more shot what purpose is\nrepresentative Holly rise.\nFollow me in, Chris, sir.\nStay tuned, Quarry.\nIs it not true for one that this is a very convoluted measure.\nAnd so we appreciate people at least trying to stay at paying attention.\nThat number two, I appreciate the requests for my colleague to try to attempt\nto at least put a question towards me.\nAnd that three, and finally, Mr. Speaker that all this we're asking\nfor is that if this bill goes back to committee,\nthat at least you can be discussed for a fair rate,\nnot a rate of zero.\nBecause again, we want to make sure\nthat if it are possible, businesses can be able to pay in for it.\nWe all believe that Georgia is the number one state\nfor the country for doing business.\nBut we just want to make sure that for those jobs\nthat come to our state, our workers who are maybe jobless,\nmay be able to use those funds because they're available,\nbecause they're there that will allow for them\nto be able to get the training and the resources necessary\nto get into the jobs of the future.\nAnd that is also.\nI'm sure the gentleman believes in his inquiry\nand it was in there someplace.\nIs there any of them?\nExcuse me, he got me mixed up.\nNow.\nHa, ha, ha, ha, ha, ha, ha.\nOh, let's see, Mr. Clerk.\nWe've got all the members have voted, I think.\nI believe we have, have you members all of you voted if so, the clerk will lock the machine\non the passage of the bill. The yeas are 105, the nays 64. This bill having received\nthe requisite constitutional majority is therefore passed. We have one remaining\nbill on today's calendar and in House bill 212 will be postponed to the next legislative\nday.\nWell, we're ready for afternoon orders, Representative Holley kind of talked me in a circle there.\nBut we got to the end.\nWe'll move on to afternoon orders.\nrecognize Representative Edna Jackson and Representative Al Williams for an\nafternoon order.\nWe're ready, Representative Jackson's recognize, and\nRepresentative Anne Allen-Rowesbrood will join them.\nMembers, give the members and the well your attention.\nThank you, Mr. Chairman, and to my fellow Mr. Speaker, I'm sorry, thank you, Elf, for correcting me, and members of the Chamber.\nToday, I honor a gentleman from Savannah, Wesley Wallace Law, for his life work with the NAACP.\nMr. Law was the first elected Savannah Branch President\nof the NAACP at the age of 27,\nthe youngest major branch president in the country.\nHe was also the longest serving president\nof the Savannah Branch for 26 years.\nHe served as the conference president\nand as a member of the NAACP National Board of Directors.\nMr. Law was also a historian, a founder of the King Tisdale Foundation, the Beach Institute,\nand Ralph Mark Gilbert, Silver Rights Museum.\nAnd celebration of Black History Month, and in recognition of Mr. Law's 100th birthday,\nin 1923 in Savannah, Georgia, in an area of great inequities and social injustice.\nHe earned a modest income as a postman and went on to become an icon in civil rights\nas a historian, teacher, preservationist, and an expiring presence in the community.\nIn 1948, he graduated from Georgia State College, now Savannah State University, and received\nthe first honorary doctorate from Savannah State.\nFounder of the Ralph Marguilbert Civil Rights Museum in March of 1960 under his leadership,\nThe sit-ins and kneel-in movements began along with church weighed-ins at Taibi Island\nas well, economic boycott of the downtown Savannah area under his leadership.\nSavannah designated him as Mr. Silverrights, Dr. King, Dr. Martin Luther King said, when\nAnd he came to speak in Savannah that we did not need his leadership, that we had excellent\nleadership.\nMr. Law, let's honor him, my colleagues.\nYou see, for lives of great men all remind us, we should make our lives sublime and departing\nLee behind us, footprints on the sands of time, will you please rise with me, as we salute\nWesley Wallace Law, a man for all seasons.\nThank you.\nRepresentative Sharper recognized for an afternoon order.\nI've got sunshine on a cloudy day.\nAnd when it's cold outside,\nI've got the month of May, well, I guess you say what can make me feel this way, my girl.\nTalking about my girl, my girl, this is my black history moment.\nThe Temptations on American Vocal Group from Detroit, Michigan, who released a series\nof successful singles and albums with motile records during the 1960s and 1970s, featuring\nfive male vocalists and dancers, oldest Williams, Elbridge L. Bryant, Melvin Franklin, and\nEddie Kendrick's and Paul Williams of the Primes in 1964,\nBryant was replaced by David Ruffin,\nwho was the lead vocalist on the number\nof the group's biggest hits, including my girl,\nain't too proud to beg, and I wish it would rain.\nOver the course of their career,\nthe temptations released four Billboard Hot 100,\nnumber one singles, and 14 R&B, number one singles,\nThree classic temptation songs are my girl,\njust my nation, my imagination, run away with me,\nand poppile was a role in stone, thank y'all.\nThank you, speaking.\nThat certainly was a fitting tribute to the temptations.\nThe representative Washburn is recognized\nfor an afternoon order.\nThank you, Mr. Speaker.\nThe best news you have today is I will not sing to you.\nI just wanted to let you know that the Georgia Association of Real Tours is here for the\nnext two days for their days at the dome event.\nAnd of course, you all know what our real tours do for us.\nThey help you buy and sell your houses, your commercial property, and your farm and timber\nland.\na very important part of the economy of our state.\nSo be looking for them tomorrow,\nas they'll be dropping by to see you.\nThank you.\nRepresentative Trane is recognized for an afternoon order.\nThank you, Mr. Speaker.\nI'm here today to tell you a story about a woman,\nthe only woman I fear more than my wife.\n48 years ago, she did everything she could to reach my father to escape communism and\nhop on a helicopter and come to America.\nAnd in the 48 years since landing in America, she has fought poverty, bigotry to raise\nfour successful kids.\nI wouldn't be here if it wasn't for her.\nAnd you know, she's got one more fight, she's fighting right now.\nstage 4 cancer is what she's fighting, but I am confident that today will not be\nthe last day that I tell her happy birthday mom I love you.\nWhat a wonderful legacy your mother is leaving and is important to you and our\nprayers will be with her. Thank you. That completes our afternoon orders for what\npurposed as representative Victor Anderson rise. To make a motion. State your\nmotion. I move that House Bill 331 be transferred from Wieson means to\nGovernor LaFares and both committees agree. Most chairman agree. The clerk will\nread the caption. House Bill 331 of Anderson of the 10th and others to be\ntitled back to Men Park 2 of Article 3, Chapter 5 of Title 4080 that\nfiscal to Georgia and say to relating to tax collectors.\nOn the gentleman's motion, H be 331 be withdrawn from Ways and Means\nCommittee and recommitted to government affairs committee is their\nobjection. Hearing none it is so ordered. For what purpose does Chairman Perkel\nrise? Make a motion. State your motion. Requests that HB 607 be moved from\neducation to higher education. Both Chairman agree. Clark will read the\ncaption. House will 607. I represent a Perkel of the 169th and others to be\ntitled next to men. Part 7 of our 7 of chapter 3 title 20. The fish go to\nGeorge Annotator League and Hope Scholarships and Grants.\nOn the gentleman's motion that HB607 be withdrawn from the Education Committee and recommitted\nto the Higher Ed Committee, excuse me, is their objection hearing none, it is so ordered.\nWe're ready for announcements, Chairman Gunther, is recognized for announcement.\nThank you, Mr. Speaker.\nThe House Judiciary Committee will meet upon adjournments.\nWe have a busy schedule, but hopefully we can get\nthrough all those bills.\nThank you.\nChair Lady Belinger is recognized for an announcement.\nThank you, Mr. Speaker.\nJuvenile Justice Committee meeting will be today\nat three in room 515 in the CLOB.\nAgain, that's at three in room 515 and the CLOB.\nThank you very much.\nChairman Powell has recognized for announcement.\nThank you, Mr. Speaker.\nThe regulated industries committee will meet it\nthree o'clock in 606.\nAnd my thanks to Chair Lady Cooper,\nthey're going to another room\nto make up the difference in their time.\nThank you, ladies and gentlemen.\nIf you could, please be there.\nAll working together, representative Anderson,\nrecognized for an announcement.\nThank you Mr. Speaker.\nThe government affairs election subcommittee will meet\nin room 415 CLOB upon adjournment,\nand the state and local subcommittee will meet\neither one hour after that\nor immediately upon adjournment\nof the election subcommittee.\nThank you.\nChairman Chocas is recognized for announcement.\nThank you, Mr. Speaker.\nI'm freeing up another room in a time.\nTomorrow morning at 8 o'clock, the Small Business Development\nCommittee will not be meeting.\nWill not be meeting.\nTomorrow morning at 8 o'clock, Small Business Development.\nThank you, Mr. Speaker.\nYes, sir.\nChairman Dickie, recognize foreign announcement.\nThank you, Ms. Speaker.\nThe Agriculture and Consumer Affairs Committee\nwill be meeting in the morning at 8 o'clock over at 606.\nCLOB, and don't forget your peanut butter and jelly\ngrilled sandwich tomorrow too, so thank you.\nI'll be there.\nChairman Newton, recognize foreign announcement.\nThank you, Mr. Speaker.\nThe Ways and Means Subcommittee on Tax Revision\nwill meet immediately on adjournment up in room 403\nthe Capitol. Thank you. Representative Jasmine Clark recognized for\nan announcement. Thank you, Mr. Speaker. GHDC policy committee. We will meet\ntoday at 3 o'clock PM 6 o'clock 5 CLOB. Chair camp is recognized for an\nannouncement. Thank you, Mr. Speaker. As in many times we make plans and someone\nwith more knowledge of us, changes them.\nSo today, an intergovernmental coordination\nwill be meeting in room 406 upon adjournment\nfor a brief meeting.\nThank you.\nGerald Lady Cooper is recognized for an announcement.\nThank you, Mr. Speaker.\nPublic and community health will meet today.\nWe will meet, but it will be at 330 in room 506.\nSo at 330 in room 506,\nThank you, Mr. Speaker.\nThat completes our announcements.\nThe words we love to hear.\nThe majority of this house is recognized for a motion.\nThank you, Mr. Speaker.\nI move that this house stand in recess until 4 p.m.\nand at that time adjourn until 10 a.m. on Wednesday, March 1, 2023.\nOn the motion of the majority of the this house stands\nin recess until 4 p.m. today Tuesday, February 28th, 2023 and at that time we will adjourn until\nWednesday, March 1st, 2023 at 10 a.m., all those in favor of the motion will say aye. All\nthose opposed will say no. Yep, the eyes have it. We are in recess and then adjourned.\nYou\n",
  "updated_at": "2026-02-12T14:37:49.412893+00:00"
}