{
  "video_id": "V__ITcZsfpg",
  "url": "https://www.youtube.com/watch?v=V__ITcZsfpg",
  "title": "Ways and Means Subcommittee on Public Finance and Local Policy Meeting 2026 - Day 16 PM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Overview:\nThis Georgia Ways and Means Subcommittee on Public Finance and Local Policy meeting focused on property tax relief measures, including a resolution (HR 1114) and an enabling bill (HB 1116) to provide homeowners with tax relief through new funding mechanisms like local sales taxes and assessments.\n\nKey Actions:\n**HR 1114**: Authorizes local governments to use new growth and development to lower homestead property taxes, allows schools to levy up to 2% in sales tax, and enables a local homestead option sales tax as an offset to property taxes.\n**HB 1116**: The \"Homestead Opportunity and Market Equalization Act of 2026\" that phases in a full homestead property tax exemption by 2032, allows for local sales tax adjustments to offset property taxes, and enables local assessments for services and capital projects.\n\nBills Introduced (First Reading):\n- HB 1116: The \"Homestead Opportunity and Market Equalization Act of 2026\"\n- HR 1114\n\nNotable Moments:\n- The Chair discussed the unsustainable path of rising property taxes and the need to provide relief to homeowners.\n- The sponsors outlined the key provisions of the resolution and enabling bill to allow local flexibility in funding mechanisms to offset property taxes.\n\nVotes:\nNo recorded votes, but the bills were discussed for potential future action.\n\nAttendance:\nQuorum present, no specific attendance notes.\n\nAdjournment:\nNo adjournment information provided.",
  "transcript": "Ladies and gentlemen, as the uh chairman\nis moving up to the front, um when I was\nI'll take prerogative of the chair for\njust a moment. When I was elected\n29 years ago, um there was two things\nthat you could not that you could\npurchase and never own. Uh, one was your\ncar and the man next to me to my right\nuh, somehow got TABT done so that\nforever you never have to pay an abalone\ntax on your car. The next one's a much\nbigger bite and uh, if anybody can pull\nit off, I have full faith that the\ngentleman to my right will be able to do\nit. So, we're going to hear\num,\nsubstitute to House Bill 1116 LC. I\nguess you're going to do bill first.\nboth the same time.\n>> Yeah.\n>> You have the mic.\n>> Uh, thank you, Mr. Chairman. And I I'll\nI'll go up to the podium so that it, you\nknow, everybody can can hear me and see\nwhat's going on. But I I wanted to let\neverybody know kind of what we're\nlooking at here and lay out the the\nframework of how we want to proceed. And\num the the idea would be is that you\nknow we know we're going to have\nmultiple meetings on this. We want to\nget uh the bill um kind of that aligns\nwith you know the briefings that we've\nbeen having so far out there and talked\nabout and uh let people work through\ncopies of it and then we'll come back in\nthe coming days and allow uh more robust\ntestimony and input from other sources.\nBut uh today try to answer some\nquestions from the subcommittee if there\nare any. and uh again uh continue to\nwork through this. This is kind of part\nof the beginning. This is uh certainly\nnot near the end. So we're we're in the\ninitial stages, not the end stages. So\nMr. Chairman, thank you so much for\nletting me go through that.\nMr. Chairman, you have the floor.\nAll right. Thank you. Uh\nMr. chairman. Um,\nas y'all have heard, uh, the speaker\nin his announcement, um,\nthat we would be tackling and and coming\nup with some some ideas on property tax\nthat we have been on an unsustainable\npath with regard to property taxes. Um,\nand this is really across the nation.\nUm,\nso as we continue to hear from our\nconstituents that uh people are having a\ntough time uh having to make some tough\nchoices.\nUh got another letter the other day of\none of those very very tough choices uh\nthat a a homeowner was trying to make.\nUm we we cannot let people be taxed out\nof their homes. So, we have been\nsearching for months now uh digging up\ndata looking for a path to help our\nhomeowners and gotten uh a great deal of\ninput and uh we we have talked to our\nour local stakeholders and partners.\nWe've you know come up with a a path and\na plan and a place to start here that\nI'm going to try to embark on with these\ntwo u two measures here today. A1 would\nbe a resolution one the enabling um and\nI think it's respectful of our local\nservices and our operations or that our\ngovernments have to provide but at the\nsame time provides meaningful relief for\nour property owners and we don't see\nthis as a local versus state issue. We\ndon't see this as a one party versus\nanother issue or a state uh house versus\nsenate issue. We see this as um about\nthe American dream and to help create\ngenerational wealth for gener uh for\nGeorgians and for their families.\nCertainly uh continue to appreciate all\nthe ongoing conversations with all of\nour members and our local partners and\num I think many of whom have indicated\nthat they would very much like to be\ndoing some things already on this front\nif they had the tools to do so.\nSo with that, if I could, I'm going to\nstart with HR 1114, Mr. Chairman, and\njust hit the high points and then I'll\nroll into the enabling legislation and\nthen try to try to take any questions.\nUm, if you look on uh LC 3969,\nis that correct?\nI got the wrong LC number.\nHR114\nH.\nThat's convenient.\nWe've had a few ver versions of this\nthing. So, um,\nif I could start with section one, um,\nthat authorizes, uh, local governments\nis kind of the, uh, the framework for\nallowing local governments to utilize,\nuh, new growth and new development to\nlower homestead property tax.\nSection two and section four would\nprovide some guard rails uh, regarding\nuh, some of the non-homestead\nproperties. uh as we get to um 2032,\nsection three would enable our schools\nto levy up to 2% in sales tax. Um\nall up underneath the overall cap. And\nsection five is our local homestead\noption sales tax enabled um not as a a\nnew tax but as an option up underneath\nuh the the existing. And so it would it\nwould be um used as a roll back for for\nproperty tax as an offset. Section six\num is something that we see local\ngovernments already doing. They add it\nto your property tax bill. This would\nauthorize the local finance assessments\nas a roll back uh you know either for\nessential services um to be built or as\na uh capital assessment to function uh\nthrough a referendum by the public and\nthen section seven is simply the uh the\nballot question. So those are that's\nkind of the the framework that u you\nknow is set up to move into the enabling\nlegislation and that is HB\n1116. We didn't quite align that up but\nit's it's it's close. Um,\nso if uh if I can start with the U\nHomestead Opportunity and Market\nEqualization Act of 2026,\nuh on page two, we begin with the full\nexemption. uh starting in in 2032, if\nyou look on page three down at the\nbottom, it uh we start tax relief at\nnext year by moving the 2000\num\nstate exemption up to 10,000 and then it\nphases in all the way up to 2032 to that\nfull\nexemption.\nIf you sees towards the the the back end\nof that, you'll see some of the things\nthat are are qualifiers with regard to\nhow that is is um implemented. Part\nthree, section 31, um\nthat that is the uh the sales tax and it\ntalks about how we uh continue that five\npenny cap at the local level. So that is\nnot anything new other than to to state\nthat um we will will not exceed a 5%\ncap.\nUm section 32 is how those pennies are\nare currently renewed. Uh existing\npennies uh that would would would be\nutilized by local governments. There's a\nwhole um list of those that are\ncurrently in use right now. Section 33\nis um how the renewal would work for any\nof these homestead pennies that we\nutilize um and and how that would would\noperate. We we actually authorize um the\nthey imposed without an additional\nreferendum to begin with and they\nautorenew as they reduce and entirely\noffset property tax. Section uh 34\nuh\naddresses uh that particular roll back\nand how you would do that in midstream\nif you had a penny that uh you wanted to\nrepurpose for homestead property tax\nrelief and moving to page 10 uh section\nfour. uh for one that is uh the splast\num and and allows that to be um broken\ndown and utilized in increments of 0.05%\nlike all the other sales tax um options\nare are available right now. So it\nallows a fractional penny there.\nOn page 12, um\nthis is the collection and distribution\nand the mechanics of the homestead\noption sales tax. And it's referenced as\nnew homestead option sales tax. And so a\nlot of that is is legal pieces that are\npulled from other pennies that are\nlevied across the state. uh and and\nwould would any way speak to how those\nare filled and and how the local\ngovernments would use those to offset uh\nproperty tax on an ongoing basis.\nThere are several pages.\nSo as we skip forward\nto part six delineates how that assess\nthose assessments would work. Um again\nthis enables um assessments for local\nservices to be approved by a local act\nthat would roll back property taxes and\nallow local governments to bill for\nthose essential services many of which\nthey already uh use that uh component.\nNow, it's just a a function of your\nproperty tax. You see it separately\nlisted on your property tax bill. Um, it\nalso enables capital projects to be done\nthrough the assessment model. And that\nwould have to go to referendum very much\nlike your splast or or east would.\nThose are pages all the way through to\nuh page 27.\nUh on page 27, we get into a little bit\nmore about the schools that would um\nallow the the reserve fund. It's\nsomething that they have in our ongoing\ndiscussions have mentioned that they\nwould like to see is a little the\nability to to raise that reserve fund up\njust a little bit so that they can uh\nprepare for a rainy day and any kind of\ntransition.\nYou'll also see some of the language\nthat would go into how we operate with\nregard to non-homestead properties. And\nthere are 36 states right now that\nimplement some sort of a revenue cap.\nAnd this is exclusive of growth, but it\nwould put a 3% cap on uh revenue\nyear-over-year um and allow that to be\nexceeded uh by uh vote of of the of the\nthe citizens of the district. Um\nsomething that we've had a lot of\ndiscussion about and I know that's going\nto continue to to be the case. Um the\nnext section is is very much the same\nthing for the cities and counties.\nNext two sections moving uh to part\neight. Uh that's on page 32, section 81.\nThis is where we take the um\nthe exemptions that are in place and we\nallow them to count towards the digest\nfor our schools. Um right now the local\nexemptions are not part of the\nequalization or local fair share formula\nand this would allow those to be um\nutilized in the overall calculation for\nthat for the the formula with regard to\ntheir local digest.\nUm section 82 is a duty to notify so\nthat if you are no longer supposed to\nhave your exemption your your homestead\nexemption that you you notify the\nappropriate uh body. 83 is the penalty\nfor not doing that. Section 84 is the\ndatabase that we try to maintain so that\nuh you know it's information that's\nalready available at the local level,\nbut this would track statewide with the\nhomestead exemption so that if somebody\nwere to want to switch their homestead\nfrom one one county or one place to the\nother that there's a way to check that.\nI know I tried to get through it pretty\nquick and be respectful of everyone's\ntime. Um again, we have a number of\nmeetings. I think that uh will continue\nuh as we as we discuss this. I really\ncertainly appreciate all the help that\nthat I have received. Um appreciate the\nspeaker's leadership on this issue and\nand certainly uh representatives uh Trey\nKelly, uh Chuck Martin, Bruce\nWilliamson, Chaz Cannon, Ron Stevens,\nVance Smith, Matt Hatchet, uh could go\non and on. uh certainly have had very\nproductive discussions and input and\nassistance from GMA and ACCG and a\nnumber of our school organizations. I\nsee some of them here today. Um also\nwant to thank the team downstairs\nbecause David Knight and u our former\nchairman Brett Herrell have spent an\nawful lot of time crunching numbers and\nlooking at these things at the micro\nlevel for a lot of our members. And so\nwe want to continue to do that. We want\nto continue these conversations. Um, and\nI, you know, just in closing, I want to\nre reiterate that I I I really feel like\nthat home ownership\nis, I think you'll agree with me, it's\npart of the American dream, Chairman\nStevens. And, um, and again, it's a\nfoundation for which to build\ngenerational wealth. And um\npart of our job, you know, is to to roll\nup our sleeves, work with our local\npartners, our local stakeholders,\nand uh if we have an issue, then\num we go to work for the people of\nGeorgia. We have a same we have a the\nvery same constituency and um that's\nwhat we're prepared to do and we you\nknow, we know that others are are ready\nto do the same. So, thank you very much\nfor the opportunity and I'll try to\nanswer some questions. I don't know if\nI'll be able to. A lot of this drafting\nis fresh and so we'll work through it\nand make it available and come back and\nanswer questions and and have more\ninput.\n>> Thank you, Mr. Chairman. Um,\nrepresent new.\n>> Thank you, Mr. Thank you, Mr. Chairman,\nand thank you, Mr. Chairman. Um, I tell\nyou, isn't it true that in in this Ways\nand Means Committee and subcommittee, we\noften look at um very important credits\nand other opportunities or exemptions\nfor for businesses that we that'll bring\nthe jobs that we need to Georgia. Isn't\nthat true?\n>> Uh, the gentleman knows what he speaks.\nYes, sir.\n>> Isn't this one of the Well, I know we've\nhad other times that we've looked at\nways that that local individuals and\nhomeowners can uh uh or property\ntaxpayers can reduce their rates or they\ncan electively up their rates. But isn't\nthis the first time that a bill has been\nprimarily\ndirected to give the majority of the\nbenefit to allow local governments to\nrearrange over I think over several\nyears with multiple different tools to\nbe able to give the uh first fruits, if\nyou will, to those people who put down\nroots in their in their community.\nThey've invested in a home and they'd\nlike to be able to keep it even when\nit's paid off without potentially losing\nit to the government. this bill do that.\n>> Uh again, the gentleman knows of what he\nspeaks. I think if you look back\nhistorically, what we've seen is that um\nhomeowners, you know, back a number of\nyears were not where we derived our our\nproperty tax. It was from income\nproducing properties. And we've seen\nthat evolve over time. And uh this is\nobviously a way to reimagine how we fund\nand operate local governments. It's uh\nagain I think the mechanics of it are\ncertainly involved and and um you know\nnothing nothing simple necessarily about\ndoing that but again I think what is\nsimple is telling the homeowner that you\nknow your your home cannot be sold on\nthe courthouse steps that we are are\ngoing to fully exempt your homestead\nproperty tax and that you're not going\nto have to rent your home\nfrom the government.\n>> Thank you. Thank you for that uh that\nopportunity to make a difference for\nhomeowners and and still recognize those\nvital services through all the different\nways that have been allowed for local\ngovernments to ease in over the next\nwhat is it five or six years to come up\nwith other ways to take care of that\nwithout the threat of losing your home\nin the future to the government. Thank\nyou, sir.\n>> Thank you, Mr. Chairman.\n>> Gentleman from Pine Mountain.\n>> Thank you, Mr. Chairman. Mr. Chairman,\nappreciate all your hard work on this.\nSo, a county decides they're going to\nimplement a penny. Do they do that by\nreferendum or do they make that decision\nas county commission that they're going\nto implement that penny? And how long\ncan that term will that penny last? The\nway this is supposed to work is that\nthey would have access to that penny uh\nby resolution\nto reduce homestead property tax and um\nfor a period through 2037 and then it\nwould autorenew for an additional 10\nyears for that same purpose. And if they\nreceived more than was enough to uh roll\nback the full homestead property tax,\nhomeowner property tax, then it would\nspill over into other property tax for\nroll back. Thank you, Mr. Chair.\n>> Yes. Thank you.\nNewton said, \"Yeah, there we go. Now\nwe're talking.\" Um,\nlast year 2025, the average age of a\nfirst-time home buyer in this country\nreached 40 years old. And you mentioned\nabout the American dream of being home\nownership. Um, the fact that that the\naverage age of a person now is 40 before\nthey can actually realize that, I think\nthat's also unsustainable, which you\nmentioned. Um, and a big part of that\ncost that keeps somebody been able to\nqualify for or obtain a mortgage for a\nhome is insurance and taxes uh in their\nescro accounts. So, I think this is\ngoing to go a long way towards not only\nhelping folks stay in their home that\nare retired on fixed incomes and pay\ntheir homes off, but also to be able to\nbuy their first home because they'll be\nable to more easily qualify for a home\nwithout the burden of the property tax\non that. And I I think it's going to\nchange uh a lot of lives and a lot of\nfamilies for a long time. And I really\nappreciate your work on it.\n>> Thank you, Mr. Chairman. um you uh you\nyou would certainly be a subject matter\nexpert in that arena. I appreciate your\ncomments.\n>> Representative Trey Kelly.\n>> Thank you, Mr. Chairman. Chairman Bman,\nthank you for the work that you've done\non this. Would you mind elaborating a\nlittle bit about the guard rails that\nare placed\num around the amount of sales tax\nthat'll be charged so that people, you\nknow, I've heard, you know, people say,\n\"Well, you're just going to implement a\nx amount of sales tax to cover all\nthis.\" We are allowing a a modest\nincrease in some areas, but could you\nspeak to the guard rails and the caps\nthat are still in place to the the\namount of sales tax that can be\ncollected ultimately? Well, right now\nlocal governments levy at at different\namounts and and there are different um\nrestrictions on what they can levy and\nthe types of pennies that they can levy.\nWhat what this uh does is enables a\npenny to be used to roll back\nspecifically homestead property tax.\nWhat it does not do is increase the\namount of local pennies available to\nlocal governments. Uh we have uh we\nmaintain the the 4 cents state uh sales\ntax uh maximum right now and this\nmaintains what is a five penny max for\nlocal sales tax. Does that answer your\nquestion?\n>> It does. If I have one followup, Mr.\nchairman and I came in just a second\nlate, but uh to help us address any\nconcerns we may have heard from local\nofficials, I know a few years back we\npassed the marketplace facilitator act\nthat added a whole new stream of sales\ntax collection for our state and local\ngovernment, but do you have any figures\nas to what that's meant to our state\nsince that implementation?\nThe numbers that we've received are are\nupwards uh increases of upwards of three\nand a half billion or more um\n>> for state and local\n>> for for just the local pennies as to\nwhat they're bringing in year-over-year.\n>> Wow.\n>> Um I do not have the 2025 numbers as of\nyet, but that is that is the latest\nfigures as I understand them.\n>> Thank you.\n>> Thank you.\n>> And I'll just follow up with that as I'm\nlooking at the man that carried the\nmarketplace facilitator. Imagine where\nwe would be if we'd not had the insight\nbefore CO. So, thank you, Chairman\nHarold. Uh, to the man that um\nknows how to run a county,\nRepresentative Chaz Canon.\n>> Thank you, Mr. Chair. Mr. Chairman, is\nit not true that the way we do property\ntax in this state is extremely complex.\n>> Man knows of what he speaks. Gentleman\nknows what he speaks. Yes,\n>> Mr. Chairman, quick followup.\nIs it not further true that what this\nbill proposes is a way to deliver\nmeaningful property tax relief through\nthat complex way of property tax?\n>> Uh I I would agree with that statement.\nUh Mr. Representative. Yes, sir. Thank\nyou.\n>> Representative Williamson.\n>> Thank you, Mr. Chairman. Chairman\nBlackman, thank you for the efforts on\nall this. And is it not true if we put\nit into historical perspective that many\ncitizens in the state of Georgia that\nhave been in their homes 40 years their\ntaxes are actually\nmore if you divide by 12 their annual\ntax bill that's due one lump sum their\ntaxes on a monthly basis are actually\nmore than their original mortgage amount\nbefore they got their\nthey paid for their\n>> I think that's 100% accurate. Yes, sir.\nMr. I know that from personal\nexperience, but um so thank you for your\nleadership on that. And is it not true\nas I read the bill that this will offer\nimmediate tax relief starting with these\nincreased exemptions? Correct.\n>> Yes, sir. Mr. Chairman, in in\nconjunction with what the House is\nproposing proposing this year and uh\ngrant relief? Yes, sir. And then is it\nfurther not true that this starts a path\nfor this state to move towards 100%\nhomestead and that we're talking about\nthe primary residence and five acres a\ncomplete elimination of any property\ntaxes. This pass starts this year and\ndepending on the situations of every\nlocal government it can be faster or or\nor less fast. Let me put it that way.\nBut the ultimate goal is uh goal line is\nin 2032 that it's mandatory and there\nwill be zero taxes on any homesteads in\nthe state of Georgia.\n>> Yes. Yes sir. the the the phase in\nbegins immediately next year and uh the\nuh different tools are enabled uh right\nout of the gate for local governments to\nto start giving uh a a very um uh robust\nlevel of of relief to to our homeowners\nacross the state. Just one followup\nquestion.\nIs it not true that as we travel down\nthis path, this very important uh bill\nthat there's no example, no square with\nthe current exemptions in place, and\nmany local governments have different\nexemptions. It could be a complete\nexemption on seniors for school taxes 65\nand over. It could be frozen homestead\nrelief at county levels. be increased u\nwhat am I trying to say\nexemptions across the board for local\ngovernments but in no case does any\ntaxpayer back up along this path all\nthose exemptions remain in place until\nthe ultimate goal of zero taxes is that\nnot true\n>> that that's correct even in the first\nyear that somebody purchases that home\nand they're responsible for those taxes\nafter they sign up for their homestead\nproperty tax exemption. Uh they would\nget all the relief in those local\nexemptions and then in year two they\nwould start being exempt fully uh post\n2032. Yes sir, Mr. Chairman.\n>> It's a slow methodical wellthoughtout\npath to to property tax ultimate goal\ncomplete property tax relief is not a\nshock to the system. It's a process.\n>> That is correct. And we\n>> represent Scott Hulcom.\n>> Thank you Mr. Mr. Chairman, um\nI have some questions. Um just to make\nsure that I understand it and to really\nred team this. It's a major policy\nshift. I certainly appreciate what\nyou're trying to do, but I want to make\nsure that I can one understand it and\nthen two explain it to the folks that I\nrepresent. So starting with HR 1114\nwhich is the resolution um can you\nexplain to me\nwhat is meant in lines 28 through 31. It\ngives local governments and local school\nsystems the ability to establish local\ngrant programs and to appropriate local\ntax funds in support of local homeowners\nincentive adjustments. What does that\nmean?\n>> Yes, sir. Uh thank you representative\nfor the question. Um\nright now the state is enabled to return\nuh up to 18 $18,000 in added exemption\nto homeowners. And um this would allow\nlocal governments in an uncapped fashion\nto be able to repurpose and do those\nexact same things at the local level. So\nif they see a surplus of funds based on\nproperty tax revenue from other sources,\nthey could rebate or refund those\ndirectly back to homeowners.\nIt's kind of the framework to enable\nthat. And I know um Representative\nRichardson is uh responsible kind of I\nthink for part of that original idea in\nColombia County. It's something that\nthey are are wanting to do I think\nsooner rather than later. Imagine that's\nprobably true for other counties as\nwell.\n>> Okay. Thank you. And then\nMy next question is um scrolling down to\nlines 46 to 51\nis that requires\num\nthe voters to be involved but it states\nany increase in revenues\nwould trigger a referendum. How how\npractically speaking would that work?\nWell, we we use the word may and then\nthat's why we back it up with the\nenabling legislation. Um it's towards\nthe back of 1116. Be happy to get a\nlittle bit further in into that. Um\nmaybe offline, but generally speaking,\nthe way that is written to work right\nnow with the two combined is that uh\nvery much like some other states that\nput a cap on revenue uh growth\nyear-over-year\num exclusive of new growth. So, if you\nhad a new development or some sort of\nnew improvement, that would be exclusive\nof the of the cap, but it would um it\nwould limit the revenue collected by non\nhomestead property tax. It's the way\nthat it works so that you don't see this\num movement from homeowner property tax\nto nonhomeowner property tax. And so the\nthe idea is to to give them some level\nof certainty and uh hold that that\nrevenue on property tax down.\n>> Okay.\n>> I hope that maybe rudimentary.\n>> Thank you. And and then my um\nmy last two questions for now would be\none, has an analysis been done of if\nthis were\nimplemented with the potential to impose\nsales tax charges of either 2 cents or 3\ncents. And those are the maximums for\nthe two different categories\nfor and this is going to be implemented\nat the county level is my understanding\nbased on reading the bill. It would if\nthose sales taxes were imposed,\nwould that compensate or be greater than\num what is existent? What is the current\nproperty tax revenues that are\ngenerated? Has that been analyzed?\n>> The offset for homestead as to whether\nor not how many pennies would would\nactually\nbe needed uh per local community for we\nhave done an analysis for the majority\nof the counties in which we have uh\nnumbers and revenue for and um we can\nprovide that to you. I think uh we we\ntried to check and double check those\nnumbers, but we can provide those to you\num\nyou know locality, district by district\nas to what we have. But again, we're\ntrying to continue to confirm those\nnumbers, but we we think we can show you\nthose. So, yes, we have been analyzing\nbased on on those models as to what it\nwould take from a sales tax um to to\noffset homestead property tax by\ndistrict, by county. Okay, thank you.\nAnd then the the the last question, this\nis kind of like a bigger picture\nquestion, is some municipalities issued\nbonds and so the impact of during the\ntransition period if this were to go\ninto place of how would that implicate\nany existing bond um issues or or would\nit? And I I guess a big part of it is\nrelated to the question that I just\nasked of. If the the revenue stream and\nthe math is largely similar, then the\nimpact is probably negligible, but I\nwanted to just raise that as a question\nbecause I imagine that be something I'll\nbe asked by the cities I represent.\n>> Sorry, I bit missed that. But yes, that\nis a question that we're we're getting.\nUm answered it much the same as you just\nanswered your own question is that you\nknow, if you have replacement revenue,\nthen that is something that covers that.\nAnd again, something that, you know,\nwhile we've put the number of years out,\nso these pennies have time to to cycle\nthrough to to their renewal date and um\nin the hopes that, you know, a lot of\nthat bond uh is is spoken for where it's\nnot. I think in certain cases they have\nthat um we see exemptions that are\nimplemented at the local level all\nacross the state and communities are\nhaving to adjust uh based on those\nexemptions uh regardless. So\nsomething that is kind of redistributed\nto some degree, representative, but\ngreat question.\n>> Thank you.\n>> Yes,\n>> Chairman Don Parsons.\n>> Thank you, Chairman. Chairman, I wanted\nto ask you, I've been trying to figure\nhow to\n>> frame the question, but you know, I had\nmentioned before about, you know, I\nunderstand I understand why there is\nsuch a thing as a property tax, and the\nonly reason I can think of having it is\nto provide to be able to pay for the\nservices that a a government uh provides\nfor the people that live there. the the\nproperty owners that live there. They\nneed to pay something to provide for the\nuh uh fire department, the police\ndepartment, uh for justice, those\nthings. That's the only reason I can\nthink of that there is one. But I can\nunderstand being that you know that with\nthat need there would would be ones\nestablished to begin with.\nAnd um having said that,\nyou know, my problem with it is that\nthere's no precision in how uh the\nproperty owner is actually charged,\nyou know, for the services that he's or\nshe is paying for. It's my understanding\nin this bill\nthrough through this process, there will\nbe a more precise uh way that homeowner\nor property owners will know what\nthey're paying for as far as what\nthey're paying for as far as services.\nAnd I think that's correct. But is that\ncorrect? Just how how does that work? I\nguess that's my question.\n>> Well, it it's not overly prescriptive.\nUm, Mr. Chairman, but I think you make\nyou have analyzed that properly and and\nthat if there is a local finance\nassessment that is done for those\nessential services. I think we\nunderstand that we have to pay for\nservices, you know, certain ones,\nespecially those essential and that that\nthat would function very much like what\nyou see now if you're paying for water\nor trash or, you know, other things uh\nalong those lines. Um, but that is is\nhow we we envision it and how we've\nworked with the locals to to set up\nsomething that would would do that but\nalso roll back um any any property tax\nowed. So, you know, and and it would,\nyou know, come through a local act. So I\nI think there are some checks and\nbalances in place.\n>> Just to follow up. So what we're looking\nfor is for the property owner to have a\nmore precise idea\nuh\n>> transparent. Yes, sir.\n>> More transparency in what they're\nactually paying for. I mean, I pay I\nmean what my property taxes my wife my\nwife and I live in a house. Uh we don't\nreally require much. I mean, you know, I\ndon't think we've ever called the fire\ndepartment. We've never had the over.\nUh, you know, we we don't have a we\ndon't have a trash service in Cobb\nCounty. I'm trying to think of other\nthing. We have water, uh, which we have\nto pay a lot for, but I don't really I\nmean, what I pay in property tax doesn't\nreally relate to the services that we\nthat we get from the county. I'm just\nhoping that there's a more precise way\nthat people will know what to pay for.\nThat's kind of what I that's my idea of\nwhat we're looking for.\n>> Yes, sir. That that that is uh\nprecisely. And I mean I think if I can\nuse your county, Representative Cannon,\nI mean I I think he sees this as uh\nsomething that they can do without any\nof those assessments. Um I believe is\nthat you know with with the sales tax\nthat they have available to them, but\nthere might be another county that sees\nthat exactly the way that you're\npresenting and that you know they they\nend up billing out those essential\nservices and then it is very transparent\nfor the taxpayer. And I I want to say\nthat uh Vance Chairman Smith is is the\none who probably\nsaid that the best. Did you you want to\nshare how you mentioned that to me the\nother day? You said you you mean I get\nan itemized bill?\n>> Your mic is on.\n>> Just itemize that bill what you're\npaying for.\n>> Yes, sir. Thank you, Chairman, for for\nmaking that point,\n>> sir. Chairman Trey Rhodess.\n>> Thank you, Mr. Chairman. Thanks Chairman\nBlackman for your diligent hard work on\nthis issue. Um done a great job.\n>> Thank you chairman.\n>> There just a few places and I happen to\nhave one in my district that rural\nGeorgia that the county travels to the\nnext county to do most of their\nshopping. Um\ndo we have a plan? I know there's only a\nfew of these places in the state. Is\nthere a plan or do we have a plan to\nhelp those few places that the math just\ndoesn't quite work?\n>> Yes, sir. Um, great question. The\nspeaker's indicated the the equalization\ngrants that we've talked about. I think\nhe mentioned them in our initial roll\nout that those um are in play. I think\nwe what we've also seen is that we\ncontinue to see some of those sales tax\nnumbers due to marketplace facilitator\ngo up based on your zip code. So a lot\nof times where we you know have\npurchased at retail locations that you\nknow you see Georgians and Americans are\nyou know more and more they're you know\npurchasing uh for shipment to their\nhomes. So you you see more and more of\nthat sales tax coming back home. But yes\nsir the answer short answer is yes.\nThat's been contemplated and we know\nthat it's not a necessarily a tremendous\namount of money uh for great many\ncounties but there are a small select\nfew that have that that may have some\nunique challenges that we're ready to to\ntackle.\n>> Thank you, sir.\n>> Thank you, Mr. Chairman.\n>> Chairman Case Carpenter,\n>> uh thank you for your hard work on this.\nWhen I was listening to uh\nRepresentative Hulcom talk about this\nthis grant money, um I have a unique\nsituation, I think, in our community\nwhere if we add a penny, our local city\nwill have excess funds. Would this allow\nthem to grant money to the school system\nto bring down that tax burden? Um,\nobviously if it's collected on their\npenny, are they able to share that with\nthe other entities in the community?\n>> Those are all those are all shared and I\nmean you can repurpose existing pennies\nor portion of existing pennies. Okay.\n>> So it you know there there's a a pretty\nextensive way to\n>> to tackle that.\n>> Thank you.\n>> Thank you, Mr. Chairman.\n>> Any other member? Mr. Mr. Chairman,\nthere's one thing I hope that we can\naddress. I know that the counties and\ncities, well, the taxing authorities in\ngeneral, about 25 years ago, we forced\ncounties to have to start advertising\ntheir increase in digest. There won't be\nany need for that, I suppose, with this\nbill.\n>> There may not be, Mr. Chairman.\n>> Anyone else in the committee?\nThen we have one person to speak. Um,\nBetty, is it\n>> what?\n>> I'm sorry. I think you know what I was\ntrying to mention earlier and tried to\nspeak with all the stakeholders. I know\nthat there may be some that wanted to\nmake a a comment or two, but the idea\nwas for everybody to have a minute to\ndigest what we've put out here, which is\nsort of a complete substitute and then\ntake testimony extensively moving\nforward.\n>> Um, in that case, since this is our\nfirst hearing, ladies and gentlemen, we\nshall be ready for the next one.\nThere'll be many, I'm sure.\nGet your questions together. And as of\nnow, the committee is adjourned.",
  "updated_at": "2026-02-14T14:50:00.036748+00:00"
}