{
  "video_id": "VA90g7hzZsU",
  "url": "https://youtu.be/VA90g7hzZsU",
  "title": "Georgia House - Day 39 (2026-06-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-06-25",
  "duration_minutes": 65,
  "summary": "Overview:\nThis Georgia House session focused on passing key legislation, with the House agreeing to Senate amendments for two bills - HB 752 related to physical therapists and HB 823 related to human trafficking. The session also included several commendations and recognitions for community members and organizations.\n\nKey Actions:\n**HR 1163**: Commendations and recognitions for various individuals and organizations.\n**HB 752**: The House agreed to the Senate amendment, which added physicians/doctors to the physical therapist compact.\n**HB 823**: The House agreed to the Senate substitute, which changed the effective date of the human trafficking bill.\n\nBills Introduced (First Reading): None noted.\n\nNotable Moments:\n- Several commendations and recognitions were read into the record, honoring community members and organizations.\n- The House had substantive debates and unanimous votes on HB 752 and HB 823.\n\nVotes:\n- HB 752: The House agreed to the Senate amendment in a 143-0 vote.\n- HB 823: The House agreed to the Senate substitute in a unanimous vote.\n\nAttendance: A quorum was present, with representatives checking the voting board to ensure accuracy.\n\nAdjournment: The session adjourned, with the next session date not specified.",
  "transcript": "House will come back to order, this house will come back to order.\nMr. Clark, would you ring the bell please.\nWe'll read the caption to a group of privileged resolutions.\nOr we'll read.\nCommending casual Cal Dupri.\nCommending Susan M. Ross.\nCommending Scott Steiner and Phoebe Putnam Health System.\nCommending Jonathan S. Ross.\nCommending, recognizing commanding W. Frank Wilson\nas outstanding public service.\nCommending and congratulating Michael Jones.\nCommending and congratulating Johnny Jones.\nRecognizing commending Dr. Victoria W. Martin\nfor outstanding public service.\nCommending and congratulating modeling Mason.\nRecognizing commending the 2020 graduating class\nof South Pauling High School.\nRecognizing and congratulating the heart\nof the Community Foundations 2020 Award of Honor,\nrecipient Jared J. J. Johnson.\nRecognizing commending Dr. Daniel Goldfaden.\nRecognizing and commending the heart\nCommunity of Foundations 2020 Business Award recipient\nInternational Paper, recognizing commanding the heart of\nthe community foundation, foundations 2020 award of\nhonor recipient Linda Asher, recognizing commanding\nWitt Mullner, the heart of the community foundation,\n2020 Young Heart Award recipient, recognizing commanding\nthe heart of the community foundation, 2020 award of\nhonor recipient Piggy Nash,\nrecognizing and commending the heart of the Community Foundation's 2020 award of honor recipient William A. Samuel, and for other purposes\nI can please the reading of the privilege resolutions.\nIs there any objection to the adoption of the privilege resolutions?\nThe chair here's none in the resolutions are adopted the chair recognizes chairman Bolton for a motion.\nThank you Mr. Speaker, I so the House agree to the Senate amendment to House Bill 752.\nChairman Belton moves at the House agreed to the Senate amendment to House Bill 752, the clerk will read the caption.\nHouse Bill 752, Vitao and act to amend Article 1333 of Title 43 of the official code of Georgia annotated relating the general provisions regarding physical therapists.\nChair recognizes Chairman Belton to explain the Senate amendment.\nThank you, Mr. Speaker.\nThis House almost unanimously agreed to a House Bill 752 that helps physical therapists\nand psychiatrists in a compact, especially helps the military spouses, but also helps\nany psychiatrists and physical therapists.\nThe Senate added physicians or doctors to this bill and asked for your favorable opinion\nand take questions.\nI do not think you have any questions.\nI yield the well.\nOn the gentleman's motion,\nthat the House agree to the Senate amendment\nto House Bill 752.\nAll those in favor will vote aye.\nThose opposed to vote no,\nand the clerk will unlock the machines\nand call the roll.\nAlex Ander, Analoids, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman,\nBodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey,\nDickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Frye, Gaines,\nGardner, Glanton, Graveli, Harold, Hatchett, Hawkins,\nHitchens, Holcomb, Holmes, Houston, Hugley, Jackson M,\nJasper's, Jones J, Kelly, Kendrick, Knight,\nLaHood, LaRickia, Lomston, Martin,\nMatiag, McCall, Morris G. Newton,\nNick's Oliver, Parrish, Parsons,\nPetrie, Perkle, Powell, Reeves,\nRhodes, Rich, Ridley, Rutledge,\nScoggins, Cessler, Silcox, Smith L, Smith R, Smith V,\nSmirey, Stevens R, Tankersley, Tanner,\nTarvin, Taylor, Thomas E, Trammell, Washburn, Watson,\nWelch, Workhizer, Weedower, Williams A., Williamson, Yerda, Allen, Bayesmore,\nBernal, Cannon, Carter, Clark D., Clark J., Cook, Davis, Douglas,\nDreyer, Dunahue, Earhart, Evans,\nFrazier, Gilligan, Gertler, Henson,\nHill, Hogan, Holland, Holly,\nHobson, Howard, Hutchinson, Jackson D.\nJones S, Jones T, Jones V,\nKouch, Kennerd Lopez Romero, Marin McLean, McLaren McLeod,\nMeeks Mitchell, Moore B. Morris C. Morris M. Nelson,\nWhen Paris, Prince, Poland,\nRobucho, Saints,\nScofield, Scott,\nShannon, Sharper,\nSmith M, Thomas AM,\nTurner,\nWalensky,\nWilkerson,\nWilliams MF,\nWilliams N,\nWilson,\nBeasley Teague.\nB-C-T.\nYes.\nBonner.\nYes.\nYes.\nBuckner.\nYes.\nBuckner.\nYes.\nFor Chet.\nYes.\nFor Chet.\nCall Will.\nCall Will.\nYes.\nYes.\nYes.\nCantrell.\nYes.\nCantrell.\nYes.\nDickerson.\nYes.\nDukes.\nYes.\nDukes.\nYes.\nYes.\nGamble.\nYes.\nYes.\nGilear.\nYes.\nGilear.\nGordon.\nBlur.\nGreen.\nGreen.\nYes.\nGullet.\nYes.\nGullet.\nYes.\nChones, JB.\nYes.\nChones, JB.\nYes.\nKirby.\nYes.\nKirby.\nLot.\nLaugh, Mathis, Mets, Mophtahan, Mark, Fruit, Rogers, Singleton, Stovall,\nWilliams R.\nYes.\nBayes Moore.\nBeverly.\nBlackman.\nBurns.\nCannon.\nKing Carter.\nCooper.\nCorbett.\nDempsey.\nDouglas.\nBrenner, Dreyer, Dukes,\nEarhart, England, Irwin, Fleming,\nGilear, Gordon,\nHarold, Hatchett, Holly,\nHowston, Hutchinson, Jackson D, Jackson M, Jasper's, Jones, Jones J, Jones V, Kirby,\nLot, McCall, Mitchell, Morris G, when Oliver, Paris, Parsons, Peatries, Perkel, Powell,\nBut Rogers, Saints, Schofield, Sharford, Smith M, Steven's R, Steve Stovall, Tankersley,\nTanner, Thomas A.M., Thomas E, Welch, Wilker\nperson. Williamson. Members will check the board to make sure it's correct.\nI have representative Douglass up in the gallery trying to vote representative Erica Thomas\nOkay, anybody else?\nStill need to get Representative Demetrius Douglas.\nRepresentative Paris is voting yes, now I'll ask again, is the Board accurate, the clerk\nwill lock the machines.\nOn the gentleman's motion, the eyes are 700, I'm sorry, that's the bill number.\nI need a nap.\nThe eyes are 143, the nays are zero, and this house has agreed to the Senate amendment\nto House Bill 752.\nThere are recognizes representative Gaines for a motion.\nThank you, Mr. Speaker.\nI move that the House agree to the Senate substitute to House Bill 823.\nRepresentative Gaines has moved that the House agree to the Senate substitute.\nHouse Bill 823, the clerk will read the caption.\nHouse Bill 823 to be entitled an act to amend code section 16, 5, 46, and 45, 151 of the\ngo to Georgia annotated relating to trafficking of persons for labor or sexual servitude.\nChair recognizes the representative gains to explain his motion.\nThank you, Mr. Speaker.\nHouse Bill 823 is a bill that this house passed 166-0 back in March and the only change\nin the legislation is Section 3 of the effective date changed from July 1st to upon signature\nand that's the only change in the bill.\nHappy to answer any questions.\nYou do not appear to have any questions.\nThank you, Mr. Speaker.\nI yield the will.\nOn the gentleman's motion,\nthat the House agree to the Senate's substitute\nto House Bill 823,\nall those in favor will vote aye.\nThose opposed to vote no,\nand the clerk will unlock the machines\nand call the roll.\nAlexander Anolowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman,\nCody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett,\nDempsey, Dickie, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming, Fry, Gaines, Gardener,\nGlanton, Grabley, Harold, Hatchett, Hawkins, Hitchens,\nWelcome, Holmes,\nHouston,\nHugley,\nJackson M,\nJasper's,\nJones J,\nKelly,\nKendrick,\nKnight,\nLaHood,\nLarickia,\nLomston,\nMartin,\nMathiac,\nMcCall,\nMorris G,\nNewton,\nNick's, Oliver, Parish, Parsons,\nPetrie, Perkle, Powell, Reeves,\nRhodes, Rich, Ridley, Rutledge,\nSkoggins, Setsler, Silcox, Smith L,\nSmith R, Smith V, Smirrey, Stevens R,\nTankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch,\nWorkisers, Weed Hour, Williams A, Williamson, Yerda, Allen, Basemore, for now, Canon, Carter,\nClark D. Clark J. Cook. Davis Douglas.\nDreyer. Dunahoo.\nEarhart. Evans.\nFrazier. Gilligan.\nGertler. Hanson.\nHill. Hogan.\nHolland.\nHolly.\nHobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Coush, Kennerd,\nLopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B,\nMore C. Morris M. Nelson.\nWhen Paris, Prince, Pullen,\nRobucho, Saints,\nScofield, Scott,\nShannon, Sharper, Smith M,\nThomas AM,\nTurner, Walensky, Wilkerson, Williams, MF, Williams N, Wilson,\nBeasley Teague, Bonner, yes, Buckner, yes,\nForchette, Calwell, Campbell, Cantrell, Dickerson, Dukes, Gamble, Gilleard, Gordon,\nyes green yes gullet yes Jones JB yes Kirby yes Kirby lot yes\nYes.\nMathis.\nYes.\nMetz.\nYes.\nBob Tahan.\nYes.\nPark.\nPark.\nPark.\nPruis.\nYes.\nPruis.\nRogers.\nCrosse.\nSingleton.\nYes.\nStovall.\nYes.\nStovall.\nWilliams R.\nYes.\nYes.\nYes.\nStovall.\nYes.\nWilliams R.\nYes.\nWilliams R, Williams R, Burns, Cannon, Brenner, Dreyer, Duke's, Earhart, England,\nCampbell, Gilear Hawkins, Holly, Howard, Jones J, Jones V, Kelly Mitchell, Newton,\nOliver, Pete Tree, Powell Tree, Pruitt, Rogers, Rutledge,\nSilcox, Silcox, Smith M.\nMembers will look at the board and make sure it's correct.\nwill lock the machines on the motion that this house agreed to the Senate\nSubstitute House Bill 823. The eyes are 149. The days are zero and this house has\nagreed. Chair recognizes or representative Skoggins for a motion.\nThank you, Mr. Chair, I asked that this House consider the agreement in agreed to the Senate\nsubstitute for House Bill 865 and that LC number is 412549S.\nRepresentative Skoggins has moved that this House agreed to the Senate substitute to\nHouse Bill 865, the clerk will read the caption.\n865 to be titled an act to amend title 53 of the Fisher go to Georgia annotated relating\nto Will's trust and administration of the states to amend part 12 of article 1 of chapter\n1 of title 7 of the Fisher go to Georgia annotated relating deposits of deceased depositors.\nChair recognizes representative Skoggins to explain his motion.\nThank you Mr. Chairman.\nThis bill is a Code Revision bill for wheels in the State Title 53.\nThe Senate made a couple of changes to the bill.\nThe two changes are the two changes that they made were that a 30-day notice be required\nwhen notifying a trustee of a hearing.\nThe other change was they made a domestic relations and obligation to this title, which\nwould be like Alamone, each I'll support those types of things.\nThat's the only two changes they made to the bill.\nThe original bill was voted on back in March, and this bill just changes a few things.\nThe bill hadn't been changed since 1998, and this bill changed a little bit of the jurisdiction\nwith the probate judges.\nThis allowed non-article six probate judges to do DNA testing on bodies to determine\ntheirs. Article 6, courts which are attorneys and they can have jury trials. They already\nhad the jurisdiction, but we changed the code to allow non-logger judges to do the same.\nIf there's any questions, I'd be glad to answer them.\nI do not think you have any questions.\nI yield well.\nOn the gentleman's motion that this House agreed to the Senate substitute to House Bill\n865, all those in favor will vote aye, those opposed to vote no, and the clerk will unlock\nthe machines.\nAlexander, in all of its bar,\nBarton,\nBelton,\nBennett, Bentley,\nBenton,\nBeverly,\nBlackman,\nVody,\nBruce,\nBurns,\nCarpenter,\nCarson,\nChokus,\nClark H,\nCollins,\nCooper,\nCorbett, Dempsey, Dickie, Dollar, Drenner, Dubnic,\nEftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton,\nGrabley, Harold, Hatchett, Hawkins, Hitchens,\nHolcomb, Holmes, Houston, Hugley, Jackson M,\nJasper's, Jones J, Kelly, Kendrick, Knight,\nLaHood, LaRickia, Lomston, Martin,\nMathyak, McCall, Morris G, Newton,\nNix, Oliver, Parrish, Parsons,\nPetrie, Perkel, Powell, Reaves,\nRhodes, Rich, Ridley, Rutledge, Skoggins, Setsler,\nSilcox, Smith L, Smith R, Smith V, Smirrey,\nStevens R, Tankersley, Tanner,\nTarvan Taylor, Thomas E.\nTremel, Washburn, Watson, Welch,\nWorkizer, Weed Hour, Williams Aide,\nWilliamson, Yerda, Allen, Bayesmore,\nFor now, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler,\nHanson, Hill, Hogan, Holland, Holly,\nHobson, Howard, Hutchinson, Jackson D, Jones S, Jones T,\nJones V, Kaush, Kenner, Lopez Romero,\nMarin McLean, McLaren, McLeod, Meeks, Mitchell,\nMoorby, Morrissey, Morris M. Nelson,\nwhen Paris, Prince, Pullen,\nRobo Show, Saints, Skofield, Scott, Shannon, Sharper, Smith M., Thomas A.M.,\nTurner, Walensky, Wilkerson, Williams M.F., Williams N., Wiltson, Beasley Teague,\nB-C-T.\nYes.\nBonner.\nYes.\nYes.\nBuckner.\nYes.\nBuckner.\nYes.\nPerchette.\nPerchette.\nCalwell.\nCalwell.\nYes.\nCampbell.\nYes.\nCantrell.\nYes.\nDickerson.\nYes.\nDoops.\nDoops.\nCampbell.\nGilly, Gilly, Gordon, Gordon, Yes.\nGreen.\nYes.\nYes.\nGoat.\nYes.\nGoat.\nYes.\nJones, JB.\nYes.\nJones, JB.\nYes.\nKirby.\nYes.\nKirby.\nLot.\nYeah.\nYes.\nMathis.\nYes.\nYes.\nMets, Mopthahan, Park, Pruitt, Rogers, Silcox, Singleton, Stovall, Stovall.\nWilliams R.\nWilliams R.\nYes.\nBarb.\nBennett.\nBurns.\nCollins.\nDuke's.\nDuke's.\nEngland.\nFrazier.\nGilear.\nGilear.\nHitchens, Holly, Jasper's, Jones J, Jones V, Kendrick, Mitchell, Newton, Petrie,\nCollins, Pruit, Tarvan, Thomas AM, Williams N.\nHave all members voted and does the board reflect your intention?\nHave all members voted?\nIf so, the clerk will lock the machines.\nOn the gentleman's motion, the Ayes were 154, the Nays were zero, and the House has agreed\nto the Senate Substitute to House Bill 865.\nChair recognizes Representative Carpenter for a motion.\nThank you, Madam Speaker.\nI move that the House agrees to the Senate sub\nfor House Bill 1098.\nRepresentative Carter moves that the House agree\nto the Senate substitute to House Bill 1098,\nthe clerk will read the caption.\nPossible 1098 to be entitled to an act to amend title 32 of the fiscal to Georgia annotated relating highways bridges and fairies\nSo it's to provide for development of a statewide strategic transportation plan\nchair recognizes representative\nCarpenter to explain the Senate substitute\nAll right guys. Thanks for having me today. I can honestly say the Senate actually made this bill better simple bill\nBasically, it streamlines government as far as reporting goes on the state transportation\nplan that the GDOT does every year.\nThey added some pieces to protect billboards if they're moved in acquisitions or if noise\nbears are put up in your community and it affects a billboard.\nIt allows a billboard to be able to be reset and then there's also a piece in here about\nProtecting your businesses when acquisitions occur and I yield for any questions\nAre there any questions\nChair does not see any questions all right. I yield the well the gentleman has yielded the well on the\nGentleman's motion that the House agreed to the Senate substitute to House bill 1098 all those will in favor\nWhoever will vote, yes, all those opposed will vote, no, in the clerk will unlock the machines.\nAlex Andrew, Anelowicz, Barr, Barton, Belton, Bennet, Bentley, Benton, Beverly, Blackman,\nCody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey,\nNikki, Dollar, Drenner, Dubnick,\nEftration, England, Irwin, Fleming, Frye, Gaines, Gardner,\nGlanton, Grabley, Harold, Hatchett, Hawkins, Hitchens,\nHolcomb, Holmes,\nHausten,\nHugley,\nJackson M,\nJasper's,\nJones J,\nKelly,\nKendrick,\nKnight,\nLeHood,\nLaRickia,\nLomston,\nMartin,\nMatthew McAll,\nMorris G,\nNewton,\nNicks,\nOliver,\nParish Parsons, Petrie,\nFerkle, Powell, Reeves,\nRoads, Rich, Ridley,\nRutledge, Skoggins,\nSetsler, Silcox,\nSmith L, Smith R,\nSmith V, Smirey,\nStevens R,\nTankersley, Tanner, Tarvan, Taylor, Thomas E,\nTramble, Washburn, Watson, Welch,\nWorkhizer, Weedower, Williams A, Williamson, Yerda,\nAllen, Bayesmore, Bernal, Cannon, Carter,\nClark D., Clark J., Cook, Davis, Douglas,\nDreyer, Donahue, Earhart, Evans,\nFrazier, Gilligan, Gertler, Hanson, Hill, Hogan,\nHolland, Holly,\nHobson, Howard, Hutchinson, Jackson D,\nJones S, Jones T, Jones V,\nCouch, Kennerd, Lopez Romero,\nMarin, McLean,\nMcLaren, McLeod, Meeks, Mitchell,\nMoore B, Morris C, Morris M, Nelson,\nwhen Paris, Prince, Poland, Robucho,\nSaints, Scofield, Scott Shannon,\nSharper, Smith M, Thomas A.M., Turner, Wollensky, Wilkerson,\nWilliams M.F., Williams N. Wilson, Beasley Teague,\nB-C-T.\nYes.\nBonner.\nYes.\nFucker.\nYes.\nPerchette.\nYes.\nPerchette.\nYes.\nCalwell.\nCalwell.\nYes.\nCampbell.\nYes.\nYes.\nCantrell.\nYes.\nCantrell.\nYes.\nDickerson.\nYes.\nDoos.\nYes.\nDooks.\nYes.\nDoos.\nYes.\nGamble.\nYes.\nGaleard.\nGileard.\nGileard.\nGordon.\nYes.\nGreen.\nYes.\nGreen.\nYes.\nGoal it.\nYes.\nYes.\nJones, JB.\nYes.\nJones, JB.\nYes.\nKirby.\nYes.\nKirby.\nLot.\nLot.\nYes.\nMathis.\nMathis.\nYes.\nMaths.\nMaths.\nMom to Han, yes, Park, yes, Fruit, Rogers, yes, Singleton, yes, Stowe\nGo-Wall, Williams R, Bennett, Bentley, Vody, Barchett, Burns, Clark J, Cooper, Corvette,\nDickie, Douglas, Drenner, England, Gamble, Gilear, Harold, Hatchet, Henson, Howard,\nJones-J, Lerickia, Lerickia, Mitchell, Newton's, Powell, Prince, Druid, Rich, Williamson.\nAll members voted and check the board have all members voted\nIf so, the clerk will lock the machines.\nOn the gentleman's motion, the eyes were 153, the nays were 4, and the house has agreed\nto the Senate substitute to House Bill 153, 1098.\nThe Chair recognizes Representative Gamble for a motion.\nThank you, Madam Chair.\nI'd like to make the motion that the House agree to the Senate Substitute on HR 1163.\nRepresentative Gamble has moved that the House agree to the Senate Substitute House Resolution 1163, the clerk will read the caption.\nHouse resolution 1163 recognized in Georgia Supreme Court Justice Robert Benjamin dedicating\na bridge in his honor.\nChair recognizes representative Gamble to explain the Senate substitute.\nThank you, Madam Chair, before you is a House Resolution 1163, which is our annual road\nnaming bill.\nIt incorporated all the requested road naming and bridges that were done earlier in the\nhouse that we agreed upon, and also now includes the Senate's list of road naming and bridges.\nAnd that's the gist of HR 1163.\nI'm happy to take any questions.\nWe'll pause for a moment in memory of those that have passed on that there are bridges\nand roads named after them.\nThank you.\nThank you.\nAre there questions?\nThe chair sees no questions.\nOn the gentleman's motion, the House agreed to the Senate substitute to House Resolution\n1163, all those in favor will vote yes, all those opposed will vote no and the clerk will unlock the machines\nAlexander and all of its bar\nBarton\nBelton, Bennett, Bentley, Benton, Beverly,\nBlackman, Bodie, Bruce, Burns, Carpenter, Carson,\nChokus, Clark H, Collins, Cooper, Corbett,\nDempsey, Dickie, Dollar, Drenner, Dubnick,\nEstration, England, Irwin, Fleming, Frye, Gaines, Gardiner,\nGlanton, Grabley, Harold, Hatchett, Hawkins, Hitchens,\nHolcomb Holmes,\nHauston Hugley, Jackson M,\nJasper's,\nJones J, Kelly, Kendrick,\nKnight,\nLeHood,\nLarickia,\nLomston,\nMartin,\nMathiac,\nMcCall,\nMorris G,\nNewton,\nNick's,\nOliver,\nParish, Parsons, Petrie, Perkel, Powell, Reeves,\nRoads, Rich, Ridley, Rutledge, Skoggins, Setsler,\nSilcox, Smith L, Smith R, Smith V,\nSmirey, Stevens R, tankersley, Tanner, Tarvan, Taylor, Thomas E,\nTramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda,\nAllen, Baysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDryer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland,\nHolly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd,\nLopez Romero, Marin, McLean, McLaren, McLeod, Meeks, Mitchell, Moore B,\nMorris M. Nelson, when Paris, Prince, Poland, Rova Show,\nSaints, Scofield, Scott, Shannon, Sharper, Smith M.\nThomas A.M., Turner, Wollensky, Wilkerson, Williams, M.F., Williams N., Wilson,\nBeasley Teague, B.C.T., Bonner, Buckner,\nYes for chat call well yes yes can trail yes Dickerson yes dukes yes\nYes.\nGamble.\nYes.\nGiliard.\nGiliard.\nYes.\nFordon.\nYes.\nFordon.\nYes.\nGreen.\nYes.\nYes.\nGullet.\nYes.\nGullet.\nYes.\nJones J.B.\nYes.\nJones J.B.\nYes.\nKirby.\nLot.\nKirby.\nMathis.\nMetz.\nYes.\nMetz.\nYes.\nPark.\nYes.\nFruit.\nYes.\nRogers.\nSingleton.\nStovol.\nYes.\nStovol.\nYes.\nWilliams R.\nYes.\nBode.\nYes.\nCannon.\nSingleton.\nSingleton.\nStovol.\nYes.\nStovol.\nYes.\nWilliams R.\nYes.\nBode.\nYes.\nCannon.\nCannon, Carter, Clark H, Clark J, Corbett, Davis, Dubnick Davis,\nEarhart, Gilligan, Holland, Hopson, Howard, Jones J, Jones T,\nMeeks, Mitchell, Newton, Paris, Parsons, Druid, Skoggins, Turner,\nFor what purpose does representative Gamble rise?\nThere was an oversight on the agreement that we just did and I'd like to go through\nthe names that we have designated for these red namings in the resolution.\nPlease do.\nWe have Justice Robert Benham, Memorial Justice Robert Benham Bridge, Mr. Al St. Lawrence,\nMr. Jimmy Petrie, Mr. Jimmy Burnsett, Mr. Harold Fowler,\nand Mr. Jimmy Burnsett, Mr. Chris Shannon, Mr. James Oscar\nHardigree Jr., Sergeant Stanley Thomas Bradley, Mr. James\nEdward Gittness, Mrs. Blondine Newman, the Honorable Emma\nDr. Van D. Valemont, Sheriff Van Peevy, Mr. Asa, Charles Daniels Jr., Mr. Wallace\nLawson-Jernigan, Senator Lee Ruig Johnson, Mr. Casey Bowen, Ms. Betty Ann D.P. Trio\nMr. Bill Madden and that includes the names that were in this resolution.\nNow that the gentleman has read the names and the names are on our hearts and minds\nlet's do take another moment of silence.\nThank you.\nFor what purpose does Representative Clark rise?\nwaves, have all members voted and is the board accurate?\nHave all members voted?\nIf so, the clerk will lock the machine on the gentleman's motion, the eyes are 156,\nthe nays are zero, and the House has agreed to the Senate substitute to House Resolution\nSection 1163.\nChair recognizes Chairman Dempsey for a motion.\nThank you, Madam Speaker.\nI move that the House agreed to the Senate's substitute to House Bill 993 as amended in\nthe Senate.\nOur DEMPSE has moved that the House agree to the Senate substitute to House Bill 993 of the clerk will read the caption.\nHouse Bill 993 to be entitled back to amend chapter 10 of Title 31 of the official code of Georgia and it's ended relating a viable record so it's to provide for viable record reports and data from the state registrar relating to child abuse reports.\nChair recognizes representative DEMPSE to explain the Senate substitute.\nThank you, HB993 left our house with unanimous support, a simple data sharing agreement\nbetween the Department of Public Health and Department of Family and Children's Services,\nDepartment of Human Services to share very important vital records.\nWhen it left, the Senate added a measure to repeal the child abuse registry.\nThey did say because it is duplicative, and because with that, as recognized in their\nbudget and the one we will all see very soon, there was a line on them saving of $975,000.\nThis same information can be garnered through the SHIN system, which is an existing internal\nadministrative system.\nIt is supported by defects, by together Georgia, the prosecuting attorneys, and unanimously,\nAs I said, left here and was unanimously voted through the Senate as well.\nIf there are any questions, I'll be glad to take them.\nIf not, I will yield the well and ask for your favorable support.\nAre there questions?\nSeeing none on the general, on the ladies' motion that the House agreed to the Senate substitute\nto House Bill 993.\nAll those in favor will vote yes, all those opposed will vote no, and the clerk will unlock the machines.\nAllixander and all of its bar, part,\nBilton, Bennett, Bentley, Benton, Beverly, Blackman,\nBodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett,\nDempsey, Dickie, Dollar, Drenner, Dubneck,\nEftration, England, Erwin, Fleming,\nFrye, Gaines, Gardner, Glanton,\nGrabley, Carol, Hatchett, Hawkins, Hitchens,\nHulkum, Holmes,\nHouston, Hugley, Jackson M,\nJasper's, Jones J, Kelly,\nKendrick, Knight,\nLeHood, Larickia,\nLomston, Martin,\nMathyak, McCall, Morris G, Newton,\nNick's, Oliver, Parrish, Parsons, Petrie, Perkle, Powell, Reeves, Rhodes, Rich, Ridley,\nRutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R,\nTankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble,\nWashburn, Watson, Welch, Workhizer, Weedower, Williams A,\nWilliamson, Yerda, Allen, Beesmore,\nFor now, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDreyer, Dunahue, Earhart, Evans, Frazier, Gilligan,\nGertler, Hanson, Hill, Hogan, Holland, Holly,\nHobson, Howard, Hutchinson, Jackson D,\nJones S, Jones T, Jones V, Couch,\nKennerd, Lopez Romero, Marin, McClain, McClaren, McClaren,\nMcClaren McCloud, Meeks Mitchell,\nMore B, More C, Morris M. Nelson,\nQuinn Paris, Prince Poland,\nRoboShow, Saints, Scofield, Scott,\nShannon Sharper, Smith M, Thomas A.M., Turner,\nWalensky, Wilkerson, Williams M.F.,\nWilliams N. Wilson, Beasley Teague,\nE.C.T.,\nBonner,\nBuckner,\nfor chat.\nYes.\nFor chat.\nCall well.\nYes.\nCampbell.\nYes.\nCan.\nYes.\nCan't trail.\nYes.\nCan't trail.\nYes.\nDickerson.\nYes.\nYes.\nDooks.\nYes.\nYes.\nCampbell.\nYes.\nYes.\nYes.\nGiliard.\nYes.\nGiliard.\nYes.\nGordon.\nYes.\nYes.\nGreen.\nGreen.\nYes.\nGoal it.\nYes.\nGoal.\nYes.\nJones, JB.\nYes.\nJones, JB.\nYes.\nKirby.\nKirby.\nLot.\nMathis.\nMathis.\nMathis.\nMathis.\nYes.\nMathis.\nMathis.\nMopton.\nMopton.\nYes.\nYes.\nFruit.\nFruit.\nYes.\nRodgers.\nRodgers.\nSingleton.\nSingleton.\nYes.\nStovall.\nStovall.\nYes.\nWilliams R.\nWilliams R.\nYes.\nBeasley Teague.\nYes.\nYes.\nBennett.\nYes.\nBeverly.\nYes.\nYes.\nYes.\nYes.\nYes.\nBennett.\nYes.\nBeverly, Carson, Clark D, Clark J, dollar, Fleming, Gaines, Gardiner, Gilligan, Hatchett,\nHugh Glee, Hugh Jackson D, Jones J, Jones T, Couch, Kendrick,\nLarickia, Newton, Parsons, Ridley's, Shannon, Smirie,\nThomas E.\nHave all members voted and is the board accurate\nto reflect your vote?\nhave all members voted if so the clerk will lock the machine on the ladies\nmotion the eyes are 153 the nays are zero and the houses agreed to the Senate\nSubstitute to House Bill 993 I'll have to sing\nmake sure to myself I ran out of the office without my mask, my apologies. Chair recognizes\nthe Chair of the Rules Committee. Chairman Smith for an announcement.\nThank you, Ms. Bigger. The Rules Committee will meet at 315 for a few minutes. Thank\nyou, sir.\ncommittee is meeting in two minutes in room 315 and this House will be in\nrecess till 330.\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T13:00:16.307992+00:00"
}