[
  {
    "video_id": "CmiyzggH49A",
    "url": "https://www.youtube.com/watch?v=CmiyzggH49A",
    "title": "11/27/23 Senate Study Committee on Foster Care and Adoption",
    "chamber": "senate",
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 17,
    "summary": "Here is a summary of the Georgia 11/27/23 Senate Study Committee on Foster Care and Adoption session:\n\n**Overview**:\nThe study committee held its final meeting, reviewing and finalizing a report with recommendations to address issues in Georgia's foster care and adoption system. Key focus areas included permanency timelines, state ID access for foster youth, case manager retention, the process of legitimation, expansion of infant/toddler courts, and support for foster and adoptive parents.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- The committee recognized the support and involvement from the Lieutenant Governor's office, the Department of Human Services, and members of the public who participated in the committee hearings.\n- The chair noted that the committee's work is just the beginning, and that continued efforts will be needed to address the complex challenges facing the foster care system.\n- The committee reviewed and discussed the draft report and recommendations, incorporating final input from members.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum was present, with committee members and representatives from the Department of Human Services in attendance.\n\n**Adjournment**:\nThe committee was slated to complete its work by December 1st, along with other study committees.",
    "updated_at": "2026-02-12T01:51:54.249052+00:00"
  },
  {
    "video_id": "1ZkJ2xIo4Uo",
    "url": "https://www.youtube.com/watch?v=1ZkJ2xIo4Uo",
    "title": "Sen Jackson Press Conference on Gun Violence | 01/20/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 12,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Sen. Jackson press conference on gun violence:\n\n## Overview\nSenator Jackson introduced new legislation, SB 413, which would allow victims of gun violence to break their leases without penalty in order to move to a safer location. This builds on her previous work passing SB 75, which allowed victims of stalking to break leases. The press conference featured testimony from a trauma surgeon, Dr. Amber Hannah, and a gun safety advocate, Heather Hallett, emphasizing the need for this legislation.\n\n## Key Actions\n**SB 413**: Allows victims of gun violence to break their leases without penalty in order to move to a safer location.\n\n## Bills Introduced (First Reading)\n- SB 413\n\n## Notable Moments\n- Dr. Amber Hannah, a trauma surgeon, discussed the importance of providing support beyond just medical care for victims of gun violence to help them recover and reintegrate safely into the community.\n- Heather Hallett, the director of Georgia Majority for Gun Safety, spoke in support of SB 413 despite it not being the \"foundational gun safety laws\" her organization typically advocates for. She emphasized the need to address the ripple effects of gun violence on individuals, families, and communities.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nNo quorum notes detected.\n\n## Adjournment\nNo adjournment details provided.",
    "updated_at": "2026-02-12T01:36:59.98288+00:00"
  },
  {
    "video_id": "e_6cXhqLZFM",
    "url": "https://www.youtube.com/watch?v=e_6cXhqLZFM",
    "title": "Sen. Anavitarte Press Conference on Majority Party Priorities | 01/13/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Overview:\nThis press conference by Georgia Senate President Pro Tempore Larry Walker outlines the Republican majority's legislative priorities for the 2026 session, focused on addressing the high cost of living and reigniting the \"American Dream\" for hardworking Georgians.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Walker discusses the significance of 2026 being America's 250th birthday, or \"semi-quincentennial\", and how this will bring patriotic celebrations.\n- Walker expresses concern that affordability issues have caused many Georgians to feel that the \"American Dream\" is slipping beyond their grasp.\n- The majority caucus plans to tackle affordability issues and \"reignite the American Dream\" through measures like eliminating the state income tax, providing property tax relief, limiting institutional investors in the housing market, and reforming the home-building permitting process.\n- The agenda also includes supporting first responders, preserving natural assets, improving K-12 education and literacy, and addressing challenges like street racing and technology access for children.\n- Walker criticizes \"insane liberal Democrat policies\" and the Biden administration's \"crippling inflation\" as drivers of the cost of living challenges.\n\nVotes:\nNone detected.\n\nAttendance: \nNo quorum notes.\n\nAdjournment:\nNo adjournment details provided.",
    "updated_at": "2026-02-12T01:38:05.222833+00:00"
  },
  {
    "video_id": "0T0nvQxjMOM",
    "url": "https://www.youtube.com/watch?v=0T0nvQxjMOM",
    "title": "12/4/23 Joint Study Committee on Service Delivery Strategy",
    "chamber": null,
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 64,
    "summary": "Overview:\nThis session of the Georgia Joint Study Committee on Service Delivery Strategy focused on finalizing recommendations for the committee's report. The discussion centered around reaching consensus on the draft recommendations, with input from the Association County Commissioners of Georgia (ACCG) and the Georgia Municipal Association (GMA).\n\nKey Actions:\nNo bills were passed or referred during this session.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- The committee discussed the need to wrap up the recommendations and provide a final report to the Lieutenant Governor and Speaker by the December 31st deadline. \n- There was discussion around reaching consensus on the six draft recommendations, with the suggestion to have ACCG and GMA provide their official positions on each recommendation.\n- Commissioner Dockery and Mayor Ward summarized their written recommendations to the committee.\n\nVotes:\nNo recorded votes took place.\n\nAttendance:\nA quorum was present, though the transcript did not provide specifics on attendance.\n\nAdjournment:\nThe session was expected to wrap up within an hour. The committee planned to reconvene with ACCG and GMA to finalize the recommendations before the December 31st deadline.",
    "updated_at": "2026-02-12T01:45:09.943223+00:00"
  },
  {
    "video_id": "FSYeoA6Dt1E",
    "url": "https://www.youtube.com/watch?v=FSYeoA6Dt1E",
    "title": "11/28/23 Senate Study Committee on Occupational Licensing",
    "chamber": "senate",
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 64,
    "summary": "Here is a structured markdown summary of the Georgia 11/28/23 Senate Study Committee on Occupational Licensing session:\n\n**Overview**\nThe Senate Study Committee on Occupational Licensing held its fourth meeting, hearing testimony from various stakeholders on occupational licensing requirements in Georgia that may be inhibiting economic mobility, limiting job prospects, and hindering small businesses. The committee discussed common themes of frustration around the bureaucratic and burdensome licensing process.\n\n**Key Actions**\nNone noted.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- The committee heard from representatives of the Georgia Forestry Association, who requested that the Board of Registrations be moved from the Secretary of State's Office to the Georgia Forestry Commission.\n- The committee reviewed an email from a constituent expressing frustration with occupational licensing requirements for their medical practice.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nThe committee had 4 of 5 members present, establishing a quorum.\n\n**Adjournment**\nThe meeting details and next session date were not provided in the transcript summary.",
    "updated_at": "2026-02-12T01:49:54.447939+00:00"
  },
  {
    "video_id": "sAcyuUN3iLM",
    "url": "https://www.youtube.com/watch?v=sAcyuUN3iLM",
    "title": "11/28/23 Senate Study Committee on Certificate of Need Reform",
    "chamber": "senate",
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Certificate of Need Reform session on 11/28/23:\n\n**Overview**: The committee discussed recommendations for reforming or repealing Georgia's Certificate of Need (CON) laws, with a focus on addressing the anti-competitive effects and barriers to healthcare access, especially in rural areas.\n\n**Key Actions**:\n- No specific bills were passed or referred.\n\n**Bills Introduced (First Reading)**:\n- None detected.\n\n**Notable Moments**:\n- The committee chair thanked members for their thorough recommendations, noting that 9 out of 12 members supported a full repeal of Georgia's CON laws.\n- The chair opened the floor for discussion on the recommendations, inviting committee members to unpack their views.\n- One member, Chairman Watson, expressed the need to balance the rigidity of the CON laws with the operational realities facing healthcare providers.\n\n**Votes**: \n- No recorded votes.\n\n**Attendance**:\n- Quorum was present, as the committee members were able to discuss the recommendations.\n\n**Adjournment**:\n- The session adjourned, with no specific date provided for the next meeting.",
    "updated_at": "2026-02-12T01:50:59.347151+00:00"
  },
  {
    "video_id": "Zar0UlYDkNY",
    "url": "https://www.youtube.com/watch?v=Zar0UlYDkNY",
    "title": "Senator Parent & Senator Harrell Press Conference | Donna's Law",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Here is a structured markdown summary of the Georgia Senator Parent & Senator Harrell Press Conference on Donna's Law:\n\n**Overview**\nThis press conference focused on the introduction of SB 522, known as \"Donna's Law\", which would allow individuals to voluntarily place themselves on a \"do not sell\" list to prevent them from purchasing firearms during periods of suicidal ideation. The law is named after Katrina Breeze's mother, Donna, who died by suicide after impulsively purchasing a firearm. The senators and advocates highlighted the rising rates of suicide by firearm in Georgia and the need for this type of preventative measure.\n\n**Key Actions**\n**SB 522**: Donna's Law - Creates a process for individuals to voluntarily suspend their ability to purchase firearms during periods of suicidal thoughts.\n\n**Bills Introduced (First Reading)**\n- SB 522: Donna's Law\n\n**Notable Moments**\n- Katrina Breeze shared the tragic story of her mother's suicide and how Donna's Law could have saved her life.\n- Chelsea Piot, from the American Foundation for Suicide Prevention, spoke as a suicide loss survivor and in support of the bill.\n- The senators emphasized the bipartisan nature of the legislation and their hope to gain broad support.\n\n**Votes**\nNo votes were taken, as this was an introductory press conference for the bill.\n\n**Attendance**\nQuorum was not mentioned.\n\n**Adjournment**\nThe press conference concluded, but no next session date was provided.",
    "updated_at": "2026-02-12T01:30:20.25629+00:00"
  },
  {
    "video_id": "XQ9HEtaf79o",
    "url": "https://www.youtube.com/watch?v=XQ9HEtaf79o",
    "title": "Two Senate leaders. Two parties. One session ahead.  | Lawmakers 2026",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Senate leaders discussion:\n\n### Overview\nThe Senate leaders from both the Republican and Democratic parties discussed their priorities and legislative agenda for the upcoming 2026 session, with a focus on addressing the rising cost of living, improving quality of life, and investing in the next generation.\n\n### Key Actions\n**SB 390**: Bill to limit the ability of the National Guard from other states to enter Georgia without the governor's permission.\n\n### Bills Introduced (First Reading)\nNone mentioned.\n\n### Notable Moments\n- Republican Senate President Pro Tempore Larry Walker outlined GOP priorities around eliminating state income tax on lower incomes, capping property tax increases, and protecting land for outdoor recreation.\n- Democratic Senate Minority Leader Harold Jones highlighted Democratic priorities like Medicaid expansion, health insurance premium tax credits, and limiting private equity firms from purchasing too many homes.\n- Both leaders emphasized a focus on affordability and improving the quality of life for Georgians.\n\n### Votes\nNone recorded.\n\n### Attendance\nNo quorum notes provided.\n\n### Adjournment\nNo adjournment details given.",
    "updated_at": "2026-02-12T01:23:53.893035+00:00"
  },
  {
    "video_id": "8VyoojVUnig",
    "url": "https://www.youtube.com/watch?v=8VyoojVUnig",
    "title": "11/30/23  Senate Committee on Reapportionment & Redistricting",
    "chamber": "senate",
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 101,
    "summary": "Here is a structured markdown summary of the Georgia 11/30/23 Senate Committee on Reapportionment & Redistricting session:\n\n**Overview:** The session focused on the minority leader presenting the Democratic proposal for redrawing the Senate's legislative map in accordance with the federal court order and the Voting Rights Act. There was debate and discussion around public comments and the process for the new map.\n\n**Key Actions:**\n- **SB 4:** Proposed Democratic map for Senate redistricting\n\n**Bills Introduced (First Reading):** None mentioned\n\n**Notable Moments:**\n- Minority leader presented the Democratic proposal, arguing it complies with the court order and Voting Rights Act, unlike the Republican proposal\n- Debate over whether to allow public comments on the new map or just rely on yesterday's comments\n- Committee members discussed the timeline of map releases and when the public had opportunity to comment\n\n**Votes:** No recorded votes mentioned\n\n**Attendance:** Quorum present, committee members debating the process\n\n**Adjournment:** Not specified, likely continuing to next session",
    "updated_at": "2026-02-12T01:47:57.87609+00:00"
  },
  {
    "video_id": "qGbz7-sJq9o",
    "url": "https://www.youtube.com/watch?v=qGbz7-sJq9o",
    "title": "Capitol Report Day 37 03/28/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 2,
    "summary": "Here is a summary of the Georgia Capitol Report Day 37 03/28/25 session:\n\n**Overview**:\nThe session featured disagreements over a judicial pay raise bill and the state budget, with the Senate making changes to the House version that the House did not support. Key legislation was passed, including a bill increasing penalties for fentanyl trafficking and protections for in vitro fertilization.\n\n**Key Actions**:\n**HB68**: Fiscal Year 2026 state budget bill, passed Senate with changes from House version\n\n**Bills Introduced (First Reading)**:\nNone noted\n\n**Notable Moments**:\n- Debate over Senate amendment to judicial pay raise bill that added increases for governor and other state leaders\n- Discussion of federal funding changes impacting state budget\n\n**Votes**:\n- HB68 (state budget): Passed Senate 48-7\n\n**Attendance**:\nQuorum present\n\n**Adjournment**:\nSession adjourned, with next week being the final week of the legislative session.",
    "updated_at": "2026-02-12T01:23:28.089394+00:00"
  },
  {
    "video_id": "zySE0A-HO4A",
    "url": "https://www.youtube.com/watch?v=zySE0A-HO4A",
    "title": "Joint Appropriations Special Session PM - January 22, 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 111,
    "summary": "Here is a summary of the Georgia Joint Appropriations Special Session PM - January 22, 2026 session:\n\n**Overview**: The session focused on the amended FY26 budget and FY27 budget for the Georgia Department of Natural Resources (DNR). The Commissioner provided updates on various DNR programs and initiatives, and outlined key budget requests across the agency's divisions.\n\n**Key Actions**:\n- No bills passed or referred\n\n**Bills Introduced (First Reading)**: None detected\n\n**Notable Moments**:\n- Commissioner Raven provided updates on the Feral Hog Down Awards Program, which has resulted in the removal of over 12,000 feral hogs from Georgia's landscape.\n- The Commissioner discussed the growth of the Hunters for the Hungry program, which has provided over 106,000 pounds of donated venison to food banks across the state.\n- The Commissioner outlined several budget requests, including $500,000 to replace the coastal resources database, $1.25 million for erosion control at Cricket River State Park, and $5 million for a road paving project on Sapelo Island.\n\n**Votes**: No recorded votes\n\n**Attendance**: Quorum present, no notes on attendance issues\n\n**Adjournment**: The session adjourned, with no mention of the next scheduled meeting.",
    "updated_at": "2026-02-12T01:24:06.948224+00:00"
  },
  {
    "video_id": "yS7g9Ghc_cI",
    "url": "https://www.youtube.com/watch?v=yS7g9Ghc_cI",
    "title": "Capitol Report Day 34 03/21/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 34,
    "video_date": null,
    "duration_minutes": 2,
    "summary": "## Overview\n\nThe Georgia legislature session focused on the debate and passage of Senate Bill 68, a controversial tort reform bill that included an exception for victims of human trafficking. The session featured a failed amendment to extend protections to children and the elderly, as well as concerns raised by a Republican senator about the bill being an \"insurance company bailout.\"\n\n## Key Actions\n\n**SB 68**: Tort reform bill, passed 34-21.\n\n## Bills Introduced (First Reading)\n\nNo new bills were introduced.\n\n## Notable Moments\n\n- Attempted amendment to extend protections to children and the elderly failed.\n- Senator Colton Moore, a Republican, criticized the bill as an \"insurance company bailout\" with no guarantees of lower rates.\n- Governor Brian Kemp praised the legislature's work on the \"tough issue.\"\n\n## Votes\n\n**SB 68**: Passed 34-21.\n\n## Attendance\n\nNo quorum issues noted.\n\n## Adjournment\n\nLawmakers will return on Tuesday for day 35 of the session.",
    "updated_at": "2026-02-12T01:23:40.739574+00:00"
  },
  {
    "video_id": "4I9ZOMshGEo",
    "url": "https://www.youtube.com/watch?v=4I9ZOMshGEo",
    "title": "Georgia Senate 2026 - Day 10 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 10,
    "video_date": null,
    "duration_minutes": 232,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 10 AM Session:\n\n**Overview:**\nThis session focused on the introduction of several new bills and resolutions in the Georgia Senate. There were no major pieces of substantive legislation passed, but the session included routine procedures, recognitions of guests, and a morning devotion.\n\n**Key Actions:**\n- **SB 438**: To amend the Official Code of Georgia related to education\n- **SB 439**: To amend the Official Code of Georgia related to public health services\n- **SB 440**: To amend the Official Code of Georgia related to services \n- **SB 441**: To amend the Official Code of Georgia related to local government\n- **SB 442**: To amend the Official Code of Georgia related to motor vehicles\n- **SB 443**: To amend the Official Code of Georgia related to criminal offenses\n- **SR 662**: Resolution recognizing and commending Taiwan\n\n**Bills Introduced (First Reading):**\n- SB 438, SB 439, SB 440, SB 441, SB 442, SB 443\n- HR 1,008\n\n**Notable Moments:**\n- Recognition of pages serving in the Senate\n- Morning devotion led by a guest chaplain\n\n**Votes:**\nNo recorded votes.\n\n**Attendance:**\nSenators from the 7th, 12th, 28th, and 43rd districts were excused.\n\n**Adjournment:**\nThe session adjourned. The next session date was not provided.",
    "updated_at": "2026-02-12T01:24:20.761435+00:00"
  },
  {
    "video_id": "8jgUK_hglEs",
    "url": "https://www.youtube.com/watch?v=8jgUK_hglEs",
    "title": "Georgia Rules Meeting 2026 - Day 10 AM Session",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 10,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a structured markdown summary of the Georgia Rules Meeting 2026 - Day 10 AM Session:\n\n## Overview\nThe session focused on discussion and consideration of several bills, including HB 350, HB 522, and HB 676. There was some debate around the merits and rationale for the bills, particularly HB 522 which dealt with COVID-19 vaccination status and organ transplant decisions.\n\n## Key Actions\n**HB 350**: Bill dealing with pre- and post-exposure medication for HIV, with limitations on pharmacist protocol and physician involvement.\n**HB 522**: Bill prohibiting the use of COVID-19 vaccination status as the sole factor in denying a patient placement on an organ transplant list.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Discussion around HB 522 and whether it appropriately balances medical professionals' expertise versus political factors around COVID-19 vaccination.\n- Acknowledgment that HB 350 was carried over from the previous year's session.\n\n## Votes\nNo recorded votes were taken during this session.\n\n## Attendance\nA quorum was present, though some members were delayed due to inclement weather.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified.",
    "updated_at": "2026-02-12T01:24:33.89867+00:00"
  },
  {
    "video_id": "3fEwvzbRVVM",
    "url": "https://www.youtube.com/watch?v=3fEwvzbRVVM",
    "title": "Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 2,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections session:\n\n## Overview\nThis session focused on legislation related to income taxes, property taxes, and immigration enforcement. Senate Republicans announced their priorities for the 2026 legislative session, while Senate Democrats proposed bills aimed at regulating ICE agents in Georgia.\n\n## Key Actions\n- **SB 204**: Originally a Democratic bill from 2025 that allowed certain non-violent felonies to be charged by district attorneys without the involvement of a grand jury. The bill was amended to include language from SB 163, which would allow individual gun owners to bring legal action against local governments who they feel infringed on their second amendment rights.\n- **SB 389**: Proposed by Senate Democrats, would require ICE agents to remove their masks and properly identify themselves during arrests.\n- **Proposed Bills**: Democrats also proposed bills to allow civil lawsuits against ICE and require a warrant for arrests in schools, hospitals, and churches.\n\n## Bills Introduced (First Reading)\n- SB 390: Proposed by Senate Democrats, would require legislative approval for National Guard deployment in Georgia.\n- SB 192: Not mentioned in the transcript, but likely introduced during the session.\n\n## Notable Moments\n- Senate Democrats held a press conference to announce their legislation affecting immigration enforcement, calling for ICE agents to \"unmask\" and be held accountable.\n- Republican lawmakers criticized the Democrats' proposed bills, saying they were unnecessary and that law enforcement leaders should make decisions about tactical gear, not legislators.\n\n## Votes\n- SB 204 was adopted by substitution in a 32-21 party-line vote, but failed to garner the two-thirds majority needed to be sent immediately to the Governor.\n\n## Attendance\nThe transcript does not mention any quorum or attendance issues.\n\n## Adjournment\nThe session adjourned, but the next session date is not specified.",
    "updated_at": "2026-02-12T01:24:48.145987+00:00"
  },
  {
    "video_id": "HUsM6BxlTi4",
    "url": "https://www.youtube.com/watch?v=HUsM6BxlTi4",
    "title": "Georgia Legislators discuss bills to ban Lab-Grown Meat and pausing Data Centers | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "Here is a summary of the key points from the Georgia legislature floor session transcript:\n\n**Overview:**\nThe discussion focused on two bills being introduced - one to ban lab-grown meat and another to pause the development of data centers in the state. There was also discussion of potential property tax reform and education funding.\n\n**Key Actions:**\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading):**\n- Bill to ban the production, distribution, and sale of lab-grown meat\n- Bill to pause the development of data centers for one year\n\n**Notable Moments:**\n- Senators discussed concerns over the public's trust in institutions and the need for more education and transparency around new technologies like lab-grown meat and data centers.\n- Senators expressed interest in pursuing property tax reform and updating the state's 40-year-old education funding formula.\n\n**Votes:**\nNo recorded votes were mentioned.\n\n**Attendance:**\nNo quorum notes were provided.\n\n**Adjournment:**\nThe transcript does not mention when the session adjourned or the date of the next session.",
    "updated_at": "2026-02-12T01:25:00.82822+00:00"
  },
  {
    "video_id": "7lTVwCOow6M",
    "url": "https://www.youtube.com/watch?v=7lTVwCOow6M",
    "title": "Georgia Rules Meeting 2026 - Day 8 AM Session",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 8,
    "video_date": null,
    "duration_minutes": 13,
    "summary": "Here is a structured summary of the Georgia Rules Meeting 2026 - Day 8 AM Session:\n\n**Overview:**\nThis session focused on a resolution (HR 1-008) to reorganize and streamline the regional water planning committees in Georgia. The changes aim to make the committees more efficient and responsive to emerging water management challenges.\n\n**Key Actions:**\n**HR 1-008**: Reduces the number of governor, lieutenant governor, and speaker appointees to the regional water planning councils; increases council member term lengths from 3 to 6 years; requires representation from key water use sectors.\n\n**Bills Introduced (First Reading):** None detected\n\n**Notable Moments:**\n- Opening prayer by Dean Green\n- Moment of silence to remember former Rules Committee Secretary Mandy Ballinger\n- Presentation by Rep. Smith on the rationale and details of HR 1-008\n\n**Votes:** No recorded votes\n\n**Attendance:** Quorum present to conduct business\n\n**Adjournment:** Not specified, but the session appears to be ongoing.",
    "updated_at": "2026-02-12T01:25:13.724906+00:00"
  },
  {
    "video_id": "hI03ViZkSGk",
    "url": "https://www.youtube.com/watch?v=hI03ViZkSGk",
    "title": "Georgia Joint Appropriations Subcommittee 2026 - Day 8 AM Session",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 8,
    "video_date": null,
    "duration_minutes": 52,
    "summary": "Here is a summary of the Georgia Joint Appropriations Subcommittee 2026 - Day 8 AM Session:\n\n**Overview**\nThe session focused on presentations from the Georgia Department of Transportation (GDOT) and provided an update on the state's transportation budget and infrastructure costs.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The GDOT Commissioner recognized the work of GDOT employees and other state agencies in responding to recent winter weather events across Georgia.\n- The Commissioner highlighted the challenges with the federal transportation budget process, including the current continuing resolution and the potential impact of a government shutdown on project funding and delivery.\n- The Commissioner presented data on the significant inflationary pressures impacting transportation construction costs, which have increased by around 70% since 2021.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe session appeared to have a quorum, with both the Subcommittee on Appropriations Chair and the Transportation Policy Committee Chair present and participating.\n\n**Adjournment**\nThe session adjourned, with the next meeting scheduled for a later date.",
    "updated_at": "2026-02-12T01:25:26.9543+00:00"
  },
  {
    "video_id": "gfbb1QqRxwQ",
    "url": "https://www.youtube.com/watch?v=gfbb1QqRxwQ",
    "title": "Georgia Appropriations Subcommittee 2026 - Day 7 PM Session",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 7,
    "video_date": null,
    "duration_minutes": 126,
    "summary": "Here is a structured summary of the Georgia Appropriations Subcommittee 2026 - Day 7 PM Session:\n\n**Overview:** The session focused on updates from the Georgia Department of Agriculture, including the ongoing response to avian influenza outbreaks, the state's hemp program, and the department's emergency management capabilities.\n\n**Key Actions:** No bills were passed or referred.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Commissioner of Agriculture Tyler Harper provided an update on the Department of Agriculture's operations, including the integration of the Rural Center under the department and efforts around the farm recovery block grant.\n- Harper highlighted the department's multi-agency coordination during the recent winter storm, with the Department of Agriculture working closely with the Georgia Forestry Commission and other agencies.\n- Harper discussed the department's focus on building out its emergency management capabilities to respond to issues impacting farms and consumers, such as avian influenza, the yellow-legged hornet, and weather events.\n- Harper provided an update on the state's hemp program, noting it generated over $2 million in revenue last year.\n\n**Votes:** No recorded votes.\n\n**Attendance:** Quorum was present, with several members arriving late from caucus meetings.\n\n**Adjournment:** The session was adjourned. The next meeting date was not specified.",
    "updated_at": "2026-02-12T01:25:40.855188+00:00"
  },
  {
    "video_id": "gAtw0Askd0o",
    "url": "https://www.youtube.com/watch?v=gAtw0Askd0o",
    "title": "Georgia Senate Page Program Video",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 3,
    "summary": "Overview:\nThe video provides an overview of the Georgia Senate Page Program, outlining the process for becoming a page, the duties and expectations during the legislative day, and the benefits of participating in the program.\n\nKey Actions:\nNo specific bills or legislative actions were mentioned in this informational video.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The video highlights the importance of professionalism and appropriate attire for pages, emphasizing that they are representing their school, neighborhood, and the Senate page program.\n- It also mentions the opportunity for pages to have their photo taken with the Lieutenant Governor and their sponsoring senator.\n\nVotes:\nNo votes were recorded in this session.\n\nAttendance:\nThe video does not provide any information about quorum or attendance.\n\nAdjournment:\nThe video does not mention the adjournment of the legislative session or the date of the next session.",
    "updated_at": "2026-02-12T01:40:03.472391+00:00"
  },
  {
    "video_id": "D56OW5qwymI",
    "url": "https://www.youtube.com/watch?v=D56OW5qwymI",
    "title": "Joint Appropriations Special Session PM - January 21, 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 229,
    "summary": "Here is a structured markdown summary of the Georgia Joint Appropriations Special Session PM - January 21, 2026 session:\n\n# Overview\nThis session focused on the Secretary of State's amended budget recommendations for fiscal years 2026 and 2027. The proposed changes aim to maintain secure elections, protect consumers, support licensed professionals, and ensure efficient agency operations.\n\n# Key Actions\n**HB 1391**: Provides funding for election integrity measures, including a one-time employee salary supplement, optical character recognition technology, a second ballot blind count, and resources for full hand recounts of two statewide elections in 2026.\n\n# Bills Introduced (First Reading)\nNone mentioned.\n\n# Notable Moments\n- The Secretary of State highlighted that Georgia runs the \"best elections in the entire country\" according to Fox News.\n- The Secretary outlined various efficiency and customer service improvements, such as reducing nursing license processing time by 62%.\n- The agency has hosted over 49 financial literacy programs, including outreach to women's prisons.\n\n# Votes\nThe proposed budget changes were voted on and passed.\n\n# Attendance\nNo specific quorum notes provided.\n\n# Adjournment\nThe session adjourned, but the next session date was not mentioned.",
    "updated_at": "2026-02-12T01:26:07.583669+00:00"
  },
  {
    "video_id": "Zb0-u7KOyXo",
    "url": "https://www.youtube.com/watch?v=Zb0-u7KOyXo",
    "title": "Inside the historic renovations of the Georgia Capitol Building",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nThe transcript details the extensive renovations being made to the Georgia State Capitol building, focusing on the restoration work in the House and Senate chambers. The renovations aim to preserve the historic architecture and infrastructure while modernizing key systems like HVAC, electricity, and accessibility.\n\nKey Actions:\nNo specific bills or legislation mentioned.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Detailed descriptions of the painstaking restoration work, including replastering, new HVAC systems, over 76,000 feet of new cabling, and the meticulous repainting and gilding by specialized artisan painters.\n- Mention of previous renovations under former House Speaker Tom Murphy that had to \"cut corners\" due to time constraints.\n- Emphasis on the sense of pride and ownership the Georgia-based contractors, architects, and craftspeople feel in restoring this historic state landmark.\n\nVotes:\nNone detected.\n\nAttendance:\nNo quorum notes provided.\n\nAdjournment:\nNo specific adjournment or next session date mentioned.",
    "updated_at": "2026-02-12T01:26:20.438543+00:00"
  },
  {
    "video_id": "9Bv01jEHgog",
    "url": "https://www.youtube.com/watch?v=9Bv01jEHgog",
    "title": "Joint Appropriations Special Session AM - January 20, 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 176,
    "summary": "Overview:\n- This was a Georgia Joint Appropriations Special Session on January 20, 2026. The session focused on the state budget and appropriations process, with Governor Brian Kemp providing remarks.\n\nKey Actions:\n- No specific bills were passed or referred to during this session.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Governor Brian Kemp addressed the Joint Appropriations Committee in person, highlighting his administration's economic development efforts and the importance of responsible budgeting.\n- There was some lighthearted banter between the committee members about seating arrangements.\n- The session began with an opening prayer by Chairman Gerald Green on his 44th Joint Appropriations Hearing.\n\nVotes:\n- No recorded votes took place.\n\nAttendance:\n- The transcript indicates a \"full house\" for the Joint Appropriations Committee meeting.\n\nAdjournment:\n- The transcript does not explicitly state when the session adjourned or the date of the next session.",
    "updated_at": "2026-02-12T01:26:33.798079+00:00"
  },
  {
    "video_id": "ajF2YMaLBHQ",
    "url": "https://www.youtube.com/watch?v=ajF2YMaLBHQ",
    "title": "Georgia Senate 2026 - Day 5 AM Session 1",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 5,
    "video_date": null,
    "duration_minutes": 51,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 5 AM Session 1 transcript:\n\n**Overview**\nThe session featured the introduction of several new bills, including SB 170. There was a brief discussion and unanimous consent to excuse certain senators, as well as the opening prayer and pledge of allegiance.\n\n**Key Actions**\n**SB 170**: No details provided on this bill.\n\n**Bills Introduced (First Reading)**\n- SB 401: Amend Part 14 of Article 6 of Chapter 2 of Title 20 related to other educational programs under the Quality Basic Education.\n- SB 402: Amend Chapter 5 of Title 49.\n- SB 403: Amend Article 5 of Chapter 12. \n- SB 404: Amend Article 1 of Chapter 9 in Title 9.\n- SB 405: Amend Code Section 15-10-2.\n- SB 406: Amend Title 4-3.\n- SB 407: Provide for a homestead exemption from Cherokee County School District ad valorem taxes.\n- SB 408: Amend an unspecified section.\n- SB 409: Unspecified subject relating to insurance and labor.\n- SB 410: Amend Part 1 of Article 1 of an unspecified section.\n- SR 579: Honor the life of Sergeant Major Transportation.\n\n**Notable Moments**\n- The Senate President welcomed a group of young girls who accompanied a senator.\n- There was a brief discussion about dispensing with the reading of the journal, which was ultimately done by unanimous consent.\n- Announcements were made about upcoming opportunities for new committee chairmanships.\n- A new senator led the chamber in the pledge of allegiance and introduction of the pastor of the day.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nThe Senate President recognized and excused several senators who were absent.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or when the next session will take place.",
    "updated_at": "2026-02-12T01:26:48.651322+00:00"
  },
  {
    "video_id": "0hAqZpUYsHg",
    "url": "https://www.youtube.com/watch?v=0hAqZpUYsHg",
    "title": "Property Tax Relief, State Education Improvements and Affordable Healthcare | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a structured markdown summary of the Georgia legislative session based on the transcript provided:\n\n# Georgia Property Tax Relief, State Education Improvements and Affordable Healthcare | Lawmakers 2026 Session\n\n## Overview\nThe transcript highlights the key priorities for the Georgia legislature in the 2026 session, including property tax relief, education improvements focused on childhood literacy, and efforts to address the rising costs of healthcare and health insurance.\n\n## Key Actions\nNo specific bills were mentioned in the transcript.\n\n## Bills Introduced (First Reading)\nNo bills were mentioned as being introduced.\n\n## Notable Moments\n- The House Majority Leader and House Minority Whip discussed the legislative priorities of their respective caucuses.\n- There was a focus on property tax relief, with the Republican caucus proposing the elimination of the homestead property tax statewide.\n- Education was a major priority, with a focus on improving childhood literacy and addressing issues like student loan debt.\n- The Democratic caucus pushed for Medicaid expansion, while the Republican caucus emphasized affordability and accessibility in healthcare, including efforts to grow the healthcare workforce.\n\n## Votes\nNo specific votes were mentioned in the transcript.\n\n## Attendance\nNo quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next session.",
    "updated_at": "2026-02-12T01:27:15.589917+00:00"
  },
  {
    "video_id": "d0MXLHcohSA",
    "url": "https://www.youtube.com/watch?v=d0MXLHcohSA",
    "title": "Georgia lawmakers debate plan to eliminate state income tax | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a structured markdown summary of the Georgia lawmakers' debate on a plan to eliminate the state income tax:\n\n## Overview\nThe Georgia Senate Special Committee on the Elimination of Georgia's Income Tax has been gathering input and developing a proposal to significantly reduce or eliminate the state income tax. The discussion centers around the details and tradeoffs of such a plan.\n\n## Key Actions\nNo specific bills or legislative actions were mentioned.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Republican Senator Blake Tillerie and Democratic Senator Nan Orrok, both members of the special committee, discussed the committee's proposals and their differing perspectives.\n- The proposals aim to eliminate income tax on the first $50,000 for individuals and $100,000 for joint filers, while reducing rates for other taxpayers.\n- Debate centered on the impact on the state budget, with concerns raised about funding critical services versus providing broad tax relief.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment or next session date provided.",
    "updated_at": "2026-02-12T01:27:28.196035+00:00"
  },
  {
    "video_id": "BPbePff989s",
    "url": "https://www.youtube.com/watch?v=BPbePff989s",
    "title": "Georgia House 2026 - Day 4 PM Session",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "# Georgia House 2026 - Day 4 PM Session\n\n## Overview\nThis session featured recognitions and announcements, including honoring the legacy of Rev. Dr. Martin Luther King Jr. and a representative's grandson's birthday. There was discussion of upcoming events and committee meetings, but no substantive legislative action detected.\n\n## Key Actions\nNo bills passed or referred.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Barry gave a speech honoring the life and legacy of Rev. Dr. Martin Luther King Jr., calling on the House to legislate with justice, mercy, and humility.\n- Representative Scott recognized her grandson Lucas' 13th birthday.\n- Representative Emory Dunahoo announced he has been providing daily devotions to members, with 4 colleagues joining him, but that this will be his last year doing so.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum present, no issues noted.\n\n## Adjournment\nThe House adjourned until 10 AM on Friday, January 16th, 2026.",
    "updated_at": "2026-02-12T01:27:41.219225+00:00"
  },
  {
    "video_id": "MyMYT22k-d4",
    "url": "https://www.youtube.com/watch?v=MyMYT22k-d4",
    "title": "Georgia Senate 2026 - Day 4 AM Session 2",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 42,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 4 AM Session 2 session:\n\n## Overview\nThis session focused on routine proceedings, with no major legislation introduced or passed. The session featured a morning devotion led by Pastor Anthony Booker, who provided a sermon emphasizing the importance of serving a higher purpose beyond just one's day-to-day work.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\n- **SB 399**: To amend Article 3 of Chapter 11 of Title 31 of the Official Code of Georgia Annotated.\n- **SB 400**: To amend Part 1A of Article 7 of Chapter 3 of Title 20 of the Official Code of Georgia Annotated relating to non-public, post-secondary educational institutions.\n- **SR 574**: To recognize and commend the Susan Jolly Foundation and the Georgia Cancer Control Consortium.\n\n## Notable Moments\n- Pastor Anthony Booker delivered a sermon during the morning devotion, emphasizing the importance of serving a higher purpose beyond just one's day-to-day work.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe session noted the excusal of several senators, including from the 35th, 10th, and 30th districts.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
    "updated_at": "2026-02-12T01:27:54.795815+00:00"
  },
  {
    "video_id": "gGequbr9vg4",
    "url": "https://www.youtube.com/watch?v=gGequbr9vg4",
    "title": "AI, Kids, and the Future of Tech in Georgia | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 10,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript on AI, Kids, and the Future of Tech in Georgia:\n\n## Overview\nThe discussion focuses on the rapid technological innovations happening in Georgia and the need to create laws that protect children, especially in relation to AI chatbots and addictive digital products targeting young users.\n\n## Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Todd Jones, chair of the House Committee on Technology and Infrastructure Innovation, discussed Georgia's efforts to be a leader in innovative technologies like air taxis, autonomous vehicles, and creative manufacturing.\n- Senator Sally Harrell, who co-chaired a Senate study committee on social media AI and children, shared concerning stories about 4th grade students accessing AI chatbots with inappropriate content on their school network.\n- Both legislators emphasized the need for guardrails and regulations to address the issues of AI chatbot companions and addictive digital product design targeting children.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session.",
    "updated_at": "2026-02-12T01:28:08.168444+00:00"
  },
  {
    "video_id": "roE1b6b9xuw",
    "url": "https://www.youtube.com/watch?v=roE1b6b9xuw",
    "title": "Georgia House 2026 - Day 3 AM Session 1",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 3,
    "video_date": null,
    "duration_minutes": 53,
    "summary": "Here is a summary of the Georgia House 2026 - Day 3 AM Session 1 in structured markdown format:\n\n## Overview\nThis session focused on opening remarks and a scripture reading and prayer from the House chaplain, Rev. Benny Tate. There were no significant legislative actions taken.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Rep. Clint Crowe introduced Rev. Benny Tate, the House chaplain for the past 36 years, and shared a personal story about Rev. Tate's ministry to Crowe's family.\n- Rev. Tate gave a sermon emphasizing the importance of encouragement, noting that \"if they're breathing, they need encouragement.\"\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum present, as members responded to the morning roll call.\n\n## Adjournment\nThe session adjourned. No information provided on the next session date.",
    "updated_at": "2026-02-12T01:28:34.336534+00:00"
  },
  {
    "video_id": "AGS_xbmElgA",
    "url": "https://www.youtube.com/watch?v=AGS_xbmElgA",
    "title": "Georgia Senate 2026 - Day 2 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 2,
    "video_date": null,
    "duration_minutes": 61,
    "summary": "Overview:\nThe Georgia Senate session focused on the introduction of several new bills, including SB 106 and SB 204. The session featured a morning devotion and recognitions of new pages.\n\nKey Actions:\n**SB 106**: Not specified\n**SB 204**: Not specified\n\nBills Introduced (First Reading):\n- SB 379 - Relating to insurance\n- SB 380 - Relating to Article 7 of Chapter 4 of Title 49\n- SB 381 - Relating to the Quality Basic Education Act\n- SB 382 - Relating to Chapter 5 of Title 48\n- SB 383 - Relating to Chapter 15 of Title 19\n- SB 384 - Relating to Article 2 of Chapter 9 \n- SB 385 - Relating to Chapter 1 of Title 28\n- SB 386 - Relating to Title 28\n- SB 387 - Relating to Title 48\n- SB 388 - Relating to Chapter 13 of Title 36\n- SR 558 - Proposing a constitutional amendment\n- SR 560 - Reaffirming the state's position\n\nNotable Moments:\n- Recognitions of new Senate pages from Perry, Georgia\n- Morning devotion given by Rev. Tom Caruth, pastor of Perry United Methodist Church\n\nVotes:\nNo recorded votes mentioned.\n\nAttendance:\nThe senators from the 10th and 33rd districts were excused.\n\nAdjournment:\nThe transcript does not indicate when the session adjourned or the date of the next session.",
    "updated_at": "2026-02-12T01:28:48.044979+00:00"
  },
  {
    "video_id": "vafC9Qsf8Zo",
    "url": "https://www.youtube.com/watch?v=vafC9Qsf8Zo",
    "title": "Campaign Year, New Faces, Big Questions | Lawmakers 2026 Day 1",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 1,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n## Overview\nThis was the first day of the 158th session of the Georgia General Assembly. It was a busy day with lawmakers getting to work on procedural business, welcoming new members, and discussing the legislative calendar. Notable aspects include several lawmakers running for higher office during the session and a focus on affordability issues like healthcare, property taxes, and housing.\n\n## Key Actions\n**SB 30**: No details provided\n\n## Bills Introduced (First Reading)\nNo bills introduced\n\n## Notable Moments\n- Audrey Cattilla, the reigning Miss Georgia, performed with her voice and violin to start the session.\n- The Senate unanimously selected Senator Larry Walker III as the new President Pro Tempore.\n- The House debated the 2026 legislative calendar, discussing accommodations for religious holidays.\n- The House paid tribute to the late Representative Mandy Ballinger.\n- The ACLU held a \"Pack the Capitol\" event advocating for engagement between legislators and constituents.\n\n## Votes\n- The 2026 legislative calendar was approved unanimously in both chambers.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment time or next session date provided.",
    "updated_at": "2026-02-12T01:29:01.459054+00:00"
  },
  {
    "video_id": "d6O8fUBptpk",
    "url": "https://www.youtube.com/watch?v=d6O8fUBptpk",
    "title": "Opening Day Under the Gold Dome | Georgia House 2026 - Day 1 AM Session",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 1,
    "video_date": null,
    "duration_minutes": 59,
    "summary": "Here is a structured markdown summary of the Georgia House 2026 - Day 1 AM Session:\n\n# Overview\nThe Georgia House of Representatives held its opening day session, focusing on recognizing the work done by the Georgia Building Authority (GBA) to renovate and restore the House chamber. Key highlights included the use of Georgia-made carpet from Dalton and the replacement of the HVAC system dating back to the 1950s.\n\n# Key Actions\nNo bills were passed or referred during this session.\n\n# Bills Introduced (First Reading)\nNo new bills were introduced.\n\n# Notable Moments\n- The House recognized Gerald Pilgrim, Deputy Executive Director and Chief of Staff of the GBA, for the team's work in renovating the chamber.\n- A video was shown highlighting the extensive renovation project, which involved over 500 employees and 400,000 man-hours of work.\n- The Speaker thanked the GBA team, the Governor, and the First Lady for their dedication and support in completing the project.\n\n# Votes\nNo recorded votes were taken.\n\n# Attendance\nThe session maintained a quorum, with members present in the chamber.\n\n# Adjournment\nThe session adjourned, with the next session date not specified.",
    "updated_at": "2026-02-12T01:29:27.673148+00:00"
  },
  {
    "video_id": "CIgJOffe2qQ",
    "url": "https://www.youtube.com/watch?v=CIgJOffe2qQ",
    "title": "Lawmakers Exclusive: Gov. Brian Kemp Talks with GPB on Final Day of Legislature",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nGovernor Brian Kemp discusses the conclusion of the Georgia legislative session, highlighting the passage of tort reform legislation as a key priority that was accomplished. He also expresses openness to potential insurance reform in the future, while emphasizing the need to maintain fiscal responsibility.\n\nKey Actions:\nNo specific bills were mentioned as passing or being referred.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- Governor Kemp plans to address the General Assembly to thank them for a \"great legislative session\" and the productive work done, despite some \"tough issues.\"\n- Kemp expresses satisfaction with the passage of tort reform, which he sees as critical to stabilizing the business environment and insurance market in Georgia.\n- Kemp indicates openness to potential insurance reform in the future, but emphasizes the need for transparency and fairness, as well as increased competition in the insurance market.\n- Kemp dismisses the possibility of a special legislative session to address the state budget, expressing confidence in Georgia's fiscal position and the conservative budgeting approach.\n\nVotes:\nNo specific votes were mentioned.\n\nAttendance:\nNo quorum notes were provided.\n\nAdjournment:\nThe session is ongoing, with Kemp planning to address the General Assembly later in the evening. The next session date was not specified.",
    "updated_at": "2026-02-12T01:29:40.5273+00:00"
  },
  {
    "video_id": "KMNFRisz5i0",
    "url": "https://www.youtube.com/watch?v=KMNFRisz5i0",
    "title": "Georgia Senate 2026 - Day 7 PM Session",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 7,
    "video_date": null,
    "duration_minutes": 109,
    "summary": "Here is a summary of the Georgia Senate 2026 - Day 7 PM Session:\n\n**Overview**:\nThe session included the introduction of several new bills, reports from Senate committees, and procedural matters. Notable was the suspension of a rule to allow assignment of a gubernatorial appointment to a committee.\n\n**Key Actions**:\n- **SB 411**: Bill to amend Title 43 related to professional services\n- **SB 412**: Bill to amend education code related to Part 4 of Article 17 of Chapter 2 of Title 20\n- **SB 605**: Bill introduced (first reading)\n- **SR 605**: Resolution introduced (first reading)\n\n**Bills Introduced (First Reading)**:\n- SB 411-420, SR 584, SR 593\n\n**Notable Moments**:\n- Suspension of Senate Rule 3-3.1A to allow assignment of a gubernatorial appointment to the Judicial Qualifications Commission\n- Morning devotion led by the Rules Committee Chairman\n\n**Votes**:\nNone recorded.\n\n**Attendance**:\nThe Senate granted unanimous consent to excuse several senators from the session.\n\n**Adjournment**:\nThe transcript does not include the time of adjournment or the date of the next session.",
    "updated_at": "2026-02-12T01:25:54.34478+00:00"
  },
  {
    "video_id": "N0VzeBPNyeQ",
    "url": "https://www.youtube.com/watch?v=N0VzeBPNyeQ",
    "title": "State of the State Special I 2026 Lawmakers Day 4",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 57,
    "summary": "Here is a structured markdown summary of the Georgia State of the State Special I 2026 Lawmakers Day 4 session:\n\n**Overview**\nThe session featured Governor Brian Kemp's final State of the State address, where he highlighted accomplishments from his two terms, outlined policy priorities, and reflected on his time in office. The speech was followed by the Democratic response.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Governor Kemp reflected on his time as governor, stating it has been an \"incredible honor\" to serve as Georgia's first family. \n- Kemp announced a new need-based scholarship program, the \"Dream Scholarship,\" garnering cheers from the audience.\n- Kemp touted several tax relief measures implemented during his tenure, including over $3.2 billion in one-time tax relief.\n- Kemp closed his speech by reciting a hymn verse about doing great work even in small places.\n- After the address, Democrats praised some aspects like the new scholarship but criticized a lack of focus on healthcare.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nNo quorum issues were noted.\n\n**Adjournment**\nThe session adjourned, with lawmakers scheduled to return the next day for a ceremony honoring Martin Luther King Jr.",
    "updated_at": "2026-02-12T01:27:02.616073+00:00"
  },
  {
    "video_id": "Il02n4GrVkg",
    "url": "https://www.youtube.com/watch?v=Il02n4GrVkg",
    "title": "Georgia Senate 2026 - Day 3 AM Session 2",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 3,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a summary of the Georgia Senate 2026 - Day 3 AM Session 2 session:\n\n**Overview**: This was a routine morning session with no major legislative actions taken. The focus was on excusing absences and a prayer by the chaplain.\n\n**Bills Introduced (First Reading)**: \n- **SB 389**: Amend Code on General Provisions\n- **SB 390**: Amend Code on Homeland Security  \n- **SB 391**: Amend Code on Criminal Offenses\n- **SB 392**: Amend Code on Public Officers and Employees\n- **SB 393**: Amend Code on Property\n- **SB 394**: Amend Code on Motor Vehicles and Traffic\n- **SB 395**: Amend Code on Health\n- **SB 396**: Amend Code on Judiciary\n- **SB 397**: Amend Code on Judiciary  \n- **SB 398**: Amend Code on Crimes and Offenses\n- **SR 563**: Urge Georgia Secretary of State to comply with DOJ voter registration request\n- **SR 567**: Express support for Willie Syndrome awareness day\n\n**Notable Moments**:\n- Chaplain Reverend Britt Madden gave the morning prayer, discussing stories about Admiral Rickover and President Kennedy.\n\n**Attendance**:\n- Several senators were excused for business inside and outside the Capitol.\n\n**Adjournment**:\nThe session adjourned, with no next session date provided.",
    "updated_at": "2026-02-12T01:28:21.469424+00:00"
  },
  {
    "video_id": "y6Ut8sb7H2c",
    "url": "https://www.youtube.com/watch?v=y6Ut8sb7H2c",
    "title": "Opening Day at the Capitol | Georgia Senate 2026 - Day 1 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 1,
    "video_date": null,
    "duration_minutes": 100,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 1 AM Session:\n\n**Overview**\nThe opening day of the 2026 Georgia legislative session featured a stirring invocational speech by Senator Benny Hinn, emphasizing the importance of encouragement and praising the legislators for their service to the state.\n\n**Key Actions**\n- **HR 998**: Resolution\n- **SB 204**: Bill\n- **SR 557**: Resolution\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Senator Benny Hinn delivered a heartfelt speech on the importance of encouragement, drawing from biblical passages and personal anecdotes.\n- Senator Hinn recognized the sacrifices made by the legislators' families in serving the state.\n- The session included a recognition of a distinguished physician in attendance.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present.\n\n**Adjournment**\nThe session adjourned. The next session date was not specified.",
    "updated_at": "2026-02-12T01:29:14.565258+00:00"
  },
  {
    "video_id": "jPOO3BgtSn4",
    "url": "https://www.youtube.com/watch?v=jPOO3BgtSn4",
    "title": "Georgia House 2026 - Day 8 AM Session",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 8,
    "video_date": null,
    "duration_minutes": 89,
    "summary": "Overview:\n- This session focused on procedural matters, with no notable legislation discussed. The session began with a prayer and Pledge of Allegiance, followed by introductions and routine business.\n\nKey Actions:\n- No bills passed or referred.\n\nBills Introduced (First Reading):\n- No new bills introduced.\n\nNotable Moments:\n- Prayer delivered by Pastor George Dillard, who spoke about the importance of focusing on essentials and not getting bogged down by unnecessary burdens.\n- Introduction of the House doctor of the day, Dr. John Pittman.\n\nVotes:\n- No recorded votes.\n\nAttendance:\n- Quorum present, with all members voting to signify their attendance.\n\nAdjournment:\n- No specific adjournment time noted, but the session appears to have continued after the events summarized.",
    "updated_at": "2026-02-12T01:30:06.660995+00:00"
  },
  {
    "video_id": "cP1YkqIhrBQ",
    "url": "https://www.youtube.com/watch?v=cP1YkqIhrBQ",
    "title": "Lawmakers Day 31 03/13/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 31 03/13/25 session:\n\n**Overview:**\nThe session featured a mix of lighthearted debates on bills designating official state colors and heritage horses, as well as more serious discussions around school psychologist licensing, pesticide disclosure requirements, and the use of song lyrics as evidence in the high-profile prosecution of rapper Young Thug.\n\n**Key Actions:**\n**HB 81:** Allows school psychologists to work across state lines with equivalent licensing.\n**HB 167:** Allows the use of fluorescent pink in addition to orange for hunting attire.\n**SB 139:** Allows the city of Mulberry to annex certain parcels of land in Gwinnett County.\n**SB 138:** Waives Gwinnett County's sovereign immunity in providing services to Mulberry.\n**SB 144:** Prevents pesticide manufacturers from being held liable for undisclosed health risks beyond FDA requirements.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Debate on the appropriate \"shade of pink\" to be used for hunting attire.\n- Democrats opposing the Mulberry annexation and Gwinnett County service bills, arguing it was a \"free Berry\" approach.\n- Passionate discussion around the use of song lyrics as evidence in the Young Thug prosecution, with a Democratic representative joining the opposition.\n\n**Votes:**\n- HB 81 passed 48-2.\n- HB 167 passed unanimously.\n- SB 139 passed 96-74 along party lines.\n- SB 138 passed along party lines.\n- SB 144 passed 101-58.\n\n**Attendance:** Quorum maintained.\n\n**Adjournment:** Session adjourned, with the next session date unspecified.",
    "updated_at": "2026-02-12T01:31:35.103485+00:00"
  },
  {
    "video_id": "jDHDXiiLYWI",
    "url": "https://www.youtube.com/watch?v=jDHDXiiLYWI",
    "title": "Sen. Hickman Press Conference on GCDD for K-12 Students | 02/04/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Overview:\n- This press conference focused on the experiences of students with disabilities in Georgia's education system, particularly the challenges faced in the \"Jeanette\" segregated education program. The speakers highlighted the need for inclusive, high-quality education for all students.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Senator Billy Hickman, a champion for disability rights, introduced the event and spoke about the importance of strengthening the teaching workforce and making education more accessible and inclusive.\n- Representative Lim emphasized that inclusive education benefits all students, not just those with disabilities, and discussed efforts to promote this in Gwinnett County.\n- Daniel, a \"survivor\" of the segregated \"Jeanette\" system, shared a powerful personal account of the abuse and challenges he faced in that program.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nNo adjournment information provided.",
    "updated_at": "2026-02-12T01:32:55.761266+00:00"
  },
  {
    "video_id": "0pXNSaNtYmg",
    "url": "https://www.youtube.com/watch?v=0pXNSaNtYmg",
    "title": "Sen. Jackson Press Conference on ICE | 01/13/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 26,
    "summary": "Overview\n- This press conference featured Georgia state senators condemning the actions of the Trump administration and federal immigration enforcement agencies like ICE. They announced new legislation to protect immigrant communities and limit the use of the National Guard without state permission.\n\nKey Actions\n- **SB 390**: Prohibit the armed state forces (National Guard) from being deployed in Georgia without the permission of the state's elected leaders.\n- **SB 391**: Prevent immigration enforcement without a judicial warrant in sensitive locations like schools, hospitals, places of worship, and domestic violence shelters.\n\nBills Introduced (First Reading)\n- SB 390: Prohibit National Guard deployment without state permission\n- SB 391: Restrict immigration enforcement in sensitive locations\n\nNotable Moments\n- Moment of silence to honor lives lost due to ICE actions\n- Speeches by Senators Ramon and Jones condemning the Trump administration's treatment of immigrant communities\n\nVotes\n- No recorded votes, these were bill introductions.\n\nAttendance\n- The press conference featured several Georgia state senators speaking in support of the immigrant community and the proposed legislation.\n\nAdjournment\n- No specific adjournment time noted, this was a press conference rather than a legislative session.",
    "updated_at": "2026-02-12T01:39:20.216084+00:00"
  },
  {
    "video_id": "DKjbv8C7ErE",
    "url": "https://www.youtube.com/watch?v=DKjbv8C7ErE",
    "title": "1/23/24 Senate Committee on Ethics",
    "chamber": "senate",
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 107,
    "summary": "Overview:\nThe Georgia Senate Committee on Ethics discussed several bills related to elections and voting procedures, with a focus on preventing the implementation of ranked choice voting in the state.\n\nKey Actions:\n- **SB 355**: Prohibits the use of ranked choice voting in Georgia, except for military and overseas voters.\n\nBills Introduced (First Reading):\n- SB 355 by Senator Robinson\n- SB 358 by Senator Burns\n\nNotable Moments:\n- Senator Robertson provided a detailed presentation on the issues and concerns with ranked choice voting, citing examples of problems in other states.\n- The committee discussed the need to restore voter confidence in Georgia's elections following the controversies of the 2016 and 2020 elections.\n\nVotes:\nNo recorded votes mentioned in the transcript.\n\nAttendance:\nNo specific quorum notes provided.\n\nAdjournment:\nThe transcript does not indicate when the committee meeting was adjourned or the date of the next session.",
    "updated_at": "2026-02-12T01:43:23.446828+00:00"
  },
  {
    "video_id": "C8VHGljz-SE",
    "url": "https://www.youtube.com/watch?v=C8VHGljz-SE",
    "title": "Lawmakers Day 39 04/02/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**:\nThis was a busy day 39 of the Georgia legislative session, with lawmakers racing to pass as much legislation as possible before the session ends. The session featured partisan debates on voting bills, as well as recognitions and emotional moments around school safety and mental health.\n\n**Key Actions**:\n- **HB 397**: Controversial voting bill that passed along party lines, with Democrats criticizing it as an attempt to disenfranchise voters.\n- **SB 17**: \"Ricky and Lisa's law\" adding clarifying language to a school safety bill passed earlier.\n- **SB 185**: Bill banning state funds for gender-affirming care for transgender prisoners, prompting a walkout by Democratic lawmakers in protest.\n- **SB 214**: Bill requiring paper ballots in elections, which will have to wait until the next session since it missed the crossover day deadline.\n\n**Bills Introduced (First Reading)**: No new bills mentioned.\n\n**Notable Moments**:\n- Emotional testimony from a legislator about their child's fear of school shootings.\n- Georgia First Lady Marty Camp joined the session to discuss the 988 mental health crisis hotline.\n- Walkout by Democratic lawmakers in protest of SB 185.\n- Recognition of longtime legislative cameraman Wesley Nichols for his 25 years of service.\n\n**Votes**:\n- **HB 397**: Passed 33-23 along party lines.\n- **SB 17**: Passed unanimously.\n- **SB 185**: Passed, prompting a Democratic walkout.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The session details do not mention a specific adjournment time. The summary notes this was the 39th day of the legislative session, with 2 days remaining before the session ends.",
    "updated_at": "2026-02-12T01:29:54.237592+00:00"
  },
  {
    "video_id": "qP4FCXC9rxI",
    "url": "https://www.youtube.com/watch?v=qP4FCXC9rxI",
    "title": "Lawmakers Day 38 03/31/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session on Day 38 (03/31/25) of the Georgia legislative session saw heated debates on several bills, including the Pediatric Safe Storage Act (HB 1), a bill banning transgender athletes from female sports (SB 1), and a bill creating financial incentives for local school boards to approve charter school petitions (SB 82). The session also included the recognition of 33 Black legislators elected during Reconstruction and the consideration of the state's fiscal year 2026 budget.\n\n**Key Actions**\n- **HB 303**: Bill to place a memorial on Capitol grounds honoring 33 Black legislators elected in 1868 during Reconstruction.\n- **SB 93**: Georgia Early Literacy Act, creating new guidelines for teaching reading to young students.\n- **SB 1**: Bill banning transgender girls from participating in girls' sports and requiring changing rooms to be separated by sex assigned at birth. Passed 100-64.\n- **SB 82**: Bill creating financial incentives for local school boards to approve petitions for new charter schools and penalizing school systems that repeatedly deny charter school proposals. Passed 107-62.\n\n**Bills Introduced (First Reading)**\n- None mentioned\n\n**Notable Moments**\n- Before the presentation of HB 268 (school safety bill), Senator Bill Callisert read the names of Appalachia High School shooting victims and asked for a moment of silence.\n- Democrats opposed SB 1, calling it a \"manufactured crisis\" and criticizing the bill for targeting individuals rather than addressing real problems.\n- Republicans argued that SB 1 protects the integrity of women's sports and ensures fair competition.\n\n**Votes**\n- HB 268 (school safety bill): Passed 45-9\n- SB 1 (transgender sports ban): Passed 100-64\n- SB 82 (charter school incentives): Passed 107-62\n\n**Attendance**\n- Quorum was present for the proceedings.\n\n**Adjournment**\n- The session adjourned for the day, with committees scheduled to meet the next day and the House and Senate floor sessions scheduled to resume on Wednesday.",
    "updated_at": "2026-02-12T01:30:35.259674+00:00"
  },
  {
    "video_id": "AF6hy5gyg6U",
    "url": "https://www.youtube.com/watch?v=AF6hy5gyg6U",
    "title": "Lawmakers Day 36 03/27/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 36 03/27/25 session:\n\n**Overview:** The session was marked by several notable actions, including passing bills to allow terminally ill patients access to experimental treatments, create a scholarship grant program for youth in foster care, and codify access to in vitro fertilization. There was also debate over a bill to criminalize artificial intelligence videos designed to interfere with elections, and a partisan resolution to investigate alleged illegal campaign contributions by the New Georgia Project.\n\n**Key Actions:**\n- **SB 72:** Allows terminally ill patients to access experimental treatments\n- **SB 85:** Creates a scholarship grant program for Georgia youth in foster care\n- **SB 233:** Adds individuals with first-hand experience with addiction to the Behavioral Health Reform and Innovation Commission\n- **SB 9:** Criminalizes artificial intelligence videos designed to interfere with elections (passed 152-12)\n- **SB 69:** Sets regulations around third parties financing lawsuits (passed 98-69)\n- **SB 105:** Allows veterinarians to give pet health advice\n- **HB 428:** Codifies access to in vitro fertilization\n\n**Bills Introduced (First Reading):**\n- HB 106, HB 310, HB 423, HB 60\n\n**Notable Moments:**\n- Visit from the House Speaker's chief of staff, Terry England, who was recovering from a farming accident\n- Debate over SB 9, with arguments that ensuring election integrity is the \"most important thing\" lawmakers can do for constituents\n\n**Votes:**\n- SB 9 passed 152-12\n- SB 69 passed 98-69\n- SB 105 passed unanimously\n- HB 428 and an amendment to raise the governor's salary to $250,000 passed 45-10\n\n**Attendance:** Quorum present\n\n**Adjournment:** Session adjourned, next session scheduled for the following day.",
    "updated_at": "2026-02-12T01:30:49.854314+00:00"
  },
  {
    "video_id": "542UQz88d18",
    "url": "https://www.youtube.com/watch?v=542UQz88d18",
    "title": "Lawmakers Day 32 03/18/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Overview:\n- The Georgia General Assembly session on Day 32 (March 18, 2025) saw the introduction of several bills and resolutions, including some controversial measures.\n- The session featured debates over bills related to maternal mortality, tax relief for timber farmers, and expanding farmland ownership, as well as resolutions praising Republican politicians.\n\nKey Actions:\n- **HB 111**: Allows the Maternal Mortality Review Committee to access psychiatric and medical records related to maternal mortality cases, in an effort to lower the state's maternal mortality rate.\n- **HB 223**: Provides tax relief for timber farmers who suffered economic losses from Hurricane Helene.\n- **HB 90**: Allows farmers to own up to 4,000 acres of farmland and receive lower tax rates, pending voter approval to change the state constitution.\n- **SB 6**: Allows the sale of fentanyl test strips to the public and excludes them from drug paraphernalia classification.\n- **SB 55**: Requires companies to pay Georgians with intellectual disabilities at least the minimum wage, phasing out sub-minimum wage programs.\n\nBills Introduced (First Reading): None mentioned in the transcript.\n\nNotable Moments:\n- Governor Kemp appointed Barbara Rivera-Holmes as the new Commissioner of Labor, replacing the late Bruce Thompson.\n- The Senate debated and passed resolutions praising former Congressman and current VA Secretary Doug Collins, as well as President Donald Trump, despite some Democratic opposition.\n\nVotes:\n- **HR 32 and HB 90**: Passed unanimously\n- **SR 245 (Doug Collins)**: Passed\n- **SR 246 (Donald Trump)**: Passed along party lines 31-18\n\nAttendance: No quorum notes mentioned.\n\nAdjournment: The session adjourned, with the House and Senate scheduled to reconvene on Thursday.",
    "updated_at": "2026-02-12T01:31:06.597713+00:00"
  },
  {
    "video_id": "YFYGJ2MOBuA",
    "url": "https://www.youtube.com/watch?v=YFYGJ2MOBuA",
    "title": "DBHDD Commissioner on Georgia's Mental Health Issues",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\nThe key highlights from this session with Georgia Department of Behavioral Health and Developmental Disabilities (DBHDD) Commissioner Kevin Tanner include the agency's role in forensic services, the challenges with limited state hospital beds, and new initiatives to address the needs of individuals with intellectual and developmental disabilities (IDD) who end up in emergency rooms.\n\nKey Actions:\nNo bills were discussed or passed in this session.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Commissioner Tanner explained DBHDD's responsibility for determining competency to stand trial and restoring competency for those found incompetent.\n- He noted the lack of state hospital beds, with nearly 800 individuals in jail waiting for a bed, and the long wait times of over a year on average.\n- Tanner discussed plans for a new 16-bed crisis stabilization and diagnostic center for the IDD population, which will provide comprehensive medical and psychiatric care.\n- He also mentioned opening pilot group homes to step down individuals from hospitals and getting approval from CMS for new Medicaid placement options for the \"hard to place\" IDD population.\n- Tanner highlighted workforce challenges, with DBHDD losing over 1,200 employees during COVID, and efforts to boost recruitment and retention, including partnerships with universities.\n\nVotes:\nNo votes were mentioned.\n\nAttendance:\nNo specific quorum notes were provided.\n\nAdjournment:\nNo adjournment information was given.",
    "updated_at": "2026-02-12T01:31:20.756051+00:00"
  },
  {
    "video_id": "7Fysv8lhZXs",
    "url": "https://www.youtube.com/watch?v=7Fysv8lhZXs",
    "title": "Lawmakers Day 30 03/11/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 30,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 30 03/11/25 session:\n\n**Overview:**\nThe Georgia House of Representatives passed the FY 2026 budget (HB 68), which includes an additional $500 million in education spending and $250 million more for the state's prison system. The session also featured recognitions, including celebrating a member's last radiation treatment and honoring the 50th anniversary of the Shepherd Center.\n\n**Key Actions:**\n**HB 68:** Fiscal year 2026 budget, passed 171-4. Includes $500 million more in education spending and $250 million more for the prison system.\n**HB 287:** Updated DNR fishing and hunting license regulations, passed unanimously.\n**HR 97 and HR 98:** Regulate sale and leasing of state property and non-exclusive easements, passed unanimously.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Member celebrated last radiation treatment for cancer.\n- House recognized 50th anniversary of Shepherd Center, which treats brain and spinal cord injuries.\n- Senate recognized Georgia lineworkers and named an interchange after a slain Roswell police officer.\n\n**Votes:**\n- HB 68 (budget): Passed 171-4.\n- HB 287, HR 97, HR 98: Passed unanimously.\n\n**Attendance:** Quorum present, no issues noted.\n\n**Adjournment:** Session ended for the day, with no floor activities planned for the next day. Both chambers to return on Thursday.",
    "updated_at": "2026-02-12T01:31:48.709282+00:00"
  },
  {
    "video_id": "JnHRDc7zItU",
    "url": "https://www.youtube.com/watch?v=JnHRDc7zItU",
    "title": "12/21/23 Joint Study Committee on Service Delivery Strategies",
    "chamber": null,
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "## Overview\n\nThis transcript appears to be from a joint study committee meeting on service delivery strategies in Georgia, with minimal substantive legislative activity. The key focus was on approving a list of seven recommendations, which was described as a framework for future legislation rather than legislation itself.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The committee members discussed establishing a quorum and technical difficulties with one member joining the virtual meeting.\n- The committee chair thanked the staff for their work in preparing the list of recommendations.\n- The committee adopted the list of seven recommendations unanimously.\n- The committee chair wished everyone a Merry Christmas at the end of the meeting.\n\n## Votes\nThe committee voted unanimously to adopt the list of seven recommendations.\n\n## Attendance\nThe committee had a quorum of at least five members, including the two co-chairs.\n\n## Adjournment\nThe meeting was adjourned after the vote on the recommendations. The next session date was not specified.",
    "updated_at": "2026-02-12T01:32:01.590061+00:00"
  },
  {
    "video_id": "b2MauceYMfc",
    "url": "https://www.youtube.com/watch?v=b2MauceYMfc",
    "title": "Lawmakers Day 26 03/03/25",
    "chamber": null,
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 26,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session featured passionate debates over bills related to transgender healthcare and book banning in libraries. Lawmakers also passed the amended mid-year budget and a bill to expand the definition of military bases.\n\n**Key Actions**\n- **HB399**: Requires out-of-state landlords owning over 25 single-family homes to have an in-state broker to manage tenant complaints.\n- **SB30**: Bans all hormone therapies and puberty blocking treatments for minors with gender dysphoria.\n- **SB262**: Bipartisan bill to preserve access to preventive healthcare services at no cost, in case the Affordable Care Act's requirements are removed.\n\n**Bills Introduced (First Reading)**\nNo new bills mentioned.\n\n**Notable Moments**\n- Emotional speech opposing efforts to \"erase\" transgender people.\n- Debate over allowing children currently on puberty blockers to continue treatment.\n- Discussion of a bill to punish librarians for providing \"sexually explicit or harmful materials\" to children.\n\n**Votes**\n- **SB30 (Gender Dysphoria Treatment Ban)**: Passed 34-19 along party lines.\n- **SB262 (Preventive Care Access)**: No vote count provided.\n- **Amended 2024-25 Budget**: Passed 55-1 in the Senate.\n\n**Attendance**\nNo explicit quorum notes.\n\n**Adjournment**\nNo adjournment time or next session date provided.",
    "updated_at": "2026-02-12T01:32:15.125117+00:00"
  },
  {
    "video_id": "6Ez7Rcdzd60",
    "url": "https://www.youtube.com/watch?v=6Ez7Rcdzd60",
    "title": "3/22/23 - Committee on Rules",
    "chamber": null,
    "session_type": "committee",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 68,
    "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Rules session:\n\n**Overview**: This was a busy rules committee meeting where the chair outlined the process for the day and upcoming rules committee meetings. The committee considered and passed numerous study committee resolutions.\n\n**Key Actions**:\n- **HR 256**: Resolution to create a study committee on expanding early learning in Georgia\n- **SR 121**: Resolution to create a study committee on learning loss and impacts of COVID-19 on students\n- **SR 155**: Resolution to create a study committee on issues facing the trucking industry\n- **SR 203**: Resolution to create a study committee on pediatric safe storage of firearms\n- **SR 273**: Resolution to create a study committee on EMS reform\n- **SR 275**: Resolution to create a study committee on workforce development\n- **SR 282**: Resolution to create a study committee on foster care and adoption\n\n**Bills Introduced (First Reading)**: None noted\n\n**Notable Moments**:\n- The chair outlined the process for the day, noting they would set the calendar for the next rules committee meeting rather than letting members pick bills.\n- There was some discussion about potentially pulling certain study committee resolutions if related legislation was already moving, but no resolutions were ultimately pulled.\n\n**Votes**: No recorded votes noted.\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: Not specified, but the next rules committee meeting was scheduled for the following day or Friday morning.",
    "updated_at": "2026-02-12T01:32:29.362486+00:00"
  },
  {
    "video_id": "SbawhQHbHB4",
    "url": "https://www.youtube.com/watch?v=SbawhQHbHB4",
    "title": "Sen. James Press Conference on HOA | 02/10/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 22,
    "summary": "Here is a summary of the key points from the Georgia Senate session on HOA oversight on 02/10/2026:\n\n**Overview**: This session focused on addressing issues with homeowner's associations (HOAs) in Georgia, with several state representatives and senators discussing proposed legislation to increase oversight and accountability of HOA boards.\n\n**Key Actions**:\n- **HB 1222**: Bill to create an HOA oversight commission and require training for HOA board members\n- **SB 107, SB 120, SB 406**: Bills addressing various HOA-related issues like payment allocation fraud, elections, and transparency\n\n**Bills Introduced (First Reading)**: No new bills were introduced, the focus was on the existing HOA-related legislation.\n\n**Notable Moments**:\n- Representatives shared numerous constituent stories of HOAs unfairly foreclosing on homes or seizing assets over unpaid fees/assessments\n- Calls for the legislature to pass \"real\" reform to protect homeowners' rights and the \"American dream\" of home ownership\n- Frustration expressed over years of advocacy with little action taken by the legislature\n\n**Votes**: No recorded votes, this was a press conference and discussion, not a legislative session.\n\n**Attendance**: No specific quorum details provided.\n\n**Adjournment**: No formal adjournment mentioned, this was an informal press conference.",
    "updated_at": "2026-02-12T01:32:42.943449+00:00"
  },
  {
    "video_id": "IhaDrMAlyGo",
    "url": "https://www.youtube.com/watch?v=IhaDrMAlyGo",
    "title": "Sen.Merritt Press Conference on GLBC Priorities | 02/02/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a structured markdown summary of the Georgia Legislative Black Caucus press conference on their 2026 legislative priorities:\n\n## Overview\nThe Georgia Legislative Black Caucus (GLBC) held a press conference to unveil their 2026 legislative priorities, which were shaped directly by the voices, needs, and lived experiences of the communities they serve. The priorities focus on key areas like economic justice, healthcare access, housing, voting rights, education, and criminal justice reform.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The GLBC chair emphasized the caucus' commitment to advancing justice, equity, and opportunity for all Georgians.\n- Rep. Jasmine Clark discussed the importance of the Georgia Civil Rights Act of 2026 (HB 670/SB 320), which aims to strengthen civil rights protections in the state.\n- Christopher Bruce of the ACLU of Georgia spoke passionately about the need to defend civil rights and liberties in Georgia.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nNo specific quorum notes.\n\n## Adjournment\nThe press conference concluded, but no specific adjournment time or next session date was provided.",
    "updated_at": "2026-02-12T01:33:08.974369+00:00"
  },
  {
    "video_id": "HbqHaEPNngU",
    "url": "https://www.youtube.com/watch?v=HbqHaEPNngU",
    "title": "Sen. Strickland Press Conference on Autism Legislation & Rio's Law | 01/29/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a structured markdown summary of the key details from the Georgia Senate Strickland Press Conference on Autism Legislation & Rio's Law on 01/29/2026:\n\n**Overview:**\nThe press conference focused on announcing the filing of Senate Bill 433, also known as \"Rio's Law\", which aims to create a specialty license plate to help law enforcement and first responders better identify and interact with individuals with autism or developmental disabilities during traffic stops and emergencies. The bill also requires basic training for Georgia peace officers on how to best interact with these individuals.\n\n**Key Actions:**\n**SB 433 (Rio's Law):** Creates a specialty license plate to help law enforcement and first responders identify individuals with autism or developmental disabilities, and requires basic training for Georgia peace officers on interacting with these individuals.\n\n**Bills Introduced (First Reading):** \n- SB 433 (Rio's Law)\n\n**Notable Moments:**\n- Senator Strickland shared his personal story of having a son with autism and the importance of acceptance and services for the autism community.\n- Layla Luna, founder of Jess B and mother of Rio (whom the law is named after), described a concerning traffic stop incident that inspired the creation of Rio's Law.\n- Connor Tomlinson, star of the Netflix show \"Love on the Spectrum\", spoke as an autistic advocate in support of the legislation.\n- Chairman Lumpston of the House pledged to champion the bill in the House, drawing on his own law enforcement experience.\n\n**Votes:** No votes were mentioned in the transcript.\n\n**Attendance:** No specific quorum details were provided.\n\n**Adjournment:** The press conference ended without a specific adjournment time mentioned.",
    "updated_at": "2026-02-12T01:34:04.410293+00:00"
  },
  {
    "video_id": "sqyGzosxE74",
    "url": "https://www.youtube.com/watch?v=sqyGzosxE74",
    "title": "Sen. Jones II Press Conference on Minority Party Priorities | 01/29/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a summary of the key points from the Georgia Sen. Jones II Press Conference on Minority Party Priorities | 01/29/2026 session:\n\n**Overview**:\nSen. Jones II outlined the Democratic caucus' legislative priorities for the current session, focusing on affordability issues for working families such as healthcare, childcare, housing, and taxation.\n\n**Key Actions**:\n- **SB 379**: Legislation to create a state-based premium tax credit to address the expiration of ACA tax credits\n- **SB 380**: Legislation to expand Medicaid in Georgia, led by Sen. David Lucas\n- **SB 408**: Legislation to sunset the tax exemption for data centers by 2027, led by Sen. Nanorock\n\n**Bills Introduced (First Reading)**: \n- SB 192 (from last session)\n- SB 379\n- SB 380 \n- SB 408\n\n**Notable Moments**:\n- Sen. Jones II criticized Republican plans to eliminate the state income tax, calling it a \"tax hike\" that would hurt working families.\n- The Democrats are also focused on issues like food insecurity, public education funding, and preventing mid-cycle redistricting.\n\n**Votes**: \nNo recorded votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nThe press conference concluded, but no information on the next legislative session date was given.",
    "updated_at": "2026-02-12T01:34:59.314558+00:00"
  },
  {
    "video_id": "oKMue-vyYGs",
    "url": "https://www.youtube.com/watch?v=oKMue-vyYGs",
    "title": "Sen. James Press Conference on Eric ID & Autism | 1/28/2026",
    "chamber": null,
    "session_type": "press",
    "session_year": 2026,
    "day_number": null,
    "video_date": null,
    "duration_minutes": 26,
    "summary": "Overview:\n- This press conference focused on two key legislative initiatives in Georgia: the Darren Lewis Saving Lives Act and Eric's ID Law, both aimed at improving public safety and protecting vulnerable populations.\n\nKey Actions:\n- None detected. This was a press conference to discuss proposed legislation, not an official legislative session.\n\nBills Introduced (First Reading):\n- **SB 419**: Eric's ID Law, modeled after a similar law in Maryland, to allow individuals with non-apparent disabilities to have an indicator on their driver's license or state ID to help inform law enforcement during interactions.\n- **HB 1011**: The Darren Lewis Saving Lives Act, proposed in response to the tragic death of Darren Lewis during a high-speed police chase in Savannah, Georgia.\n\nNotable Moments:\n- Emotional testimony from Kathy Lewis, the widow of Darren Lewis, about the loss of her husband.\n- Remarks from Senator Donzella James about the prevalence of autism and the need to protect individuals with non-apparent disabilities, including her own grandson.\n- Introduction of Eric, a young man with high-functioning autism, who will speak about his experience and the inspiration behind \"Eric's ID Law.\"\n\nVotes:\n- No votes were taken, as this was a press conference, not an official legislative session.\n\nAttendance:\n- No specific quorum or attendance details provided.\n\nAdjournment:\n- The press conference concluded, but no information on the next legislative session date was provided.",
    "updated_at": "2026-02-12T01:36:15.713992+00:00"
  },
  {
    "video_id": "uwaVfaHfzwM",
    "url": "https://youtu.be/uwaVfaHfzwM?t=1706",
    "title": "Georgia House - Day 40 (2026-04-04)",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 40,
    "video_date": "2026-04-04",
    "duration_minutes": 213,
    "summary": "## Georgia House - Day 40 PM Session Part 1 (April 4, 2026)\n\n### Overview\nAfternoon session continuing the final day of the 2026 legislative session. Marathon session with extensive bill passage and conference committee reports.\n\n### Key Legislation\nThis session included passage of numerous bills through Senate substitutes and conference committee agreements, including:\n\n- Tax and budget-related measures\n- Education policy updates\n- Healthcare regulations\n- Criminal justice reforms\n- Local government bills\n\n### Session Characteristics\n- Fast-paced voting on final bills\n- Multiple conference committee reports\n- Senate substitute agreements\n- Sine Die preparations\n\n### Notes\n- Part 1 of the extended afternoon/evening session\n- Members working through backlog of legislation before midnight deadline",
    "updated_at": "2026-02-11T21:09:10.800432+00:00"
  },
  {
    "video_id": "__j1Tuf4wKU",
    "url": "https://youtu.be/__j1Tuf4wKU?t=1038",
    "title": "Georgia House - Day 40 (2026-04-04)",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 40,
    "video_date": "2026-04-04",
    "duration_minutes": 227,
    "summary": "## Georgia House - Day 40 PM Session Part 2 (April 4, 2026)\n\n### Overview\nLate evening session completing the final day (Sine Die) of the 2026 Georgia legislative session.\n\n### Key Actions\n- Final passage of remaining conference committee reports\n- Last-minute amendments and bill reconciliations\n- Closing speeches and recognitions\n- Sine Die adjournment proceedings\n\n### Sine Die Traditions\n- Final recognitions of departing members\n- Thank you speeches to staff and leadership\n- Ceremonial closing of the session\n\n### Session Characteristics\n- Extended session pushing toward midnight deadline\n- Historic legislation finalized\n- 2026 session officially concluded\n\n### Notes\n- Marks end of 40-day legislative session\n- Members return to districts until next session",
    "updated_at": "2026-02-11T21:09:10.800432+00:00"
  },
  {
    "video_id": "C-QrVR4LrRI",
    "url": "https://youtu.be/C-QrVR4LrRI?t=636",
    "title": "Georgia House - Day 40 (2026-04-04)",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 40,
    "video_date": "2026-04-04",
    "duration_minutes": 138,
    "summary": "## Georgia House - Day 40 AM Session (April 4, 2026)\n\n### Overview\nOpening morning session of the final day (Day 40) of the 2026 legislative session. Heavy focus on morning orders, recognitions, and beginning bill passage.\n\n### Key Legislation Passed\n- **HB 582**: Allows abuse victims to present evidence in defense; includes HB 384 defining police oath violations as felonies/high aggravated misdemeanors\n- **HB 266**: Major veterans tax relief - virtually eliminates state income tax on veteran retirement income; includes police foundation tax credits\n- **HR 7**: Road naming resolution honoring George A. Seat True Locke Jr. (amended to add HR 328 for Chief Jeffrey E. Turner I-75 dedication)\n\n### Morning Orders & Recognitions\n- **Pastor Jay Williams** (Chaplain): Reflected on significance of 40-day sessions, compared to biblical 40-day periods\n- **Rep. Stetson**: Thanked colleagues for support during cancer treatment; recognized new Macon County Sheriff Carlo Spelton\n- **Spelman College Glee Club**: Celebrated 100th anniversary\n- **Kindle Ray Johnson**: Recognized as youngest certified farmer in the USA\n- **Ocarian Dwight Perry Memorial**: Ice cream truck safety legislation (HR) in his memory\n\n### Announcements\n- Rules Committee meeting at 1:30 PM (Room 341)\n- Intergovernmental Coordination Committee in Room 406\n- First Annual Sine Die Block Party in Liberty Plaza (1-6 PM)\n\n### Session Notes\n- Final day atmosphere with celebrations and recognitions\n- Multiple family visitors in gallery for Sine Die",
    "updated_at": "2026-02-11T21:09:10.800432+00:00"
  },
  {
    "video_id": "O1Uf8jr9m48",
    "url": "https://youtu.be/O1Uf8jr9m48",
    "title": "Georgia House - Day 2 (2026-01-12)",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 2,
    "video_date": "2026-01-12",
    "duration_minutes": 56,
    "summary": "## Georgia House of Representatives - Day 2, 2022 Session (January 12, 2022)\n\n### Overview\nSecond day of the 2022 session, the morning after Georgia Bulldogs' national championship victory. Session opened with championship game highlights played in the chamber.\n\n### Key Actions\n- **SR 362**: Joint resolution notifying Governor that General Assembly has convened (adopted)\n- Committee of Notification appointed (8 members including Rep. Meeks, Rep. Bonner, Chairman Hogan)\n\n### Bills Introduced (First Reading)\n- **HB 870-874**: Local bills for Bullock County Board of Commissioners, Bullock County Board of Education, Bibb County redistricting\n\n### Morning Orders & Memorials\n- **Officer Ricky Tottenson**: Moment of silence for Newton Police Department officer (18-year veteran, school resource officer known as \"Officer T\") who died in the line of duty\n- Coweta delegation presented the memorial\n\n### Announcements\n- **Local Redistricting**: Chairman Tankersley reminded members about January 7th memo on local redistricting procedures; bills affecting 2022 elections should pass by first week of February\n- **Senator Cleveland Memorial**: Originally scheduled for Friday, postponed to April\n- **Keep Georgia Wild Day**: Scheduled for January 13th in the rotunda at 9 AM with Governor and conservation groups\n- **State of the State**: Governor's address scheduled for Thursday, January 13th\n\n### Notable Moments\n- Championship game celebration video played at session opening\n- Speaker joked about Rep. Gullet attending a different bowl game (and losing)\n- Birthday recognition: Chairman Jan Tankersley\n\n### Adjournment\nAdjourned until Thursday, January 13th at 10 AM (State of the State day).",
    "updated_at": "2026-02-11T21:09:11.287288+00:00"
  },
  {
    "video_id": "N7E6qiANoVU",
    "url": "https://youtu.be/N7E6qiANoVU?t=1393",
    "title": "Georgia House - Day 1 (2026-01-10)",
    "chamber": "house",
    "session_type": "regular",
    "session_year": 2026,
    "day_number": 1,
    "video_date": "2026-01-10",
    "duration_minutes": 51,
    "summary": "## Georgia House of Representatives - Day 1, 2022 Session (January 10, 2022)\n\n### Overview\nOpening day of the 2022 legislative session, notable for coinciding with the Georgia Bulldogs' national championship football game.\n\n### Key Actions\n- **HR 568**: Notified Senate that House has convened\n- **HR 569**: Called joint session for Governor's address (scheduled for Thursday at 10:45 AM)\n- **HR 570**: Established session schedule - out Tuesday (Jan 11), reconvene Wednesday at 11 AM, Thursday/Friday at 10 AM, then budget hearing recess\n\n### Bills Introduced (First Reading)\n- **HB 843**: Property tax exemptions amendment\n- **HB 846-849**: Traffic/road safety and child abuse reporting\n- **HB 850**: Holiday observances\n- **HB 851-853**: Inmate policies and detention conditions\n- **HB 854**: Incorporation of City of Buckhead\n- **HR 529**: National Park Services concerns\n\n### Notable Moments\n- Rep. West Cantrell (term-limited after 8 years) delivered scripture reading from Romans 12\n- Multiple references to Georgia Bulldogs championship game that evening\n- Birthday recognitions: Rep. Karen Bennett, Rep. Betsy Holland, Rep. Beth Camp, Rep. Wiltson, Rep. Derek Jackson\n\n### Attendance\nFull session, journal confirmed without objection.\n\n### Adjournment\nAdjourned until Wednesday, January 12th at 11 AM to accommodate championship celebrations.",
    "updated_at": "2026-02-11T21:09:11.287288+00:00"
  }
]