{
  "video_id": "vPTcXEqFTgE",
  "url": "https://www.youtube.com/watch?v=vPTcXEqFTgE",
  "title": "Senate PM 4 Day 40 of the 2025 Legislative Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 108,
  "summary": "Here is a summary of the key points from the Georgia Senate PM 4 Day 40 session transcript:\n\n**Overview:**\nThe session included discussions and actions on several bills, including HB 224, HB 296, HB 491, HB 516, SB 101, SB 12, and SB 207. There was also a drawing for a sportsman caucus shotgun or pistol, with one senator winning the ticket. The governor made remarks highlighting the state's investments, tax cuts, and partnership with the legislature.\n\n**Key Actions:**\n**HB 516:** Allows county regional library boards and community service boards to conduct meetings through teleconferencing, with certain public access requirements.\n\n**Bills Introduced (First Reading):**\nNo new bills were explicitly introduced during this transcript.\n\n**Notable Moments:**\n- Sportsman caucus drawing for a shotgun or pistol, with one senator winning the ticket.\n- Governor's remarks highlighting legislative achievements, investments, tax cuts, and partnership with the legislature.\n- Debate and amendment process for HB 516 regarding public meetings and tax-exempt bond validations.\n\n**Votes:**\nNo recorded votes were included in the transcript.\n\n**Attendance:**\nThe transcript does not provide any specific quorum or attendance details.\n\n**Adjournment:**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Thank you, Mr. President. I'm here to tell you that the Senate has done it again. We have won! We did the drawing for the sportsman caucus drawing for a shotgun or pistol. One of the all senators won the ticket. They all want to know who it is. I know that this senator will use this shotgun or pistol. Pretty regular. At this time, I'm going to ask the senator from the 11th to step up here. All right, before I give him this ticket, we did so well on selling the tickets that we did a second drawing. But our senator will get the ticket first. The left overs will go to the house. Senator, congratulations. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. All right. If everyone can take their seats, the governor is making his way over to the house. Take their seats. That would be great. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you all very much. Thank you, Lieutenant Governor Jones. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nI've million dollars each year and I know we're all very proud of the much needed relief that we are sending the victims of Hurricane Helene. We have supported legislation to strengthen our workforce and not only to keep us the number one state for business but make us the top state for talent. And together we have achieved something that no other general assembly has done in over a generation and that has passed meaningful tort reform. And I know that fight was hard. Those debates were fierce but I believe at the end of the day we have a common sense, comprehensive piece of legislation that keeps our state moving in the right direction. And while tort reform may have been controversial, some people fought others against it. One thing we can all agree is that we didn't want to have a special session. I also want to thank you for your work on getting the FY 2026 budget passed. Chairman Tillery, thank you for your leadership. I know it was not an easy year and we appreciate you and the subcommittee chairs and the Senate's work on the budget. Included in that budget are strategic investments that make our state stronger and further develop our infrastructure. And through these investments the state is doing all we can to keep people working all across our state. And while we are also returning tax dollars where they belong and our people's pocket. Other states out there are raising taxes on their citizens just to make ends meet. California, New York and Maryland. But not here in Georgia, here in the best state for business we budget conservatively. That's why we're able to make historic investments without increasing debt. We're able to do a third tax rebate and cutting taxes while we're at it. Thankfully like much years in the past and throughout my second term. The partnership and thoughtful coordination between the Senate, the House and my office has benefited the people of our state. And put Georgia on a path to prosperity and opportunity. And hope is that we continue that successful streak which has benefited hard work in Georgia's most of all. As this seventh session during my time in office draws to a close. I want to thank you all for your contributions and your hard work. Marty and the girls and I are grateful for your service to our fellow Georgians. Thank you all. Good luck, the rest of the night and God bless you for what you do. Have a good evening. Thank you. You have a good evening. Thank you. Thank you. Thank you. Thank you. Recognize the senator from the 30 cars. Mr. President, I ask the House bill 516 be removed from the table. Secretary, read the caption. House bill 516, the new, the 40th and others. We will act to amend the 1010-15. The official go to the meeting. To the public limitation on action to contest agency action. Recording notice of time and place and access to minutes and for other purposes. Mr. President, Senate committee. Is there objection? The House bill has the 16th. The new, the 40th and others. To amend the 1010-15. The official go to the meeting. To the public limitation on action to contest agency action. Recording notice of time and place and access to minutes and telecomers. The meeting is a telecomer. I for later matters. Mr. President, Senate committee on state and government operations. General recommends this bill do pass by. Substitute. Subsequently, it is amended. Senator Dixon, chairman. Mr. President, Senate committee. The state and government operations. Oppers. The following. Substitute to House bill 516. The bill is an act to amend. Code section 15-14-1. The official go to Georgia. And to the meeting. To the public. And for other purposes. Mr. President. Senator Amitari, 31st and others. Offered the following amendment. Number 1. They are elected representatives. And may approve the issuance of certain private activity bonds. To establish procedures for public notices and hearings. To such bonds and other purposes. Mr. President, I can please the order. I am Senator from 31st. Theelected representative.林. The president and House Bill 516 basically allows county regional library boards and community service boards. conduct meetings through teleconferencing. This bill requires the meetings to be held at a physical location at least 50% of the board members, physically present, and that they should provide one or more methods of public viewing for such meetings and provide commentary at such meetings without physically being present at the meetings. I'll yield for questions. No questions, Senator. Thank you, Mr. President. I recognize Senator from the 37th speech of the amendment. Is there a center from 37th around here? Senator from the 31st, would you like? Okay, never mind. There he is. I'm old Senator. Got an amendment here. Thank you, Mr. President. Ladies and gentlemen, Senate, amendments to HB516 and amendment 2, is the one we're speaking to, amendment 1 is going to be withdrawn. Amendment 2 essentially just takes an administrative hearing that has to happen. When we do tax exempt bonds, there's got to be an executive agency that validates the public purpose. Senator from the 31st, just presented the bill, Senator. Parliament are inquiring. Statue are inquiring. How are we presenting a amendment when we haven't presented the bill? The senator right there from 31st just presented the bill, Senator. Keep up in here, rules, chairman. Come on, in begin. Yes, sir. Elementary inquiry. Statue are inquiring. What bill is the gentleman trying to amend? Because the sheet that we have, the yellow sheet says he's trying to amend House Bill 296, which is the next bill. Okay, we're all confused over here, Mr. Prello. The amendments to 516 are in the book. Thank you, Mr. President. Bring it before you, amendment AM490273. HB516. It's amendment number two. Amendment number one is going to be withdrawn. What this simply does is when there's a charter schools built, because it's for a public purpose, they're eligible for tax exempt bonds. Our IRS code requires two validations happen when tax exempt bonds are issued. There'll be an executive branch validation, and there'll be a judicial branch validation. What this simply does is for charter schools with statewide attendance it allows the Attorney General's Office to do the executive branch validation of the public purpose. That's all it does, Mr. President. Yeah, no questions, sir. There's any other senator we're speaking for. You you senator from the 31st you want to close the debate. Once you close the debate clear clear by the up here. Thank Mr. President. I know we just had dinner, but we may need that Larry Walker power hour. So senator from the 20th you may need to get up and get this crowd going. I presented the bill. The amendment is friendly, vote green on both amendments. Thank you, Mr. President. All right. Recognize senator from the 31st. This president withdraw amendment number one. All right, is there objection to that? Without objection amendment one is withdrawn. Now we're on to amendment two. Is there objection to amendment two? Hearing none, amendment two is added. Questions only adoptions of the committee substitute as amended. Is there objection to the adoption of the committee substitute as amended? Hearing none, the committee substitute as amended is adopted. Is there objection to agree into the board of committee, which is favor to the passes of the bill? Chair here is none. The board of the committee is agreed to. Is there objections to the main question being ordered? Chair here is none. The main question is ordered. The question is on the passes of the bill by substitute. All those in favor with the bill will vote. Yeah, you pose name secretary on the line with the machine. You may vote. Owned the passage of 516 to yeas, Our 49th and a's are won. This bill haven't received the requisite constitutional majority. is therefore passed by substitute. Recognize the senator from the 29th. I ask for unanimous consent to lift House Bill 296 from the table. Secretary Reedicat. House Bill 296 of our representative gains the 120th and others built between Title IX to amend Article 2, Chapter 5, Title 40. The first, the court of Georgia and the table lead to issuance expiration and renewal of driver's licenses. This is a request for the representative of the driver's license and it's certain electronic format that satisfies the requirements of his assets of driver's license while operating a motor vehicle to prohibit the compelling of a license seat to reduce wireless to medication device to law enforcement officer and further purposes. Mr. President, that completes the order. Is there objection? Here, now, I recognize senator from the 29th. Oh, I'm sorry. Go ahead and finish the caption and then senator. House Bill 296, whoever's under gains the 120th and others built between Title IX to amend Article 2, Chapter 5, Title 40. The OCEGA related to issuance expiration and renewal of driver's licenses, right, that the presentation of driver's license and its certain electronic format satisfies the requirement to possess a driver's license to operating a motor vehicle to prohibit a compelling of a license seat to reduce the wireless telecommunications device to law enforcement officer and further purposes. Mr. President, that's an important and public safety recommend this bill to pass. This is exactly submitted. Senator Albers, chairman. Mr. President, Senator Strickman, the 42nd Office of the following amendment, number one, to amend House Bill 296 by inserting after a four months, the line 14, the following, to amend, code section 48, dash five to see, dash one of those to GA will be to alternative ad-vorm taxation of motor vehicles and Title Ad-vorm tax fee. So as to provide for an alternative method for payment of ad-vorm tax, we're certain modified rental vehicles, driver definitions, by inserting after line 111, the following and further purposes. Mr. President, Senator Couser, the 46th Office of the following amendment, number two, to amend House Bill 296 by placing line 8 with the following lifetime sportsman's license to amend, code section 33, dash 28, the Fisher code George annotated to request by claimant for information as to the name, ensure a name of each and shirt and a limited coverage shows to revise the disclosure requirements to an article to chapter 5 and Title 40, the official code by inserting between on 68 and 69, the following and further purposes. Mr. President, that completes the order. I recognize the center from the 29. Thank you, Mr. President. Mr. President, I acknowledge that this is a piece of legislation that was brought last year. I had some concerns about it as related to using electronic drivers licenses on traffic stops. and Representative Gaines has worked on this legislation and got it to where I think it's productive and again moving law enforcement and to the age of technology. I want to be clear, these types of IDs based on this legislation, as it says today, would not be accepted when you go to vote. You would still have to have the hard copy of your driver's license so that it can be properly scanned the way it needs to be scanned today. But what this does do is allow the citizens to use an electronic driver's license as they operate their motor vehicle. It would give the law enforcement agencies until July of 2027 to obtain the devices needed to read these driver's license. And it would protect the individual so they would not have to surrender their phone to the agency that is conducting the traffic stop. There are two amendments added on this legislation. I've been advised that the authors of those amendments will come forward, discuss those amendments and defend those amendments. I would ask for a favorable consideration to HB 296 as presented. Again, last year I had some concerns about it and I want to thank the good representative from Athens for the hard work he put into getting this and the way it needs to be. And with that Mr. President, I'll yield the will. Senators yielded. I recognize the center from the 42nd. Speak to his amendment. That's right. Thank you Mr. President. Mr. President, amendment 1 is actually House Bill 66 that passed out the House. I believe it was 171 to 2 or 3. It was an animus out of the Senate Finance Committee as well. So it's not something coming to you new for the first time. It just did not get to the floor yet today. This section deals with the current law we have for four higher charter buss or motor coaches. That's current law. Even though it's being restated, we had to restate that to add the new section here. And this is just saying for the TA VT tax. Under existing law, these companies that rent out these vehicles get to divide their tax payments in half and pay it over two payments. And there's a loophole currently where there's a company in Georgia that does modification of vehicles. And they rent those out, especially in the film industry in our state. And this makes certain that we put in code that for these modified vehicles, they're also being rented out in the same way. They get the same advantage. They still pay the same amount of tax, but you get to divide those payments up since they are also renting out vehicles. So it's nothing that hasn't been vetted by both bodies at this point. It's just coming back as an amendment here. This is House Bill 66 originally. Happy to take any questions. Senator from the, a young lady every question, Senator. Or Senator from 14th, I'm sorry. You don't have a question. It's on a minute. Okay. Senator from the, 55th, I'm sorry. Mr. Gentlemen, you? Yes, sir. Are you speaking to, what's your man meant to you speaking to? Is that 14, 0492 or 0135? No, sir. It's 0135, amendment 1. And I do want to separate, well, the dress, amendment 2 in a second. Amendment 1, though, again, is the one I was referencing that was a House Bill that was vetted in committee on this side as well. Okay. And with the gentleman, further you? Yes, sir. Can you, in essence, give me two sentences as to why? Yes, sir. And I don't want to completely repeat myself, but this is under current law. You'll see in this section, we had to restate it because we had to strike and add one thing to it. Current law says that these four-hour charter buses and motor coaches, they still pay the same TAVT tax, but they get to devide it over two payments. Okay. They were now including another company that didn't quite qualify for that or another type of industry where they're modifying these vehicles and ran them out. The same way that is don't qualify under the current code, so it's meant to be clean up to capture the same spirit of the current law. They say the same tax, it is devide the payments, so it's not the same. Just bleeding the payments. Yes, sir. Yes, sir. Thank you, sir. Thank you. Senator, on 30th. Jim and Yield. Yes, sir. This question was going to be meant for the last presenters. I'm hoping maybe you can help me on this. Any idea how much it's going to cost local law enforcement agencies to buy this equipment to read the new electronic version on the cell phone? I don't know where the other presenter will. I don't know. The underlying bill is not my bill, so I don't know. My section cost is nothing. Why is the final turn here? I thought maybe you would know all the answers to the bill. The country lawyers are always the best man. I always appreciate your thing that you do. Thank you. I'll say if I don't know the answer. I don't know on that. Perfect. Thanks. All right. Thank you. Senator. Yeah, you go. Amendment one, ask for your support. Thank you. We're going to ask the senator from the 46th speech of the second amendment. Thank you. Thank you, Mr. President. Ladies and gentlemen, this is another bill, light and evening. I intended to put on the MoPED bill, representing the claim. It was requiring you to have the minimum limits of insurance. But it fits here since this bill's insurance requires if requested by a claimant, insurance company must confirm that they have obtained the minimum statutory required coverage. I would appreciate your consideration and passage of this. Senator from the 42nd. The senator, you. I you. I heard the presentation, but actually aren't you striking on line 15 under current law all the way it works when insurance company may have a liability, they have to give the limits of the coverage to a claimant. Aren't you striking that? And they can still give the copy of their declaration's page. And obviously the full coverage can be discovered in discovery and litigation if litigation commences. Do you further yield? Yes. So if your amendment passed, you actually have to get in litigation before you find out the limits of coverage. Now you don't have to. If you made a settlement offer, you can make a condition upon disclosing the policy limits or that you accept only the policy. Limits over another amount. You first keep people from basically targeting deep pocket folks with insurance. Do you further yield? I yield. But to be clear, you're making it where the current law says the claimant gets to see a limit of coverage. Now, the no longer will see that. They'll just see if there's a minimum coverage sprout about law. Isn't that correct? That's correct. Unless they disclose further that they give the declaration's page could show it. Do you yield for a couple more? One more. And this amendment we see coming at 815 or 816 on day 40 was ever filed as a bill and heard any committees this entire session. I'm not aware if that was in the house bill or not. Of course yours was your amendment was filed at 814. So I mean, I'm a minute behind you. You beat me to the box. The fair is a tree of my amendment was a house bill that passed the house with over 170 votes, was unanimous in the finance committee. And this Senate as well, correct? That's fair, but that was a tax bill went to our finance committee got vetted and rejected. It's not true. It was unanimous in our committee. Are you all in that committee? I don't see it on our calendar. You voted for it. But I don't see it on the rules calendar. It is. Well, then let's wait on it. I think we're done. Recognize the centrum from the 55th. With a gentleman yield. A yield. You are striking disclosure of the limits of coverage and stating I quote a statement simply that the coverage provides at least a minimum required coverage required. Is it not true that most policies are only required for $25,000? That's true. And this guarantees a sure that that's done. So all this says is there is in fact insurance. Is that not a fair statement? Of the type of power ball law. What about the instances where, for example, I had a client to come in recently that had $240,000 with the medical records. And would it not be true that I would have to litigate just to find out that there was only $25,000 with the insurance that's going to cost more litigation? Is that a fair statement? That is not a fair statement. You could demand the policy limits in a settlement and require them to verify that as it's routinely done. But when the current law is when we demand the policy limit, we have to at least know what to demand in order to implicate a number of other safeguards, for example, bad faith. Are you basically saying now that we don't have to, all you're saying, are you basically saying that all you have to now do is say I have insurance in response to this code section, but not in response to your settlement demand. If you made a demand for policy limits, they would have to confirm that. But you're now going to require me to make a demand for policy limit and I won't know until I litigate whether or not I'm even going to recover $25,000 if I have $200,000 with the medical. I'm sure you don't have to litigate to get that. You can make your settlement demand to the company for $250,000 or your policy limits, whichever is higher. And so, routinely, I answer the policy demand today during our break that was worded that way. With all due respect to the gentleman, what is the genesis? Why do we need to now not disclose how much insurance do we have? Because so many people are getting sued because they're known as a deep pocket. We've talked about premises liability and here ad nauseam on other things. And if that's the reason they're being sued because they have assets or insurance, that's a deterrence to be inadequately insured. Thank you. Thank you. Mr. Jettelman. Mr. Jettelman. Mr. Jettelman. Senator, are you on the speak? You want to speak to the amendment? Breaking out of Senator front of 50th. I thought you sounded that question. Let him introduce. Thank you, Mr. President. This is a very interesting and later-riving amendment. I don't think it was thoroughly explained. We passed the bill earlier dealing with the civil litigation system. And one of the things we heard from our constituents is we don't want frivolous lawsuits being filed. We're tired of all this litigation. And I know defense attorneys that believe in what they pass know that litigation is going to slow down in the state of Georgia because we did pass the comprehensive bill. What this amendment does is assures that litigation is going to be filed. And I'm surprised there are defense attorneys that are bringing this because what this does is say, I don't have to tell you how much insurance I have. If you want to know, you got to file. You got to file lawsuit. You got to get it in discovery. And then I'll tell you, so out of court settlements are going to be gone.\n\nYou won't be able to settle out a quarter of this goes through because it's called Hide the Ball, No Transparency with Insurance Company Amendment. That's what you should call this. It's a Hide the Ball, No Transparency with Insurance Amendment. I'm going to ask you guys to vote this down. This will just allow insurance companies not to be transparent with people they injure and it will cause more litigation. I yield the well. Does any other senator's senator from the 55th you'd like to speak to the bill? All right, all right. You yield senator. You yield. All right, senator from the 29th would you like to close debate? Senator from the 29th would you like to close debate? All right. Thank you, Mr. President, to my good friend from the 30th. Basically, these drivers licenses are read on an iPhone with an app. The app is free. Even before I retired, our agency just issued iPhones to every officer. You want to keep your professional, your work iPhones separate from your personal phone because law enforcement officers tend to get sued a lot and we have to surrender our work phones and not our personal phones in that case. Like I said before, I did not like this legislation last year. Representative Gaines, our good friend out of Athens, did a lot of work on this in the off session to get it to where it's good legislation. It's moving forward. Technology moving forward. I would ask that you support the bill and I will ask that you support both amendments. Thank you, Mr. President. I yield the well. All right. Does anybody have any of the senator who would speak for against the measure? All right. So we got the questions on adoption of amendment number one authored by the senator from the 42nd. Is there objection to amendment? We have objection, all right? So all those in favor of amendment number one will vote yay, all opposed nay, secretary, and a lot of the machine. All right. So that will move on to amendment number two. Is there objection, amendment number two? There is objection, amendment number two. All those in favor of amendment number two will vote yay, all opposed nay, secretary, and a lot of the machine. On the option of amendment number two, the a's are 13 and the a's are 39 and this amendment has failed. So is there objection to agree to the board of committee which is favorable to the past of the bill? Chair here is none. Board of committee has agreed to. Is there objection to the main question being ordered? Chair here is none. Opposition is ordered. Questions on the past of the bill as amended? All those in favor of the bill will vote yay opposed nay, secretary, and a lot of the machine. All right. All right. All right. All right. All right. All right. All right. All in the past of the bill, the a's are 51 and the a's are three. This bill has received a requisite constitution majority as therefore passed as amended. I recognize the senator from the 54th. Yes, Mr. President. I moved to have HB 224 removed from the table. Secretary reading announcements. House bill 224 by representative Bonner and other assembly third and others to build to me title and act to amend chapter one and title 32, the official go to Georgia and table which is general provisions relative to highways, bridges and ferries. So I authorize the construction or maintenance of overroads upon military bases or installations by the department of transportation and for other purposes, Mr. President, I complete the order. Here's the objection. Hearing none. Continue, secretary. House, what's the 24th or by representative Bonner, the assembly third and others to build to me title and act to amend chapter one and title 32 of those, the G.A. Boyd to general provisions, so also the highway, bridges and ferries. So I authorize the construction or maintenance of roads upon military bases or installations by the department of transportation and for other purposes, Mr. President, the Senate, the cabinet of transportation recommends that this bill do pass as likely as submitted and it's in our doze, old chairman, Mr. President, I complete the order. I can ask Senator Runn to feed you forward. Thank you, Mr. President. My friends, this is a very simple bill. I don't know if you know this or not, but there are 13 major military installations in Georgia. What this simple bill, this bill simply does is allow Georgia Department of Transportation to contract with the U.S. Department of Defense when it comes to working on roads, all military bases and also the Department of Defense will pick up the entire tab for everything any job that they do. Current law prohibits any official officer or employee of G.A.T. to authorize or the construction or maintenance on any private road. This bill creates the exception to that law when acting in pursuant of the agreement with Department of Defense or other federal entity that Georgia Department of Transportation is authorized to construct or maintain a private road upon a military base or military installation. So as long as the funds expanded are so we derive from the Department of Defense and other federal entities or agencies. Mr. President, this is a very good bill. It just continues for those military bases we have in our Georgia so they can make sure that we're taking care of those as we do in a desert cold storage in Zadam. Mr. President, no question. I'll wear you on the wheel. You have no questions. Does any other Senator wish to speak for against the bill? Is there objection to previous questions being ordered? Chair here is none and the previous question is ordered. Is there objection to agree to the Board of Committee which is favourable to the past of the bill? Chair here is none and the Board of Committee is agreed to. Is there objections to the main question being ordered? Chair here is none and the main question is ordered. Questions on the past is of the bill. All those in favour of the bill vote ye, opposed to the name, secretary, one, lot of the machine. you on the pass of the bill the a's are 51 the nays are zero this bill hemmed it's constitutional majority is there for pass recognize the center from the twenty-night I ask for unanimous consent to lift HB six fifty two from the table section section section read the caption send house bill six fifty two by representative Jones the twenty-fifth and others have built the entire act of men article one of chapter nine of title forty-eight of the official code of Georgia annotated really new motor fuel taxos to provide for an exemption to motor fuel tax relative to the electricity collected from certain electric vehicles charging stations and further purposes is there objection hearing none secretary finish kept house bill six fifty two by representative Jones the twenty-fifth and others built the entire night to mend article one of chapter nine of title forty the official code of Georgia annotated relating to motor tax fuel taxos to provide for an exemption to the for collection of motor fuel motor fuel taxes relative to electricity derived from certain electric vehicle charging stations to provide for related matters to people can fill in laws and further purposes mr. president the senate committee on rules recommends this bill do pass by substitute respectfully submitted senator brass of six chairman mr. president senate committee on rules offers the following substitute house bill six fifty two a bill to be entitled act to a mend real an act relating to regulation and taxation of electricity used as motor vehicle in electric vehicle charging stations approved may second twenty twenty three as amended to and further purposes mr. president senator dole is all of the twenty-seventh offers amendment one to the senate substitute to house bill six fifty two this this amendment is out of order as as the bill was engrossed upon third reading mr. president that completes the order break it on the center from the twenty nine thank you mr. president this is an extremely unique piece of legislation because it focuses on one thing it focuses if you look on line forty eight it it defines what exempt special fuel it means any it means the fuel dispense from an electric vehicle charging station in operation as of January one twenty twenty five that is under operated by nonprofit organization exempt from taxation under five oh one see three of the internal revenue service that delivers electricity for no exchange or consideration for payment that is located on a federal interstate right of way that exists in my district along the way in this special fuel is dispensed absolutely free to anyone who owns an EV all funds used for that or funds raised through nonprofit not through taxes I would ask your support on this to keep that incredibly important free EV station there and operating and with that mr. president I yield the well centers yielded I see it which speak for against bill chair here's done is the objection to the previous question being ordered chair here's not in the previous question is ordered questions on the adoption of the committee substitute is their objection to the adoption of the committee substitute hearing none they committee substitute adopted is their objection to agree to the poor to committee which is favorable to the passes of the bill chair here's none of the the Committee's agreed to. Is there objections to the main question being ordered? Chair here's none of the main question is ordered. The question is on the passage of the bill by substitute. All those in favor of the bill vote. Yay. Opposed, now you Secretary, I'm not the machine. On the passage of the bill, the yay's are 54 and the nays are zero. This bill hasn't received records that Constitution Majority is there for pass by substitute. Reagan has 1993 heroin ice splinter 24. Mr. President, I asked that House Bill 443 be lifted from the table. Secretary, read the announcements. House Bill 443, Representative P. Trey, 166, and others to be in town of NAC2 Men, Code Section 27-2-23, the official got a Georgia anti-Aewolage of License Permit Tag and St. P. So the survivor of fees for Reef and Migratory Fish and Dorsen, has provided for recreational commercial fishing, to have related matters to be able to look in logs and weather purposes. Mr. President, thank you for your natural resources and the environment. I would like to welcome your welcome to this bill, do pass by committee subs, who is about at least minutes in our innocent chairman, Mr. President. In the Senate Committee on Natural Resources and the Environment, I would like to present the following subs, too, to House Bill 443, a bill is going to tell on 9-2 Men, Code Section 27-2-23, the official got a Georgia anti-Aewolage of License Permit Tag and St. P. So the survivor of fees for Reef and Migratory Fish and Dorsen, has provided for recreational commercial fishing, to have for attention to certain fees and for other purposes. Mr. President, Senator Dozle, 27th, offered a volume of amendment, number one, to amend House Bill 443 by inserting after a men online, following Chapter 2 of the time of the 26th, the official got a Georgia anti-Aewolage of Standards Labelling and Alteration of Food. So the repeal of Article 18 related to raw dairy to repeal really provisions to amend by inserting after a line 7 of the following chapter 2 of Title 26, to those who gaolage to standards labeling and adulteration of food, is amended by repealing Article 18 way to raw dairy, and then the references that article into raw milk as regulated by such article on the official got a Georgia anti-Aewolage of Section 2, for read a designated second two in Section 3 for other purposes. Mr. President, I can please the order. The man from Columbia County, the legendary Columbia County. Thank you, Mr. President. I bring you House Bill 443. It's a very simple bill, but it's very important. Our Georgia fishermen have asked for this bill. Do you know how his asked for this bill? And simply what it is, it's just a fee for the fishermen $10 if your residents and Georgia non-residents, it's $20. But what it is, it's the money to be collected, to do a study on our offshore fishing. The federal government right now is going by some guidelines that's ordered in some of us in this Senate, and it's not accurate. And this here will get more accurate data to where our fishermen can fish more in the ocean. Thank you, as you vote green. I yield a well, just vote green. Let's go. Any other senator wish to speak for against the measure? Chair here is none. Is there objection to the previous question being ordered? Chair here is none and the previous question is ordered. Any other senator? Which one of y'all's got the amendment? Who's speaking for the amendment? Senator from 27. Thank you, Mr. President and colleagues. For those of you that heard the discussion of the budget a couple of days ago, there was conversation around the green door process with the subcommittee chairman meet. And I know for myself, my biggest takeaway was how so many bills that we pass here that we may not think have a budget implication do indeed have a budget implication. And one of those bills that we passed a few years ago that has had a multi-hundred thousand dollar budget implication is the raw milk bill that we passed here in the General Assembly. And from my understanding we are currently testing only one farm under this program. I think a couple other farms are seeking to be signed up, but this would repeal that law that we passed in its entirety. With that, Mr. President, I'm happy to answer any questions or I'm happy to yield the wealth. You do have a couple questions, Senator. I recognize Senator from the second. Senator from the second. Thank you, Mr. President. Senator, can you explain the impacts of your amendment as it relates to I-16 and any future growth of I-16 as we talk about budget costs and the implications of legislation? Well, every dollar that we save senators and opportunity to spend money elsewhere. One thing I'd like to do actually is begin looking to spend some general fund money on infrastructure projects. And I-16 would be the top of the list for me. Thank you, Senator. Bring it on as Senator from the 41st. Thank you, Mr. President. Senator, do you yield? I do. Senator, isn't it true that there's a few times when I might agree with cutting back on some regulations and this is one of them? I would put this probably up one of the few times and I only agree on cutting regulations that you would agree with me. So thank you. What do you do for me? I do. Isn't it true that because the regulations were so high that many farmers who wanted to provide raw milk just could not fit within the large regulations that were placed when it comes to raw milk? Well, I went back and looked at this bill, Senator, and I was surprised to see that it originally passed. It was indeed 20 pages of regulation around this topic. And do you further hear for one last question? Yes. Isn't it further true that people can continue to sell raw milk for pet consumption only? Yes, that is correct. Thank you. Yeah. Question's on raw milk. All right. It's recognized as Senator from the 32nd. Thank you. Would the Senator yield? I do. Senator, are you aware that there are some other issues with raw milk aside from the budget considerations? I had a conversation previously with a certain doctor in the caucus from the 32nd who shares some of those with me. Would you further yield, Senator? I will. Just in reading the public health stuff that comes out, it seems that there is a much higher chance of people getting foodborne illness from raw milk than from past rice milk. Isn't that true? I'm sure you know of what you speak, Dr. Senator. Thank you. We're going to have Senator from the first. Mr. Ponder clarification. Do you yield? I do. Yes. So we're doing away with raw milk in this department, in the inspection and so forth. So it won't be available. It will not be available for human consumption, but will be available for pet consumption. I believe that is the case. In my reading of the bill as well, what we do is put a lot of regulation around the human consumption piece. I believe what this actually would do at the end of the day is the law then would be silent on human consumption as I read the bill. Because what we were doing is we were repealing the section, the 20 page, it's like 20 page section of law, but the 20 page bill that we did pass. So essentially we're going back to where we were in 2020 and prior to that. Okay. Great. Thank you. I recognize Senator from 13. I recognize Elton John here in the audience tonight everybody. Senator from 13. Sir, do you? I do. Sir, would you please go through the cost. This will be saving us and it numbers more time on this if we don't do this program. What it costs. It's my understanding that in the base budget we have a we have appropriated approximately $800,000 towards the testing program. I think it's true that it also should be could be over a million potentially in the future. I had a conversation with people that would know before and they gave me a number of 800,000. I support you, amendment. Thank you. I'm going to yield the well, Mr. President. All right. Does any other senator wishes to speak for against the bill? Questions on adoption of amendment number one. All of them by the senator from the 27th. Is there objection? That objection. Amendment. It is a amendment. It is a amendment. Questions on adoption of the committee substitute as amended. Is there objection to the adoption of the committee substitute as amended? Hearing none, the committee substitute as amended is adopted. Is there objection to agreeing to the Board of Committee which is favorable to the passage of the bill? Chair here is none. The Board of Committee has agreed to. Is there objection to the main question being ordered? Chair here is none. The main question is ordered. The question is on the passage of the bill by substitute. All those in favor of the bill vote. Yay. Opposed nay. Secretary, I'm locked the machine. Thank you. On the passage of the bill the yay is our four. The bill is passed by substitute. The majority is therefore passed by substitute. Secretary, read the report. Mr. President, the Senate committee on the second level of governmental operation has had an enforcement possibility to Frederick earlier or earlier, although they did We're going to have a sit in front of the 49th. Mr. President, I move that the Senate agree to the House amendment to the Senate amendment to HB 491. Secretary Reed, the caption. The House bill 491, where I represent the Senate and the Senate, and others will be down in act two, men, Article 1 and Chapter 3 and Article 2, Chapter 4, Title 27. If you go to Georgia Antate, we'll do hunting and non-commercial vision. It would be a suspect police has to remove an exception for the use of air guns ton wildlife to rights of visions concerning the taking of catfish by bow and arrow to fight for later matters to be able to move in laws and for other purposes. Mr. President, the Senate offers the following amendment to amend House Bill 491 by inserting before to provide for later matters, a line for the following to extend the firearms archery impairment of weapons, hunting season for gear by inserting between lines 2021 to following section 2, said articles for other men by adding a new section and for other purposes. Mr. President, the House offers the following amendment to amend the Senate floor amendment 1 to House Bill 491 by striking lines 1 through 14, Mr. President, that completes the order.\n\nfrom the 49th. Thank you, Mr. President. I think Wednesday we passed HB 491, which was about air gun hunting and the sunset on that. It also had to do with cat fishing, with a bow and arrow. We amended it with an amendment to extend deer season, and all we're doing really is the house. We sent it back to the house. They took that amendment away, just agreeing to leave that alone for right now, myself and my Mr. Rocketman from the 13th. We're going to work hard on this day one, and we're going to fix deer season. We're going to make deer hunting better than it's ever been in the state of Georgia. Mr. President, a yield for questions. No, you have no questions. Sorry, I'm sorry. Senator, from the 48th, do you have a question? I don't see you light on, Senator. I was actually wanting that one, but I yield the well, Mr. President. I get it. It is. Senator. There. Does any of the Senator wish to speak for against amendment or the bill? Hearing none. Senator has moved that the Senate agreed to the House amendment to HB491. All those in favor, we'll vote ye. All opposed, nay, secretary and law to the machine. Senator, from the 20th, what purpose do you rise? Part of the meeting, Quarry. Mr. President. So we're dealing with raw milk and hunting catfish with a bow and arrow at night with a light. I think it's time to sunny die. Skin very close, Senator. Skin very close. I don't think it won't be necessary to vote on that. On the motion to agree, the yeas are 52, the nays are 1, and this motion has prevailed. Recognize the Senator from the 42nd. Mr. President, I move the Senate agree to the House substitute, the Senate bill 207 has amended by amendment one. Secretary the caption. Senate bill 207, by Senator Shirkland, the 42nd and others, the bill 207, the title and act to amend, title 2026, 31, 33, and 43. Those CGA will lead to education, food, drugs, and cosmetics, health, insurance, and professions, and businesses to amend, chapter four, title 25 of those CGA will lead to fire fire standards of training to amend Article 2, chapter three, title 35 of those CGA, will lead to Georgia and crime, and information center to amend Article 3, chapter eight, the title 42 of those CGA, and for other purposes. Mr. President, the House of Office of Law and Subitutes, Senate bill 207, a bill to amend, title and act to amend, chapter four, title 25 of the official judge, Georgia and Tate, and will lead to fire fire standards and training, so I survive for the reporting of guilty, please, taken on the first offender treatment to obtain employment, it's a fire fire, to survive for the late of matter, so people can look in laws and for other purposes. Mr. President, Senator Shirkland, the 42nd, office following amendment number one, to amend the House substitute, the Senate bill 207, fire placing one through the end with the following, to amend Title 2026, 3313 and 43, those CGA, will lead to education, food, drugs, and cosmetics, health insurance, and professions of businesses respectively, so it's a creative pre-clearance process, and licensing of individuals with criminal records to make an application to or investigate by certain licensing boards and commissions, to arrive for definitions and for other purposes. Mr. President, that completes the order. There you are, Senator. How are you doing? You got to take the way out right there. Mr. President, we've got to get the printers going on the house side with this bill, so I want to speed it up. This is Occupational Licensing Reform Bill, this is Year Three, you all voted on this bill, 55 to nothing, a few weeks back, you'll see the original bill you were given, and the new substitute, I've been working with leadership in the House and reached a resolution on the bill. It's a little bit lighter because we removed part of the bill where it limited the offenses that could be looked at by the boards, and the House wanted to open that up a little bit more as a compromise. You'll have more pass crimes looked at by boards, but you still have the same due process, same legal standard, where someone can challenge whether or not the past offense is related to the industry you want to work in, and also you still have the same predetermination process. Someone wants to work in industry. Someone wants to work in an industry, they can find out in advance that their past criminal record keeps them from working there. It's a great pro job bill. I want to thank the Georgia Justice Project, Faith and Freedom Coalition, Metro Chamber, and Georgia Chamber for sticking with me year, third year now trying to get this bill done. Happy to take any questions. Or I'll yield the well. You have no question, Senator. Any other Senator which speak for against the bill? Hearing none. All right, so the Senator has moved that the Senate agree to the House substitute on SB 207 as amended. And all those in favor, but okay, all opposed, nice, secretary and law and machine. All in favor. All the agree, the A's are 53 and the Nays are zero and so this motion has prevailed. Recognize the Senator from the 24th. 29. Mr. President, I move that the Senate agree to the House substitute to SB 101. Secretary, read the cash. Senate bill 101 by Senator Roberts in the 2019. Another, the bill is being done on act two men. Tribute 12, the Title 31 of the EFISCO, Georgia Antateway to control of hazardous conditions, preventable diseases and metabolic disorders. Those require testing for GUSHANE, must for DISTRIBE, at newborn testing screening system for a late manner, spread for an effective date, to build smoking laws and for other purposes. Mr. President, the House offers long substitute, Senate bill 101 to build the Senate on act two men. Title 33, the EFISCO, Georgia Antateway to insurance to the assessed requires certain health benefit policy covers for medically necessary orthotic devices and prosthetic devices and their materials to provide for the employment, to provide for definition, to provide for requirements, to provide for reporting, to provide for rules and regulations, to provide for related matters, to provide for an effective date, to build smoking laws and for other purposes. Mr. President, that completes the order. Are we going to add the Senate from the 29th? Thank you, Mr. President. Some of you may recall that SB 101 initially covered Muscular Adiffs, Fidou Shanes, went over to the House, the language was moved out and there was funding placed in the budget to cover the Muscular Dissertry pilot program for the Hill Prick for Dushan's Muscular Dissertry. The chair of appropriations worked with me. We reduced them out, sought to do as much as we could possibly do, but to the politics that we know exists across the hall, we ended up losing the pilot program. But in the process, out of bad, sometimes comes good and I think this is absolutely good. What this does is it requires insurance, certain healthcare benefit policy coverages under insurance for the medical necessity for prosthetics and other things for Georgia citizens and probably the best example of this is after I started looking into the bill, I was introduced to a young man here in the capital by the name of Elliott. Elliott is about six years old, he has a titanium leg and Elliott would like to go run and play with his friends, but to do that, Elliott would need a blade to do that. And I don't know if you know it or not, but there are certain prosthetics necessary to take showers that are different from what you would normally wear. And so what this bill does is it gives Elliott his other friends like him and adults the opportunity to not only get one prosthetic when dealing with their insurance company, but the opportunity to get up to three prosthetics. And so it's a very good piece of legislation, very compassionate piece of legislation and I would appreciate your support on it. And with that Mr. President, I'll yield for any questions. You have no questions, Senator. Thank you Mr. President, yield well. Does any other Senator wish speak for against measure? Chair, here's none. Senator from the 29th is asked to send it to agreed to the House substitute on SB 101. All those in favor vote, yay, I'll pose, nay, Secretary, I'm not machines. I'll send the band to the shall. I'll send the band to the shall. I'll send the band to the shall. I'll send the band to the shall. All in the agree, the a's are 51, the a's are 1, and this motion has passed. We're going to send it from the 47th. Thank you Mr. President. It's getting kind of late. But I move that Senate agreed to the House substitute to SB 12. Secretary, read the caption. Senate bill 12 by Senator Gannon, the 47th and others to build some means to have an act to amend article 4, chapter 18 and type of 50. They have issued out of Georgia and T. We'll be seeing inspection public record. So as to rise for residents, it'll lead to documents and records in the possession of private persons or entities to arise definitions, rise for residents, related to additional enforcement of inspection requests, private related matters, private and effective dates, real smoking laws, and for other purposes, Mr. President, the House, all of us to long substitute Senate bill 12 will build between Title IX to amend article 4, chapter 18 and title 50, the official of Georgia and T. We'll be seeing inspection public record. So as to rise for residents related to public records and the possession of private persons or entities, to arise definitions, rise, related matters, private for effective dates, your appeal to smoking laws and for other purposes. Mr. President, that completes the order. Here's the objection. Rebel, that —iday'll delivered formal transmission. Thank you, Mr. President. Ladies and gentlemen, I know it's getting kind of late. And I will tell you, said the SB-12's got a lot more tension than I thought it would have. I was really pleased when I introduced the bill. It's just what happened here. And I've said it had a lot of co-sponsors, a lot of support that passed out of here unanimously. Took it over to the house. The house went through their process, made a little slight change, a little perfection to it. And then as y'all may know, it went to house rules, and it got from a three-page to a 35-page bill, scared me to death. Well, I'm pleased to know that our friends over in the house, they clipped it back. They pulled it back to pretty much what we passed out of here. Said, I want to thank the folks in the house for doing that. I want to thank our governor for doing that. One of the things that you don't want to get into an argument with people that buy ink by the train car load. So for me, what this bill does, it's a pro-business bill. It protects our small businesses around the state. It's an open government bill. It's something that actually will help our local government so that we channel the open records requests to the local government and protect it our small business from being overcome or outrun by open records requests. Not a whole lot different from what we saw earlier this year with the unanimous vote. I believe the vote in the house was 167 to 1. I'm asking for unanimous vote to pass this bill, and I'll be glad to yield for any questions. You have no question, Senator. Thank you. Would anyone, any other Senator, wish to speak for against a measure? Hearing none. Senator has answered the Senate degree to the House substitute on SB 12. All those of every vote, yay, all opposed, nay, secretary, and a lot of the machine. All in the motion to agree the yays are 53, the nays are one, so this motion has to be made. All right. Just to understand the d's. Thank you.",
  "updated_at": "2026-02-13T12:46:20.699371+00:00"
}