{
  "video_id": "vqlXW5Qfatg",
  "url": "https://youtu.be/vqlXW5Qfatg?t=2666",
  "title": "Georgia House - Day 27 (2026-02-27)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 27,
  "video_date": "2026-02-27",
  "duration_minutes": 268,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview:**\nThe session featured the consideration and passage of several notable bills, including legislation to move the state tax appeals process to the judicial branch and a bill regulating amateur combat sports organizations.\n\n**Key Actions:**\n- **HB 1267:** Enabling legislation to move the state tax appeals process from the superior court system to a new tax tribunal in the judicial branch.\n- **HR 598:** Constitutional amendment to authorize the creation of a state tax tribunal.\n- **HB 598:** Requires licensing and regulation of certain amateur combat sports organizations by the Georgia Athletic and Entertainment Commission.\n- **HB 1115:** Revises the maximum allowable sales and use tax rate.\n\n**Bills Introduced (First Reading):** None mentioned.\n\n**Notable Moments:**\n- Debate and passage of HB 1267 to move the state tax appeals process.\n- Presentation and adoption of HR 598 to amend the constitution to enable the tax tribunal.\n- Debate and passage of HB 598 to regulate amateur combat sports organizations.\n\n**Votes:**\n- HB 1267 passed 161-0.\n- HR 598 passed 165-0. \n- HB 598 passed 164-1.\n- HB 1115 passed, but the vote count was not provided.\n\n**Attendance:** No specific quorum notes.\n\n**Adjournment:** Transcript does not indicate when the session adjourned or the date of the next scheduled session.",
  "transcript": "\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you and we It was to give tax payers direct access to a knowledgeable court so that they could have their day in court in due process of matters matters specifically related to tax. But as it exists in the executive branch, if the state or the tax payer wishes to appeal, their only option is to go to the superior court. And that superior court always is going to be in Fulton County because that's where the tax court is housed today. Well, we all know the superior court in Fulton County is very busy with a trial calendar. It's not set up to be an appellate court. So what we seek to do today by passing this enabling legislation followed again, hopefully the speaker will call our constitutional amendment next is to move that process to the judicial branch so that the first level of appeal can be at the tax payer's discretion to their appeals court in Georgia. This is tax payer friendly. It's court friendly and that it removes cases from a superior court that is already overcrowded and it puts an appellate situation into an appellate court rather than a trial court that it currently exists in with a superior court. 1267 is that enabling legislation is to fairly length you build. I think 29 on a 30 pages because there's a lot of cross references, but it's worked very hard. I want to thank the chairman of judiciary chairman gunner for working with me on this and working with other involved parties and thank their committee and make note that for those of you that have been around for a while. This came out of judiciary in about 12 minutes because they had worked so hard going into this to get this process right. The enabling legislation assuming the constitutional amendment is brought up and passed by this body in the Senate would go on the ballot in November. If pass this enabling legislation would take place January of 2026. So with that if there are questions Mr. Speaker I'll try to answer them. If not I would ask the House's favorable consideration of HB 1267 the enabling legislation so that we can move the tax courts of the judicial branch and be taxpayer friendly to Georgia. Gentlemen has no questions. I yield well Mr. Speaker. Gentlemen's yielded the well. Our posture is we'll take up the enabling legislation now HB 1267 the successful then at some point later today we'll take up the CA and. Is there an objection to the previous question being ordered. Chair is none the previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair is none and the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes all opposed will vote no and the clerk will unlock the machine. All members voted. All members voted. If so, the clerk will lock the machine. On the passage of House Bill 1267, the Yays are 161, the Nays are 0. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption of H.R. 598? House resolution 598, I represent a Martin of the 49th of Resolution Propositing and Amendment to the Constitution so as to invest a judicial power of the state in the Georgia tax tribunal. This resolution I have been referred to, Committee on Judiciary, that committee recommends that this resolution be adopted by Committee substitute. Chairman Martin is recognized to present the resolution. Thank you, ladies and gentlemen, I'll be brief here. This is the resolution to which I spoke earlier today. This would go on the ballot in November for approval of the voters to enact the legislation that we just proved if there are no questions on this. I'd ask the House's favourable consideration on H.R. 598. Mr. Speaker, if there are no questions. I yield the well. Gentlemen, as you were to the well, is there an objection to the previous question being ordered? Chair, has none of the previous question is ordered? Is there an objection to adopting the Committee substitute? Chair, has none of the Committee substitute is adopted? Is there any objection to agreeing to the report of the Committee which was favourable to the adoption of the resolution? Chair, has none of the report of the Committee. It is agreed to, shall this resolution now be adopted? All in favour of the adoption of the resolution? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? I have all members voted. All members voted if so, the clerk will lock the machine on the pass of House resolution. The year 165, the days are zero. The resolution has been zero.\n\nThe requisite constitutional majority is therefore adopted. Mr. Clerk, will you read the caption to House Bill 598, 598? House Bill 598, our resident of Cox, the 28th and others to be titled back to men, title 43, the fish go to Georgia, annotated relating to professions and businesses, so as to change certain provisions relating to certain boxing, wrestling and martial arts associations and federations. Let's Bill have referred to the Committee on Regulated Industries, that committee recommends that this bill do pass. Representative Cox, are you ready? Representative Cox is recognized to present the bill. Thank you, Mr. Speaker. Not to be confused with House Resolution 598, this is House Bill 598. This is about the safety of athletes in amateur combat sports. Currently, we have defined different organizations under the word of amateur, where five combat sport organizations are under that status, where they do not have proper regulation for safety of the athletes. We're wanting to remove those five organizations from amateur and then require them to get a license and be regulated by the Georgia athletic and entertainment commission. And this will ensure that at different events that they're protected from any injury and harm and that would have proper EMT doctors onsite to be able to handle those athletes in their protection. And for that, I yield for any questions. You know, one has no questions. I yield the well. Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the House Bill 598. The yeas are 164. The nay is won. This bill haven't received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the captions of House Bill 1115? 1115. House Bill 1115. While the representative from the 148th to be entitled to amend chapter 8 to tunnel 48 and the official go to George annotator, laying the sales and use taxes. So as revised provisions for the maximum liable sales and use tax rate, this bill ever referred to the committee on ways and means that committee recommends that this bill do pass by committee substitute. Representative Noel Williams is recognized to present the bill. Representative Williams. Thank you, Mr. Speaker. Colleagues, I rise today to speak on House Bill 1115. This was a study committee we had on the ways and means this summer. And I'd like to give a lot of credit to Chairman Blackman and to Trey Kelly, Mitchell Horner, Bruce Williamson and Robert Dickey. They helped a lot in preparation with this bill. We dealt a lot with ACCG, with GMA and we had all parties in agreement. And what this bill does, we modeled it after making and bill, O-lost and host, Asylum Tanias tax bill for the constituents. Basically, it raises the state sales tax from two cents to three cents. And with that extra penny, the county can have a rollback provisions on their property taxes. Now, in order for this to go in effect, it must pass the delegation of the said delegation and then it must be approved by the county on a vote. And once that vote is approved, then it's a five year time period on that. And then after five years, if they want to re-up it, they can, but they have to do that with a vote. Mr. Speaker, this is a bill we worked on, like I said, all summer. And we had a lot of variations and I'll take any any questions. I ask for your favorable consideration, House bill 1115. Man, you have a lot of questions. Well, I'll take a couple. How about one to start with? Representative David Wilkerson, to your left and the back. Thank you, Mr. Speaker. Does the gentleman yield? I do. Just to confirm, this is up to the individual counties, whether they want to do it or not, stuff we do. We can if we don't, then the voters, you know, it's up to the voters at the end of the day, right? That is correct. And that's what we think is good politics when it's up to the voters. Thank you. The chairman of the ad committee, representative Dickie, to your right. Has a question. No, thank you, Mr. Speaker. No question. I appreciate you bringing this bill. Is it not true that I may can be a delegation passed a very similar measure, was allowed to a few years back in O'Lost and passed his chamber and also passed the voters of Macon Bip County and they're really like this measure. So thank you for bringing this bill. Well, thank you. And the gentleman knows of what he speaks. You have no further questions. Well, that, Mr. Speaker, I appreciate it. And nice for your favorable consideration of House Bill 1115. Thank you very much. The gentleman has yielded the well. Is there an objection to the previous question being ordered? Chair has done the previous question. Is ordered. Is there an objection to adopting the committee substitute that chair has done the committee substitute is adopted? Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill that chair has done the report. The committee is agreed to shout this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. All members voted. All members voted if so. The clerk will unlock the machine. All in the passage of House Bill 1115, the yeas are 167. The nays are two. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to House Bill 643? 643. House Bill 643, by the way, is on the roof of the 61st and others to be entitled to amend chapter 23, title 47 of the Fish and Go to Georgia and intending to remain the Georgia Judicial Retirement System, so as to repeal prohibitions against certain state judges of Fulton County participating and other popular retirement systems. This bill ever referred to the committee on retirement that committee recommends that this bill do pass by committee substitute. You ready? Representative Roger Bruce is recognized to present the bill. Representative Bruce. Thank you, Mr. Speaker. I've learned that when you come to the well, the shorter you talk, the better people listen. So if you talk too long, you don't pay any mind. So I want to be real brief. All this bill does, it allows all the judges in Fulton County to be able to participate. And all of the pension plans that are available to him. That's really all it does. You have a question. You take a question? Sure. I thought you did a good job, but Representative Derek Jackson was not listening intently like I was. So evidently he has a question to your left. And he said hello. Yeah. So he waged. So he must have been listening. You have no further questions. I'm from the other way. Well, thank you. The gentleman has yielded the well. Is there an objection to the previous question being ordered? That Chair here's none. The previous question is ordered. Is there an objection to adopting the Committee's substitute? Chair here's none. The Committee's substitute is adopted. Is there an objection to agreeing to a report of the committee which was favorable to the passage of the bill? Chair here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of passage of the bill? Will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 643. The yeas are 156. The nays are 11. The bill having to see the requisite Constitutional majority is therefore passed. What for what purposes rep is any David Clark rise? Mr. Speaker, I move that House Bill 1093 be recommitted to the rules committee. That's your motion. Mr. Clerk, will you read the caption? House Bill 1093 by the rest of the clerk will be 100th to be titled next to a men chapter 1 and title 2 of the Efficiency of the Georgia Anitator relating the General Provisions Trello for the Agriculture Service to prohibit the acquisition of possessive interest in certain land by certain foreign persons and entities. On the General Assembly's motion, that House Bill 1093 be withdrawn from the calendar and recommitted to the rules committee is the objection. Here he noted and so ordered. There he … What can a physician swing over? Mr. Clerk, I think I've heard something about this bill. Will you read the caption of House Bill 13391339? House Bill 1339 by Representative Parrish, the 158th to be titled an act to amend Title 31. Will the official go to George Anitett in relating to health, so is the revised relative to certificate of need. This bill I've referred to the Committee on Health. That committee recommends that this bill do pass by Committee substitute. Members, I think you probably won't give the member in the way or your attention for lots of reasons, but I think he has some important points on this on House Bill 1339. He wants to make sure you informed him. Representative Pooch Parrish, Wayne's borrower is recognized to present the bill. Representative Chairman Parrish. Thank you, Mr. Speaker. Ladies and gentlemen, one of, thank you for giving the opportunity to talk with you a few minutes today about the substitute to House Bill 1339. It's the substitute LC339687S. And before I get into the bill, I want to take just a minute and thank a few folks who helped us work on this over several months. Our House Budget Information Office, Morgan Hall and Amber Mack, Haley Gallowayl in the Speaker's office in our legislative council, Betsy Harrington, these folks are putting many, many hours on this and I just want to say thank you to them for their hard work. This bill that you have before you today, the substitute, is a bipartisan bill that's based upon the findings from the Georgia House Study Committee on Certificate of Need Modernization that met over the summer. As many of you know, CON was first mandated by the federal government in 1974 and was shortly there after adopted by Georgia and all the other states. The federal government repealed the mandate in 1986 and subsequently the 50 states have gone their separate ways in repealing, amending or continuing the CON regulations. Georgia has since modified its regulation several times, but given the rapid evolution of health care in this country, it was wholly appropriate that we investigate the structure and regime best able to provide Georgia's with cutting edge health care that's both accessible and affordable. As Speaker Burns has articulated on many occasions, improving health care access in Georgia is one of his top priorities. The CON study committee was a bipartisan committee made up of seven House members and four non-legislative House members with health care experience and expertise. The committee was intended to be a vehicle that would move us all in the same general direction, making improvements, clarifying ambiguities and putting behind us as many roadblocks as possible. What we wanted to do in our study committee was study the issues and the opportunities from every point of view, which included holding our first meeting here in Atlanta, then we met in Augusta and then Albany to ensure the full consideration of various situational perspectives. Our final meeting was held by Kent Atlanta in late December and our report was adopted unanimously and signed by every member of the committee. It's been on line all this time and every member that served on that committee signed this report. I don't have to tell any one of you that health care is a complex issue. The report of this committee was based on facts, evidence and fairness. There's not a single solution nor is there any one size that fits all. The report was helpful in drafting legislative remedies that encourage providers to offer premier health care, whether it be routine, emergency or traumatic, that is more affordable and increasingly accessible to all judges. Many of you were present when we had hearings last week and heard from several who offered suggestions to improve this legislation. We listened and many of their concerns and suggestions are incorporated into this bill today and therefore that's the reason for this substitute. I believe based on the feedback from members, policy experts, health care organization and stakeholders across the state, this is a very good piece of bipartisan legislation that will improve health care outcomes for Georgia's all across the state. I want to give a shout out to our health committee that works so hard with us to make sure that we got this bill in the shape that it's in today so we can bring it to you. Now I'd like to go through the bill for you and I'll be glad to try to answer any questions. This substitute modifies and updates statues relating to the state's certificate of need process. The Department of Community Health is required to review and update the state health plan every five years. The time period to submit a letter of intent is reduced from 30 to 25 days before application submission. The 120-day period for DCH to review the application begins upon receipt of the application within 31 days of the receipt. An applicant will be provided an opportunity to meet with and review with DCH. Opposition is required to be submitted within 30 days of the receipt of the application. Care thresholds for the construction, remodeling and installation of capital projects are removed. That's something we had a lot of feedback on and it's important. House Bill 1339 expands several provisions relating to CON exemptions. The allowable period for closed hospital to be repurposed without a CON is extended from 12 months to 24 months. The expansion of hospital bed capacity increased to 10 beds or 20 percent within a three-year period when the occupancy rate exceeds 60 percent for the previous 12 months is exempt. The maximum distance for certain health care facilities to relocate without a CON is extended from a three mile radius to a five mile radius of the original location. The psychiatric and substance abuse inpatient programs are beds for Medicaid and uninsured patients are now exempt when an agreement is reached with a nearby hospital. New or expanded rule-based hospital obstetric services are exempt under certain conditions. Those are two points that this house is insisted trying to work on to combat the maternal mortality issue that we face in this state. And also the behavioral health issues we've been working to address. Acute care facilities in rural communities are exempt under certain circumstances. Transfers of existing beds and services are exempt when they occur within the same hospital system and are within a 10 mile radius of the original campus provided the exemption has not been used in the prior 24 months. Some compliance is addressed in section 6 of this bill. Failure to meet one or more requirements for exemption result is a monetary penalty. Repeated failure to pay fines or produce data lead to the revocation of the exemption. Penalties associated with delays or unsubited reports are increased from $500 to $2,000 per day up to 30 days and from $1,000 to $5,000 per day for every day after 30 days. DCH and the General Assembly's Office of Legislative Council will review and make recommendations to update and rewrite Title 31 Chapter 6 and other such provisions relating to CON in consultation with relevant stakeholders. The recommendations will be made to the General Assembly by December 1, 2024. Under the rural hospital tax credit program, the DCH Commissioner shall approve proportional donations to an individual rural hospital if the contributions exceed the yearly maximum contribution amount. The maximum limit of the rural hospital tax credit is increased from $75,000 to $100,000 per taxable year and the sunset is extended from December 31, 2024 to December 31, 2029. Lastly, the House Bill 1339 creates a comprehensive health coverage commission which will advise the General Assembly, the Governor and DCH on matters related to the quality of and access to health care by low income and uninsured populations including reimbursement funding, quality improvement and service delivery enhancement opportunities. The commission will consist of nine members including a chairperson that will be appointed by the Governor for nine legislative members appointed by the Speaker of the House of Representatives and four non-legislative members appointed by the President of the Senate. The commission's initial report will be submitted no later than December 1 of 2024 and the commission will be abolished on December 31 of 2026. Ladies and gentlemen, I hope you look favorably on this legislation. We've been many hours put into this, a lot of conversation between stakeholders and all and there were suggestions that were offered. We tried to take as many of those as we could and work into this. But let me be the first to tell you, this is not the end all of this, this is the beginning of a journey. We're going to continue to look at this but I really believe this moves us forward in the right direction and I hope that you'll join with me. As we go forward, let's not let perfection be the enemy of doing some good. This is a good bill and I hope that you'll join me in supporting this. Mr. Speaker, if you have any questions, I'll be glad to try to answer them if not out of your oil. You have a couple of questions, Mr. Chairman. Yes, sir. Representative Newton to your right, Dr. Newton. Representative, Dr. Newton has a question. General's recognized for a question. Thank you, Mr. Speaker. Thank you, Chairman, for this work. I'll tell you, this is an amazing bit of work and I was so glad to serve with you on that committee. Doesn't this bill really address three areas of intense focus that this body in particular, the house has dealt with over the past number of years? It addresses mental health, which we've worked harder and harder on putting together both the workforce and the facilities. It'll decrease in streamline the ability to get these up in a timely manner. It's addressing maternal care and prenatal care for unborn children by the expansion in OB and then finally, in a rural areas, the critical importance of expanding health care in these areas. Not just for the health of those there, but if we want them to survive and thrive, they need it for economic development. Doesn't this bill move those forward? Thank you for that question, Chairman. You are exactly correct and right on target. And let me just tell you, you members in this house can be proud of the efforts that this house has led not just this year, but over the years. When you look back and see the amount of money that you have put into the budget to increase access to quality health care in this state, we've increased the number of federally community qualified health centers that people show up and are treated and they pay according to their ability to pay. You have put more residency programs all over this state. So when our medical schools graduate these doctors, we're going to have in-state residency programs so we train them here in Georgia and surveys and data will tell us they will usually stay near where they train. And we have put these all over this state and we've done it not just in the urban areas, but in the rural areas all across this state. And we have addressed those issues that was mentioned, maternal mortality, behavioral health and other things. So don't let anybody tell you that the house hasn't done its part. It's done more than its part. You've been a real leader and you can be proud of that and I hope you'll tell that story. Gentlemen, you still yield? Yes, sir. The dean of this house, Representative Gerald Green, has a question. Thank you, Mrs. Speaker. Mr. Chairman, with the gentleman yield? Yes, sir. Thank you for the hard work that you have put in this particular bill and thank you for putting up with all the text messages from men and all of my questions. Do you see going forward any hope for a closed hospital in our rural areas of Georgia? And is it not true that this is a great concern for me and for the rural council as we look at what has happened in rural Georgia? Yes, sir. Mr. Dean, thank you for that question and I have a stack of text messages that I have received from you over time about this particular issue. And as I mentioned, this is certainly not the end of this situation. This is the beginning of this process. We're going to look at that and see what we can try to do about addressing some of those concerns like that. And thank you for bringing that to our attention as well. And it's been a real team effort. We said something that we had a real team working on this for months and months. Our committee that worked on it as well as those folks that I mentioned earlier. But thank you for your question and for your participation. Gentlemen, yield? Yes, sir. Representative Barnes to your left. How's the question? Representative, your body Barnes is recognized. Thank you, Mr. Gentlemen, yield? Yes, ma'am. Thank you. Is it not true that this bill will help impact units expand across our state? Yes, ma'am. Yes, ma'am. Thank you, does the gentleman further you? Yes. Is it also not true that this bill will help expand psychiatric care for our state in general? I believe that would be true. Yes. Thank you. Thank you for this bill. You're welcome. Representative Al Williams to your left. Mr. Chairman, if you yield? Yes, sir, to my friend from the coast. Mr. Chairman, yield? Yes, sir. Is it not true that for many years I've been an adamant opponent to messing with a certificate of need program? The gentleman will yield again? Yes, sir. Is it not further true that because of your involvement in your record in health care in this state and what I've seen you do through the years, I felt secure being a rule legislator that you would keep in mind the importance of this program and what it can do in rule Georgia. Thank you.\n\nI mean positive standpoint with your bill and greatly appreciate it because a lot of us are very concerned when this committee came together. But I commend you and I think as we move forward we can hope to see some progress and some reopening hopefully those some rural hospitals that have had to close. Yes sir, if thank you for those comments and as I mentioned it's been a real team effort and I live in a rural part of this state as well and I share those concerns. And I think the approach that our committee and our took on this is we wanted to move forward in a measured way. We didn't want to take giant leaps and then look back and say oh my goodness what did we do. So I think there's a measured approach to what we're doing. I think we're generally moving in the right direction and we're going to continue to do that. Thank you. Always makes me feel good when two great minds with lots of experience agree on something. Representative Stenson to your left in the back has a question. Representative Stenson. Thank you Mr. Speaker. There's a gentleman yield. Yes sir. Is it not true that I too as a member of the rural caucus and council development council been a part of this general assembly for 12 years have been a big supporter and been waiting for this day regarding reform to CON. Is that not true Mr. Chairman. And so with that being said thank you so much for your work on this legislation. Thank you very much. You have no further questions. Thank you Mr. Speaker. And again I want to let you know that this has really been a team effort and there are many many people that we need to thank. And thank you all for your support and working with us and our stakeholders out of the hall that have done this as well. I ask for your favorable consideration and I yield the well. General Gielder the well. We do have some speakers for and against the bill. So in the wisdom of the rules committee they've imposed House rule 33.3 and limited those responses to 30 minutes each. Chair now will recognize Chair Lady Hauston speak to the bill. You have up to 30 minutes. Lady is recognized. Thank you Mr. Chairman and I'm not going to get up here and talk against the bill. They tell me I just want to give my perspective but they told me to give my perspective. I had to say whether that was for against. And I'll probably vote for the bill but I just want to tell you all that I've been here for 26 years and we've been talking about this for 26 years. And there are some things in this bill I like. The tax credits to rule hospitals has been wonderful to my district. And we're doing 15 million dollar expansion to our hospital in Nashville Georgia because of the rule tax credit. But the two things that I like the bill I appreciate what they did but I just want it to go further. And two things that really have bothered me close to my heart in the last few months is an access to a pet scan. And that's what I want to talk about. I have two issues about access to a pet scan and we have to serve people with a pet scan. And I don't know. First of all, I had this young boy that was an intern with me. When I first started and we were probably talking about CON from Nevis Thaya. He went to North Georgia then he went on to Merce Medical School then he served in the Army. He has been trying to get a pet scan for years and if you represent any of these towns he has associated with a group that has satellite offices in these towns. And they do cancer and blood research centers. If you're in Clark County or County County, Putnam County, Green County, Newton County, Rotnell County, Jasper County, Walton County, Franklin County, or Hart County that either have a satellite district or fixed unit in those towns and they cannot get a pet scan. Now I don't understand that. And we've been working for four years. We educate him. We send him to Merce School and then don't let him participate in the free enterprise system. And that's the problem. And I'm going to vote for this bill but I just want to tell you how I feel about pet scan. My next thing is my nephew has cancer. I have a cousin, he said he's my cousin, we're so far back that he wouldn't show up on 23 and me or any of those things. But I claim him because I like to get into him every time I need to. So anyway, he called him because my nephew had cancer. So they wouldn't even do a pet scan in rural Georgia. And this was about five months or six months ago. It's been recent. They told him in rural Georgia it would take two weeks to get a pet scan. So they have these navigators. So the navigator is still lived in Athens. So the navigator called Athens to see if he could get a pet scan on his way to Atlanta. They would do two of our Athens to get a pet scan before they got to Emory. And they was going to stay over there a few days. You don't know how all that goes. So anyway, they told him he could get a pet scan quicker in rural Georgia than he could in Athens. So this nephew of mine, this was on Thursday. On Monday, he got a pet scan because somebody pulled strings. And I didn't pull the strings. I would have if I had known who to pull with. But I represent the most of the people I represent don't have access to pull a string. And that's what I'm speaking for. These people who do not have the access to pull a string. And I'm going vote for this bill. It does, it does, it does mental health. It does a lot of good things. But y'all, we've got to provide people with access to a pet scan. Thank you and I yield the well. Ladies, yield the well. Thank you for your comments. We have someone speaking in favor now, Representative Owl. We're ready for your comments. Representative Owl has recognized to speak to the bill. Let us expand just for a moment. Good afternoon. I'm speaking in favor of the bill. Everyone can relax. So look, I like and I respect the goals of HB 1339. I appreciate its focus on struggling rural health care systems. And I appreciate its goal to streamline the CON process, particularly with respect to expanding psychiatric and OB services. I think this piece of legislation shows that this body as a whole prioritizes increasing care access in the state of Georgia. I just wish our action in service of that goal was a little bit bolder. So the reason we've had so many rural hospital closures in the state of Georgia is not because of CON law. The reason we've had so many rural hospital closures in the state of Georgia is because we have the second highest uninsurance rate in the nation. And the high burden of uncompensated care on hospital systems across the state has become untenable. Making it somewhat easier to open up more hospitals or more beds or to streamline paperwork does not address that core issue. Just like opening up 20 new restaurants or putting more items on the menu cannot mitigate chronic hunger in people who cannot afford food. So this bill is well intentioned. I think it wants to do good. Each individual piece of it is fine. It does no active harm. But I want to note that it does inflict some passive harm in that it commits the harm of inaction. Right? Just because a patient doesn't have health insurance doesn't mean that they won't require health care. What it does mean, however, is that patients without health insurance and without means to access that care that may be available, even in rural areas, is that the care they eventually get is delayed. It's ultimately more complex. The patients end up sicker by the time they get to us. They have poor outcomes because of that. And all of this ends up being much much much more expensive. And these costs don't go away just because the patient can't pay. Right? These costs get absorbed by the providers who give that care. They get absorbed by the health care systems, which is why we see so many rural hospital closures. And the costs get absorbed by each of us also, regardless of what kind of insurance we personally have. In order to address those costs and the heavy burden of uncompensated care, we need to address our high uninsurance rates. And we need to close the coverage gap. Period. We need to avail ourselves of the resources and the federal money we've been turning down for a decade to cover these patients. We don't, I say this gently, we really don't need another study committee. Right? We don't need another task force. We don't need another commission to tabulate and look at spreadsheets and retabulate what we already know. A commission is a form of action. It feels like action, but in the end it's not. Right? I respect the sponsor of this bill deeply. I really respect this work that's been put in. And I know that everyone here is trying to do the right thing. But it's not enough. Okay, we know what we need to do. We just need to be brave enough to do it. So I support the goals of HB 1339. I am going to vote yes. I think it's trying to do good. I just hope that before signing die, and we still have time. Okay, we still have time to do this. I think we need to use this opportunity to do some more. Thank you, Mr. Speaker. I yield the well. We have no further speakers. We will now have the chairman's time. Representative Chairman Hawkins, chairman of the committee from which this bill came. We'll speak to the bill. Thank you, Mr. Speaker. I would just like to say that this bill has been a great deal of work. A great deal of work by a number of people on the committee. And over the years, it is a tough and difficult subject. We have different needs around this state. From rural to small towns to metro to the large cities. But this is a good bill. This is a good start. I would ask you to vote for this bill and move into the future and help the patients of this state access good quality care. I would like to yield the rest of my time to Chairman Silcox. Chair Lady Silcox has recognized the chairman's relinquy system to the Chair Lady Silcox. Thank you, Mr. Speaker. And thank you, Chairman Hawkins, for yielding some of your time. I rise today to come and just say that I certainly appreciate the rules of Chairman Parish over all the work that has gone into this. But I sincerely hope that our work is not through. My son is graduating from the Medical College of Georgia this spring. He and along of his classmates are the average amount of debt for these young people that are coming out of medical school is $295,000. I grew up in Sandy Springs when I was a little girl. Some of our community physicians, including Dr. Bill Collins, who helped save my life from cancer, formed Northside Hospital. And it was because of their dedication to try to build a community hospital in Sandy Springs that we have Northside Hospital. And so I'm not rising to speak against the bill. I'm rising to speak on behalf of physicians to give up their lives to save our lives. They give up 14 years in some cases like my husband to train to become an orthopedic surgeon. So I rise to ask that going forward, we can allow physicians to participate again in creating community hospitals because I know that then if those hospitals are successful, that even though they may start as just a small institution, they can grow and eventually qualify for the Medicare dollars to have residents and become teaching hospitals. And they can't be planted on their own. It takes community physicians and leadership and their involvement. So I appreciate you listening and I hope that our work is not through and I'll yield the well. That completes all of the comments on House Bill 1339. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the committee's substitute? Chair, here's none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair has done. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no and the clerk will unlock the machine. Have all members voted. All members voted. If so, the clerk will lock the machine. On the passage of House Bill 1339, the yeas are 166 and the nays are won. This bill haven't received the records that constitutional majority is therefore passed. The bill is agreed to. The bill is agreed to. Mr. Clerk, will you read the caption of House Resolution 1022-1022? House Resolution 1022 by Representative Camp, 135th and others. The resolution proposing amendments to the Constitution is to provide for local governments to have the option to offer a statewide homestead exception from Admiral Long-Taxes. This resolution has not been referred to the committee on ways and means that the committee recommends that this resolution be adopted by the committee's substitute. Representative Camp is recognized to present the resolution. Thank you, Mr. Speaker. Thank you, colleagues. This bill, HR 1022, is a resolution that is going to be able to help a lot of individuals. There was a lot of conversation for this in ways and means. I appreciate Chairman Stevens and Chairman Martin for their assistance in this. Also, Chairman Blackman. This particular measure is a homestead exemption. It exempts the out of the law tax for the previous year. It's a base year homestead exemption. It's floating. It allows each municipal body, whether it's the county, the city, or the school board to determine they want this. They have a resolution and then there's a referendum. It is complete local control. This allows individuals to make choices in their governing bodies. And Mr. Speaker, I'm open for any questions. The lady has no questions. Thank you. Ask for your favorable consideration. He's yielded well. We have he weighs. We have no further speakers. Is there any objection to the previous question being ordered? The chair has none. The previous question is ordered. Is any objection to adopting the committee's substitute? The chair has none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair has none. The report of the committee is agreed to. This resolution now be adopted. All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. All members voted if so. The clerk will lock the machine. All the adoption of House resolution 1022, the Yays are 168, the Nays are zero. This resolution, having received the requisite constitutional majority, is therefore adopted. Mr. Clerk, will you read a caption to House Bill 11851185? House Bill 1185, I represent a camp of 135th of being titled to amend part one of Article 2, Chapter 5, a title 48. The official go to Georgia and it had a related tax exemption. So as we provide for statewide home set exemption from mad ballorum taxes. This bill I've referred to the committee on ways of means that committee recommends a disbilled do pass by committee substitute. The committee is recognized to present the bill. Thank you again, Mr. Speaker. Excuse me. This pollens kind of getting me today. All right. So this is the enabling legislation for HR 1022. This legislation again provides a local option base year home set exemption for county consolidated governments. Municipality and school board taxing. It does not in lieu of any home set exemptions, but in addition to and it does provide flexibility as each governing body has the ultimate decision on how they want to handle this floating home set exemption. It does make it available to them a whirling in session three months a year. And so this does make this year round available to those governments. And again, Mr. Speaker, I'm open for any questions. Lady has no questions. Thank you. I can ask for your favorable consideration. Is there any objection to the previous question being ordered that chair has done the previous question is ordered? Is there an objection to adopting the committee substitute? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill that chair has done the report the committee is agreed to? Shall this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. The bill will be ordered. Yes, the clerk will lock the machine. On the path to House Bill 1185 the yeas are 169 the nays are zero. The bill having to see the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 1182 11182 House Bill 1182 by Representative Crow the 118th and others to be entitled back to amend chapter one in Title 33 in chapter seven in Title 48. The official go to George Annett's and it will lay in the general provisions regarding insurance and income taxes respectively. So it's revised the low income housing tax credits. This bill I've referred to the committee on ways and means that committee recommends this bill do pass by committee substitute. Representative Crow is recognized to present the bill. Thank you, Mr. Speaker. Colleagues, I bring House Bill 1182 and this amends the low income housing tax credit which is now redefined in here's a affordable housing projects. This is currently a developer can get 100% of the federal available tax credit for one of these projects. What we're doing is we're going to reduce that to 80% but provide five uplift categories that can get them back to that 100%. Those uplifts are either it's located in a rural area reserves are prioritized as a majority of its units for seniors or provides a preference for veterans or first responders provides access to stable and high frequency transportation consists primarily of a rehabilitation or renovation or is owned by housing authority and all that to is meet one of those criteria to receive a hundred percent of the federal housing tax credit. We also made some changes to the open records level on lines 82 and lines 160 made it a little more transparent and added some language in here for open records and that's essentially all we did with the bill. Mr. Speaker and I would be happy to answer any questions. Gentlemen has no he does have a question. Gentlemen you yield I will represent all Williams you're left. Thank you. Thank you. Gentlemen you yes or I will clarification purposes is it not true I don't quite understand are you doing 80% in urban and 100% in rural if so why possibly. So one of the uplift criteria is if it's in a rural area it can also be in an urban area if it provides access to stable and high frequency transportation so it doesn't have to be in a rural or urban but if it's in a rural it can be 100%. There's five criteria all you have to do is meet one of those that are on lines 36 through 41 on page two. Thank you. Gentlemen you I will represent a Becky Evans to your left has a question. Thank you Mr. Speaker does it gentlemen you yes ma'am yes so what what's in why are we doing this. Well I think you may be aware there was a study committee looking at all housing all tax credits last summer and there was some concerns brought out during that about some of the tax credits and some of the information that was brought back from all of this. This is a way to make sure so this is this is already a government subsidized housing right federalities subsidized we're further subsidizing that with Georgia tax payers tax dollars we want to make sure that we get the most bang for our buck for lack of a better term and this is a way to tighten that up to make it more efficient and to make sure we're getting the most advantageous outcome for the Georgia tax payers. Just a gentleman further you will for one yes thank you so so how much tax credits have we been giving over the past years like how many. Hundreds of thousands or millions of dollars. I would need to look back and have I don't have that currently with me what the what the aggregate amount is but this would help us target it more and make sure that we're directing this money. Towards areas that really needed these projects these types of projects usually cost more and so we're wanting to do more to incentivize those kind of projects. Okay. Chairman Blackman has a question chairman Blackman's recognize for questions of the gentleman yields. Yes sir. Yes sir isn't it true that the latest year on record was a $434 million tax expenditure. Yes sir I believe that is correct isn't it further true that this bill addresses concerned stemming from the state audit of this program while at the same time preserving the credit. To include a greater amount for developments that have higher costs like those in rural Georgia or that are rehabilitation or revitalization of existing properties. Yes sir you're exactly right I appreciate the question thank you thank you for that Mr. Speaker if there's no more questions I will yield the well and ask for your favorable consideration. Gentlemen has no further questions yielded the well we do have some folks that have signed up to speak in opposition. The wisdom of the rules committee has limited debate. Pursuit to rule 33.3 so those opposed will have 30 a total of 30 minutes I'll let you guys in ladies do your own. On the termination who gets to speak for what representative Bruce Roger Bruce to sign up to speak to the bill. Thank you. Gentlemen recognized thank you Mr. Speaker twice in the same day I don't come down here that much but I want to take a different approach because there'll be people that will be following me that will give you all kind of numbers and reasons. As to why we need to vote against this bill but I wanted to take a different approach if I could I just want to talk about fair play. Because several years ago this chamber and our chamber across the hall we invited these companies to come to our state we asked them to come and we gave them incentives to come. And they invested time money energy resources and developing their plans so that they could be part of the state of Georgia. Ron Bill.\n\nHe gave me the wrong way. I didn't sign up for this one. My bad. Mr. Speaker, I yielded well. Representative Bruce will make a lot of sense to me. I don't know what everybody else is worried about. There you go, brother. Representative Fry. Representative Fry, this is 1182. Let's make a sure. The gentleman's recognized to speak to the bill. Thank you, Mr. Speaker. Yeah, I don't have anything prepared, but I do want to tell you a little story about one day I was watching some football. There might be one person in this room that really appreciates this story. Only one. It's a guy by the name of Steve Spurrier. Steve was beating the full out of this team. It comes out in half time, I think it was like 26 to 6. They said, well, how's it going? You got a 20 point lead, Savhtom. How you feel about that? He said, well, you know, defense isn't doing too good right now. They put the lead him score and all offense and I put enough points on the board. And I just thought, what an amazing philosophy for this coach to be winning, but still have his foot on the gas pedal and not being okay with what was going on in the game and the status quo, although they were solving the problem. And that's kind of what I want to say right now is that the idea that in the midst of a housing crisis that we're experiencing all across the state, all across the nation, that we would take our foot off the gas pedal and have any sort of idea that restricting housing at this time in our economy is a good idea. Now a lot of my friends ask me, you know, why don't we even care what rents are? Why don't we care what mortgage prices are? And I'll tell you why. Because in my day job, we're able to provide housing that frees up about $500 to $800 for every family per month. And I don't have any empirical date on this, but I would guarantee you that that money is spent within five miles of that front door. And that money that we spend into our economy is the lifeblood of our economy. Taking our foot off the gas right now, when we are in the worst housing crisis in our lifetimes, and I say worst, worst in the 2008-2009 crash, because things were cheap back then. When the starter home in this state is $400,000, starter home is $400,000. This is not the time to take the foot off the gas. This is the time to put the foot on the gas to the floor, put more doors in the market and build as much as we can to offer the citizens of this state the relief that they need. So I'd ask you to vote now on this bill, and let's get it right. And let's build more while we need to build more right now. Thank you, Mr. Speaker, I yield the welcome. Gentlemen, yield the well. Represent Glaze, you're recognized to speak to the bill. Representing Glaze. Thank you so much, Mr. Speaker, and I do want to draw the attention of my colleagues as I speak, not really for and not really against how about that? And Mr. Glaze is always going to step up and do what I think is right. As a former city official who have used this credit to build moderate income housing for seniors in the city of Fairburn, one who has worked hard to get the state gick credit, which is the Georgia initiative for community housing. And I know how important that is because we wanted to make sure we had mixed use housing to bring our college students back to our cities and surrounding region to work and build the economy in South Fulton and in Calvita County. This credit does that. This credit when it matches 100% in densely areas, populated areas, it does that. Why I rise today is because my background and some of you have this background where you lived in poverty and you lived in low income apartments. And then that did not have everything to do with where you were going and what you were going to put into this economy. And where you were going to do with your life and how it was going to impact where you lived. So I've been in Georgia for 42 years and I dare to say that my life impact has been in Georgia. And it has made the difference in many children from those who have been the richest to those who have been the poorest. And I did not withhold my gift and my calling. At 80% I came 100% every time. Because my background said that I should not have even made it out of the projects. I should not have finished high school. I should not have two degrees. I should not be the mother of six college graduate with seven degrees beyond that. I should not. But I came to tell you that when we do to the least of these, what we're willing to do for every, we have just moved away from humanity. And I'm going to tell you when we lose humanity, we go into a place that is scary. And I want to tell you that I love this bill and I thank God for my colleagues who worked on this bill, who spent their time this summer, and to come up with these tax credits into assure us that they were doing what they were supposed to do. But I came to ask you today to correct something that sits a small little area in this bill that I know for sure that some of you know some of us who came from the worst zip codes. And now I have had the greatest impact on the lives of the generation under us. I need you to take a look at this and not so much vote it down. I'm not asking you to do that. What I'm asking you to do is the five areas in this bill that will be waved from the 100% is to add the one that we left out. You know there's a book of books that says that the poor will be among you always. And when you have done it to the least of these you've done it on to me. So I came to tell you this afternoon that we ought to make sure that we amend this bill and do what is right for the least of these. My mother made sure she raised us even though it was in the projects. And four out of her five children graduated from college. My brother was a naval officer. My sister just retired from the CIA and I got another one that works for the state. And I've worked in this state and sent many children into careers in this state. And I wouldn't take nothing from my journey. But this today I need to ask you to do something better than this. I need to ask you to come back and look at this and I'll vote with you if you'll come back and look at this and do the right thing for people who live in poverty. And you've got to put that six wavre in there that we target. What's that six wavre? I'm so glad you asked. That's six wavre in there is for those working families. You know, we call them essential workers during COVID. They were the lowest of the income on the income bracket. And they had to get up and sit inside of places and spaces and be subject to that scourging disease called COVID. You know, my mother would have been one of those. She just happened to be one who kept children, who cleaned floors. She was called to me. But she was an essential worker for somebody. When she came home, she made sure that her children gave back to society. This is a public private partnership. And in public private partnership, there's a benefit that sits on a scale that you and I can't really see because we're not the makers of it. We do have a creator. And he looks at it. He looks to see if we'll do what he does. And once done for the least of these. I'll vote with you if you'll come back and fix this. Fix this. And that's to include those families that work in families. My family worked. My mama worked. Guess what? I worked. I had to start working at 11 years old. I haven't stopped since then. I asked you to look here inside of you. Do something. Come back. I work with you. I'm not standing to stand against this good stuff. This is the only thing that we use in the state of Georgia to invest in housing. This is an investment. But I'll tell you it's not in brick and mortar. It's in children. It's in families. It's in the disabled. The disabled has been left out of here. My oldest brother, I still take care of him today. My mom and dad is gone. But my brother is still here. I must take care of him because he's disabled. That's not in the bill, guys. We can't leave that out. Come back. Let's do something better. It's one more step in here. It's families. It's working families. It's children. It's those who are disabled. Let's do what is right. It's time. There's somebody who measures us beyond what statistic says. But it makes sure that we who sit here looks at humanity. It leaves off. Just live leaving folks behind. Don't leave me behind. Don't leave me behind. Don't leave people who look like me, who's family started out like my don't leave us behind. Because you just might find that the family that I'm a part of might be left out. You don't want us left out. Because guess what? We do our work. We pay our price to society. And we give because we've been taught to be servant leaders. Where you stand with me on this one. Where you come back and do better. Because again, I will not condemn those who put this bill together. I say thank you. But I think we left out a big category. Let's get this right the next time around. Thank you for listening. I yield the well. Thank you, Mr. Speaker. I'm going to say thank you. Ladies, you're the well. Representative Becky Evans recognize the speak to the bill. Thank you, Mr. Speaker. Colleagues over the past six years since I've served. What I've heard from people time and time again. I've heard from people who have been taught to do to help people improve lives in Georgia. It's to improve housing, it's to get more housing. We are in a housing crisis. When I knock on doors and talk to people. And I say what's your number one concern? So many of them say gosh, you know, what can you do about housing? I have a hard time finding a place to afford to live. I've worked with you that's been so important to me that I've worked with several people, several colleagues to try to have conversations to do more in this area. And we have met with the governor's office and we've tried to talk about how to use the housing trust fund. We have this huge surplus. And we want to see could the state do more to help in that area? We've had productive conversations, but at the end of the day nothing's happened. And I have to go back to the people and people say what are we doing about housing in the state of Georgia? And I say well, we don't we haven't done anything else. I said but you know what I found out we these low housing income tax credits. They are a really good thing. We are known in other areas for having these low housing income tax credits. And what I've heard from the builders for both for profit and non for profit builders is that these low income housing tax credits are so important and vital. And they help them build housing in all different sectors as my colleague mentioned not just for seniors, but also for essential worker housing. And the problem is is that we need to be doing more for housing, not reducing this low income housing tax credit. I just want to remind you about some of these housing statistics. We have a deeply an adequate supply of housing that is available and affordable for all income levels, but especially for the lowest in the highest income renters. There is a gap of 395,000 units affordable and available. This effect has the greatest impact on our lowest income renters. These are the people that have the fewest resources and are the most vulnerable to housing security. Over 43% of Georgia renters are cost burdens. They pay more than 30% of their income on housing costs. That means they have to choose between paying rent and putting food on the table paying for medical costs or buying shoes. We talked about our children. We all talked about how important our children are. And there's research by Derby and it identified a direct correlation between residing and a low income housing tax credit during childhood. We have increased education and earnings and every additional year living in a low income housing, it was associated with the 3.5% rise in the probability of attending a four year program and a 3.2% increase in future earnings. Access to affordable quality housing, it's a proven strategy to improve childhood outcomes in terms of educational success, high school graduation and college attendance. It provides far reaching benefits for child's mental and physical health. 59% of Georgia renters are at or below 50% area median income, according to the Department of Community Affairs. When DCA opened up the wait list for 5,000, 5,000 federal housing choice vouchers in October of 23, it's the first time since 2021 for people at or below 50% average median income. They were seeking a wait list of 33,000. Do you know how many they received? They received 177,000 over 177 out that out. Excuse me, applications for the wait list in just three days. Colleagues, we've got to do more, not less, to address this housing crisis in Georgia. There's no reason for this bill. I ask you to join me in voting now. Ladies, you to the well. Will Park has recognized to speak to the bill. Thank you, Mr. Speaker. Colleagues, I first wanted to just let y'all know that that was my bad. I signed Representative Roger Bruce up for the wrong bill. I'll take responsibility for that. Apologies again, Representative Bruce. I appreciate the passionate remarks from my colleagues on this issue. Affordable housing is certainly something that impacts all of our districts and our communities. I think this bill moves in the right direction. But again, I think the primary concern is online's 53 to 56 and online's 132 to 135 in which it provides this option. We have a multi-billion dollar surplus. Multi-billion dollar surplus. I don't see why we would have an option even for an 80% match of the federal housing tax credit, even if the purpose of which is to incentivize affordable housing with one of these conditions in lines 35 to 41. So again, I agree with my colleagues that this bill could use a little more work. I will respectfully be voting no to this bill and hopefully we can perfect it as we proceed with the legislative session. Thank you, Mr. Speaker. I yield the well. Gentlemen, as yielded the well, that completes our discussion on House Bill 1182. You'd signed up. We do have chairs time. I overlook that. My apologies, Mr. Chairman. For chairs time, you have up to 20 minutes. I hope you won't take that long or I may not recognize you. You're recognized for up to 20 minutes. Chairman of the committee, Ways and Means, chairman, Sean Blackman, recognize the speak. Thank you, Mr. Speaker. And I certainly appreciate the discussion we had a healthy discussion about this for several months. I would like to highlight a few of the facts here that these are privately owned developments. They're money making developments. And this will not reduce the number of developments. We've worked with in coordination with stakeholders across this state and ensuring that we minimize the impact on those that use this program. And we will continue to do so. But it also ensures that communities and residents are receiving the most benefit from state tax dollars invested in this program. And that includes providing transportation to workers, housing to veterans, seniors or first responders, and rehabilitating blighted properties, specifically in rural Georgia. Mr. Speaker, I know the hours late. We've talked a great deal on this, but those that have listened to this debate will understand that this is while it does address the audit. And I would suggest that those of you look at the state audit concerns stemming from that that we are in fact doing good things to help affordable housing here in Georgia. And I'll yield the balance of my time to Chairman Martin. Chairman Martin has recognized speak to the bill. Thank you, Mr. Speaker. Ladies and gentlemen, we've I appreciate everybody's comments on the bill and I would just like to offer an observation. We're different than the federal government. We have a budget. We don't have an unlimited amount of money. I know there's been talk about our surplus. For those of you like me that were here through 07 08 09, I know what it looks like to not have one. I know what it looks like to be here in April wondering what the federal government is going to do to programs that they started and as a state we're supposed to backfill if the federal money runs out. I'm going to say it again. We have to have a balanced budget. It's up to us to be responsible for the taxpayer's dollars. So I would just draw a couple of things attention to a couple of things of the definition of project. Not all the units in these projects or for the persons that we've talked about. Some are not only a certain percentage are required to be available. And what this bill does assuming someone doesn't take advantage of the targeted project list and assuming they only get 80% of the tax credit. Here's what happens for $10 million that would happen today. The state would get the same amount of housing as if we spent 12 and a half million. Basically the people in Georgia have an opportunity to increase by 20 25%. The number of units that can be available spending the same tax dollars because you know what these projects are going to still happen because you know what they're profitable. So for this bill today and we'll see because we have until 20 26 before it goes into place. But you're going to find out that reducing to 80% lets our tax dollars go further. And I submit to you that someone will stand in this well three years from now and for the same amount of money we'll have an audit and more people in Georgia will have a place to live. I just want us to remember we have a limited resources in Georgia and this bill looks over those and in my opinion and those I think of chairman black men and others makes the best use of the tax dollars to provide housing for those that do you need it. Gentlemen is yielded the well that completes the presentations in the discussion on House Bill 1182. Is there an objection to the previous question being ordered that chair here's none the previous question is ordered. Is there an objection to adopting the committee substitute chair has none the committee substitute is adopted. Is there any objection agreeing to the report of the committee which was favorable to the passage of the bill. Chair has none the board of the committee has agreed to shall this bill now pass all in favor of the passage the bill will vote yes all those opposed will vote no and the clerk will unlock the machine. Have all members voted. For what purpose is represented Carson rise Mr. Speaker pursuant to rule 133 I asked to be excused from this vote. The gentleman has that right and the journal will so reflect. For what purpose is represented may not rise parliamentary inquiry state inquiry is it not true Mr. Speaker that this bill says you get the 100% tax credit if you are if the development is for senior. Veterans locations that are near facilities especially if you're in the mart in the metro area like Marta because that's high frequency transportation as well as rehab units which would be. The unit is not sure Mr. Speaker that voting no on this bill is voting against senior development veteran development and development and blighted communities for rehab purposes. I know the lady to be a very learned lady and I'm sure she can read the bill and that's what it certainly sounds like it says to me as well. For what purposes represent Roberts rise parliamentary inquiry state you inquiry thank you Mr. Speaker isn't it true that the state low income housing tax credit has been an excellent successful and important public. The private partnership and every dollar invested in the state low income housing tax credit has generated $5.79 in economic activity. It makes no sense to me I'm not a math genius that we're putting giving less tax credits to get more housing especially for low income housing which we need desperately thank you Mr. Speaker. I agree with you I'm not sure. I kind of got lost right there in the middle on that inquiry. For what purposes representing Sains rise parliamentary inquiry state inquiry is it not true that while there's a year to year increase of veteran homelessness at 14% this house through House Bill 1182 is responding to that call by incentivizing and prioritizing veteran home ownership. The gentleman knows what he speaks what purposes representative Holly rise. Pull the minutes we increase the state you inquiry. It's not true that while I have a low definitely a load of respect a lot of respect for the sponsor of this bill as member of our Henry County delegation our Henry County delegation is perplexed by this because we are the fastest growing county in the state and we know that affordable housing is necessary. And further Mr. Speaker that hopefully this leads to a conversation about how we can cover everybody in much of the way that the program currently does. Sure the gentleman believes what he speaks now we have a couple of it won't ask a parliament parliament inquiry and y'all have already discussed this bill very strongly last one for what purposes representative Ramon rise. Parliament inquiry state inquiry isn't not true that although the concerns about federal dollars is a legitimate one particularly because Congress can't seem to get it's act together. We are blessed as a state with currently a lot in our reserves and we can always keep enough for a rainy day while still using what we have for those who need it most. The lady is very astute on her observations. Have all members voted if so the clerk will lock the machine on the passage of the House bill 1182 the years are 104 the days are 61 the bill have received a record.\n\nConstitutional majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 1303? 1303. House Bill 1303, by rep. Senator Stinson of the 150th Vietaulat, and act to amend Code Section 40, to 86 of the official code of Georgia and TETA, relating to special license plates promoting or supporting certain worthy agencies, funds, or nonprofit corporations. This bill I've referred to the Committee on Motor Vehicles, that committee recommends that this bill do pass. Representative Patty Stinson is recognized to present the bill. Thank you, Mr. Speaker. Colleagues, I bring to you House Bill 1303, relating to the Sheppard Center, and there's information on your desk about the Sheppard Center being a private nonprofit rehabilitation hospital that was found in 1975. And House Bill 1303 basically just makes, creates a special license plate honoring the Sheppard Center. And the funds raised by the sale of this special license plate will be dispersed to the Sheppard Center Incorporated. If you turn your attention to the screen, that is another picture of my late husband, Darryl Kay Bentley, doing his, after he had his accident, in May of 2018, and we spent several months at the Sheppard Center here in Atlanta. And we were so very grateful for such a hospital as the Sheppard Center being here in Georgia, because if not, we would have had to travel outside of this state. And the Sheppard Center provided excellent care to him and also helped me doing my stay there to provide a housing for us as well. And so I'm very grateful that we have this, this type of hospital here in the state of Georgia. And so again, this special license plate is honoring the Sheppard Center and the sales of the license plate will be dispersed to the Sheppard Center Incorporated. For, and this is an honor of their fifth year anniversary. So at this, what that being said, Mr. Speaker, I will yield for any questions if there are any. If not, I ask for your favorable consideration of House Bill 1303. The lady has no questions. Thank you, Mr. Speaker. And thank you, colleagues, for your support of the Sheppard Center here in the state of Georgia. Thank you. What a wonderful resource for not only the people of Georgia, but for mankind, the Sheppard Center. So thank you for bringing the bill. Is there any objection to the previous question being ordered? Chair, has none of the previous question is ordered? Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair, has none of the report of the committee is agreed to? Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And the clerk will unlock the machine. Have all members voted if so, the clerk will lock the machine. On the passage of House Bill 1303, the yeas are 166, the nasor zero. The bill, Henry C. the requisite constitutional majority is therefore passed. Mr. Clerk, while you read the caption of House Bill 1192. House Bill 1192 by reps of course, from the 46th and others to be taught on act to amend Code Section 488-3. The official code of Georgia and attendee relating exemptions from sales and use tax shows to prohibit the issues of new certificates of exemption for certain high technology data and center equipment. Mr. Clerk, this bill I refer to the committee on ways and means that committee recommends that this bill do pass by committee substitute. Chairman Carson is recognized to present the bill. Thank you, Mr. Speaker. This bill is in regard to sales tax exemptions for high-tech data centers that are covered in paragraph 68.1 of our title 48 of our revenue code. Many of you heard about this from various constituents and some of our friends outside. What this is about is about suspending the sales tax exemption on the equipment that goes into these high-tech data centers. As you know, these data centers cover numerous acres that can be, have a very large footprint of several hundred thousand square feet, have hundreds of millions of dollars of equipment in them. What this equipment does is process a lot of financial and merchant transactions. A lot of them coming from our cell phones, point of sale and so forth. This sales tax exemption was put into place in 2018, but one of our colleagues, and it was also extended in 22. What the issue has been that has come forth is that these data centers are using an enormous amount of power off our grid. So what we're doing in this legislation, and I'm speaking specifically to members that have these data centers in their districts, what we're doing with this legislation is taking a two-year pause on issuing new certificates of exemption. So if you have a data center in your district and they're already operating, they have an currently exemption certificate from Department of Revenue, that continues. Other exemption certificates will be approved by the Department of Revenue under this legislation up to and through June 30th. Starting July 1st, we're going to take a two-year period, a period of pause to not issue new certificates of exemption, of sales tax exemption on the equipment so we can more study this issue and the industry and its impact on Georgia, not just on the grid, but also jobs and so forth. Lines 30 also increase the amount of the percent of average wages in order to be deemed a quality job. You also will see, starting on lines 38 through basically the rest of the bill, this creates a commission to study data center energy planning. To basically look at this, like I said, to look at this issue, study it for the next two years and if we pass this bill in the Senate degrees and so forth and it goes for signature, we will just basically put a pause on new certificates of exemption and if we do nothing else, July 1st of 2026, the exemption certificates can be once again approved. I'm sure there's other questions, Mr. Speaker, but that's basically the bill and I'm happy to answer a question and if there's no questions, I will yield the bill. You have a question? Yes, sir. I'll yield. Chairman Blackman and Senator Al. Isn't it true? Do you yield, Chair Carson? Yes, sir. Isn't it true that this preserves any applied for certifications that are currently in the pipeline? That is correct. If I may, Mr. Chair, I'll point the members to the bill. Lines 18, the commissioner self-suffend the issuance of any new certificates of exemption pursuant to this paragraph, but yes or to the chairman's point, existing certificates remain in place. Follow up questions. Yes, sir. Isn't it further true that any ongoing contracts with these data centers will also be honored? Yes, that's correct. Thank you, Mr. Chairman. Mr. Speaker, with that, I will yield the well. I'm sure there will be other speakers on this. Thank you, Mr. Speaker. You're right. There are other speakers on this. We have a folks sign up, speak opposed and in favor and the wisdom of the Rules Committee. We have a time limit imposed. There will be 30 minutes for those opposed, 30 minutes for those in favor and then we'll have the chairs time. For those opposed, we'll recognize Chairman Bonner, speak to the bill. Thank you, Mr. Speaker, colleagues. I rise today in opposition to the bill. It does not give me great joy to oppose Chairman Blackman and Chairman Carson on this, but I've got to stand and represent my community. In 2018, the State of Georgia identified data centers as a targeted industry in Fayette County followed suit. In fact, in 2018, I voted against the legislation that even created this incentive. But in 2022, Fayette County landed one of the largest data centers in the country in QTS. QTS came in and it immediately started investing in our community. The initial investment of $2 million alone in fees to the city available for permitting in another half million dollars to Fayette County Water Department. QTS acquired 615 acres in our community. That acreage could have been 1200 plus homes that would not benefit our tax digest because they would be using more services than they pay for. In 2021, the property that QTS now sits on generated only $31,000 in property tax. By using the 2023 rate, QTS will pay over $2.2 million in taxes and significantly more in 2024 when the building is complete. To date, QTS has invested approximately $5 billion in the first of multiple phases in our community. Now I appreciate the fact that not every provision in this bill applies to QTS and I'm grateful for the changes that have been made since the first draft. But we do have other opportunities in our community that this bill will impact their future. For our community, data centers have been a net positive. It is not a huge impact on our community in terms of traffic and infrastructure. There was a comment made regarding power. It is a bit challenging to reflect on the history of this issue. We were hoping to say that in 2018, the state of Georgia provided an incentive for a targeted industry and we were almost surprised that that industry took advantage of that incentive and they showed up here in Georgia. And we were even further surprised to find out exactly what a data center was and that they used a lot of power. I would submit that our Department of Economic Development did that research on the front end and we knew very well what we were doing in 2018. In fact, we did so in 2022. We extended that credit. So my ask to the body is this, just as the sponsor of the bill said we're putting a pause on this incentive, I would ask that we would put a pause on this bill. The message it sends to the communities out there that we try to attract, I think, is negative in this sense. So again, I appreciate the work that's been done by I would urge my colleagues to vote no. Thank you, Mr. Speaker. Gentlemen, yield, he had a question. He yielded the well. Representative Derek Jackson has recognized the speak to the bill. Representative Derek Jackson. Representative Bruce, is this the right one? Come on down. Representative Bruce, you and I make very few mistakes. He's younger guys like we at Park every then and then he makes a broken saying. Representative Bruce is recognized to speak to the bill. Passing on to my colleague over there. We all need some kind of relief, sir. It's okay. As I was saying earlier, you know, I wanted to try to approach this from a different angle. You know, everybody wants to come down and talk about the numbers. And I have some numbers too. This has brought $18 million to my community of 510 jobs. Since we, years ago, agreed as a group that we would invite these companies to come through our state. And we gave them tax incentives to do so. And all I'm asking today is that we live up to our obligation. We said that we were going to provide these incentives up until 2031, I believe it was. And we're about halfway there. And unfortunately, so much money has been invested in these communities. So many plans have been made around this. And as my colleague said just a moment ago, what is the message that we have send in to others that want to consider investing in our state? Bottom line is that if they can't trust that we will live up to the obligations that we make, then they're not going to invest. I wouldn't, if somebody told me that they were going to do something, they didn't do it, I would not put my money in them. I just wouldn't do it. I don't think you would either. So for that reason, I ask that you vote against this bill and Mr. Speaker, I you will well. General, the well, the well, Representative Derek Jackson, did I see you come back into chamber? Oh, there you are right there. Representative Jackson, don't worry about the hard time they're giving him. General, I was recognized. Thank you, Mr. Speaker. Here's our rise and full opposition to House Bill 1192. We often state that we're the number one state to do business. And the reason why we are economically is because we did the right thing many years ago to attract businesses to come to Georgia. We gave incentives for them to come to Georgia. And now in the data center, more specifically, an industry that I am very familiar with during my seven years at General Electric, we helped manage data centers. We're talking about 23,000 jobs. We're talking about $5.3 billion in one year. If we do not say no to $11.92, it's not just about those 82 data centers with 43 different operators. It's the dozens of data centers who are under construction. And if we do not say no to House Bill 1192, we will create an unstable industry that would negatively hurt us economically. It would negatively impact families who came to Georgia. These are six figure jobs. And when you think about just in my district alone, QTS is one of the largest data centers. Google it and the amount of money that they generate for this state. We will not have a surplus if we did not do the right thing for not just data center, but all these industries that we've attracted to come here. And so I humbly ask you all to say no to House Bill 1192. And with that, Mr. Speaker, I yield the well. General, I yield the well. We'll park as recognized as speak to the bill. General, I recognize. Thank you, Mr. Speaker. I rise in opposition to House Bill 1192. This bill is bad for business and bad for Georgia workers. On behalf of Georgia workers, first I want to speak to their concerns on this bill. The International Brotherhood of Electrical Workers, IBW, they are strongly opposed to this bill. They work, they've told me, that they work about six million hours annually in these high tech data centers, which equals about 3,000 workers. The building trades as a whole is about four times larger. So we're talking about approximately 12,000 workers with respect to construction. Their concern with this bill passing is that it will kill thousands of good paying jobs. The utility unions are also concerned about this bill. And in particular, they're concerned about existing investment that they have already made. Millions of dollars that they've invested in infrastructure where if this passes, potentially some of those infrastructure investment projects would otherwise have to be abandoned. Now I've also heard and I recognized legitimate arguments from a lot of our conservation organizations with respect to the amount of energy and water that these high tech data centers utilize. Those are very real and legitimate concerns. However, I do not think that we need to slam the brakes on this tax exemption, which is what this bill does with utilization of the word, shall. The commissioner as far as I'm aware would otherwise retain discretion as to what tax exemptions he could approve or not approve as it exists without this bill. But what this bill does is that it slams the brakes on this tax exemption and provides a lot of uncertainty within the business environment. So again, there are competing interests here in which I believe that as a legislature and as a state, we have the ability to walk and chew gum at the same time. I think we could impose parameters or require additional investment from those who would otherwise be receiving these investments without putting a two-year moratorium. We can study this issue while still ensuring a certain certitude when it comes to our business environment. Last two things I'll say, as a Georgian, I want to see high tech companies continuing to come into Georgia and continuing to invest in the state of Georgia. One concern that I have, and we'll see whether or not it bears out, is I'm very much aware of the opportunity the state of Georgia had a few decades ago when it came to having the banking industry be settled down here in Georgia. We missed out on that opportunity as a state and that banking industry ended up settling in North Carolina. I know it's not an exact analogy, however, again, I don't want this bill to send a message to high tech companies that the business environment in Georgia is unstable and unpredictable, in which after passing a 10-year exemption in the middle of that, we're pumping the brakes and based on what derives out of this study, which we could still do in the meantime, they could otherwise terminate this tax exemption that's generated billions of investment in the state. Last thing I'll say in opposition to this bill is that I do think it is a rare instance and a rare issue in which there is both bipartisan opposition to a piece of legislation with my respected colleagues on both sides of the aisle speaking against this bill, along with opposition from both industry as well as labor on a bill. And so for all of those reasons, I respectfully urge all members of this body to vote no to HB-1192. Thank you, Mr. Speaker. I yield the well. The gentleman has yielded the well. Representative Gamble has recognized the speak to the bill. Representative Gamble. Thank you, Mr. Speaker. Today I rise something to do that I've never done before. This is my six legislative session. And until today I've never spoken against a bill in the well, but I feel that I have to be a voice for my district, and I'm here on fighting on behalf of my community. Let me start by saying there's a lot of conversation that you've all heard from both sides about what this bill and what this bill does not do. You've all seen the letter from the Georgia Chamber of Commerce opposing this bill. Going back to 2018, Georgia has courted this industry. And as recently as 2023, we have signaled to this industry that Georgia was open for business. So as a result, a data center has come and purchased 1900 acres in my district. And as we sit here today debating this legislation, land is being cleared, dirt is being moved, and fiber is being placed in the ground. And now we say stop, mid project we say stop. We don't want this project in Georgia for the next two years. That's what we're saying. This same site was zoned for 2,200 single family homes, possibly build a rent. I know that's been a controversial subject around here. I don't know. It would require a new elementary school. But instead we have a project that provides $44 million in personal property tax to local schools over the next 10 years. Millions of dollars in sales tax on energy used and new enhanced broadband connectivity in South Bartow County. This project is strongly supported by my local economic development officials. My local mayor, the Bartow County Commissioner, Commissioner Steve Taylor, and business leaders from Bartow County. This is not a project that was forced on us. We wanted this. We wanted this for our community because of the many benefits that it brings to us. Please don't change this game midstream. And say that Georgia is closed for business after saying come here just over two years ago. I'm not going to call this a bait and switch, but I'm going to call it a give and take. What is this signal to other industry that would come here and have this incentive? The high tech data center incentive is the best bang we have for the buck with a 10 to one return. For every dollar invested, we get 10 back. And that's according to the Carl Vincent Institute. You don't have to take my word for it. It's what they found. Brass building, Gory Holder, some of the larger folks that are interested in working in this industry. They've all spoken out in opposition to this bill. I just would ask you all to give consideration to what you've heard today. I know there's a pause for two years, but I think it has a bigger impact than just a pause for two years. And I would ask for you to vote against this bill. Thank you, Mr. Speaker. I yield the well. Gentlemen, as yielded the well, that completes those opposed to the bill. Those in favor. German Knight, recognize and speak to the bill. Speak it in favor. Thank you, Mr. Speaker. I'm going to be brief. There are concerns with this. Number one, data centers use large amounts of energy. That goes as factual. They use large amounts of energy. So there are questions about what it's going to do to our electrical splines, Georgia. In fact, at our state, our citizens invested in the two new vocal plants. And it's been a comment that one of them would almost be taking up the output that would be taken up by these data centers. But I want to point you to a secondary issue on energy. And data centers are not the only companies that do it. And I know for a fact that a lot of them are the ones that are doing this. They want to be net neutral. They're one of the largest energy users. Listen up, rule, Georgia. Listen up, rule, Georgia. They're one of the largest energy users, and they want to be net neutral. So what did they do? They take the federal tax credits. And they're the ones that are putting, I know, part of the large strain and demand of the solar installations that are going across rule, Georgia. So they can be net neutral. They're the ones that are taking these tax incentives from the feds and going out into rule, Georgia, our farmlands, and are partially responsible for those solar panels. This needs to be studied. Not all of our tax credits. Sometimes our tax credits are too good. And with AI coming on, the demand is only going to be greater. And I would tell you that there are more issues to this, especially environmental issues, and then issues surrounding rule, Georgia, farmland, okay? Run off destruction of land that we need to look at. I would urge you for that reason alone to put a pause on this and to look at it. I'm serious to Georgia and it's a policy that we need to look at. And it is directly related to these tax exemptions. And I'd urge you to put a pause on that, especially rule, Georgia. Thank you. Gentlemen, is you, too, the well? Now we have the chairman's time. Chairman of the committee, Chairman Blackman, speak to the bill. Thank you, Mr. Speaker. I'm an yield most of my time to Chairman Williamson and Chairman Martin, but I did want to say one thing. We know things now that we didn't know in 2018. We know things now that we didn't know two years ago. We also know that this is an immense subsidy for an industry that takes up a tremendous amount of resources, power and water. And taking the time to step back and look at this is a prudent step. And it is do the taxpayers of the state of Georgia. And it's not just happening in Georgia. It's happening across the country and around this world. Now I yield my time to Chairman Williamson and Chairman Martin. Chairman Martin. Chairman Williamson, ways, Chairman Martin, speak to the bill during the chairman's time. Thank you, Chairman Blackman. Ladies and gentlemen, this is tough situation for everybody. I get it. But I'll also tell you this. I'm looking at the reports that have been mentioned. And the money involved is $8 million in 2018. It goes up to $30 million this. Understand this. The author of the bill and the chairman have said, we're not pulling the rug out of anybody that's trying to be in business today. Let me say that again. You're not changing the rules on anybody that's trying to be in business today. They have to do life first. I trust the gentleman on his word that if there are tweaks that need to be made to honor that, that the gentleman will do that. They author the bill and the chairman of the committee. But I would stand until you.\n\nJust this today. As I said earlier in the afternoon, it is prudent for us to watch the taxpayer's money. I for one a few years ago, questioned why we extended it at the time without the information. So that's what we're trying to do today. I ask you to support this bill, support the legislative process. There's probably a 99% chance you'll see it again with some changes, but we need to take a look at this and to do that, we need a positive vote to move this along. I yield the well. Gentlemen, as yielded the well, that completes our discussion on House Bill 1192. Is there any objection to the previous question being ordered? Chair, here's none of the previous questions ordered. Is any objection to adopting the committee's substitute? Chair, here's none of the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here's none of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. Clerk, all members voted. All members voted. Clerk, will lock the machine. All in the passage of House Bill 1192, the yeas are 96. The nays are 71. The bill, Henry C, the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 10181018? House will 1018, I represent it, probably the six and others to be titled, act to amend title 10 and title 16. Any of the officials go to Georgia, annotated, related to commerce, and trade, and crimes, and offenses respectively. So as we provide for protections of persons who own purchase or engage in the business selling firearms. Mr. Belimmer, for the committee on banks and banking, that committee recommends that this bill do pass by committee substitute. Right, wait just a minute. Thank you, members. Chair, recognizes, representing Jason Ridley to present the bill. Thank you, Mr. Speaker. And my friends on the other side, don't let that description scare you about this bill. Let me tell you what this bill's about. It's about national security. Whenever you go and use your credit card, there's a four-digit code that comes from the processor called a merchant category code. That code connects that card to whatever store you're buying. Walmart is a discount store, so it'll have a number, for example, like a 5911. Each one of those numbers means something not specifically to what you're buying, but what store you're at. A gas station has a different number, and so does any big box store have a different number. What this bill does is one simple thing. Well, actually, maybe I should refrain on one simple thing. A few years ago, and that code, well, let me go back, that code is set by a company out of Geneva, Switzerland. This is called the ISO, the International Standard of Organization. That's how they come up with those code. It's not set up by the FDIC, the Treasury, or anybody in the United States is set up by a foreign country, and it is an entity of its own. So a few years ago, back in 22, they came up with this new code for firearms. And it was 5723, and if you look on the bill online, 38, you'll see that number there. What that number did is whenever you went into a store, if they sold guns, instead of it being a sporting goods store, a general merchandise store, anything you bought in that store, if it was firearm related, or if it was a tent for a camping, it went under that code, so it looked like you were buying a firearm. Now, here's where I think a National Security standpoint comes in. You've got a foreign country that whenever you're buying something that can have a registry, that registry goes, they do this for 180 different countries. So it's one standard deal. So that's where this bill came from, that's the reason we're doing this bill. So since they came up with this code, and it's not being used in 2022, the credit card companies raised came to quit using it. What's happened to now is you got individual states that are using this code, but cause this code is out there now. California has passed a law saying that you've got to use this code, whenever somebody buys something that's firearm related. Colorado is currently trying to pass this same law. It's going to wreak havoc on the credit card companies, the processing companies, because you're going to have some states that's going to use this code, and some that's not going to. So what we're doing is just staying with the standardization of what it's always been. This code does not exist in Georgia, and so they can't use this code. I don't care what side of firearms you stand on. Nobody should know what you're buying and be keeping the registry, especially if foreign countries. That can be distributed to anybody at any time. And that's all this bill does, and like I said, all we're doing is keeping that from happening here in Georgia. And if you've got any questions on a big, glad to answer it. Do you have some questions? Chair recognizes representative person for a question. Thank you, Madam Chair. Mr. Jim Maniel. I do. Is it not true that a specific firearm code for credit card purchases could result in lawful transactions made by law-biting gun owners being reported to law enforcement agencies? Yeah, I think it's a bigger risk of foreign countries, and it is no one who's got what over here. That credit card is up to you personally. So if that code comes up on your credit card information, then they're going to know what you're doing. But the bad part is this. If you're in a gun store, and everybody knows, everybody's got them in their town. So they don't just sell guns. They sell camping equipment stuff. Whatever you're buying, it's going to go under that code. So somebody's going to think that you're buying firearm stuff when you're not. So thank you for the question. Chair recognizes representative Chastain for a question. Thank you, Madam Speaker. Jim Maniel. Yes, sir. Is it not true that federal law contains multiple restrictions on the creation of national firearms registry? And the creation of that merchant code is attempt to circumvent the system? That's exactly correct. And that's exactly what it's doing. Thanks for your question. You are in the United States. It's illegal to do this. That's the reason they're doing it to a foreign country. And that's exactly what this right here would do. Chair recognizes representative Clark for a question to your left. Thank you, Madam Speaker. Does it gentlemen you? Yes, I do. So would someone mention that this could be used by lawful citizens making lawful purchases? But could this not also having this code, could this not also prevent some of the mass shootings that we have seen all across the country when people are buying stockpiling all these guns and then using them to exert terror on our students and our schools right here in Georgia and across the country? No, Madam it would. Because it's a big tie to your credit card. So unless somebody stole your credit card and was buying all those guns, then it's not going to prevent anything. There's already home there. And you got to think about this. Whenever you go and buy a firearm, you've already got to fill out forms. This guy, you got to have a background check, the scent. That information's held by the ETL. So this would have, that would not prevent that from happening. This code is by a foreign entity. It don't have anything to do with what you're talking about. That does it gentlemen, further you. So when you say that, it is by a foreign entity. No one in the United States is getting this information. Is that what you're saying? No, Madam. What I'm saying is credit card companies are having this information. What I'm saying is a foreign entity has came up with this number. So they come up with all the merchant category code numbers. Since the 1970s, this one company has done it. So what I'm saying is they've never been a number. You still, when you went and bought a firearm or you bought a tent, it was under Sporting Goods or General Merchandise. They came up with this code individually for firearms, period. And so that's the whole issue is you've got a foreign country that's coming up with a code that knows what you got at your home. But the bad part is mistakenly, if you're just going camping and you buy the stuff in the gun store, then it's also going to have that on your card also. Thank you for using the question. Chair recognizes representative Monta-Ham for a question. Thank you, Madam Speaker. Does gentleman yield? You'll for one more, yes, sir. Is it not true that states like California have already passed legislation to weaponize these codes against law abiding weapons carriers? Yes, sir. That's exactly what they're doing. And that's going to probably end up in federal court before it's over with. Madam Speaker, I think I've explained the bill and how yielded the well. Hope your favor will consider a situation, whatever that word is. The gentleman has yielded the well. The chair recognizes representative Roberts to speak to the bell. Thank you, Madam Speaker. OK. I have a little bit different take on the still, but I'm going to start with this, colleagues. Let's start with what we can all agree on. I think every member in this chamber supports law enforcement and wants to give them the tools. They need to hold criminals accountable. I don't think they want any of us to leave our banks helpless to prevent fraud. And I know we all want to do anything we can to stop human trafficking, terrorism, and mass shootings. And I believe we all want to keep our families and our communities safe. This bill does none of these things. In fact, it does the exact opposite. These codes, let's talk about them for a minute. They're four digit codes that are used throughout the retail economy to classify retailers by their primary business activity. These are not new. As a matter of fact, if you look at your AMAC statement, you'll see your purchases are divided into lots of categories, groceries, men's clothing, beauty products, alcohol. Visa has over 500 of these MCCs, they're called. They hold critical information that are used by different parties involved in an electronic transaction. As a card holder, they're used to track our spending so that we can figure out if we're eligible for certain rewards through our credit card companies. Merchants, you assign these based on the primary business activity banks that provide merchants with the point of sale systems and the payment. They use them to measure and assess the risks of transactions with those merchants, things like fraudulent chargebacks, categories of goods and services are assessed as high-risk, low-risk, and middle-risk. High-risk categories are associated with a high level of fraud and chargebacks and include categories such as gambling, credit institutions, stores selling alcohol and tobacco products, various online stores, online gaming and advertising. There's all kinds of them, but high-risk because of this potential fraud. So why are we even talking about all this? Because even though MCCs are not new for so many industries, in September of 2022, the International Organization for Standardization created a new MCC for sellers of guns and ammunition. Let me read to you what the International Organization for Standardization is real quick. Just so we can clarify that this is not some international conspiracy that's going to put us in harm's way. This is an independent, non-governmental, international standard development organization composed of representatives from the national standards organizations of members' countries. It was founded in 1947. It's published over 25,000 international standards covering almost all aspects of technology and manufacturing. It has over 800 technical committees and subcommittees. This is about trade and exactly what I said before, ways for us to identify transactions. It is not a national security risk. So let's see. So you're right, absolutely. Colorado and other conservative states are bringing legislation just like this bill to preemptively stop credit card companies from using this new MCC because the gun lobby's believe it's going to somehow lead to a gun registry. That is a fiction. But apparently the sponsors of this bill think that that unfounded fear is more important than the good could come from this new coding. These codes could be combined with other data points to help financial institutions detect and report suspicious activity, including fraud, and transactions associated with crimes like human trafficking. State laws that prohibit and penalize use of the gun and ammunition store merchant category code limit the banking system's ability to manage risk from firearms retailers. There are almost 80,000 gun and ammunition stores in the United States with an estimate market size of 18.5 billion into 2023. The firearms retail market creates risks for banks because of the prevalence of chargebacks. Specialized payment processors that serve gun retailers say the prevalence of chargebacks is because of the try after you buy nature of online sales, relatively high cost of firearms and fraud. So for retailers, this is expensive, y'all. It leads to financial losses, higher fees, and the inability to accept credit card payments. For banks, chargebacks for any reason create credit risk when merchants fail to legitimate chargebacks. According to the federal department deposit insurance corporation, in that case, the acquiring bank is obligated to honor the chargeback and pay the issuing bank, which could result in significant loss to the acquiring bank. So this is increasing their risk and their inability to do these things. The gun and ammunition store code allows banks and credit card companies to develop rules-based transaction monitoring systems without drastically altering their internal systems for coding and processing transactions. The gun store MCC simply integrates with existing financial infrastructure to provide additional information on sales made by gun and ammunition retailers without limiting or further regulating gun sales. Law enforcement officials seeking to identify individuals who are potentially stockpiling weapons could also benefit from this new information. This kind of cooperation and information sharing between retail outlets and law enforcement is routine and encouraged across the federal government in related public safety context, the FBI, FEMA, the Bureau of Alcohol, Tobacco, Firearms, and Explosives, and the Department of Homeland Security. All have trainings, pamphlets, and promotional videos, emphasizing the importance of retail security awareness, which the FBI defines as maintaining awareness in retail stores and reporting suspicious activity to the appropriate authorities. In addition, financial regulation, such as the right to financial privacy acts, specifically exempt banks from their obligation to protect private financial information, they provide that is relevant to a possible violation of the law, not law-abiding gun owners, like myself and my husband, but people who are violating the law. The information collected via the new MCC could feed directly into the existing trip wire system that the FBI has used for more than 30 years to track the sale of materials that are commonly used to build bombs. It would ensure that gun retailers did not bear the full responsibility for ensuring retail security awareness under the new system payment networks, like Visa and MasterCard and Merchant Banks would also bear some responsibility for providing law enforcement with information about the number and frequency of gun purchases by individuals that is not captured by point of sale background checks. The gun store merchant category code can be used in rules-based transaction monitoring systems to detect potential active shooters planning mass casualty events according to the Federal Financial Institutions Examination Council. Suspicious activity reporting forms the ability to utilize financial information to combat away for it terrorism, terrorist financing, money laundering and other financial crimes according to Oracle, the workhorses of transaction monitoring have been rules-based systems commonly referred to as scenarios. Scenarios are essentially simple if-else statements that trigger an alert if a specified combination of conditions are met. Financial institutions can choose to deploy a few scenarios or up to several dozen depending on the size and risk profile of the institution. They may also be able to deploy new scenarios in response to new products that the institution brings to market. Banks have created rules-based transaction monitoring systems to meet this expectation that can be adapted to detect and report potential active mass shooters planning mass casualty events. An example of a methodology to detect a possible active shooter before a mass casualty event would be not looking up your name on a registry, putting in these factors, and when the transaction goes through and you see during a 60-day look back period, a bank customer transactions at five or more distinct gun merchants, they would see it by this code, the MCC code, aggregate purchase transactions totaled $2,500 or more from gun merchants, number of transactions at gun stores or more than 50% of the total transactions on their credit card, aggregate purchase amount is more than 50% of purchasers by the customer. This scenario right here describes an individual trying to hide their rapidly intensifying interest in firearms by shopping at multiple gun stores and mirrors the Pulse Night Club shooters buying pattern just before he killed 49 people and wounded 50 more in Orlando, Florida in 2016. If a system for collecting and flagging suspicious gun ammunition sales had been in place over the past 15 years, law enforcement officials would have had the opportunity to potentially intervene and prevent multiple mass shootings, a review of mass shootings involving the payment system, your credit card, returned eight clear cases where the shooter used electronic payment to purchase weapons used in the incident. Cassis Adobe's Arizona in 2011 where representative Gabrielle Giffords was shot, Aurora, Colorado, where Holmes killed 12 people and injured dozens more in the mass shooting at the movie theater in Aurora, Colorado. Another, let's see, 14 lives in San Bernardino, California in 2015, I could, a teen killed 49 and injured 50 more at the Pulse Night Club. Oh my goodness, the list goes on and on and on. Lots of people that we potentially could have saved just by seeing credit card information. If we want to protect our banks from fraud and unnecessary expense from a high risk industry, if we want to assist our law enforcement in preventing and prosecuting terrorism, human trafficking and mass shootings, if we want to keep our families and communities safe, why the heck are we trying to pass a preemption bill that does nothing to help any of those things? Why are we preventing banks and law enforcement from utilizing the same tools to protect themselves in our communities that they use with other high risk industries? That's a rhetorical question because it's what we've seen time and time again. The gun lobby trumps everything. If you vote for this bill, you're letting Georgians know once again where your priorities lie that you are willing to prioritize a fictional gun registry ahead of our banks, businesses, law enforcement, human trafficking victims, and Georgians, families, and children. What's even more insulting is that because these other conservative states have filed these preemption bills, the credit card companies have already stopped their efforts to use this MCC code. And I know y'all know that. So you and your, don't want, you and your gun buddies won the codes are not being used. So why are we wasting valuable time in this chamber right now when we have so many important things to be doing for the people of Georgia? This is performative politics. We should be spending our 40 days finding ways to expand access to healthcare, housing, economic opportunity for all Georgians and to keep our families truly safe. Thank you. I yield the well. The lady is yielded the well. The chair recognizes representative Scott to speak to the bill. Thank you, Madam Chairwoman. This is Madam Speaker. To the members of this house, standing opposition to House Bill 1018, the so-called Georgia Fire Arms Industry Nundiscrimination Act. While this bill may sound appealing on the surface, it threatens to save the and well-being of our communities. First and foremost, the bill restricts the ability of financial institutions to implement necessary safeguards against potential risk associated with firearms transactions, by prohibiting the use of firearms coals and prevented financial institutions from distinguishing firearms retailers from other merchants. HB1018 undermines crucial measures that help prevent illegal activities such as money laundering and the financing of illicit arms trafficking. Furthermore, this legislation hampers the ability of financial institutions to exercise discretion and processing payment card transactions involving firearms. By mandating that financial institutions cannot decline transactions, solely based on the assignment or non-assignment of a firearms code. HB1018 ties the hands of these institutions, potentially exposing them to increase risk of fraud and financial crimes. Additionally, House Bill 1818 poses a threat to the public safety by prohibiting the creation of maintenance of multi-dirted addiction of databases of information regarding weapons' care and licenses. Such database plays a vital role in ensuring that firearms do not end up in their own hands, whether through individuals who are not qualified to possess them or through illegal channels. Moreover, by prohibiting the keeping of lists, records or registries of private-owned firearms are their owners. This bill obstructs efforts to track and trace firearms used in criminal activities, hindering law enforcement's ability to investigate and prevent gun-related crimes effectively. In conclusion, House Bill 1018 undermined safety, public safety, weakened financial institutions ability to come back in this activity and obstruct law enforcement efforts to keep our community safe. Therefore, I urge you to stand against this misguided legislation and prioritize the safety and security of our communities. Thank you, Madam Speaker and I yield a well. The lady is yielded the well. The chair recognizes Representative Westbrook to speak to the bill. Thank you, Madam Speaker and good afternoon colleagues. I rise to speak against House Bill 1018, the Georgia Firearms Industry Non-Discrimination Act. This is the latest iteration in this body's ongoing series of bills with completely misleading names that attempt to conceal from the voters what they actually do and the negative consequences we will all be living with or in the case of this bill not so much living with as potentially dying from. The bill says it is to provide for protection of persons who own, purchase, or engage in the business of selling firearms. What it actually does is carve out for firearms sellers as a super special favored industry giving them protections that no other business gets. So what does House Bill 1018 do? It prohibits private businesses from requiring firearms sellers to comply with merchant category codes which are four digit numbers called MCCs that identify the type of business processing a financial transaction. Grocery stores, department stores, hardware stores, as my colleague mentioned, these are things that appear on all of our credit card statements every month. They are completely innocuous. It's information and transparency. Prior to 2022, there were no codes for gun and ammunition stores. They were categorized as sporting goods stores or miscellaneous general merchandise stores. After the new merchant category code was approved in 2022, the credit card networks, VISA, MasterCard, American Express announced that they wanted to adopt and use these new MCCs. Let me be clear on something. This is an innovation that came out of a non-governmental organization, not a foreign country, not a foreign country, but a non-governmental organization that studies efficiencies. It kind of sounds like something the number one state to do business might be interested in. This is an established non-governmental organization and the private sector and businesses picked it up. They wanted to use it. So this is not a national security threat. This is not big government. In fact, this bill is what's big government. This is us, is elected leaders of government, and our endless desire\n\nto overreach, telling the private sector what they can and cannot do, which is what we like to do. And in this case, it increases the risks to our communities presented by mass shootings. And the majority of mass shootings between 2007 and 2018, according to a study, the shooter used credit or debit cards to acquire the guns and ammunition used in the attack. What the codes would have done, if they had been in place then, was allow the banks issuing those credit cards to absorb and flag suspicious buying patterns in ways that law enforcement and ways that the family members of mass shooters and retailers simply cannot do. Implementation of the new codes for gun stores could enable financial institutions to identify and report potentially illegal gun sales, again not law-abiding gun owners here, potentially illegal gun sales to law enforcement, reducing trafficking, straw purchases, and transactions that are designed by going to multiple retailers to evade the mandatory multiple sale reports required by firearm real-tailers. Retailers. Financial firms are already doing this with a whole host of suspicious transactions related to other types of illegal activities. Again, this isn't new, this is a carve-out for this favorite industry. This bill is protecting them from doing something that we already require of everybody else. And as always, these decisions we make aren't made in a vacuum. And Georgia, as we know at Bears Repeating, we have high rates of gun violence, high rates of firearms suicide, including among our youth and including in our rural areas. We have high rates of unintentional shootings because our younger children are accessing unsecured firearms. And we have high rates of interpersonal conflict in our metro areas that along with easy access to guns, leads to too many deaths of our young people. In Georgia, firearms are the leading cause of death for children and teens that is now true of the US as a whole. More than car accidents, more than the illnesses that every parent fears, like childhood cancer, more than any other cause. In this country where most of us who are parents put our children in cars and drive them multiple places, multiple times a day, car accidents aren't disproportionately taking our babies' lives, not car accidents because we decided to make those car trips safer with a whole series of vehicle safety laws. But with firearms, we have done the opposite and continue to, and this bill is just the latest and a long line. It is unconscionable that we are allowing firearms to take the lives of so many Georgia children. I will note though that one list that Georgia is not on though, at least not so far, is the hurt list of horrific, high-profile mass shootings that are known usually by name only. Parkland, Sandy Hook, Aurora, Columbine, Yvall Day, and many others. But I fear it is just a matter of time and I cannot for the life of me understand why we would make choices that increase risks for our communities, our schools, and the law enforcement officers who respond to these violent scenes. We who love in this body to talk about public safety and we love to crow about who really values law enforcement. Why would we take any tool out of their toolbox? Why would we make their jobs harder? Why would we not put not just our children at risk, but also the people who run toward danger? Why would we put them at more risk? In closing bills like this are wildly out of step with what our constituents want from us. They want safe schools and safe communities. We all know this. Every single one of us sitting in here. Some of my colleagues in the majority party represent constituents who make sure you know this and they're watching. I ask that you vote no on House Bill 1018 and Madam Speaker I yield the well. The lady has yielded the well. The chair recognizes Chairman Sains to speak to the bell. Thank you Madam Speaker I'll be quick. I'll start off with a quote from the liberally governed state of New York. New York state legislative environment remains a major concern for our industry. That's from Ken Darcy the CEO of Remington. That quote signified a loss of 300 jobs to New Yorkers. Those jobs removed to Georgia. Part of the reason I tell you that quote is because this bill addresses a new found understanding from some in our chambers that taking away and eliminating and restricting and making it more difficult for our law-abiding citizens to own firearms is not a popular move to make. So a new strategy is to use these non-governmental agencies not elected by anyone in particular the international organization of standardization governed by a foreign governed in a foreign country with zero US bankers in their association and their governing association. This bill does three simple things. On line 71 it clarifies that we cannot use these firearms specific merchant codes in financial institutions. Something that has been stated by those detracted from the bill that this is a new code. There's been financial transactions performed prior to the code being established and there will be afterwards. Two on line 77 it prevents the arbitrary transactions from being denied for no no valid reason. So if a customer is making a transaction for a firearm they're not going to be denied on that exclusive cause. And then finally on line C which I think is one of the most important parts of this bill it prohibits government agencies from creating and maintaining a multi-juris jurisdiction database pertaining to weapon carrying licenses and privately owned firearms. This sensitive information for law-abiding citizens is unwarranted in government hands. Especially given the fact that we know based on the US Bureau of Justice Statistics that 60% of convicted felons avoid potential victims when that victim is known to be armed. We know that the majority of felons admit to avoiding homes where people are armed or they feel like they might be harmed with a gun. We know that this is sound policy for public safety and we're fighting back against not only leaving our constituencies gunless but also jobless at this point due to the failed policies that this detracts. Thank you Madam Speaker. A yield. The gentleman has yielded the well. The chair recognizes Representative Kelly to speak to the bill. Thank you Madam Speaker. I don't get in this well and proclaim myself to be someone who has a big understanding of technology issues or someone who's worked on a lot of high profile technology pieces of legislation. In fact probably the last time I worked on one is in 2018. And about 10 minutes ago we gave that issue a little haircut. But something I do like to think that I've studied and I've spent a little time getting to know is is our US Constitution. And the reason for that is because every two years we stand in this chamber, put our hands on our Bible and swear it up hold it, the US Constitution and the Constitution of the State of Georgia. I think everyone of us take that responsibility seriously. I think we make that commitment to our districts and to our state and to our nation. And so what we're asking to do in the piece of legislation today is just uphold some of those fundamental principles that every two years we swear no to. The second amendment. Our second amendment whether we like it or not, whether those in the minority party who don't agree with it, think the founding fathers got it wrong. Our US Constitution gives us an opportunity to lawfully have firearms. What we're here today is we're standing up for our second amendment. We're also standing up for our fourth amendment that protects against warrantless searches. Without this legislation we're having financial information shared. With retailers and our payment processors with government entities without any warrant ever being issued. I believe in our 14th amendment which guarantees us all do process. Thank God that we have a Constitution that says you are innocent until proven guilty. But what legislation in other states, opposite of what we're trying to do today, they try to make law abiding systems who simply may go to their hardware store and buy a few too many rounds for some bureaucrats' mind, tries to make them guilty before they've ever committed a crime. And then finally we're here standing up for the 10th amendment. If we're going to make policy that regulates firearms, then that decision needs to be made in this body under debate. It should be bade by some financier in New York, Urgen-Niva, or some non-government organization. That policy should be debated in this chamber. And we are taking steps to make our community safer. This year's budget has $45,000 per school, $45,000 per school, over $100 million. This is going to be ongoing funding. In the last two years we put $80,000 for every school. I'm in agreement with the minority party on this. We won't say for schools. And we're doing that. But there's a process. And there's a way we can do that working together that doesn't violate the Constitution and the oath that we swear to every two years. And that's why I hope everyone in this body will come together and vote for this legislation. And with that, Madam Speaker, I'll yield the well. Chair recognizes Chairman Williams for the Chairman's time. Thank you, Madam Speaker. You know, it kind of alarmed me when I found out about this because this bill came through banks and banking with zero opposition. And I was just kind of surprised when I got up here and see how everybody was against it. And I didn't realize this was such an onslaught on our privacy. But I would like to turn my time over to Representative Ridley, who I thought did an outstanding job explaining the bill and representative. of gentlemen as you all did the well, the Chair recognizes Representative Ridley to speak to the bell. Thank you, Madam Speaker. Put inside teffic terms, I've never heard so much bouvon fickle matter in my life about this bill. What this bill is about is about merchant category codes. It's about labeling the merchant as a firearms dealer. That's what the code is about. So what we're doing with this is saying that you cannot use these terms. That's it. You can't use this number. It was not a number that you could use before. And they're saying it's not being used, but it is in California they passed the law that you do got to use this number. So if you're a gun store, everything sold in that store has got to be labeled under this number. Now, you all want to know where it came from? I didn't want to get into it. Let's get into it. This number came from one bank that petitioned this one entity to come up with this. Now, the credit card companies, when they come up with this number, they have no choice. They have to abide by it. They can't opt out. They have to use any code that the ISO comes up with. One bank, Amogotten Bank in New York started in 1923. It's the only union-owned bank in this country still today. It has a $42 billion union pension fund that's backed it. And guess who? Let's talk about the great information about this bank. Every Democrat president, congressman, senator from Obama, Hillary, and everybody else, campaigns are at that bank. Guess who runs, when you do your campaign there, guess who has a 24-hour counts-air service from the prior administration that bank? So to set up here and say that this is in bring up Sandy Hook and all this other stuff, this bill has nothing to do with any of that. But I'll blow it. I won't just blow and smoke up everybody. I'm all over the place. Excuse me. Blow on smoke all over the place and try to make this bill that's something that's not. All this bill saying is a fine gun store that you cannot label me under a different code than sporting goods or general merchandise, which has always been forever. That's it. And Madam, I don't know what else to say about this bill besides it's a great bill. Thank you. I'm guilty of well. Good decision. That completes all the speakers own House bill 1018. Is there an objection to the previous question being ordered? Is there an objection to adopting the committee substitute? Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted for what purpose is represent for a man rise? Parliamentary inquiry. Is it not true that the foreign nation we've discussed is actually switch a line which has a stunningly high rate of gun ownership, but not the same mass shootings that we have here as a result of good gun safety measures. I'm sure the lady believes in what she stated for what purpose does represent the bird rise? Parliamentary inquiry. Is it not true if the opposition party cared about the border as they do about gun sales 165 American citizens would still be alive since the Biden took office. I'm sure the lady believes in what she speaks for what purpose does represent representative Jordan Ridley rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that we currently prohibit multi-jurisdictional databases of people who hold carry permits and this bill simply closes a loophole by also prohibiting databases of people who applied for carry permits? I'm sure the gentleman knows of what he speaks. Have all members voted if so the clerk will lock the machine on the passage of House Bill 1018. The Yees are one of six the nays are 60 that Bill haven't received the requisite constitutional majority is therefore passed. Members, I hope you'll join me in welcoming three former members to the House. We have representative former representative Brenda Lopez Romero. She's right now front of you stand up. Former representative Lopez we have representative Amy Carter. Representative Lynn Raleigh, former members of this House. Lynn is to my right. Representative former representative Carter is in the back to my left. So it's good to have all three of you back ladies. You all had great service perform great service when you when you were here as members. Mr. Clerk, will you read the caption of House Bill 971 971? House Bill 971 by Representative Newton to the 127th and others to be entitled. Now to amend chapter 7 of Title 48, the fish go to Georgia, anti-regulating income taxes. So it's a reminder for a tax credit for certain eligible expenses incurred for firearm safe handling instructional courses in firearm secure storage devices. This bill I've referred the committee on ways and means that committee recommends this bill do pass by committee substitute. Members we have a couple of important bills remain on our rules calendar couple of important bills. And this is certainly one of them. Members will please come into the chamber take your seats. If you're conducting important business you need to do it a little less quiet. No, a little more quiet. Not less, not less quiet. No, that's not that was a misspoke dinner. The doors are open to both any rooms. If you need to have a conversation. That would be an excellent two excellent places to have that conversation. Chairman Newton is recognized to present House Bill 971. Thank you Mr. Speaker and colleagues House Bill 971 supports Georgians. So many of whom over the last four years in particular due to significant crime and violence have purchased or considering purchasing a firearm to better defend themselves. Their children or their family against criminal violence and who desire to do that in a responsible in a secure manner. This legislation allows Georgians to use a portion of their state tax obligation as a tax credit for up to $300 per taxpayer for two things. To obtain firearm training through an in person firearm safe handling instructional course. Remember many of these individuals may not have grown up hunting or maybe they didn't wear blaze orange or pink representative. But they may not have grown up hunting or may not have ever been in a home that had guns around. But now they may are considering or have purchased one. It allows them to obtain that firearm training and also to purchase a firearm safe storage device that would allow them to keep the firearm both readily accessible. And also secure from children. But even more important especially from criminal theft which is fueling much of the gang related shootings we hear about almost daily. In particular the deaths of children and teens primarily the result of homicide illegal use of guns is over 60% of the pediatric deaths we hear about. We're working on mental health to try to decrease suicides and accidental shootings as well. But remember. Homicides many of them gang related from stolen firearms is one of the leading causes of death in children in our state and across the nation. Couple of interesting changes or important changes we made to this bill on line 67 and 68. We specified that no individual no entity can make a list of these. I know it was mentioned about the risk of a gun ownership or gun training or a firearm safe list. This bill assures that in addition to it being in your tax records which are some of the most protected records we have that there can be no list obtained of these. So that was one of the precautions we wanted to make sure of. We wanted to make sure it's voluntary. All of this is optional. No one's required to use this tax credit. They can buy whatever they want. I know the fourth amendment was mentioned by an earlier speaker. This is voluntary and no one's going to come into your home and check and snoop around to find out whether or not. What's going on in your home or whether you own a firearm or not. This bill is consistent with our constitutional rights under the second amendment. But it allows us to place protection of our ourselves and our families in a responsible manner. And I do hope I'm glad to answer any questions. Mr. Speaker. I hope you'll support the bill. Gentlemen, has no questions. Thank you, sir. I yield the well. Good job. Thank you. The rules committee in this wisdom has limited discussion on this bill. We have three people signed up to speak in favor of. You will be allocated 30 minutes. Take as much as little of it as you'd like. Three people have signed up to speak. Chair Lady Silcox has recognized to speak to the bill. Thank you, Mr. Speaker. I want to thank Representative Newton for this bill. House Bill 971 has the right incentives. It encourages responsible going ownership for those purchasing safety storage devices or taking safety courses for a tax credit. Safe storage will decrease instances of gun theft and safety courses. And safe storage will reduce accident. All shootings in our state as well. I would encourage each of you to help prioritize public safety and vote in favor of House Bill 971. Mr. Speaker, I yield the well. Ladies, yield the well. Representative Owl is represented to speak to the bill. Representative Owl. Thank you, Mr. Speaker. These remarks will be very brief because I don't want to gild the lily here. First, I really want to commend the good doctor from Augusta for shepherding this bill. He's done excellent work and I'm grateful to him for it. Second, I want to underline the essence of this bill and emphasize a few key points to members of both parties. Most important is that this bill does not ban anything. It does not punish anything. It does not restrict anything and it does not criminalize anything. And the tax credit is fully optional. What this bill does is to encourage safe gun ownership and incentivize personal responsibility. And in doing so, it's going to make our communities safer. Because we know that safe storage will decrease the number of stolen guns in our communities, the majority of which are unsecured guns stolen out of cars. Fewer stolen guns means fewer guns used in criminal activity, which is the priority I know we all share. Increased adoption of safe storage practices is going to mitigate the impact of gun violence on mental health by decreasing suicide risk. Again, something I know this body cares deeply about. And finally, secure storage of guns will help keep our children and teenagers safer. This body is on the cusp of demonstrating something remarkable and I just want to take a moment to realize that. And that is to show that there is a way forward on addressing the issue of gun violence in our communities. Incentivizing secure storage and personal responsibility is something we can agree on. It's something we can get done together. And it's a way that we can show that this body and this state can lead on the issue. Thank you to all the members and you know who you are, who stepped up to lead here. Today I'm very proud to be a member of the Georgia House of Representatives and I am very proud of all of you. Thank you, Mr. Speaker. How you all the well? The lady has yielded the will. Representative Scott Hilton has recognized to speak to the bill. Thank you, Mr. Speaker. Members of this body, I'm honored to offer my full support for House Bill 971, a legislative proposal that strikes a balanced and bipartisan approach to firearm safety in Georgia. While upholding our rights and shrine in the Second Amendment, I uphold the work of this body has done to address mental health, gang violence, and school safety in our state. With House Bill 971, we're taking yet another step to keep our communities safe. As Vice Chairman of Education, I'm proud of the three priorities that Sherwin-Eurman sets for our committee. It's good policy, literacy, and school safety. Toward that end, this body has appropriated over $100,000 in grants for school safety. This year alone through Chairman Hatchett's leadership, we're looking at an annual appropriation of $45,000 for every school in our state for school safety. The data shows us that 42% of adolescent school shooters obtained a firearm from relatives at home through theft. If we can encourage responsible gun ownership at home, we will take yet another step towards safer schools. Beyond the home environment, thousands of firearms are stolen from lawful gun owners with over 230,000 firearms stolen annually in the United States alone. A significant portion of these guns subsequently find their ways in the hands of criminals perpetuating violence and endangering innocent lives. House Bill 971 directly confronts this issue by incentivizing responsible gun ownership practices and promoting firearm safety education. By supporting House Bill 971, we demonstrate yet again our commitment to fostering a safety society preserving the rights of responsible gun owners. By incentivizing responsible gun ownership practices and promoting firearm safety education, we strike a balance that benefits all members of our communities. Thank you for your support of 971 with that I yield the well. The gentleman is yielded the well. That completes our discussion on House Bill 971. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's none. The committee substitute is adopted. Is there any objection to agree to the report of the committee which was favorable to the passage of the bill? Chair here's none. The committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. I have all members voted. For what purpose is represented bird rise? Parliamentary inquiry. State your inquiry. Is it not true this is a back door registry through the Department of Revenue? No ma'am I don't think so. Chair disagrees with you. What purpose is represented Carter rise? Parliamentary inquiry. State your inquiry. Is it not true that offering a tax credit for gun safes and gun training is a good tax credit for judges? Chair the lady believes in what she speaks for what purpose is represented?\n\nMr. Chairman Collins rise. Paul Dominguez-Rienkore. Stay tuned, Quarry. Mr. Speaker, is it not true that this bill does not infringe upon the rights of gun owners? Instead, it empowers them to make informed choices that prioritize safety and responsibility. And is it further not true that by promoting education and access to secure storage options, we are taking proactive steps to prevent accidents and tragedies from occurring. I'm sure that the chairman of the Committee on Public Safety understands all the aspects of this bill and I appreciate his insight for what purpose does Chairman Martin rise? Paul Dominguez-Rienkore, Mr. Speaker. Stay tuned, Quarry. Is it a Trammer's speaker? I agree with you that the DOR wouldn't use this as a registry. But isn't it further true? There's no requirement in this bill that anybody would apply for a tax credit if they're concerned about that. I think the gentleman speaks to facts and the truth. What purpose is, what virtue rise? Parliament, Quarry. Stay tuned, Quarry. Is it not true, Mr. Speaker, that the bill explicitly says there shall be no list or database created by this incentive? I'm sure the gentleman has diligently read the bill and I'm sure that's exactly what the language of the bill states. Have all members now voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 971, the Yees are 162, the Nays are three. The bill, haven't received it. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 11381138? House Bill 1138 by Representative Kendrick of the 95th to be entitled an act to amend Code Section 101014 of the Fish Coded Georgia annotated relating to fund administrator investments relative to the Georgia fund. So it's a revived foreign additional factor than the fund administrator shall consider in the selection of venture capital funds. This bill ever referred to the Committee on Economic Development and Tourism, that Committee recommends that this bill do pass. Save the best to last, maybe. It is the last one, so I like that part of it. Representative Kendrick is recognized to present the bill. Thank you, Mr. Speaker. I'm gonna put on my glasses because I'm over 40 now. All right, today I am presenting HPE 1138 for the record, this is not my first bill, but what HPE 1138 does, is it adds a 17th investment criteria to the Invest Georgia fund. Many of you do know that we have the Invest Georgia fund that we passed back in 2013. It is a fund of funds, so the state funding that we give to this fund invests in venture capital firms here in the state of Georgia and then they take that money and they invest in Georgia portfolio companies. This bill does not, I repeat, does not repeal in any way the Invest Georgia fund. It just adds an investment criteria to the fund. And with that, I ask for your favorable consideration and I will yield for questions. You have one question, back to your left representative, representative Neal has a question. Thank you. Does the lady yield? Yes, I do. Is it not true that you aren't experienced securities attorneys and it buys venture funds as an investment advisor? Yes, I have been practicing law for 17 years in this area of law and I cannot believe it. And it's a pleasure to be an investment advisor here in the state of Georgia and advising so many funds. Thank you for the lady further you. Yes. Your current clients, is it not true that your current clients are investors that trust your investment advice and this body will benefit from your experience in this area? Yes, thank you so much. That's why you're my best friend. Your check is in the mail. Thank you. The lady was obviously a child prodigy. She's been practicing law for 17 years. I'll take it. You have one more question. All right. Will you yield for one more? Yes. Representative Hutchinson to your right. You recognize for a question. Is the lady yield? Yes, I do. Is it not true that you're up at like 4am to make sure all of our investments are doing well as soon as you open your eyes before the sun is even up? This is very true. I am early, but up at 4am and I want to get out of here because it's nearing my bedtime. So thank you. I thank you state of the fact that you're ready to yield the well. The lady has yielded the well. Great job. Is there an objection to the previous question being ordered that you're here as none? The previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none the report of the committee is agreed to. Shout this bill now pass all in favor of the passage of the bill. Will vote yes, all those opposed. Will vote no and the clerk will unlock the machine. I have all members voted for what purpose does represent the beclaim rise. Commentary inquiry. State inquiry. I would just make sure Miss Speaker that my light worked. Barely, but it works. Thank you, Miss Speaker. That may have been your one time for the week right there. I'm not sure about that, but I'll reconsider that by Friday Thursday. All members voted if so, the clerk will lock the machine on the passage of House Bill 1138. The yeas are 146. The nays are 14. This bill having received your requisite constitutional majority is therefore passed. Members that completes our rules calendar for Wednesday. Oh, it's Tuesday. For Tuesday, yes, I'm sorry. We are move on to afternoon orders. I'm going to ask members to hold to one minute of the possible. We have a number of afternoon orders and we have some committee meetings that need to take place. I'm going to ask members to stand, if you will, as I recognize, representing Val Williams and Chairman Deloche. I want Representative Bonte-Han to be close down front. Thank you, Ms. Speaker. It is sadly that Representative Deloche and I announced the passing on yesterday of a very dear friend of both of ours. The tax commissioner from Liberty County, whose picture is on the screen, Virgil Jones. Virgil was one of the kindness people have ever known. He leads behind a wife, Lisa, two children, Lindsay, and Virgil the second. He's been tax commissioner of Liberty County for 20 years. Just so happens that his father, Maxi Jones, was the first certified Black Deputy Sheriff in Liberty County, swanian in 1969. It is with the heartfelt he was more than just elected official. He was my dear brother, my dear friend, and it's very difficult. Thanks some of the members of the house just today, and especially Holly on the door for their attention. And it was just a lot for me to bear, please believe me. This wonderful man lived the kind of life that brought us together in Liberty County, even his voice, when you first heard it. You knew there was a kindness in his heart that just shined forth. And wherever he was and whatever the issue was, and whatever was needed to make us focus on coming together in solving problems, Virgil lived a kind of life that made us do that. And I'm thankful. And I will tell you this when you talk about who he left behind is no doubt out as his brother. Thank you, buddy. Thank you, Mr. Speaker, we you well. PERS for you, both of you, and especially you, representing Williams and for the family. Members of your remains standing, representing Montaghan and friends, or... Make it recognized. Make it, Mr. Speaker. Today is a great sorrow that we announce the passing of Deputy Allen Wright Strough, a dedicated member of the Polling County Sheriff's Office for nearly 14 years. Deputy Wright Strough passed away unexpectedly at his home on Thursday following a medical emergency. At the age of 43, his departure is a significant lifestyle community, and I'll let you know him. Deputy Wright's life on the ambition was a service of Deputy Sheriff from Polling County, and that's a dream he realized in September of 2012. When he joined the Sheriff's Office as a jailer, he continued his commitment when he became a Deputy Sheriff in 2013, after completing his training at the North Central George and Life Force of the Academy. In the route his career, Deputy Wright Strough was a vital part of the Uniform Patrol Division, diligently working to ensure the safety and security of Polling County. His dedication extended beyond his patrol duties. As he played a crucial role in managing the Sheriff's Office's law enforcement communication systems. As a lifelong resident and eighth generation of his family in Polling County, Deputy Wright's legacy is deeply interwoven with a fabric for community, his passion for his work, his dedication to his fellow officers, and his left first community will be dearly missed. And we extend our deepest condolences to Deputy Wright's family, their friends, and their colleagues during this very difficult time. If y'all would, we'll have a moment of silence. Thank you. Thank you, members. Members, if you remain standing for one more remembrance, representing Huddleston, Collins, and Tyler Paltz, may I have the recognize for your remembrance? Colleagues, we come together before you today in the honor of the life, a Gary Bullock. A J.D. II passed away on Thursday, February 22. He will be remembered as a follower of Jesus Christ, a loving husband, a devoted father, grandfather, and a great-grandfather, and a little friend to many. He proudly served his country in the United States Army, the United States Marine Corps, and the United States Navy. Gary started his career at Tampa Electric Company, and went on to become the CEO of Curly MC, where he retired in 2000. In his retirement, Gary fulfilled his dream of playing golf at all 50 states. In his every spring, when the Azegas were in bloom, you could find Gary volunteering as a marshal at the master's tournament. In 2007, Gary came out of retirement and become city manager for the city of Balden. He was instrumental in many projects for the city. The love Gary had for Jesus was evident, in every conversation he had, in his travels, he would witness to others on a plane, restaurant, or wherever he could. One of the things that made Gary such an incredible individual was he never rushed to judgment. He had a unique ability to say the exact right thing at the exact right time. He had that common presence in any situation. Please keep Gary's family in your prayers and join us in a moment of silence. Thank you. Thank you members. You may be seated. Representative Edna Jackson has recognized for an afternoon order. Thank you, Mrs. Beaker and colleagues. I would like to extend an invitation to all of you, even though we will not be here in session on tomorrow morning. But it will be Savannah State University day here at the Capitol. We want you to come by room 310 and CLOB and meet our students, faculty, staff, and alums that will be here at the Capitol. It will be from eight o'clock in the morning until 11. We look forward to seeing all of you. Savannah State Day. Well, there'll be members here, so make sure you welcome all our friends from Savannah from the coast. Representative Kendrick's is recognized. Representative Stenson, you're next. Good afternoon, again. So you should have a flyer on your disc about Tech Demo Day. So we will have some tech founders down in the South Wing, as well as the Technology Association of Georgia and ATDC will have a table set up. So come on down and make sure you greet the tech founders and welcome them to the Capitol and see the innovative stuff that they're doing here in the state of Georgia. So hopefully to see you Thursday morning from eight to 12 p.m. in the South Wing of the Capitol. Thank you. Representative Stenson has recognized for an afternoon order. Thank you, Mr. Speaker. And honor of Black History Month, I want the light to recognize by Ola English Bailey of Macon County, Georgia, the home of the late Lynn Moore Jane State Representative who served in this house for 20 years. Miss Viola English Bailey, woman in Ogathorp, Georgia, July 13, 1919. Bailey was among the Black educators in Macon County who made it possible for children of sharecropping families to get an education. And I just want to acknowledge once again, the life and legacy of Viola English Bailey for all that she did to help families in the Macon County area. I have a little known Black History fact. Thank you, Mr. Speaker. Thank you, members of the House for your attention to this Black History matter. Thank you. Thank you, Representative. Representative Mayner has recognized for an afternoon order. Thank you, Mr. Speaker. Just a reminder, there are blue boxes at every corner of this chamber. So you can recycle your paper at the end of every day and throughout the session. Thank you. The Rips Anybert now has recognized for an afternoon order. Thank you, Mr. Speaker. For my Black History moment, it is about the beginning of the R&M African American Museum in Clayton County. The R&M African American Museum came about from my desire to share my collections with others. By nephew Austin commented that we had a lot of collectibles. The M is in memory of my mother. Thank you, Mr. Speaker. So we will recognize Representative Hagen, Representative New and Representative Lot for an afternoon order. Thank you, Mr. Speaker. I rise today to stand up for women. Too often women feel unsafe in this state. Unsafe going to the store, unsafe walking home from their favorite restaurant after dark, unsafe going for a walk or jog in their community. And there are some who have said that it's basically society's fault that we don't do enough to keep women safe. It's also been said that dangerous immigration policies don't matter because these crimes against women would have been committed anyway. Well, it matters to victims of crimes that were committed by known violent illegal aliens. And it matters to families who are left behind to pick up the pieces. So we stand for our efforts to deal with illegal immigration in Georgia. We stand for rights of women to defend themselves. We stand for policies that make violent law breakers and think twice before attempting to harm the women in their lives. I hope this chamber will stand with women and stop making excuses for violent offenders. Thank you, Mr. Speaker. I yield the well. Thank you, Representative. That completes our afternoon orders. We'll move on to announcements. No, I think we have some privileged resolutions, Mr. Clerk, that have come in since we read some of those. Mr. Clerk, will you read the caption to a group of privileged resolutions? Recognizing commending, Mr. Willie James Bentley, recognizing commending Dr. Ingrid Thompson-Cellars and for other purposes, that completes the reading with privileged resolutions. Thank you. Is there any objection to adopting the privileged resolutions? Chair, he is known and the resolutions are adopted. Moving on to announcements. Chair Lady Cooper has recognized for the announcement. Thank you, Mr. Speaker. Please listen up. We will have a meeting of the Public Health Committee immediately upon adjournment. There's a very important bill. I think you will find very interesting and I need to have a quorum. So will everybody please plan to attend L.O.B. 606 immediately upon adjournment for the Public Health Committee? Thank you, Mr. Speaker. I yield the well. Thank you. Chairman Corbett recognized for an announcement. Thank you, Mr. Speaker. The rule caucus will meet for lunch tomorrow, but we're being the blue room at the depot. Everybody come join us. Everybody's here for committee meetings. Also, the Environmental Quality Subcommittee of Natural Resources will meet immediately upon adjournment. Room 515, C.L.O.B. I'm sorry, tomorrow. It won a clock. It's been a long day. Tomorrow it won a clock. Excuse me, Mr. Speaker. And one other F.I.M.A. on Thursday morning, the Georgia Hospital Association Center for Rule Health will be hosting a meet and greet drop-in breakfast for House members. This Thursday at 8 a.m. in room 230. Thank you. Glad you use those glasses when you need them. Representative Claim has recognized for an announcement. Thank you, Mr. Speaker. I just want all of the members to know that there will not be a working family caucus meeting on Thursday. So there will not be a meeting and there will not be any food. Thank you, Mr. Speaker. That was a good announcement. Chairman Chokus, recognize for an announcement. Tomorrow morning at 10 a.m., 10 a.m., the Small Business Development Committee will be meeting in room 506, C.L.O.B. Again, it's 10 a.m., 506, C.L.O.B., again, it's 10 a.m., 506, C.L.O.B., we're going to have a riveting presentation by the Retail Association. So please be there. Thank you. Riveting, not like that. Chairman Parsons recognized for an announcement. Thank you, Speaker. Okay, energy utilities and telecommunications will meet this afternoon. And 403 here in the capital upstairs will be going in there after the health committee. But that we will meet, and I think we'd rather go ahead and do that this evening than to put it off to tomorrow. So I would really appreciate your attendance after the health meeting in 403 this afternoon. EUT, thank you. Thank you, Mr. Chairman. Members, I hope you're paid attention to these announcements because he's going to be calling you to come in tomorrow if he doesn't have a quorum today. Chairman Hopkins has recognized for an announcement. Thank you, Mr. Speaker. The committee on health will meet in 403 upon the German. We've got five bills. We're going to do this in less than an hour. I need you there. This is the last chance these members have to get the bills through. So right now, thank you. Representative Jasmine Clark recognized for an announcement. Thank you, Mr. Speaker. Members of GLBC, tomorrow, we will have a lunch and learn with Ohio River South and tobacco-free kids at the Capitol, CLOB 514 at 11 o'clock AM. CLOB 514, 11 o'clock AM. GLBC, lunch and learn. There will be food. Thank you, Mr. Speaker. Chair Lady Matthews, recognize for an announcement. Thank you, Mr. Speaker. Pined adjournment, state planning and community affairs will meet in 415, CLOB. It will be a quick meeting so you'll be able to meet at your other meetings. Thank you. Chairman Sains, recognize for an announcement. Thank you, Mr. Speaker. Immediately following state planning, special rules will meet in 415 immediately following state planning today. And tomorrow at 8 AM, we will also be meeting at 515 CLOB. Representative Anderson, recognize for an announcement. Thank you, Mr. Speaker. Immediately upon adjournment, the governmental affairs committee will meet in room 341. Thank you. Chairman Dickie, recognize for an announcement. Thank you, Mr. Speaker. I've got a couple announcements. Agriculture and Consumer Affairs Committee will be meeting in the morning. I'll move the meeting back to 8 o'clock. So I hope all of you will be there. We've got one bill. Tomorrow I'll also remember 150th anniversary for our Georgia Department of Agriculture. Here in the capital at 2 o'clock, if you're here, I hope you'll be there. And Thursday morning we've got state biscuits in the streets. So don't forget that. Thank you. I have a question. What time were you going to meet in the morning? We were going to meet at 7. Oh, goodness. But I've already ended in this eight. Okay, why is decision? Chairman Bonner has recognized for an announcement. A defensive veteran affairs at CLOB 515 upon adjournment. That's a new room 515 CLOB. Chairman Collins recognized for an announcement. I'm sorry, did I cut you off? Public safety is going to meet immediately upon adjournment in 506 CLOB. We've got one bill. We'll also meet at 1 o'clock tomorrow. So y'all come. We'll get it knocked out. Thank you, 506. Chairman Gunther recognized for an announcement. Thank you, Mr. Speaker. House Judiciary will meet in 132 upon adjournment. We've got four bills on the calendar to consider. Hopefully we can move those quickly. Chairman Green recognized for an announcement. Thank you, Mr. Speaker. We have state properties tomorrow at 9 o'clock. Room 433, we have two measures on the agenda. Thank you. That completes our announcements. But I have some profound notices that this house needs to take pay a close attention to. We have three birthdays today. Representative Matthew Gamble. Representative Matthew Gamble. I'm going to do these in the correct order. Representative Vance Smith has a birthday today. And the famous. Representative Buddy Deloge has a birthday today. I know Miss Linda is looking for you to be home. Sometime. Do we have any, if any pages are still here? We'll take some photos. The majority leader of this house is recognized for an announcement. A motion, I'm sorry. Thank you, Mr. Speaker. I move that this house stand in recess until 7 o'clock PM today. Then stand adjourned until 10 a.m. on Thursday, February 29th, 2024. On the motion of the majority leader that this house stands in recess until 7 p.m. today. At which time we will adjourn until Thursday, Thursday, February 29th, 2024 at 10 a.m. All those in favor will say, ah. All those opposed will say no. Oh yeah, I was headed. Thanks, Representative Williams. We are adjourned.",
  "updated_at": "2026-02-13T20:16:05.075414+00:00"
}