{
  "video_id": "vWG-6j-0M9E",
  "url": "https://youtu.be/vWG-6j-0M9E",
  "title": "Georgia House - Day 38 (2026-06-24)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": "2026-06-24",
  "duration_minutes": 180,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThis session focused on procedural matters and did not involve any substantive legislation. The main notable aspects were the opening prayer and comments on the importance of compassion.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The House session began with a Scripture reading and prayer led by Pastor Patrick Latham.\n- In his prayer, Pastor Latham spoke about the need for compassion, empathy, and understanding among fellow citizens, even when there are political or ideological differences.\n- He cited the example of Jesus showing compassion to the people and highlighted the importance of \"taking the proverbial walk in our fellow countrymen's shoes\" to work together for a better future.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA full quorum was present, with all members reporting to the floor.\n\n## Adjournment\nThe session adjourned, with the next legislative day set to occur.",
  "transcript": "They are have convening having arrived. All members of this House will please report to work. All members of the House, please report to the floor of the House, the gallery, or room 341, the clerk will ring the bell. All members will report to the House. We are going to have the morning roll call. All members present will please say here or present loudly to signify their presence and the clerk will unlock the machines and call the roll. Alexander Haneload's bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Rudy, Bruce, Burns, Carpenter, Carson, Chocus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Benton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehoud, Larickia, Lomston, Martin, Keith Yak, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirie, Stevens R, Tankerslead, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yurda, Allen, Beesmore, Bernard, Bernard, Bernard, Bernard, Bernard, Bernard, Carter, Clark D, Clark J, Cook, Davis, Douglas, Drier, Dunahoo, Ehrhardt, Evans, Frazier, Gilligan, Gertler, Henson, Bill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kinard, Lopez Romero, Marin, McLean, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, when, Paris, Prince, Pullen, Robyshow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Steven Sun, Thomas A, M, Turner, Lansky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, here, Bonner, here, Richard, here, Hallwell, here, Campbell, here, Cantrell, here, Dickerson, here, here, Campbell, Gillier, here, Gordon, here, here, here, Jones J, B, here, Kirby, Lot, here, Mathis, here, Metz, Momp-Tah-Hon, Park, here, here, Rogers, Singleton, Stole, here, Williams R, here, Unlewitz, Bar, Blackman, Clark D, Dreyer, Dubnik, Dukes, Fleming, Fry, here, Campbell, here, Harold, Holcomb, Holmes, Hopson, Hutchinson, Jones J, Jones V, Kirby, McLaren, Momp-Tah-Hon, when, Rhodes, Rogers, Stevens R, Thomas A, Thomas E, Washburn, Williams A. Members will look at the board to be sure it is accurate. We get representative Dukes, Blackman, any others, any others, Clark will lock the machines, doorkeepers will close the doors and keep them closed. Well, good morning. Legislative day 38 is here. The end is in sight. We will begin our day-to-day with Scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 15th House District, Representative Gamble, Representative Gamble. Thank you, Mr. Speaker, members of the House. It is an honor to stand for you today and introduce my pastor, Dr. Patrick Latham, from Tabernacle Baptist Church. Pastor Latham is fairly new to us. He started in January, so my heart goes out to any minister that changes churches right in the middle of what we have just come through with the COVID pandemic. He has previously passed in Cedar Town, Georgia and in Loughton, Oklahoma. He and his wife Laura Price-Latham are both originally from Marietta, Georgia. Patrick is a graduate of Walton High School in Cobb County, Gordon State College in Barnesville, and the University of Oklahoma, and also New Orleans Baptist Theological Seminary. Together, he and his wife have three children, Julianne Will and Liva, and Patrick considers it his life purpose to help connect with their ultimate purpose in life through Jesus Christ. Would you welcome Pastor Patrick Latham? Thank you, to Speaker Ralston, and thank you to our representative, Murnhorwrn, with at all times how do Parkinsonakin feel possibilty on these diseases in order to give his body that is an instinctive cause of ants. I want to share with you briefly on the subject of compassion, the need of the hour, and the newнд thinking, Spinning, and a brand new nature that is for you as a friend. Our fellow Americans is perhaps the greatest need of our time. Love and understanding seems to be what's required. Sergeant Shriver, the first director of the Peace Corps, once said if American society could fully embrace this virtue we call love, it would be as if humanity discovered the usefulness of fire for a second time. Indeed, compassionate regard for one another can greatly benefit us. The question we face is how can we have hearts that are full of such compassion, empathy, and sympathy? Is there any way for us to improve our human condition? Unfortunately, we have help and an example in the person of Jesus. Mark 634, we read and of occasion in his ministry shortly after Scripture describes an interaction with King Herod, the King of Judea at that time, says Jesus went to travel with his closest followers, he cut across the northern portion of the sea of Galilee to find a place of rest and when he went ashore, he saw a large crowd and Jesus had compassion on them for they were like sheep in his eyes without a shepherd that he began to teach them many things. Jesus approached the sea shore and he saw a green grass sending up into the hillside and people wanting to catch a glimpse of Jesus and to hear him teach, rushed down that sea shore in their customary white garb and in Jesus' eyes they literally looked like sheep on the pasture side but they figuratively looked like sheep as well. Jesus knew that the people needed a shepherd. He was well aware of Herod who had been mentioned previously and Herod's ruthless reign has greed, his murderous behavior, his lust driven and unjust lifestyle that is well spoken of in history. And so Jesus had compassion. The Greek language of the New Testament, the coinegreek, the common Greek spread by Alexander, uses a strong word from the first century here. It's a word that speaks of the human vows or the human intestines. Speaks of that type of emotion for another where you are moved on the inside. Remember when I met my wife, we met at shillings on the square in Marietta, Georgia, and she would come into visit sometimes at my lunch hour. I was a waiter there and she would come into get her lunch and many times as she entered that restaurant I would see her in the busyness of serving meals and as I saw her I got butterflies in my stomach. The Greeks were well aware that emotion seemed to impact us on the inside. And so here the New Testament uses this word of a deep visceral feeling for the condition of another person and it alludes to displays of sympathy and empathy. This word speaks of more than just concern for another person. It portrays a concern for another person that leads one to take action on behalf of that person. We see Jesus here had that compassion. He embodies the virtues of an ultimate leader. The Torah had used this picture to speak of the type of leadership that God's people needs in numbers 27-17 and Christ embodied this compassion and He stands today as an example for us. He reminds us that we can all benefit ourselves, our families, our communities, our state, our nation by embracing this type of compassion. May we learn to look at our fellow citizens through the lens of love, that we may never agree ideologically or politically or economically on every issue we can still seek to grow in our displays of empathy, sympathy and compassion. If we can learn to take the proverbial walk in our fellow countrymen's shoes, we might be able to reach agreements and embody changes that will help us survive and thrive as a society. When compassion becomes the gold standard for our beliefs and behaviors, we can work together to form a better future for our loved ones, our communities, in our nation. To take note that Scripture also teaches Jesus is not just an example in this regard, He is an empowerment and an enablement as well. We may feel that of ourselves we can't muster up the compassion we need, but Scripture teaches us in Romans 5-5 that God's love can be poured into our hearts through the Holy Spirit who has been given through Christ Jesus. So if we feel ill-equipped to show compassion and concern to others, may we humble ourselves, pray and seek the person of Jesus. He can transform us spiritually. He can give us the perspective of love, patience and forgiveness we need. Let's pray. Heavenly Father, during these turbulent times, help us to heed the example of Jesus, help us to remember His great words that have echoed throughout the ages. This is my command. Love one another as I have loved you. Working our hearts and minds to give us greater compassion for one another and use such love and compassion to bless the residents of Georgia and to make us into people you want us to be in Christ's name I pray. Amen. Let's say to pledge to our flag. I pledge allegiance to the flag of the nine states of America and to the Republic for which it stands, the nation, the God, the indivisible, the liberty and justice for all. Thank you. Doorkeepers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits, read the proceedings of the previous legislative day and found them to be correct. Furthermore, beer is a sign that God loves us and wants us to have a good time, Benjamin Franklin. Representative Carpenter, sure did appreciate that one. Chairman Hogan, the chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal the chair here is none and the journal is confirmed? The clerk will read the resolution establishing the order of business for the day. Mr. Barnes, on our 59th, whose following be establishes the order of business, turned to first part of the period unanimous consent, introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House bill 1251 by Ruppes on Matthew, the 73rd and Bar, the 103rd. There will be Title of Nacta, Amendment Title 31 of the Fiscal of Georgia Annotated relating the health so as to repeal in its entirety, Chapter 26. Regulated industries. House bill 1252 by Ruppes on Scott of the 76th Kendrick of the 93rd. Thomas of the 39th Shannon of the 84th Canon of the 58th and others. There will be Title of Nacta, Amendment Article 16 of Title 45 of the Fiscal of Georgia Annotated relating the general provisions regarding corners. Judiciary. House resolution 1621 by Ruppes on the bened of the 94th, Hugh Lee the 136th Hutchinson in the 107th, the cloud of the 105th, Carter the 92nd and others. Resolution supporting the policy recommendations set forth by the Georgia legislative black caucus. Governmental affairs. Senate Bill 502 by Senator Beecher, the 21st of Bill B. Todd of the Act to amend and act, reincorporating and recreating the city of Woodstock. Intergovernmental coordination. That completes First Readers. Second reading of bills and resolutions that park or read. House bill 1250 by Representative Dreyer of the 59th Gardner of the 57th for now. The 77th Drenner of the 85th, Wilkerson of the 38th and others. Ability to the powers and duties of the Georgia Peace Officer Standards and Training Council. Through Second Readers. Reports of Standing Committees to the clerk or read. Representative Shaw Blackman, the 146th District Chairman of the Committee on Governmental Affairs submitted the following report. Mr. Speaker, your committee on Governmental Affairs has had a consideration of following bills of the Senate. Mr. Structle, me to report the same back to the House of the following recommendations. Senate Bill 322, do pass by committee substitute. Senate Bill 463, do pass by committee substitute. Respectfully submitted Representative Shaw Blackman and the 146th District Chairman. Representative Jan Tancerson, the 160th Chairman of the Committee on Intergovernmental Coordination Local submitted the following report. Mr. Speaker, your committee on Intergovernmental Coordination Local's had a consideration of following bills of the House and the Senate. Mr. Structle, me to report the same back to the House of the following recommendations. House Bill 1165, do pass. House Bill 1243, do pass. House Bill 1245, do pass. House Bill 1246, do pass. House Bill 1247, do pass. House Bill 1249, do pass. Senate Bill 510, do pass. House Bill 1242, do pass. Respectfully submitted Representative Jan Tancerson, the 160th District Chairman. Representative Barry Fleming, the 121st District Chairman of the Committee on Judiciary submitted the following report. Mr. Speaker, your committee on Judiciary has had a consideration of following bills of the Senate. Mr. Structle, me to report the same back to the House of the following recommendations. Senate Bill 402, do pass. Senate Bill 289, do pass by committee substitute. Respectfully submitted Representative Barry Fleming, the 121st District Chairman. That completes the reading of the Reports of Standing Committees. Okay, we're going on now to the local calendar. Third reading and passage of uncontested local bills. One bill on the local calendar relates to homestead exemption and requires a recorded two-thirds roll call vote for passage. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered the clerk will read the local calendar. House Bill 1165 by Representative Williams, the 168th Liberty County. House Bill 1243 by Representative Davis, the 87th Cab County. House Bill 1245 by Representative Percheta, the 176th Leneer County. House Bill 1246 by Representative Percheta, the 176th Ware County. House Bill 1247 by Representative Clark, the 147th City Warner Robbins. House Bill 1248 by Representative Williams, the 148th City of Cordill. House Bill 1249 by Representative Wells, the 110th Henry County. Senate Bill 510 by Senator Tilary, the 19th Wheeler County. House Bill 1242 by Representative Drenner of the 85th City of Decatur. Is there any objection to the previous question being ordered on the local calendar? The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none the report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills? On the local calendar will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Aneloets, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodey, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Herrell, Hatchett, Hawkins, Hitchens, Hulkum, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehood, Larickia, Lomston, Martin, Matthew, Macau, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silkcocks, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Alan, Beesmore, Brnaw, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Erhard, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard, Lopez Romero, Marin, McClain, McClaren, McClown,\n\nMeeks Mitchell More B More C Morris M Nelson Wen Paris Prince Pullen Robachoe Saints Scofield Scott Shannon Sharper Smith M Steven's M Stevenson Thomas A.M Turner Wollensky Wilkerson Williams MF Williams N Wilson Beasley Teague Yes Bonner Yes Buckner Richard Yes Carl Well Yes Campbell Yes Can't trail Yes Dickerson Dooks Dooks Yes Campbell Gillier Yes Gordon Yes Green Yes Gullet Yes Jones J.B Yes Kirby Lot Yes Mathis Yes Metz Mampdahan Mampdahan Park Prude Yes Rogers Singleton Stovall Yes Williams R Annella Woods Yes Bernal Clark D Cook Dickerson Duglass Yes Dress Drier Fleming Gamble Gilligan Hutchinson Jones J.B Jones T Kirby Knight McLaren Mampdahan Morris M When Oliver Thomas Thomas E Welch Williams A Thomas E Williams A Thomas E Wilson Wilson Wilson Wilson All right, who is that representative Douglas? Representative We've got a few up in the gallery. Take your mask off so we can hear you. Representative Paris. Representative Paris votes yes. Any others? Okay, Donna. There does not appear to be any others. The clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 155. The nays are one. These bills having received the requisite constitutional majority are therefore passed. We're going on now to morning orders. Going on to morning orders. All members. Will please lower the decibel level of conversation and give respect and attention to the members in the well. The chair recognizes for a morning order. Chairman McCall Thank you, Mr. Speaker. I want to take you to a second. I want to brag on the members of this house and also on the brag on the national fair down at Perry. The fair is going to happen this fall. It will be October 8 through the 18th. If any of you have never been, you need to go just to see what a treasure that is for the state of Georgia and especially central Georgia. If you need any help figuring out how to get in or get there, find me and we'll take care of you. On October the 17th, there will be a showdown and let me explain just a second what that is. If you account the plaques on it seven, we started this about nine years ago where we put five members of the house and five members of the Senate show and animals that the 4-H and FFA students teach them how to show. Seven out of nine times the house has whipped the Senate like a three-year-old in K-Mart. I want to do that one more time for my last time down there doing this as they had chairman. But Representative Lynn Smith on the first one, Tom Kerbett has run it twice. David Knight showed hogs and won it. Scott Turner showed a dairy cow. Even Stacy Abrams won it. The last one to win, the last one we have was Representative Bonnie Rich. So if any of you have any questions about how much fun that is and how much you learn, there's probably 45 or 50 other ones of house members in here. And I want to tell you how much I appreciate y'all hipping us spank the Senate. There's an oversight committee made up of members of this house which is Representative Dickie Jasper's England Parkland myself that meet with the Fire Board. I want to be serious just a second. COVID caused the shack the fire to have to shut down. They have lost around a million dollars worth of income due to the shows being canceled. We need to take care of the fire ground. It's a treasure for the state of Georgia. And I hope on October the 8th through the 18th they have the biggest crowd they have ever had at the Georgia National Fire. I like to miss speaker. Chair recognizes the chairman of the House Ethics Committee Chairman Nicks for a morning order. Thank you, Mr. Speaker. Mr. Speaker, I rise in opposition this morning to the gambling legislation that got presented during morning orders yesterday. You know gambling is special. It doesn't follow the same rules as everything else. It's kind of like a horror movie. You know the monsters coming but you never know who in. And also it's never dead. On Monday night that thing got dug up, brushed it dirt off of it, gave it new clothes and the strip senate resolution and its 16 hours got presented in full in morning orders. Is that not special? And it gets bigger and better every year. You know what? They have to put some shiny objects on there that we can grab onto. This one's got a lock box. A lock box. It's really called an emergency power fund but we'd never remember that. This one's got a lock box. And if I understand it, those benevolent gambling bosses are going to come down here and just going to stuff that with money. So if we need anything we can just grab it and pull it out. And this one also has got another shiny object. It's got an opportunity fund. And that's kind of like a lock box except it's all for education so you can get in there if you need some of it. And it's all so simple. All we got to do is just put this thing on the ballot. And those big old gambling boys are going to come down girls are going to come down and they're going to take care of it. All we got to do is trust them. Just trust them. They'll take care of us. You know a serious question though. What are we willing to sell Georgia for? You know if this is so great there are number of states that have legalized casino gambling. Which one do we want to be like? Do we want to be like the one that's the number one state in the country for business? Oh no wait a minute that's Georgia. Seven years in a row. How about the ones that got AAA bond ratings that they managed to keep all the way through the great recession? I hadn't looked it up but I don't think there are going to be many on that list. That's Georgia. How about the one that's got the model public scholarship fund in the country that others come and try to model after? Oh wait a minute that's the hope scholarship. That's Georgia. Which somebody please tell me again why we need to sell our state to the gambling bosses. I yield the well. Chair recognizes representative Scott for a morning order. Thank you Mr. Speaker. House bill 9793 section 8 is proposed to eliminate an additional 7 million from the budget. Looking at part 48.4 veterans benefit. This will eliminate all Georgia Department of Veteran Services feel office and appeals division. Eliminating feel office and appeal division would be an enormous mistake. Georgia Department of Veteran Affairs files approximately 85% of all VA claims and appeals for veterans within the state of Georgia. Georgia veterans depend on these offices to counsel and assist them in navigating veterans benefits file claims and appeals on their behalf and represent them during the hearings before the VA and board of veterans appeals. The Georgia Department of Veteran Services feel office and appeals division had 344,902 visits for Georgia veterans and completed. 395,155 federal action claims and appeals and 88,603 state action. So half of this great state, 700,000 veterans population use the Department of Veteran Services this year alone and this year pre COVID-19 were on track to exceed those numbers. Eliminating these 52 locations that Georgia veterans depend on to file for state veterans benefits receive advice file claims and appeals and receive representation for hearings will create an enormous vacuum that will take years to recover from. We ask that the committee the budget committee to reconsider such decuts and destructive cuts to our veterans. Thank you. Thank you. Chair recognizes representative Jasmine Clark for a morning order. Ladies and gentlemen in this chamber we need to have a real come to Jesus moment about race. I don't get much time in the well so I will try to accomplish in the next minute what has been brewing in our society for over 400 years. When we talked about the casino bill yesterday Jim Crow laws were in vote. Jim Crow laws are alive and well. I was surprised to hear a comparison to a conservative radio talk show host telling alternative facts about the casino bill to a systemic set of laws used to enforce segregation and keep black people in the South in their place. These laws included denying black people the right to vote the right to hold certain jobs and the right to get an equitable education. So if you want to have an honest conversation about Jim Crow laws being alive and well let's do that. I've got time. It is offensive to compare treacherous Jim Crow laws to some dude on the radio not liking your bill. It's about as offensive as equating civil rights hero Dr. Martin Luther King to Confederate generals who fought to uphold the institution of slavery. Racism is not always using the N word. Racism is not always using the N word. Sometimes it is making a mockery of our nation's painful and shameful past and those who still feel the effects of it today. I yield the will. House will maintain decorum representative Kennard. You got 10 seconds left. You want to be carried over tomorrow. Okay. Put him on the list for tomorrow. We're now going on to the rules calendar. Clerk will read the caption to Senate Bill 371. Senate Bill 371 by Senator Gucci, 51st speech, 21st Jones, 25th Butler, 55th and others to be title knack to men, Article 3, Chapter 2, Title 32. The official go to Georgia annotated relating officers in the Department of Transportation, just to provide for state investment in railways and railroad facilities and equipment. This bill I refer to the committee on transportation that committee recommends that this bill do pass. Chair recognizes the chair of the House Transportation Committee, Chairman Tanner to present the bill. Thank you, Mr. Speaker. I'll be short with this bill. Senate Bill 371, you have solved this legislation several times over this course of this session. We passed a very similar bill out of the house. It's also already passed the Senate right when we came back into session on month last week. It got passed with some haste and there had been a couple of things that GDOT wanted to change. This bill before you takes into consideration. All this bill does is simply provide a program area within the state budget for investment into freight and to rail. It doesn't require any investment but it just has a program item in the state budget. This came out of the freight logistics commission that's made over the last year and a half as one of their recommendations as we continue to look for ways to move freight off of our interstate and public road system on to rail. And again, this is the same legislation. The only real difference is it gives a little bit more flexibility within the program area to GDOT. And again, all of this is subject to the appropriations process of future general assemblies and to their direction. The only thing this does is put a program item into the budget. Mr. Speaker, with that I'll be glad to answer any questions. You do not appear to have any questions. Mr. Speaker, with that I'll yield the well-nast for favor over consideration of Senate Bill 371. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 371 will vote aye. Those opposed will vote no and the clerk will unlock the machine and call the roll. The bill is agreed to. Alexander Manolo-Witz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubneck, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Gray, Gravelie, Harold, Hatchet, Hawkins, Hitchens, Hulkum, Holmes, Hauston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Mathyak, McCall, Morris G, Newton, Nick's, Oliver, Parish, Parsons, Peter, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Wen, Paris, Prince, Pullin, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Yes, Fawner, Yes, Fuckner, Yes, Parchette, Yes, Calwell, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Suks, Yes, Campbell, Yes, Gillierd, Yes, Gordon, Yes, Green, Yes, Gullet, Jones J, B, Kirby, Lot, Yes, Mathis, Yes, Metz, Mophtahan, Yes, Park, Pruitt, Roger's, Singleton, Yes, Stovall, Yes, Williams R, Yes, Anelo, Blackman, Burns, Clark D, Clark J, Collins, Cooper, Dryer, Gilligan, Hill, Hitchens, Hitchens, Hugley, Hugley, Jones J, B, Jones V, Kelly, Kirby, Lopez Romero, Yes, St, Thomas A, M, Members will look at the board and make sure it's correct. Clark will lock the machines on the passage of Senate Bill 371. The eyes are 154. The nays are 1. This bill having received the requisite constitutional majority is therefore passed. Clark will read the caption to Senate Bill 342. Senate Bill 342. By Senator Jones, the 25th, Mulles, the 53rd, Gutes, the 51st, Kennedy, the 18th, and Miller, the 49th. The title of an act to amend Article 2, Chapter 3, and Article 1, Chapter 4, Title 25, Deficitical to George Annotated, relating the minimum requirements for local fire departments and general provisions relative to fire fire standards. This bill having been referred to the Committee on Public Safety and Homeland Security. That committee recommends that this bill do pass. The chair recognizes Chairman Rhodes to present the bill. Thank you, Mr. Speaker. I have before you this morning Senate Bill 342. This legislation is a result of outcry of the outcry as we heard of our volunteer firefighters from across the state. We're losing them left and right. These ladies and gentlemen that go out and volunteer their time in efforts to help protect us and our homes are really at risk. Sometime back a few years ago through some legislation, I think it was inadvertently they got lumped in with the full-time firefighters. As an example, just if this were to continue and they were to shut down our volunteer fire departments in my home county, it would cost us $6 to $8 million to equip our volunteer firefighters up to standards and training standards. All this legislation does is take them back to their volunteer firefighter status and they have to obtain those minimum standards of volunteer firefighters. Mr. Speaker, are there any questions? I'll be glad to answer them. I do not think you have any questions. I yield the well and ask for your favorable vote. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of Senate Bill 342 will vote aye. Those opposed will vote no and the clerk will unlock the machine and call the roll. Alexander Oneloowitz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnik, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Gravley,\n\nHarold Hatchett Hawkins Hitchens Holcomb Holmes Houston Hugley Jackson M. Jasper's Jones J. Kelly Kendrick Knight LeHood Lerickia Lomston Martin M. Matthew McAll Morris G. Newton Nicks Oliver Parrish Parsons Petri Perkle Powell Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Silcox Smith L Smith R Smith V Smirrey Stevens R. Tankersley Tanner Tarvan Taylor Thomas E. Tramble Washburn Watson Welch Workhizer Weed Hour Williams A. Williamson Yurda Allen Bernal Beesmore Cannon Carter Clark D. C. Clark J. Cook Davis Douglas Dreyer Dunahoo Earhart Evans Frazier Gilligan Gertler Henson Hill Hogan Holland Holley Hopson Howard Hutchinson Jackson D. Jones S. Jones T. Jones V. Kaush Kennerd Lopez Romero Marin McClean McLaren McLeod Meeks Mitchell Moore B. Moore C. Morris M. Nelson Wynn Paris Prince Pullen Robyshow Saints Scofield Scott Shannon Sharper Smith M. Thomas A. M. Turner Wollensky Wilkerson Williams M. F. Williams N. Wilson Beasley Teague Clark D. Gardner Henson Hill Holmes Jones J. B. Kelly Kirby Lopez Romero Moore B. Perkle Sharper Smith M. Taylor Thomas A. M. Wilkerson Williams N. Clark Wollock The Machines On The Passage of Senate Bill 342 The Eyes Are 158 The Nays Are Zero This Bill Having Received The Requisite Constitutional Majority is therefore passed due to some unusual circumstances. Representative Bentley was not able to be here for morning orders this morning. I'm recognizing her at this time for a morning order representative Patty Bentley. Thank you Mr. Speaker. Colleagues I come to you this morning with a heavy heart. Yesterday as I was turning on to Capitol Avenue to come to the Capitol I got a call at my husband had taken yield and was taken to the hospital and making so I turned around to go back to the hospital so I wasn't able to be here with you all on yesterday. And then this morning as I was up getting dressed to come back to the Capitol we got a call at my father-in-law had passed away. Calvin J. Bentley Sr. owner Bentley and sounds funeral home of making Jeffersonville and Roberta been in funeral business for over 50 years. I went home to be with the Lord today and I asked that you all keep the Bentley family in prayer has been a really rough time for all of us especially for me. But with your love of supporting your prayers have been able to make it through and I just thank you so very much. May God bless you all. I'm sorry may we have a moment of silence please and honor of Mr. Calvin J. Bentley Sr. Thank you. Amen. God bless you all. Clerk will read the caption to Senate Bill 288. Senate Bill 288 by Senator Anderson the 43rd Jones of the 22nd Jordan the 6th parent of the 42nd Jones the 10th and others. The total act to amend code section 353 37 the fiscal to Georgia and 10th are relating the review of individual criminal history record information definitions privacy considerations. This bill I refer to the committee and special committee on criminal justice system that committee recommends that this bill do pass by committee substitute. There are recognizes representative Houston gains to present the bill. Thank you Mr. Speaker Senate bill 288 would give George and the 2nd chance this legislation is an important step forward for criminal justice reform in our state. I'm extremely proud to have been a part of this legislation and it's a bill we can all agree on that will help millions of George's. This legislation allows for individuals to have the records restricted for employment purposes for certain misdemeanor offenses after not reoffending for a period of 4 years law enforcement the courts will continue to have access to these records. Our large employers like Home Depot and Coca-Cola express their support prosecutors defense attorneys all ends of the political strict political spectrum from freedom works and faith and freedom coalition. Americans for prosperity to the southern center for human rights nonprofit groups like the 9th way this is something we can all get behind 41 states provide their citizens the opportunity to have a second chance by allowing individuals to restrict certain offenses. Just in the last year we've seen Texas Oklahoma North Carolina and many other states expand record restriction eligibility today we can join these 41 other states. By passing this bill we will not only help returning citizens gain employment and fill Georgia jobs but we can help reduce for citizen rates across the state and a time when unemployment is near record high we should help Georgians across our state and pass this legislation hope you join me in this effort and vote yes on Senate bill 288. Mr. Speaker I'd be happy to answer any questions. I don't think you have any questions. Thank you Mr. Speaker I yield well. Is there any objection to the previous question being ordered the chair here is none the previous question is ordered. Is there any objection to agree or to adopting the committee substitute the chair here is none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of Senate bill 288 will vote aye those opposed will vote no and the clerk will unlock the machines. Ann call the roll. Alexander and all of its bar Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Vody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Coup, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Bradley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yarder, Alan, Baysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Erhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Moore C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robacho, St, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, Williamson, Wilson, Beasley T, Yes, Banner, Yes, Buckner, Richett, Yes, All-Well, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Tukes, Yes, Campbell, Gillard, Gordon, Yes, Green, Yes, Cullet, Jones J, B, Kirby, Lot, Yes, Mathis, Yes, Metz, Mopthahan, Yes, Park, Pruitt, Yes, St, St, St, St, St, St, St, St, Williams R, Baysmore, Bentley, Buckner, Yes, Cannon, Clark J, Drier, Gamble, Hill, Jones J, B, Jones V, Kendrick, Kirby, Lopez Romero, Newton, Paris, Petrie, Skoggins, Smith M, Yes, Stevens R, Thomas E, Watson, Members will look at the board and be sure it's correct. All right, members, look at the board. Clerk will lock the machines on the passage of Senate Bill 288. The eyes are 159. The nails are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 301. Senate Bill 301 by Senator Tillery in the 19th, Hello, fourth, Robertson in the 29th, Mulles in the 53rd, Miller in the 49th, be titled an Actual Men, Article 1 and Chapter 6 and Title 42, the official to Georgia annotated relating the general provisions regarding detainers. This bill have referred to the Committee on Public Safety and Homeland Security. That committee recommends that this bill do pass. Chair recognizes Chairman Bill Workhizer to present the bill. Thank you, Mr. Speaker. This bill was bought by our local sheriff to Senator Blake Tillery, the late Senator Jack Hill of myself. Title has a population of 25,000, 5,000 of those are inmates, state inmates. This was suggested to save both state and local governments money, manpower, and more importantly, social cost on transporting state inmates back and forth to local jails from state prisons while being agiticated on the state. This bill is indicated on new charges while being incarcerated. A mentioned social cost, state inmates are usually more hardened or being transported back and forth for charges they commit while being incarcerated to county jails where they are put in jails that are not suitable to housing these type offenders. This is where gang tactics are shared and they're just not equipped to do this. The terrible incident in Baldwin County is an example of inmates overtaking guards which should have been a routine transport. These inmates will remain in the custody of the institution until all charges have been agiticated. And this will only happen if it's a requested by the local sheriff and the warden and the local commissioner agreed to it. And that's the bill and I'll stand for any questions if not I'll yield the well. I do not think you have any questions. Thank you, Miss Speaker and ask for your favoral consideration for Senate Bill 311. Is there any objection to the previous question being ordered the chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill the chair here is none the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 301 will vote aye those opposed will vote no and the clerk will unlock the machines. Alexander on all of its far part built in Bennett Bentley Benton Beverly Blackman Bode Bruce Burns Carpenter Carson Chocus Clark H Collins Cooper Corbett Dempsey Dickey Dollar Drenner Dubnic Abstration England Irwin Fleming Frye Gaines Gardner Glanton Graveli Harold Hatchett Hawkins Hitchens Holcomb Holmes Houston Houdley Jackson M Jasper Jones J Kelly Kendrick Knight LeHood Larickia Lomston Martin Matthew McCall Morris G Newton Nicks Oliver Parrish Parsons Petri Perkel Powell Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Silcox Smith L Smith R Smith V Smirrey Stevens R Tancersley Tanner Tarvan Taylor Thomas E Trammel Washburn Watson Welch Workheiser Weed Hour Williams A Williamson Yurda Allen Beesmore Bernard Cannon Carter Clark D Clark J Cook Davis Douglas Dreyer Dunahue Erhart Evans Frazier Gilligan Gertler Hanson Hill Hogan Holland Holley Hobson Howard Hutchinson Jackson D Jones S Jones T Jones B Coush Leonard Lopez Romero Marin McClein McClaurin McLeod Meeks Mitchell Morby Morris M Nelson Wynn Paris Prince Pullen Robachow Saints Scofield Scott Shannon Sharker Stevens M Stevenson Smith M Thomas A.M. Turner Wollensky Wilkerson Williams M F Williams N Wilson Beasley Tee G Stowe Wall Williams R Williams R Hart B E S E T E G Burns Cannon Clark H Dollar Dreyer Gamblear Gilliard E S E R O Patrick Henson Holmes Jones V Lopez Romero Lomston Petrie Rogers Skoggins Tarvan Williams A Wilson M. Members will look at the board, make sure it is correct. Clark will lock the machines on the passage of Senate Bill 301 the eyes are 157 the nays are two. This bill having received the requisite constitutional majority is therefore passed. Clark will read the caption to Senate Bill 394 this was a bill that was postponed from a prior legislative day until today. It is called at this time Senate Bill 394 Senate Bill 394 by Senator Alvers the 56 Robertson the 29th Harper the 7th brass the 28th Martin the 9th.\n\nTo be entitled back to a men article three, chapter five of title 16 article one of chapter 15 and title 45 and article seven of chapter four title 49 The fish go to Georgia annotated relating to kidnapping false imprisonment and related offenses This bill I'm inferred to the committee on judiciary that committee recommends a disbuell do pass Chair recognizes representative Reeves to present the bill Thank you, mr. Speaker Senate bill 394 You know, this is a pretty simple bill As I think all of us are aware we have several different state agencies in our state and many of those state agencies have Units that conduct investigations Department of revenue department of insurance and the attorney general's office is also one of our agencies that has the ability To conduct state investigations And so the way that our laws are set up is that these investigators and some of them are post certified But they are only allowed to exercise All of the powers are they post certified Peace officer if the general assembly Specifically allows them to do that in code and so the attorney general's office currently has Of the many things they investigate by way of example There is something in Georgia called the Fair Business Practice Act, which is our consumer fraud protection laws The attorney general's office has investigators that investigate consumer fraud issues and they have investigators right now Because our code has specifically allowed it in title 10 that their investigators have full peace officer powers The attorney general's office over the last several years and all of you who've been in the room for a while have been a part of this Has really expanded Its ability to investigate and prosecute Medicaid fraud and human trafficking so currently The attorney general's office has one investigator in the human trafficking division and they have 14 Investigators in the Medicaid Fraud Control Unit, but those investigators do not enjoy the full powers of a peace officer because we have not Allow them so in law and so this bill simply allows in those specific areas Medicaid frauds is mostly dealing with the exploitation of elders and then human trafficking It allows them those full powers and it's important because those cases are complex and there's oftentimes urgency especially in human trafficking cases where The need to make an arrest is urgent and needs to happen on the spot and these very Complex Medicaid fraud cases oftentimes stretch across several jurisdictions So instead of having a partner with other local jurisdictions This will allow the attorney general to have the flexibility to to really have the efficiency To handle these cases from beginning to in Mr. Speaker I will that there is The bill supported by the GBI police chief sheriff association This should be a simple matter. I'll yield for questions You do have a question or two do you yield a deal chair recognizes chairman Fleming to your left for a question Thank you. Thank you, miss Speaker Representative isn't it true that I fully support this bill because as I understand it We have been doing a good job of trying in this state to crack down on sex trafficking Especially of children and as our attorney general has expanded his efforts to Eliminate that as best we can from the state. This is a vital component of that need is it on true? That is true and you know I might understand there's a minority report on the case so I think that there is going to be opposition to this But I will say this this is about the exploitation of elders And it's about human trafficking and I believe that those are two issues that are about as bipartisan as it gets and supporting this bill is simply allowing the the office that is investigating those issues that knows the most about those issues that Begin those investigations to actually be able to follow through and finish them up and be Completely over them from start to beginning. So mr. Speaker since there is a minority report. I will yield the well Okay gentlemen has yielded the well and There is a minority report And under the rules of the house 20 minutes are allocated for the presentation of the report The chair recognizes representative mech Lauren for purposes of the minority report Thank you mr. Speaker I would ask the house today when making a decision on this bill to think about the way that framing The issue is working in this discussion You just heard the gentleman say that this bill is about sex trafficking or it's about Medicare fraud I disagree I think this bill is about Process I think this bill is about separation of powers and I'll try to explain briefly Anybody here a fan of law and order? You know the beginning of the Episode when it says the criminal justice system is divided into two parts the Prosecutors at charge cases and police to investigate them Two parts now public defenders take a beef with that intro, but that's for another time But there's a reason why there's two parts as articulated by the makers of law and order Because the power to Prosecute a crime is Distinct even within the executive branch from the power to investigate or enforce the laws on the ground This bill would give the attorney general's office the ability to collapse that distinction To hire its own post certified officers To investigate the crimes that it itself is prosecuting as a matter of expediency as a matter of convenience I think sex trafficking is horrible I've worked at a federal court on Medicare fraud issues. I do not take for granted the seriousness of those issues But it's really really easy to stand up and say we should collapse separation of powers because these issues are really bad You wouldn't agree as the Georgia legislature to collapse the legislative and executive functions of Georgia government Just because the issue that we think we could address more efficiently is a bad issue or it's a really important issue You wouldn't do that Because process is important so I'm asking you to look within the executive branch At this request from the attorney general to collapse the functions Of prosecutors and police I really don't have a whole lot more to say than that. It's about convenience And I have not personally served as a post certified officer and I've never been a prosecutor So I can't personally give you any stories as to why it's important for those functions to be distinct But I ask you if we're going to go down this road Where for matters of administrative executive convenience at the level of the attorney general There are people in here who are concerned about liberty And I just ask you to keep that concern at the forefront of your mind as you evaluate this bill. I yield the rest of my time. Thanks Mr. Speaker Gentlemen is yielded his time Under the rules of the House the chairman has to the 20 minute final argument chair recognizes Chairman ifstration for the chairman's time Thank you miss speaker all yield the balance of the chairman's time to represent a breeze gentlemen has that right and the chair recognizes representative Reeves for the balance of the chairman's time Thank you miss speaker um, you know, it's interesting argument that was just made about um That the we should separate the Prosecutor's ability to investigate and then prosecute probably maybe somebody could get Paul Howard over here to hear that comment because Well, you know consistency is important, right? Consistency is important so somebody please call Paul Howard and asking to come over here and listen to this debate um There's never been to my knowledge of intersex years Nobody's ever raised an issue about the various and sundry State agencies such as department of revenue department of insurance and currently the attorney general's office that has Already has the ability for their investigators to exercise full Peace officer powers um, I've never in my six years heard anybody to even talk about how we need to repeal that how that's a problem and that's an issue And so if we're going to frame the issue as was said in the minority report then let's Let's frame the issue that this has never been an issue Until right now and again, this is creating an efficiency That's going to help us better Handle the exploitation of elders and human trafficking criminal cases These are complex cases and the attorney general's office has very Qualified individuals as the investigators that are highly competent and I ask that this body Um, please support this measure. Thank you mr. Speaker What purposed as representative al Williams rise As Stature inquiry Isn't that true? The speaker that I was looking forward to asking the gentleman What he was going to tell us out that big book that he brought with him to the podium which he never used Maybe he's never read it. I think you're right, but And oh yeah, I understand where you didn't open it I don't want it because that thing seems awful to me. I have enough trouble without that. Take it back. I don't get paid But is it not further true that in testimony Before I subcommittee appropriations the attorney general has said and this is just my will over an edification that Elder blues abuse while egregious The biggest Medicaid fraud is from providers But I do like to bill but the providers are who Take all of our money at Medicaid. That's the big blues If the gentleman so states chair recognizes The chairman of the committee chairman of stration Do you're let for all purpose to you rise? State your inquiry. Thank you miss speaker is it not true that Georgia's taken incredible steps of the past few years to fight the evil human trafficking enterprises that we have found and that this measure Consistent with investigators working in prosecutors offices who were post certified this gives the attorney general the tools to fight Crimes that many times can span Jurisdictions can span judicial circuits and states chief Law enforcement officer needs these tools is that not true? If the gentleman so states I know that he is an expert in this area What purpose does representative holly rise? All the men agree to write your inquiry is not true That for the amazing bills that this legislation has passed in order to stop human trafficking that we've been able to do so Because our government has been able to successfully work with many of the local small Municipalities who already have active investigators who are working these cases to make sure that we can limit the amount of Extrafic in cases in the state If the gentleman so states I know that you believe that to be true What purpose does chairman setslar rise? We got you a microphone coming You Pull him in her signature inquiry If members of this body are honest with themselves isn't it true that we believe that the attorney general's office has this power I mean I didn't know mr. Speaker that they couldn't conduct these kinds of investigations the idea that they can't um I mean out of never known as a member of the public and can't believe this legislature That the attorney general's office did not have this power this seems to do something very simple I think most members this chamber would presume they already have the power to do Mr. Speaker why are we making this complicated when it's directly focused on sex trafficking Investigations for the kind of powers that common sense would tell us they should have already had and this is just trying to fix that simple Oversight in law is that true mr. Speaker? Because I think sometimes we're predisposed to make that which is not complicated complicated What purpose is representative carpenter rise? Stature inquiry is this not true is it not true that this bill is talking about the attorney general that as soon as he found out the terrible Incidents that happen in brunswick move swiftly to make sure justice would be served He did do that Okay, we're ready to vote Is there any objection to the previous question being ordered the chair here's none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair Here's none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no And the clerk will unlock the machines and call the roll Alexander on allowats bar Barton Belton Bennett Bentley Benton Beverly Blackman Bodie Bruce Burns Carpenter Carson Chokus Clark H Collins Cooper Corvette Dempsey Dickie Dollar Drenner Dubnick Eftration England Irwin Fleming Fry Gaines Gardner Graveli Herrell Hatchet Hawkins Hitchens Holcomb Holmes Hauston Hugley Jackson M Jasperous Jones J Kelly Kendrick Knight Lehyd Larickia Lomston Martin Mathyak McCall Morris G Newton Nick's Oliver Parish Parsons Petrie Perkel Powell Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Silcox Smith L Smith R Smith V Smirrey Stevens R Tancersley Tanner Tarvan Taylor Thomas E Tramble Washburn Watson Welch Workhizer Wheat Hour Williams A Williamson Yerda Allen Beesmore Bernal Cannon Carter Clark D Clark J Cook Davis Douglas Dreyer Dunahue Earhart Evans Frazier Gilligan Gertler Henson Hill Hogan Holland Holly Hobson Howard Hutchinson Jackson D Jones S Jones T Jones V Kaush Kenner Lopez Ramera Marin McLean McLean McLean McLean Mitchell Moore B Morris C Morris M Nelson Wen Paris Prince Pullen Robo Show Saints Scofield Scott Shannon Sharper Smith M Thomas A.M Turner Walensky Wilkerson Williams MF Williams N Wilson Beesley Teg E C T Yes Bonner Yes Buckner Yes Um No Richette No Callwell Call Yes Campbell Yes Cantrell Yes Dixon Yes Dickerson Yes Dixon No Dukes Duce No Campbell No Galeard Gillard Galeard No Gordon Galeard No Green No Green Yes Gullet Yes Gull Yes Jones J.B Yes Jones J.B Yes Kirby Yes Kirby Yes Lot Yes Mathis Yes Metz No Mopthahad Mopthah Yes Park Yes Per No Prood Rodney Yes Singleton Stovall Yes Stovall Yes Williams R Williams R Aneloids Drenner Drenner Dunahue Dunham Campbell Yes Jackson M McCall Mitchell Scott Thomas E Thomas E Thomas E Thomas E Thomas E Thomas E Thomas E Thomas E Thomas E Members will look at the board Make sure it is correct Clerk will lock the machine on the passage of Senate Bill 394 The eyes are 102 The nays are 64 This bill having received the requisite constitutional majority is Therefore passed Clerk will read the caption to Senate Bill 429 Senate Bill 429 Senator Ligon The third stone The 23rd Robertson 29th cows 46th Vittal NAC to amend The district court of Georgia annotated so as devise modernized correct errors Oral missions in and react statutory portion of the said code Refer to the committee on code revision that committee recommends a dis bill do pass Chair recognizes chairman Timothy bar to present the bill Thank you, Mr. Speaker I brought my water today as this is a 23 page bill and I'd like to go over it line by line with you Brevity This is our annual cleanup bill We add Capitalizations where they were omitted Commas and periods And that is the 23 pages of this bill is purely Revising the code in that way And in the interest of lunch I will yield the well, Mr. Speaker Ask for your favorable consideration I do not think you have any questions Is there any objection to the previous question being ordered the chair here is none the previous question is ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here is none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines Allegs and her anoloids bar Barton built and Bennett Bentley Benton Beverly Blackman Bodie Bruce Burns Carpenter Carson Chocus Clark H Collins Cooper Corvette Dempsey Dickey Dollar Drenner Dubnick England Irwin Fleming Fry Gaines Gardner Graveli Harrell Hatchett Hawkins Hitchens Holcomb Holmes Jones J Kelly Kendrick Knight LaHood Larickia Lomston Martin Mathyak McCall Morris G. Newton Nick's Oliver Parish Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Sillcox Smith L Smith R Smith V Smirrey Stevens R Tancersley Washburn Watson Welch Workhizer Wheedower Williams A Williamson Yerda Allen Beesmore Bernal Cannon Carter Clark D Clark J. Archer Dunahue Earhart Evans Frazier Gilligan Gertler Henson Hill Hogan Hollie Hobson Howard Kausch Kennerd Lopez Romero Marin McLean McClaren McLeod Meeks Mitchell Moore B Morris M. Nelson Wen Peris Prince Busho Saints Scofield Scott Shannon Sharper Smith M. Thomas AM Turner Wollensky Wilkerson Williams M.F Williams N Wilson Beasley Teague Yes Buckner Yes Burchette Carl Will Yes Campbell Yes Cantrell Dickerson Yes Suks Yes Campbell Yes Gillard Yes Gordon Yes Green Gullet Yes Joan J.B Yes Kirby Yes Lot Yes Mathis Yes Metz Yes Mavhtahan Yes Park Yes Fruit Yes Rogers Rogers Yes Singleton Yes Stovall Yes Williams R Canna Carter Dreyer Gaines Huggley Hutchinson Jackson M. Jones V. Meeks Newton Ridley\n\nScott Gins, Tramble, Williams A, Yerda. Members will check the board and make sure it's accurate. Block the machines on the passage of Senate Bill 429. The eyes are 166. The knees are zero this bill. Having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 344. Senate Bill 344 by Senator Molles, 53rd Millenium 49th, due to the 30th Gooch, 51st, kind of the 18th and others to be in Tallah Nack to amend Code Section 24, 1360, the official go to Georgia and it's related to order requiring prisoners delivery to serve as a witness or criminal defendant generally. This bill have been referred to the Committee on Judiciary, non-sevalat committee recommends that this bill do pass. Chair recognizes Chairman Eftration to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, begin today presenting Senate Bill 344 by telling you a little bit about my other job. So I'm a practicing attorney when we're not in session. I go to the courthouse pretty much every day. I'm there all the time and I'm familiar with the criminal process and procedure on both sides of it. Being a former prosecutor myself and being in private practice. I've seen how it works. My wife served as a citizen advisor. Our accountability court have just seen the ins and outs of it. And we had a really innovative judge a few years ago who started doing something new in Gwinnett County where I primarily practice. So Judge Randy Rich, the spouse of one of our members of this body, is an outstanding judge and was a tremendous innovator certainly from my perspective. What he did was he worked through the technology aspects to ensure that defendants who needed time and court and when there was relatively routine matters to take care of, that there could be a video connection between the courtroom, all interested parties and the defendant. And what that did is it enabled for expeditious justice. It didn't require that cases be held over or postponed because transportation didn't happen which actually is a frequent issue if a teammate isn't transported. It really allowed for tremendous efficiency in the process, but also was a huge cost savings to the county and was done so with true protections for all rights and all parties involved. And that really opened my eyes to the procedure and the opportunities that really come from that. Senate Bill 344, that's a long window way of me telling you, Senate Bill 344 is authorizing in code for this really to be done throughout the state. Because primarily the delays that happen are because of inmate transport to and from prisons where there can be hours and hours of drive-tun in between. And we're talking about very expensive costly transportation because of the guards necessary for the transit. And if transportation isn't made and all the attorneys are present in one place and a hearing can't happen, that's a huge expense to the state and local government because of that. So what we have here is a bill that would allow for non-trial proceedings, certain specific proceedings to occur by video conference, which we've all become more accustomed to in this current time. But would allow for defendants or people who are post-convictions. So this is either pre-pre-pre-trial or post-conviction proceedings to be handled in this manner. Now there are a few exceptions and that would be just what's listed here is includes araments and other just very routine matters. But you're right to be present in court is not for your trial is not changed by this bill. The legislation is requested by the Georgia Department of Corrections and has been supported by them. It was introduced by Senator Mullis in committee we heard about the importance of this cost savings and how this would allow for the parties involved to also have confidential communication with their attorneys. So a defendant is going to have a secured means by which to have confidential communication with his or her attorney. And I'll just tell you if you've ever been through the process of an attorney, you know what we have to do otherwise many times is a criminal defense attorney will actually have to go to the prison, go through all the protocols to enter a prison which are extensive and then be very limited in any ability to potentially interact or have extensive conversation because the limitation of time wants inside the prison to meet with the attorney's client. So these protocols I believe will really help to ensure a greater expeditious delivery of justice in our state and will serve all parties involved, preserve the ability of course to be in court for your trial. That's unchanged. And a side effect of this will also be a huge cost savings to the state, a very important thing. Now if a party feels a defendant feels that he or she should be in court, his attorney has the ability to make that known to the judge and the judge may grant that in order that the party appear. There's been great discussion of and I think the minority report references that that's not a shall. You shouldn't have an absolute right to be in court. And I'll just tell you this with all of the protections that we have in our Constitution or code for criminal defendants with the oversight of the judiciary and the appellate process, I am confident reading this legislation that all protections due to defendants under our Constitution are preserved with this bill. I don't have any concerns that people are going to be prevented from getting what they want in the process. We heard in committee from a spirit court judge who stated, and I'm just paraphrasing here, but if a request is made by a party to be present, more likely that's going to happen. A judge is going to agree to it. We're talking about post-conviction matters that can be handled in an expeditious manner. It continues to be my belief that Senate Bill 344 serves inmates, serves defendants, served those accused of a crime far greater than any possible concern that a judge might refuse a request to appear in person. I believe that this is good legislation. I'll be happy to yield for questions. Thank you, Mr. Speaker. Mr. Chairman, do you yield for questions? Yes, sir. Chair recognizes Chairman Silcox to your right for a question. Thank you, Mr. Speaker. Mr. Chairman, do you yield? Yes. Isn't it true that this will also provide for people to still have access to these conferences, the same thing would in a courtroom that is the most will not be conducted in private, so people will still have access to hear these hearings if they so desire. Yes, absolutely. That's a great question. Just to give a summary here, all parties in those involved would still be in the courtroom traditionally with this. The hearing is open. The courtroom is open. So those who appear in court have the ability to see just like they would any other open courtroom proceeding. But in some circumstances, I'm aware of the hearings being live streamed online as well. So public access is preserved. That's in no way changed from existing requirements in the law. And don't you think also Mr. Chairman, this will result in substantial savings to the state? Without a doubt, substantial savings. The testimony that we heard in committee is it's thousands of dollars per inmate to appear at these hearings in court. And if you think about a habeas corpus proceeding, a post hearing, post conviction hearing, where a person who has been convicted is being transported to the court, the attorney is potentially having to be transported to the prison before the meeting. We're talking about great cost savings and increase in efficiency in allowing the person to get judicial consideration of his or her petition and for the defense attorney to speak to the post conviction attorney to speak to his or her client in an expeditious manner with all the protections of confidentiality and privilege preserved. Thank you for bringing the bill, Mr. Chairman. Thank you. Chair recognizes representative Perchette for a question to your right. Thank you, Mr. Speaker. Is the gentleman yield? Yes, sir. Isn't it true that in a time as we are in now with this pandemic that this would create an ability for these hearings to take place remotely so that there is less likely the chance for any type of transmission and we can continue to move business along in times such as these, isn't that true? That's absolutely true. Thank you. That's a great point that I hadn't raised but I know that there's been great concern by all of us to reduce transmission. Certainly, the Department of Corrections is expressed concern and pushed and sure that that's minimized and by allowing for these video hearings that that will further that regard. I do not. I do not. Thank you, Mr. Speaker. I ask the House to favorably consider this measure and I'll yield the well. Gentlemen, as yielded the well, we do have a minority report. We have a minority report on Senate Bill 344. The Chair recognizes the minority leader of the House leader, Tramble, for the minority report. Thank you, Mr. Speaker. I know it's lunchtime but I want to start out by reading from the text of the United States Constitution, Amendment 6. In all criminal prosecutions, the accused shall enjoy the right to a speedy and public trial by an impartial jury to the state and district wherein the crime shall have been committed, which district shall have been previously ascertained by law and to be informed of the nature and cause of the accusation to be confronted with the witnesses against him, to have compulsory process for obtaining witnesses in his favor and to have the assistance of counsel for his defense. Ladies and gentlemen, it may be right before lunchtime but the sixth amendment right to counsel is literally on trial on the floor of the Georgia House. It's on trial. If you vote yes to this bill, you are eviscerating the fundamental constitutional right to counsel provided in the sixth amendment to the United States Constitution. Now, let me tell you about what this bill does by its own terms. This is a bill about convenience, administrative ease. But you know something, the founders, when they wrote the Constitution, recognized there's some things that aren't supposed to be easy. When your constitutional rights, they're not supposed to be given up or taken away easily. You're not supposed to be able to take someone's liberty away easily. And when we talk about going to a process where a defendant on trial for his liberty is able to appear by video and has no choice in the matter, does not have a fundamental right to say, I want to appear in front of the judge in this proceeding. We have compromised that fundamental right to counsel. Now, it was said that they maintained the right to appear for a jury trial. But how many of you have ever been to a proceeding where there's a criminal calendar in court, a state court or superior court? There are literally dozens upon dozens, sometimes hundreds of cases, people there in court, waiting for their day in court. If we do this, you know what will happen? We're just speeding up the processing of people, just like that. And when a defendant says, I want to appear in court, are they guaranteed that right? No, not under the spill. Only if the judge says okay, the judge's discretion. And you know what, as a lawyer, a lot of times convenience trumps fairness. And if it's not a right and they don't have the ability to invoke it as a right, they'll lose it. Now I want to talk about this. It was made out like it was just post-conviction proceedings and things that don't involve the implication of surrender of liberty. But I would call your attention to line 27 in the bill, entry of pleas in criminal cases. That means you're pleading guilty. That means the awful, awesome power of the government is coming down to bear upon you. And you are surrendering your liberty from a video conference. If a defendant voluntarily wanted to waive a right to appear in person, this bill might be totally different. But that's not what this body is being asked to do. We're being asked to take that right away from a prisoner in custody of the state or prisoner in custody of the county correctional facility. Look where we are right now. We're in three places. We're not all on the floor of the chamber. We're on the floor. We're in the gallery and we're in 341. Would anybody maintain that this is exactly the same as we regularly do business? No. It's not. It's harder. Even though everyone is free to come down to the chamber, we have the rights to move about. But you know something, when you're confined in a correctional facility, it's not like coming from 341. It's not like coming down from the gallery to participate in this proceeding. You're there. They're guards all around. You're not right next to your lawyer. You think that's the right to counsel? A wait a second. I want to time out your honor. I need five minutes with my client. Go in the room and look at a video monitor and you can have the time you need to talk to your client. You don't think that there are potential other implications about attorney client privilege that will come up in certain contexts with that? Of course there will be. I want to end this. I'm going to end this and leave you all my time to represent a body because I think I've made my point. But I just want to take one story. You know, I've stood in those proceedings next to defendants when they're entering pleas, when they're going through this process. And I've got to tell you that being able to be right there, while it may not be part of the record proceeding, there are a lot of times where a defendant needs to lean over to his or her lawyer and ask a question, just if it's about what's going on, what's happening? What's going on here? What's about to happen? So it's not like I'm giving them some brilliant legal advice at the moment. But they've got that right. They have an advocate that understands the process and is there to explain it, is there to stand up for them when something's not going right? And it's not the same if you put somebody on a video and you're just sitting there and they're left to guess. And you know what? It would take tremendous courage to summon the strength from a remote location to say I need a minute to speak with my lawyer. Whereas if they're right next to me, they can just tap me on the shoulder, say what's going on? It's not the same. We know it's not the same. Here's my story and then I'm going to yield the balance of my time to the whip representative voting. You know you see a lot of things in court. And one day I was taken a plea with a guy and he thought that he was going to get probation. It was the recommendation of both the prosecution and the defense and that was the way he thought it was going to go down. He thought he was going to walk out of that courtroom. But it was one of the rare instances where the judge disagreed with the recommendation of the prosecutor and the joint plea agreement. Thought he deserved some time because of the nature of the offense. Not caught us unsuspecting and caught us unaware. So we got sentenced to two years to serve. And you know what he did? He pulled his wedding ring off and he handed it to me. And he said give it to my wife. So she can take care of it. You can't do that. On the EO. Mr. Speaker I yield the balance of the time for the minority report to the whip representative voting. Gentlemen has that right. The chair recognizes representative voting for the remaining 10 minutes and 30 seconds of the minority report. Thank you, Mr. Speaker. Normally when I come to the well, I would have a sheet piece of paper, my speech written out. But this is one of those occasions where I just don't need that. Because I live it every day just like our leader of the Georgia House Democratic caucus every day. We debated this issue in committee. We just ask allow a defendant to opt out, allow the defendant to be able to go before the judge if they choose to. So some of us may be sitting here because we may not have been involved or had a loved one involved with the judicial system. But sometimes in this general assembly, we have to put ourselves in the seat of the people that come before institutions of this state that we have nothing to deal with in our daily lives. Because we do represent the state of Georgia. And we do have people that may have mental issues, drinking issues, substance abuse issues, that may have to avail themselves to the judicial system. And like the leader stated before, constitutional rights should always be adhered to. And this general assembly should do everything that we possibly can to make sure the Georgia Constitution and the US Constitution are always front of mind before this noble body. I won't keep much of your time. But the leader had a story. Because he's a trial lawyer like me. And I have a story. I had a client. I would say it in a jurisdiction that could be a little tough when it comes to repeat offenders. But this is a non-violent offense, a theft of offense. The problem is my client had a string of those offenses. And I spoke with my client. I wanted to know what's going on here. What is the root of the problem? Mr. Bowie, I'm an alcoholic. Mr. Bowie, I do drugs. Mr. Bowie, I have stolen from my mother, my family, and I have disgraced my family. But it's time, Mr. Bowie. I need help. I need you to get me into a program for my substance abuse problems. I need to be able to be a man to my child. I need to be able to be a man to my family. So I found to substance abuse program that would accept to them. And so when I went to the prosecutor and the prosecutor said, Mr. Bowie, the negotiated plea, the best I could do is 10 years in prison. I was like, Mr. prosecutor. I just can't accept 10 years in prison for my client. I just can't do that. My client has a drug problem. And I got him in. He's got to get into a rehab program. He's going to change his life. Well, Mr. Bowie, you tell it to the judge. And I said, OK, we'll put it up in the negotiate. What the negotiate it means is that we don't have an agreement. And I'm going to put up my side arguing my case for my client. The state is going to do the same. And the judge is going to make the decision in the end. And so I told my client I was like, it may not look good for us because you do have a record. And you have a string of death cases. He's told me, Mr. Bowie, just let the judge see my face. I just want the judge to see my face. And so we went before the judge. And the judge saw my client's face and told his story of his life, of his challenges. The judge gave him a better deal that I could ever ask for. We're going to put your own probation today. But you're going to go straight into that substance abuse program. We're going to let you go. We're going to let you leave here today. And we're going to allow you to wait on the bed. But be with your family. And as soon as you're done, we're going to terminate that probation. Once you complete that program, you don't have to pay any files of fees. And we're going to give you first off into treatment. My client completed it. He's married today. He has a family. He just had a child. With that, Mr. Speaker, I yield the will. Okay. Moving on now to the chairman's time. Chairman of the administration is recognized for the chairman's time. Well, thank you, Mr. Speaker. Ladies and gentlemen of the House, it's been a busy week for me. I had no idea that this would be, this bill would end up being the biggest fight here on the floor as it's become. A few things have been said from this well, which need to be corrected, which just simply are not consistent with the practice and the truth as I've observed it. I appreciated the minority whips comments just a moment ago. I recall in committee that this member actually specifically talked about a great experience with resolving a matter through a video connection in a Cobb County courtroom, spoke specifically to the judge who me had been before. This legislation does nothing to stop or prevent a criminal defendant from being present in the courtroom when his or her liberty is at stake. Tries are unchanged by this bill. A trial cannot take place because of this bill over video. It can't be done. We're only talking about as I said earlier, and I'm consistently saying now, pre-trial and post-trial proceedings in a very limited nature. So let's go through them. You can see the listed events here. Hearing's on our appearance. Initial appearance hearings, probable cause hearings, pre-trial motion hearings, all pre-trial, and line 27, entry of pleas in a criminal case. Now I practice law so I know what this looks like, but not everybody in here has seen these procedures, seen how this goes. What happens when there's an entry of a plea in a criminal case? That's where an attorney has met with his or her client. And we're talking about in custody cases here. Has met with his or her client in custody. Has discussed the implications of voluntarily and freely going before court and admitting guilt in a case and understands the implications because that attorney is duty bound to have made sure that his or her client knows these things. Now if the client is leaning over in court right now and saying what's happening, I submit to you that there's been a real failure in the communication and contact between the attorney and his client prior to that date. But if that happens anyway, if that still occurs, there is a means by which for there to be a direct and secure communication channel between the attorney and the defendant. And by the way, was said in committee that if the attorney wants to be with his or her client at the remote location and have the video connection, that way that's fine too. Nothing in this bill would prevent that. And some lawyers I've seen prefer to do that. They want to for the guilty plea to go be next to their client and speak to the judge through the video fee. That's fine. There is nothing in this bill which is inconsistent with constitutional protections ensuring that you get due process under the law. I mean, by its very nature, the constitution would trump anything that we're doing here. And the fact that this is being practiced that we've seen in state courts only and all the more so should encourage you and give you confidence in our ability to pass this for protections to remain in place. Now I'll point you to some other language here just for anybody who's really questioning how is this going to work? And it's on 78 to 80. Except for these pretrial and post-synancing matters. Nothing in this code section should be construed as providing for the use of testimony pursuant to paragraph one of the subsection in criminal proceedings. That's making it explicit. It cannot be used at trial. You have to be in the courtroom for any trial.\n\nUnchanged. This is not about folks who are now going to have to plead for their liberty over video connection. That's just not in this bill. In the trial proceeding. We talked about other court matters that are also included in here. So it's not just limited to the criminal context, but we're looking at great efficiencies in the court system, which I've mentioned are not all that indifferent from what we've already passed this week, which is allowing the General Assembly to meet and hold committee meetings and deliberate and discuss issues through video. We've already passed that. What could be of greater importance than deliberation on the laws of our state that will all have to live under? And if it's good enough for a unanimous vote or complete support on an issue like that, we're talking about the same type of framework for what I'd characterize as more regular matters that are required to be handled by courts, which require parties to appear, and currently a very expensive and long process for inmates to be transported to and from a courtroom, sometimes on the other side of Georgia. You know, a common statement often given is justice delayed is justice denied. When I read this bill, what I see is utilizing technology to deliver justice to the people of this state. I wouldn't be up here. I wouldn't be talking to you about this measure. If I thought there was any chance that this would cause some sort of railroading of people or denial of due process or a denial of civil rights. I view this as a great opportunity for those who are in custody in our state to get their cases resolved because I can't imagine anything worse than sitting in a jail cell or sitting in prison, waiting to resolve your matter, waiting to be heard, but you can't because transportation didn't occur because the chief justice issued a COVID state of emergency that's been extended for 30 more days because other things have occurred which will prevent you from being in court because your attorney can't find the time or hasn't been able to yet to drive across Georgia to your prison to meet with you. The opportunities here to get before a judge, to address issues, to give that person who's in custody a chance to speak to the manner of woman in power who can address, who can fix the problems, I think is tremendous. I think if we fail to act on Senate Bill 344 today, if we leave this measure for another session or vote it down, that that will do more harm than good to the people of our state. I ask you to support Senate Bill 344. Do you yield for questions? Yes, sir. Chair recognizes, Representative Beth Moore, do you ride up in the gallery for a question? Thank you for a spirit debate on this. Does the gentleman yield for a question? Yes, ma'am. Isn't it true that if we do not pass this particular version of this bill today that that would not preclude court systems from voluntarily putting in place these types of virtual proceedings, just like we do when at county as you mentioned in your first statements? I disagree with you in this sense. The state of Georgia will still likely be compelled or required to transport inmates to and from court proceedings without explicit statutory authorization. Do you yield for a follow-up question? Sure. How does the court, isn't it true that we do have a judge in Gwyneth County as you said that has implemented these virtual proceedings on voluntary basis both in terms of its voluntary for the court and voluntary for the defendant? Isn't it true that there are other courts that if they have the financial means in the technological ability, including a good internet connection that they could implement this type of virtual proceeding if they wanted to? So I don't practice extensively in this area, so I may be, I can't speak to specifically what's going on, but my understanding is what we see at the Gwyneth courthouse is primarily between Gwyneth, the Gwyneth courthouse and the Gwyneth jail, or an adhabious proceeding between a prison where there's a phone contact for the attorney, doesn't include the protections that are in place in this bill to ensure the video conferencing that would be expected at the conclusion of this bill. And thereby, it's my understanding thereby, the state and the Department of Corrections would be compelled to transport inmates to and from court costing thousands of dollars. Thank you. Chair recognizes representative McLaren to your left for a question. I'm Deha, does the gentleman yield? Yes, sir. Is it not true that in committee a bipartisan group of legislators attempted to amend the bill to change the word may to shall, meaning the judge using in person proceedings upon objection to the defendant, but that the committee rejected that amendment? So I can't remember the amendment exactly, but this was a real focus of the debate in committee. Does the gentleman pretty afford that? Yes, sir. Is it not true that the six amendment to the Constitution, the US Constitution guarantees not only the assistance of council, but also the effective assistance of council at a series of stages, so-called critical stages, which include proceedings like an arrangement pre-trial hearing, pre-trial motions that would be covered by the provisions of the bill. So what I'll say is there is throughout constitutional arguments that have been made about the extent of the right to council, there have been interpretations as to which phase or certain phases, whether or not the right to council exists. But I don't think there's any contesting that in the phases that are before us in the criminal context, there is a right to council, absolutely. What I would just say to you is, many times in the court system and in the judiciary, I've observed inefficiencies which drive me crazy. What are some of those inefficiencies? It's the failure inability of an attorney to make contact with his or her client. Maybe there's a large caseload, maybe there's some obstruction to being able to get into the courthouse. I'm sorry, get into the jail or where that person's being held to meet with them. Maybe it's you can only come during these certain hours and the lawyer has court during those hours and it becomes very difficult. Other major obstacles, a judge's calendar, judges who have very long calendars and an inability to get all of the cases before the judge for decisions and dispositions and justice to be done in the cases. And a third major thing that I've seen that's caused issue and that is when judges show up, attorneys show up, the attorneys are being paid by the state potentially through indigent defense, the judge of course is being paid by the state, everybody's there present and you know what, transport didn't happen. Transport didn't come through. And that hearing now has to be reset for another day because the logistics of getting the party there to handle the hearing couldn't occur. I see all these inefficiencies and I view Senate Bill 344 as a solid, as a reasonable, as a protective measure to utilize technology to address those inefficiencies, to deliver justice to the people of the state. I don't read this bill and see any erosion of constitutional protections. I don't view this as means by which a criminal defendant is going to be forced into some outcome. But just to take that a step further, you know, every when I used to be a prosecutor, you have to remember you're not just duty bound to do justice in the case, do justice on behalf of your client, the state. But you're also responsible to make sure that the defendant receives a fair hearing, that he or she receives a fair judicial disposition because you know that our constitution holds all officers of the court to these standards. And on top of that, you know that an appellate court is going to review whatever's taken place and court. And if there's any erosion or taking away from that, that's going to be known and that case is going to be right back before you. You just think through the potential for a defendant to say, Judge, I want to be seen. I know I'm on a calendar to have a video conference with you for post-sinnance proceedings in line 31 to 33. So the person who's been convicted is in prison and says, no, Judge, I want to have my proceeding held in front of you. Why would a judge not grant that to ensure that there is an appellate basis later arguing that I didn't have a fair hearing because I wasn't present for the proceeding? I'd submit to you that most are going to say an opportunity to get before a judge in an expeditious manner is a way to deliver justice. And that's something I'm going to support. Folks want to get in front of judges, in my experience, if they don't, because they don't like what's going to happen when they get in front of a judge. This gives an opportunity to get in front of the judge, make the facts known, make the arguments heard, so that the case can be resolved. I just, I just repeat what I said earlier, justice delayed is justice denied. Senate Bill 344 is a means by which to deliver justice to better help the people of our state. This isn't erosion of constitutional protections. The ability to appear in court is not only, not only continues to be the case, but is unchanged by this measure. This is not going to change a court proceeding for trial one bit and not encourage your favorable consideration. Thank you. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 344? Will vote aye those opposed to vote no? And the clerk will unlock the machines and call the roll. Alexander Aneloowitz, bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Houglet, Hedley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Hall, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirie, Stevens R, Tancersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Watson, Washburn, Welch, Workiser, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Ramero, Marin, McLean, McLaren, McLeod, Meeks, Mitchell, Morbby, Morris C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, No, Bonner, No, No, Perchette, Calwell, Campbell, yes, Cantrell, no, Dickerson, No, No, No, Campbell, yes, No, Gordon, No, Green, yes, Colbert, yes, Jones J, B, no, Kirby, yes, Lot, yes, Mathis, yes, Meets, no, Mom to Han, yes, Park, Pruit, yes, Rogers, Singleton, Stowe, no, no, Williams R, yes, Blackman, Dunhu, Gardner, Jones T, Morris M, Pullen, Silcox, Tanner, Mayor's father, Members will look at the board. Make sure it is correct. Members will look at the board. All right, Mr. Clerk, you may lock the machine on the passage of Senate Bill 3344. The eyes are 82. The knees are 82. This bill having failed to receive the requisite constitutional majority is therefore failed. The purpose of this is the majority will Kelly rise to make a motion. State your motion. Mr. Speaker, I'd like to serve notice of a motion to reconsider Senate Bill 3444. The time for the motion is now. So the question before this body is whether this house will reconsider its action in failing to give a constitutional majority to Senate Bill 344. All those in favor of the motion for reconsideration will vote aye. Those opposed will vote no and the clerk will unlock the machine and call the roll. Alexander Aneloets, Bar, Barton, Belton. Just a minute, Mr. Clerk. It's important that the clerk be able to hear responses. So I'm going to ask that you cease conversation until we get this roll call in. You may continue. Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Prye, Gaines, Gardner, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Mathyack, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcotts, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Williams A, Williamson, Yerda, Alan, Baysmore, for now, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, when, Paris, Prince, Pullen, Robeshoe, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollinsky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, No, Bonner, Yes, Buckner, No, Barchett, Calwell, Campbell, Yes, Cantrell, Yes, Dickerson, No, No, No, No, Yes, No, No, No, No, No, Green, Yes, Yes, Jones J, B, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Met, No, Yes, Park, Yes, Park, Prew it, Yes, Rogers, Yes, Singleton, Yes, Stoweball, No, Williams R, Yes, Alan, Yes, Davis, Jasper's, Jones V, Morris G, Pullen, Smith L, Henry, Tarvin, Thomas A, M, Weedower, Williamson, All right, members will look and be sure that the board is accurate. The clerk will lock the machines on the motion for reconsideration. The eyes are 94, the nails are 71, this house is reconsidered. It's action and failing to give a constitutional majority to Senate Bill 344, and that bill will go back on the general calendar now. If you have signed up for an announcement, make your way to the front of the chamber. Give me the chair wants to call your attention to you have on your desk or at your seat, your agreed disagree folders. Okay, they're on the tables, I understand. You need to get one of those, put your name on it and hang onto it because that's the only one you'll get and you're going to need it today and tomorrow and Friday and Saturday and Sunday. So be sure and get one of those. Chair recognizes Chairman Lynn Smith for an announcement. Good afternoon everyone and this is to clarify that natural, that natural resources and environment committee will be meeting upon a German which is now in room 506 CLOV to consider Senate Bill 384, Senate Bill 384, 506 CLOV to be upon a German. Madam Chair, that's actually going to be upon recess. We're coming back. Well I was being hopeful Mr. Speaker, but I understand. I can't blame a lady for trying can you chair recognizes the chair.\n\nChair of the Ways and Means Committee, Chairman Harrow for an announcement. Thank you, Mr. Speaker. The Ways and Means Committee will also meet upon recess and 406 CLOB will be taking up Senate Bill 375. Chair recognizes Chairman Tanner for an announcement. Thank you, Mr. Speaker. Transportation Committee will meet upon recess and 606 CLOB taking up the road name and bill. Please come so we can get that taken care of. Thank you. This house will be in recess until for committees and lunch until 2.30 p.m. 2.30 p.m.",
  "updated_at": "2026-02-13T23:31:44.45683+00:00"
}