{
  "video_id": "WFiNYICceNE",
  "url": "https://www.youtube.com/watch?v=WFiNYICceNE",
  "title": "5/29/2025 Sen. Islam Parkes Press Conference on Reproductive Rights in Georgia",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 19,
  "summary": "Here is a summary of the key points from the Georgia 5/29/2025 Sen. Islam Parkes Press Conference on Reproductive Rights in Georgia:\n\n**Overview:**\n- The press conference addressed the concerning situation of a brain-dead pregnant woman being kept on life support in Georgia, highlighting the ambiguity and potential harms caused by the state's restrictive abortion law.\n\n**Key Actions:**\n- **HB481**: Georgia's \"heartbeat\" abortion ban law, which is the subject of discussion and concern.\n\n**Bills Introduced (First Reading):**\n- No new bills were introduced during this press conference.\n\n**Notable Moments:**\n- Sen. Parkes called on Governor Camp to request a binding legal opinion from the Attorney General to clarify key questions about the abortion law's requirements and impacts.\n- Kasey Muroshak shared her personal story of facing barriers to care after a miscarriage due to the restrictive abortion law.\n- Speakers criticized the law for causing confusion, trauma, and harm to women and families, and called for the governor to provide clarity and leadership.\n\n**Votes:**\n- No votes were taken during this press conference.\n\n**Attendance:**\n- This was a press conference, so no quorum or attendance information was provided.\n\n**Adjournment:**\n- This was a press conference, not a legislative session, so there was no adjournment.",
  "transcript": "Good morning. I want to thank you all for being here today. I'm joined by\ncommunity advocates and organizations such as Georgia National Organization\nfor Women, Feminist Center for Reproductive Liberation, Planned Parenthood\nSoutheast, Amplified Georgia Collaborative, and Sister Song National Women of\nReproductive Justice, as well as Black Mama Matters Alliance, and Indivisible.\nI wish we were gathered here under better circumstances, but the truth is what's happening\nright now in a hospital room at Emory Healthcare should shake every single one of us to our\ncore.\nAdriana Smith was declared brain debt in February, a legal and medical determination of death.\nAnd since then, her bodily functions have been sustained by machines in an attempt to continue\nthe pregnancy.\nto her family. The hospital told them that this was required under Georgia law, but that\nwould be an unusual and deeply troubling interpretation of her six-week abortion\nban. Women deserve the ability to give informed medical consent, and when they cannot, their\nfamilies must be empowered to make decisions with full information and without fear. Families\ndeserve clarity, providers deserve protection, and Georgians deserve laws that prioritize\nour health, dignity, and basic humanity,\nnot confusion, delay, and fear.\nRepublicans have made clear.\nThey won't repeal this cruel and unpopular law,\nand repeal is the only way to give women access\nand give them the care they need.\nAnd without repeal,\nGeorgians deserve to know what care they can access.\nWe do not know what this law demands,\nand that is a failure of leadership.\nI have sent a formal request to Governor Camp asking him\nto use his authority to get an official legal opinion\nfrom Attorney General Chris Carr.\nThat's not politics.\nThat is the actual process.\nBut the governor who signed this law into effect\nwon't even acknowledge the question.\nHe won't answer Georgia families.\nHe won't answer doctors.\nHe won't answer me.\nAnd he certainly won't answer the people of Georgia.\nBut let me tell you what we do know.\nWe know that the sponsor of this law\nsays it's working exactly as intended.\nThat this woman being kept on machines\nis the logical results of their legislation.\nMeanwhile, the Attorney General's office\nissues a press statement saying that the law\ndoesn't actually require this outcome.\nThese are not small contradictions.\nThese are life and death contradictions.\nAnd then that's why I've sent a formal letter\nto Governor Camp asking him to do what only he can.\nrequest a binding legal opinion from the AG\nthat brings clarity to this crisis.\nAnd I've asked four basic but urgent questions,\nquestions at hospitals, doctors and families\nacross Georgia need answered.\nNumber one, under Georgia law,\nincluding the current abortion statute,\nis a hospital legally required\nto maintain a brain-dead pregnant woman on life support\nin order to continue gestation of the fetus.\nNumber two, what are the precise definitions\nthat constitute a medical emergency under this law.\nNumber three, when the law allows abortion\nin cases where the fetus is incompatible with life,\nwhat conditions actually meet that threshold\nand why hasn't the state made that explicit?\nNumber four, how does this law affect legal standing\nof advanced directives and end-of-life planning\nfor pregnant Georgians?\nThese questions are not theoretical, they're urgent\nbecause as long as this law remains vague,\nWe will continue to see families traumatized,\nproviders criminalized, and patients left behind.\nDoctors are being forced to make impossible choices.\nFamilies are trapped in grief, grief, and fear.\nAnd women are dying, just like Amber Nicole Thurman,\nwho has denied care for over 20 hours\nand died on the operating table.\nJust like Candy Miller, who died after managing\nher own abortion at home because she was too afraid\nto go to the hospital.\nThe governor's own maternal mortality review committee\nhas called these debts preventable.\nIs this the Georgia that we want?\nWe are calling on the governor to do his job.\nRequest a formal opinion from the AG\nand tell the people of Georgia what this law actually means.\nWe're not going to sit quietly while women are used as test\ncases for law.\nNo one will take responsibility for.\nIn the buck stops with the governor,\nhe signed his bill into law.\nNow it's time for him to face the consequences\nof what is doing to real families.\nThis law does harm to Georgians every day,\nand we deserve clarity, we deserve compassion,\nand we deserve better than silence.\nThank you.\nThank you.\nNext, we will have Kasey Muroshak speak,\nand she will share her personal story\nabout how Georgia's abortion law affected her.\nGood morning, and thank you for having me here today.\nMy name is Casey Marishak, and I'm here today not just as a grieving mother, but as a voice\nfor women who have suffered in silence because of the unintended consequences of George's\nabortion laws.\nWhat happened to me is not rare.\nIt is not an outlier.\nIt's happening every day.\nOne in four women experienced a miscarriage, over half of them need medical intervention\nto complete it safely.\nThis is not just a political issue, it's a medical one.\nAnd yet what I went through proved just how dangerous it is when politics interfered\nwith health care.\nme to share my story with you. We lost our baby. We found out on a Thursday morning in March,\njust one day after our gender reveal, that our daughter no longer had a heartbeat,\nbut she had been given a name, so I earned a cold Christian. In a matter of seconds,\nwe went from preparing to welcome her into our lives to try to figure out how to say goodbye.\nMy doctor was sympathetic, but because of the restrictive abortion laws,\nMy care was limited to a list of abortion clinics, no follow-up plan, no guidance, and no support.\nOver the next two days, I called clinic after clinic continuously having to repeat and relive\nthat soil did not have a heartbeat. My insurance recommended me go to the emergency department\nbecause of increasing septic symptoms, so I did. I spent seven hours there in pain,\nand grief and in shock, only to be discharged with no treatment, no resolution, and no care.\nHowever, we did learn I had a condition called placenta previa, meaning that if my body\nhad tried to complete the miscarriage on its own, I could have hemorrhaged.\nI could have lost my ability to have children, and I could have lost my life, and yet still\nnobody helped.\nI was forced to walk around for more than a week carrying soyer who was no longer alive.\nOur healthcare system had no place for my situation because the restrictive abortion\nlaw ties the hands of medical professionals.\nOur daughter had a name.\nShe had a family who prayed for her who loved her before she ever arrived.\nHer feet will never walk this earth.\nHer hands will never dig in the dirt in our backyard, but she left her mark on our hearts.\nAnd now she's giving me the courage to speak to you today.\nMy story is not unique.\nI'm not alone.\nI'm one of many women who have been failed by a system that does not see us, doesn't\nprotect us and does not trust us to make decisions about our own bodies.\nThe government does not belong in women's healthcare.\nIt does not belong in our grief, our decisions, or in our exam rooms.\nThis issue will touch every family in some way someday.\nWhen it does, I hope things are different.\nI hope your daughter, your sister, your niece or your friend is treated with the care,\nrespect, and the urgency that I was denied because I was failed by policies that value\npolitics over people by a system that does not trust women to know their bodies, their\npregnancies, or their pain. I am not here to debate the morality of abortion. I am here\nto speak to the urgent need for clear medical exceptions that protect women in crisis.\nDoctors need legal clarity and the freedom to act quickly when a woman's health is at risk,\nnot after she is on the verge of sepsis. I refuse to stay silent. I refuse to let\nat Sawyer's story and in a hospital hallway\nor an unanswered phone call.\nHer name will not be buried quietly.\nShe mattered and through her I have found my voice\nand I will continue to use it.\nI will keep speaking until change is no longer a plea\nbut as a promise.\nBecause if this can happen to me,\nit can happen to anyone.\nAnd I will not stop until women's healthcare\nbecomes the priority.\nThank you.\nYes.\nWe're not here brought here today for one particular case, but for a multitude of situations\nthat happened throughout Georgia, one of which you just literally heard because of this\ndraconian law that this legislature passed.\nWhat we've learned and frankly both Democratic caucuses understood is that this is what\nhappens when you deprive women of their autonomy and their choices. What these\nsituations tell us is that more women and more Georgia families will endure\nthese uncertainties, pain and suffering. So let's be clear first and foremost we\nneed to give women their autonomy back and repeal HB481. That is always the\ngoal of this caucus and House Democratic Caucus and quite frankly the people of\nGeorgia. As that fight continues, we must stand with Senator Parks and demand\nclarification from our Governor and Attorney General, what rights do women\nhave under this law?\nGeorgians have been asking this question. We as legislators have been asking this\nquestion, and the people standing here today have been asking this question, yet\nGeorgia's leadership has stayed silent. This morning, I stand with everyone here to\nWe announced to tell their attorney general to answer the calls of these women.\nAnswer the call of the families of this state.\nAnswer the call is so deftly needed.\nIt is his responsibility and the governor's responsibility to give us these answers.\nWhether through a formal legal opinion or other means, these answers must come.\nThe women of this state and families of this state demand this.\nAs my duty, as Senate Minority Leader,\nis the duty of the Senate in the House\nto prevent deaths, to prevent suffering,\nto prevent the heart wrenching stories,\none of which you heard today.\nWe say we are here to do the people's business.\nWell, the people need answers.\nIt's time to get to business.\nWith that, I will let our representative\nPark Cannon speak.\nThank you.\nWell, that's it.\nThank you.\nIt's transition.\nI'd like to thank you all for being here\nand particularly thank Casey for sharing her story.\nShe is a powerful speaker who speaks to the impacts of delayed care in Georgia.\nAnd this is a ripple effect that happens across our state.\nMy name is Park Cannon.\nI'm proud to serve as the Secretary of the House Minority Caucus.\nAnd outside of the legislature, I am a full spectrum doula.\nThat means I help people whether they want to be pregnant or not, whether they can sustain\na pregnancy to term or not.\nAnd many times in those decision making moments, it's not about the government and it's not\nabout God, it's about science and medicine.\nAnd today what we're experiencing in Fulton County is a medical travesty and is a concern\nthat all legislators should carry because we see the through line of House Bill 481\nthrough so many different reproductive injustices happening.\nAs the legislator for the area where Grady Hospital is, I want to thank the professionals\nthere for doing above and beyond care, because now they're the only level one trauma center\nin this area.\nSince Wallstar has closed, also within District 58, we have been looking around the state\nto figure out what happens when hospitals close, and what happens when there is medical\nconfusion based on the law.\nAdditionally, with Emery University Hospital Midtown being in District 58, it has been very\nclear that our constituency want to see justice as served.\nThat specifically means that medical professionals are able to do what they need to do and that\ntheir surviving family is able to grieve privately.\nWe ask for the privacy for her family, but we also ask for the repeal of House Bill 481.\nSo if you're here today, I want to transport you back to the day that House Bill 481\nwas passed.\nHere in this chamber, many of us in the legislature clamored and cried.\nWe said there will be vague circumstances that take place because of this law.\nthe law was passed, thankfully based on a number of these organizations here like Sister\nSong and Planned Parenthood and Feminist, we took it all the way to the Georgia Supreme\nCourt and we said this law is vague, not just vague because what happens if somebody is\nin an HOV lane and pregnant and gets pulled over, but because of medical travesties like\nthis one.\nSo today we asked for the legislature to consider a full repeal of House Bill 481, which put\nthis ban into effect and created the vagueness that we see, and to enact the Reproductive\nFreedom Act, which you will hear about.\nThank you very much.\nNext we will have Quodulent Jackson speak.\nShe will be closing out this press conference.\nShe is with the Feminist Center for Reproductive Liberation.\nThank you very much for having me here today.\nMy name is Kwajaland Jackson,\nand I'm the Executive Director of Feminist Center\nfor Reproductive Liberation.\nAnd I first want to offer my sincere condolences\nto all who have lost a loved one to medical mistreatment,\nneglect, denial of care, or obstetric violence\nthat are hurting today, to the families of those whose names we know and to those\nthat we don't know. You are not alone in your grief. We mourn with you. We have\nlong endured a system in this country where the needs of our communities have\nbeen ignored or dismissed. Where our pain and suffering is simultaneously made\ninvisible and made a spectacle for mass consumption. At Feminist Center for\nReproductive Liberation, we not only provide compassionate care that people want\nand need in our clinic, including abortion care, but we also fight in these\nvery halls to demand that care people deserve they're able to access\neverywhere. That means we fight to ensure that people can safely end the\npregnancies that they don't want, and we fight so that people can survive the\npregnancies that they do want. And everything in between, we fight so that OBGYNs,\nmidwives, doulas, promatoras, nurses can practice the compassionate care\nthat they are trained to do without fear obstruction or confusion. We fight so\nthat birth in Georgia can be a joyous occasion that people desire and not a\nfrightening and deadly risk that has it has been true for black women for so\nlong. With the proponents of this dangerous law failed to understand is that\nThe bodily autonomy is life, self-determination is life, compassionate care is life, allowing\nclinicians to act in the best interest of their patients is life, reproductive liberation\nis life.\nWe are fighting for our lives, and we are fighting for the lives of those who oppose us as well.\nIf you want to save lives, you will repeal this inhumane ban.\nThank you.\nGood.\nThanks so much.\nThat is the end of our press conference.\nIf you have questions, we are open to answering.\nI mean we're concerned with the fact that this law is mandating care with\nmedical consent. A woman should consent to medical care, and if they can't, their next\nto kin should consent to medical care. And at the end of the day, if this situation,\nthis family should have had the ability to have a conversation and not have this mandated\non them. And if this were to happen ever again, we want our families, we want women to\nbe able to have bodily autonomy and make their decisions for themselves, and that decision\nshould be between their doctor and them.\nAll we're saying is that with this being a second case like this that's ever really\ntaken place in our country, when we look at the similarities between the medical circumstances\nAnd we see there's a time ticking right now.\nAnd so many of us are curious as to what is the next course\nof action for these medical professionals,\nwhich is why we're gathered here today to say time is taking.\nWe need to figure out how this law impacts care.\nAny more questions?\nThank you very much.\n",
  "updated_at": "2026-02-12T18:49:21.438783+00:00"
}