{
  "video_id": "wFpyRsuUe6s",
  "url": "https://youtu.be/wFpyRsuUe6s?t=998",
  "title": "Georgia House - Day 31 (2026-03-07)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 31,
  "video_date": "2026-03-07",
  "duration_minutes": 128,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured discussions on the importance of empathy and compassion towards all people, regardless of their background or circumstances. The transcript focused on a speech by Pastor Travis Rutland highlighting the parable of the Good Samaritan and the need to see others as neighbors, not just scenery or machinery.\n\n## Key Actions\nNo major legislative actions were recorded in the transcript provided.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Pastor Travis Rutland delivered a speech on the importance of seeing all people as neighbors, not just scenery or machinery, using the parable of the Good Samaritan as an example.\n- Rutland spoke about his childhood experiences of praying for the governor and state legislators while growing up.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nNo specific quorum or attendance details were provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Travis serves as the president of Global Servants. Global Servants is an international nonprofit missions and ministry organization. Global Servants currently has a work in six countries and two continents. He is a native of Georgia. He holds a bachelor's degree and a master's degree from southeastern university. Travis and his wife Courtney have been married since 1997 and they have three sons, Mark Owen and Liam. And our fathers have been friends for a long time and I've known Travis and known Travis's family for many years now and had the great fortune to have him come to Carter'sville to Liberty Square and so we're so blessed to have him. And I'm glad that he was able to come today. So would y'all welcome Pastor Travis Rutland. Thank you. Thank you. Thank you. Thank you. Thank you. Good day. Thank you. Welcome morning. I'm honored and thrilled to be here with you today. I appreciate Matthew's introduction. That was so kind of him. I want to say a special thank you to Speaker Burns for the invitation that is humbling and I'm honored to be here today. When I was a little boy growing up, my dad was actually friends with Governor Joe Frank Harris. And so I remember every time that we drove into Atlanta when we would drive by the Capitol, my dad would always say, we have to pray for the governor. So I grew up as a little boy praying for the folks inside these buildings and I'm honored and excited to be back with you or be here with you today to give you a little thought and to pray over all of you. So I appreciate everything that you do. I'm a proud native of Georgia. As Matthew said, I was born in Atlanta, grew up in Conjures for the most part and I'm thrilled to be here this morning. So I just wanted to give you a quick thought and I want to be mindful of my time. How do we deal with the world around us? How do we relate to the people that we encounter on a regular basis? Following World War II, there was a Polish anthropologist named Alicia Ivanska and she immigrated to the United States following World War II and she began to travel and work at universities write articles in books. I read an interesting article about her. In 1957, she traveled to the Midwest of America to interview farmers for a book that she was writing. And in the process of interviewing these farmers, she said that all of these farmers had broken down their world view into three main categories. That the farmers saw the world around them through the prism of scenery, machinery, and people. So the mountains in the distance, the trees, all those kinds of things, they were this scenery that they took for granted. The tractors, the plows, the tools that they used to farm were machinery and then people were people. And so I was reading that article and it was reminded me of an encounter that Jesus had in his ministry. I won't read the verses, but it's found in the Gospel of Luke in chapter 10. And in that, a man approaches Jesus and he talks to Jesus about how can he inherit eternal life. And Jesus says to man, well, what do you think? And the man says, well, I believe that if you love the Lord your God with all your heart, your mind, and soul and you love your neighbor as yourself. And Jesus says, that's it, that's exactly it. Do that and you'll inherit eternal life. And the man says to Jesus a very intriguing question. He says to him, yes, but who is my neighbor? My feeling is that the man was trying to compartmentalize his life a little bit. He was trying to figure out who did he have to treat as his neighbor. He says to Jesus, yes, but who is my neighbor? And Jesus, as he so often does, does not answer the question. He instead tells a story. And the story that he tells is probably one of the most famous stories that Jesus told us what we know as the parable of the Good Samaritan. In the parable of the Good Samaritan, a man is traveling from Jerusalem to Jericho. He's attacked by thieves, he's beaten, robbed, and left for dead on the side of the road. A priest walks by, sees the man and continues on his way. A Levite walks by and sees the man and continues on his way. And then Jesus tells us in the story that a Samaritan sees the man and stops and helps him bandages his wounds, puts the man on his animal, and takes him to an inn or a hotel for lack of a better word. Takes him to an inn and gives him to an innkeeper and says, take care of this man and I'm going to come back and get him. In that story, Jesus is giving us insight into how we relate to others. For most of us, most of the time, the people that we see are nothing more than scenery. The folks in the restaurants dining next to us, the people walking through parking lots, the homeless guys that we see at the stoplight, they are nothing more than the scenery. They are extras in the movie starring us. In the same way that Tom Cruise doesn't hang out with extras on his movie set, we don't either. This is the Travis Rutland movie and I'm not interested in hanging out with the scenery, with the extras. But the fact of the matter is, they are not mountains far in the distance. They are real people with real needs and real problems. Now, I know what you're saying to yourself, do I have to help every person that I walk through past in the parking lot? I'm not suggesting that. What I am saying is that we have become conditioned, like the priest and the Levite, to ignore the suffering of the people around us. They both saw the man lying by the side of the road, and they said to themselves, he is nothing more than scenery, and they continued on their way. But the world around us has real needs and real problems. Now, pivot away from the crowds, and instead deal with the people that we look at and interact with on a more regular basis. The waitress at the restaurant, the checkout girl at the grocery store. If you can find a grocery store that still has a checkout person, usually we have to do it ourselves now, but you have to check out girl, waitress, teacher, pastor, politicians, all of these, we interact with these people. And the problem is we begin to see them as the farmers that Alicia Ivanska interviewed. We begin to see them as nothing more than machinery. They are machines that are designed to make, what are machines designed to do? Make our lives easier. So what we begin to do is see them, not as people, but as simply a cog in the machine that makes my life simpler. So we're standing at the Walmart and the girl that's checking us out scans the same item three times. She gets our change wrong. She puts the bread in the bottom of the bag and it gets crushed. And we say to herself, she's such an idiot. What's wrong with this girl? But the thing is, maybe she's not an idiot at all. Maybe her mother is dying. And when she gets off work, she's gonna go to an assisted living facility and hold her mom's hand as she passes away. But see, we have no concept of that because that girl is not a person to us. She is simply a cog in the machine that makes our life easier. We cannot see people as simply scenery and machinery. So what is the solution? Jesus gives us the solution as the story ends. The story ends and Jesus says to the man, who was the man who was robbed, who was a neighbor to him. And the man responds and he says, the one who showed him mercy. And Jesus says, go and do likewise. Do you see that? So many of us want to shrink who we think of is our neighbor. We want to shrink it as the man, who's my neighbor? Jesus expands our understanding of who our neighbor is. We want to say it's just the people who believe what I believe. It's just the people who think like I do. It's just the people who vote like I do. But that is not what Jesus is saying to us. Jesus is saying expand your worldview. The whole world out there, that is your neighbor. Go and do likewise. That's what I would encourage everybody here in this house and anywhere that's watching online or anything else. The people around us are not scenery and they are not machinery. They are real people with real needs and real problems. And we are called to show them love, mercy, and forgiveness. Jesus, we say to Jesus, who is our neighbor? Jesus says, the whole world is, go and do likewise. If you will, stand with me and join me in prayer. God, we come to you right now. I thank you for every man and woman in this chamber. I ask that you would bless them, that you would give them wisdom and your guidance. They are making important decisions that affect the people of Georgia and I ask that you would be with them, that you would guide them and direct them, give them your wisdom, your knowledge on all things. I intercede for them, I ask that you bless them. You bless their families. Everything that they put their hand towards that you would bless. Be with them, guide and direct them. We thank you for all your many blessings. In Jesus, powerful name we pray. Amen and amen. Amen. All right. I pledge glad that the allegiance to the flag of the United States of America and to the Republic. Thank you, brother Travis, for that message. Doorkeepers, you may unlock the doors. Members, you may join brothers.\n\nTravis out in the south any room and thank him for his message today and have a photo. Members our Doctor of the Day today is brought to us by the invitation of Chair Lady Katie Dempsey, his Dr. John Cowan, Dr. John Cowan, we're glad to have him and if you get a chance say hello to him and thank him for his service for being with us. Members we can get your attention. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits, Chairman Tarvan. Mr. Speaker your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct and today is day 31 and you know we have a we need to stay alert and we have a hands-free non-destructive driving law in Georgia so here's a little symbolism. Stay alert. Life is one big highway with a lot of signs, crossroads and forks. Stay alert. Stay alert. Thank you Mr. Chairman. Chairman Tarvan, the Chair of the Committee on Information and Audits report that the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair here's none the reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair here's none and the journal is confirmed. Mr. Clerk will you read the resolution establishing the order of business for the day. Reps and administration of the 100th Moose filing be established as the order of business to the first part of the period unanimous concerns. Introduction bills and resolutions, first reading and reference files, bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair here's none and the resolution is adopted. First reading of bills and resolutions the clerk will read. House bill 1449 by reps of Collins, the 71st Smith of the 18th Hullston of the 72nd Smith and the 70th of the bill being taught on act to men and act to provide a new charter for the city of Bill Ericka. The intradublmental coordination house bill 1450 by reps of Holly the 116 Douglas the 78th, Mithiaq the 74th, Crow of the 118th Lewis Ward of the 115th and others, the bill be taught on act to men and act creating the Henry County Airport Authority. Intergovernmental coordination. House bill 1451 by reps of Franklin and the 160th of the bill be taught on act to provide a new charter for the city of Brooklyn. Intergovernmental coordination house bill 1452 by reps of Gaines, the 120th of the bill be taught on act to men, Code Section 22152 of the official go to Georgia and it's a related and special education services. Education House bill 1453 by reps of Corp. 174th Canyon, the 172nd Perkle 169th, bill be taught on act to men, part one of Article 2, Chapter 8 and Title 12 of the official go to Georgia and it's a related and general provisions regarding solid waste management. Natural resources and environment. House bill 1454 by reps of Jones, the 60th Bruce, the 61st Evans, the 57th Pantitch, the 51st Roberts, the 52nd and others, bill be taught on act to men and act creating the board of commissioners of Fulton County. Intergovernmental coordination house bill 1455 by reps of St. of the 180th of the bill be taught on act to provide a home state exemption from the city of St. Mary's ad ballarm taxes. Intergovernmental coordination house resolution 1333 by reps of Mathis of the 149th. Resolution recognizing Mr. Jerry Van Dykes and dedicating a bridge in his honor. Transportation House resolution 1334 by reps of Bonner, the 73rd, Mithiac, the 74th, Baysmore, the 69th Clark, the 100th Canyon, the 172nd. Resolution honoring the life of Colonel Benjamin Stutterd Malcolm and dedicating a bridge in his memory. Transportation House resolution 1335 by resident of Cameron in the 1st and Tarvern in the 2nd. Resolution honoring the life of Mr. James Cameron Sprogans and dedicating a bridge in his memory. Transportation House resolution 1336 by reps of Jackson, the 165th Stevens, the 164th Westbrook, the 163rd, Gillier, the 162nd, Petrie, the 166th and others. Resolution honoring the life of representative Edward Mickey Stevens and dedicating an interchange in his memory. The intergovernmental coordination. That completes First Readers. Second reading of bills and resolutions the clerk will read. House bill 1441 by reps of the 178th, Park Kaiser, the 157th, the bill to provide a home site exemption from Appling County School District, Edelhorn, Taxes for Educational Purposes. House bill 1442 by reps of Deloge, the 167th, the bill to authorize the city of Darian, to exercise all redevelopment and other powers under the redevelopment powers law. House bill 1443 by reps of Holland, the 54th, the episode of the 57th, Celcux of the 53rd, episode 89th, Bruce of the 61st and others. It builds to provide for operation of automatic transit lane, vehicle lane monitoring devices for the enforcement traffic and transit vehicle lanes in the city of Atlanta. House bill 1444 by reps of Scotted 76, Neil of 79, Douglas of the 78th, per now of the 77th, the Battle of the 75th. A bill to amend and act creating the Clayton County Board of Commissioners, House bill 1445 by reps of Taylor of the 173rd. A bill to amend and act to provide a new charter for the city of Thomasville. House bill 1446 by reps of Persinger of the 119th, Eftration of the 104th, Gaines of the 120th. A bill to amend and act recreating and establishing a Board of Commissioners of Barrow County. House bill 1447 by reps of Persinger of the 119th, Gaines of the 120th, Eftration of the 104th. A bill to provide a new charter for the city of Statham, Georgia. House bill 1448 by reps of Mathis of the 149th, the bill to create Board of Elections of Registration for Dodge County. House resolution 1325 by reps of Jasper's of the 11th, the resolution recognizing Mr. Jeff Downing and dedicating an intersection in his honor. House resolution 1326 by reps of the Maynard of the 156, Williams of the 168th, McLean of the 109th, Mitchell of the 88th, Gale of the 160th, and others. Resolution honoring, Mr. Maseo A Brown, dedicating an intersection in his memory. House resolution 1327 by reps of the Maynard of the 56, Williams of the 168th, McLean of the 109th, Mitchell of the 88th, Gale of the 160th, and others. Resolution honoring, Mrs. Carolyn Liseal, Long Banks, and dedicating an intersection in her memory. House resolution 1328 by reps of the 119th, Gaines of the 120th, Restoration of the 104th. Resolution honoring, the life of Mr. Douglas, Doug H. Garrison, and dedicating an intersection in his memory. House resolution 1332 by reps of the Mathis of the 149. Resolution recognizing, Mr. Richard Rickey, Alan Dykes, and dedicating an intersection in his honor. Senate Bill 531 by Senator Jackson of the 41st Butler, the 55th parent of the 42nd Anderson of the 43rd, a bill to amend and act to create and establish into Cab County, districts from which members of the county board of education of Cab County shall be elected. Senate Bill 558 by Senator Harold of the 40th, a bill to amend and act creating a new charter for the City of Doraville, Senate Bill 560 by Senator Harold of the 40th, a bill to amend and act creating a new charter for the City of Doraville. Senate Bill 562 by Senator Jackson of the 41st Butler, the 55th parent of the 42nd, Davenport of the 44th, Anderson of the 43rd and others have billed to amend and act to provide a new charter for the City of Pine Lake, through 2nd Raiders. Members, the Chair actually assigned a committee to a, I assigned a bill, House, excuse me, House Resolution 1336, a few minutes ago honoring the life of Representative Mickey Stevens, a former member of this House to Intergovernmental Coordination. The proper committee should be transferred, transportation, Mr. Clerk, if you will make that change, I would appreciate it. The report of standing committees, the clerk will read, Representative Josh Bonner, the 73rd District Chairman of the Committee on Defense and Veteran Affairs submitted the following report. Mr. Speaker, your committee on defense and Veteran Affairs has added an irid consideration following bills of the senators instructing me to report the same back to the House of the Following Recommendation, Senate Bill 398, due pass, respectfully submitted Representative Josh Bonner, the 73rd District Chairman. Representative Bill Workhizer, the 157th District Chairman of the Committee on Industry and Labor submitted the following report. The Speaker, your committee on industry and labor has added an irid consideration following bill of the senators instructing me to report the same back to the House of Following Recommendations, Senate Bill 384, due pass, respectfully submitted Representative Bill Workhizer of the 157th District Chairman. Representative Medi Lumsen, the 12th District Chairman on Committee on Insurance submitted the following report. Mr. Speaker, your committee on Intergovernance has added an irid consideration following bill of the senators instructing me to report the same back to the House of Following Recommendation, Senate Bill 307, due pass, respectfully submitted Representative Medi Lumsen in the 12th District Chairman. Representative Beth Camp of the 135th District Chairman of the Committee on Intergovernmental Court Nation Locals submitted the following report. Mr. Speaker, your committee on intergovernmental court nation locals has added an irid consideration following bills of the House and the Senate. As the struck committee report the same back to the House of Following Recommendations, House Bill 1374, due pass, House Bill 1427, due pass, House Bill 1436, due pass, House Bill 1438, due pass, Senate Bill 504, due pass, House Bill 1413, due pass, by substitute, House Bill 1422, due pass, House Bill 1423, due pass, respectfully submitted Representative Beth Camp of the 135th District Chairman. That completes the reading of the reports and standing committees. Members, we do have a local calendar this morning. We have a local calendar, and it does have a couple of bills that require a two-thirds vote. In fact, there are three of them on the local calendar relate to homestead exemption and do require that recorded two-thirds roll call vote for passage. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered. Mr. Clerk, will you read the local calendar? House Bill 1374, by the Rev. Campbell, 35th City of Act Worth, House Bill 1427, by Rev. Stinson, of 150th Doolie County, House Bill 1436, by Rev. New Year to the 150th Lee County, House Bill 1438, by Rev. Williams, the 140th City of Cordale, Senate Bill 504, by Senator Burns, the 23rd Warren County, House Bill 1413, by substitute, by Rev. Rose, the 124th Putnam County, House Bill 1422, by Rev. Stinson, of way to the 9th Dauston County, House Bill 1423, by Rev. Stinson, of way to the 9th Dauston County. Is there any objection to the previous question being ordered on the local calendar? Chair, here's none. The previous question is ordered. Is there any objection to agree into the report of the committee, which was favorable to the passage of the bills? The chair here is done. The report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote yes, all those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? All members voted if so. The clerk will lock the machine. On the passage of the local calendar, the yeas are 158, the nays are zero. These bills haven't received the requisite constitutional majority or therefore passed. Members, we have some important recognitions this morning. We have a lot of good folks who's traveled great distances to be with us. So I would ask the members of this House to give them your attention as they are recognized by our members in the well. Members, we have a whole slew of morning orders. You will have one minute to have your say. Watch the lights. We will begin our morning order with Chairman Jasper's. Is that Whitbert? Who is that coming with you? Some of your friends? We have some friends of yours. We'll let them join you. Those that need to join Chairman Jasper's. He does have friends. I know you were surprised too. Well, I'm glad to know that, Mr. Speaker. But I'm glad to get started with our recognitions this morning to recognize a very special group of folks who are here that make a tremendous economic impact across our state. And that's our airports. And they'll stand up as I talk about them. They're from your communities. Let's give them a hand and welcome them. You know, there's 95 general aviation airports, eight commercial 103. You know the impact they make in your community. And I hope you join me and welcome you guys here. Go buy and see your representatives. They look forward to visiting you. Find out. Big part of our states, states, health and well-being is our airports. Thank you for what you do. We appreciate you being here. Representing Pedro Marin is recognized for a morning order. Thank you, Mr. Speaker. Today I rise to congratulate a group of proud Georgians, residents that have representative you all just spend just for a minute. Thank you. Today I rise to congratulate a proud group of Georgian residents that have taken upon themselves to establish a musical group named Apu Inca. Apu Inca celebrates 15 years of on in on in temper. History promoting Peruvian Latin American and work culture with its particular and the end instruments. Apu Inca has played in several countries, including Japan, China, Russia, India, Saudi Arabia, Spain, Germany, Italy, among others. So today I have them at the gallery. Would you please stand and be recognized the group of Apu Inca? Thank you for your work. Thank you, Mr. Speaker. Thank you, Representative. Beautiful music. Good to have you all. Representative Anola Witt says recognize for a morning order. Thank you, Mr. Speaker. It is my pleasure today to welcome to the Capitol and to recognize the Boy Scouts of Troop 1. They are celebrating their centennial year. This year they were founded in 1924 at the log cabin church in Vynings. They have they're a scrappy bunch. They are an active bunch. They do high adventure. They are at bird atoms. They're at Camp Woodruff. They are throughout the community. And I'm particularly fond of them because this is the troop through which my son earned the rank of Eagle for himself. But this is again troop one hundredth anniversary. Their centennial is one of the oldest active scouting groups in Georgia. And it is part of the silver comet district of the Atlanta area council of the Boy Scouts of America. And we welcome you here today to the people's house. They're right there in the middle. Thank you. Troop 1. That's pretty impressive. I see they're scrappy. One of them has a broken arm up there. Has a cast on his arm. Welcome to the people's house. Representing Bernal is recognized for a morning order. Thank you, Mr. Speaker. Today we are celebrating six women in radio. We want to thank the founder of celebrating women in radio, Deheal, for honoring some of the most influential voices in the broadcast industry. Marie Boyntine V103, Lisa Nicholas, WSB radio and formally CNN, River Blue, Midday Jazz, Sharon CWALK, AM, Miss Shanica, streets, 94.5, and Wondeland Stokes, 1380. Ladies, would you please stand so you can be recognized? Thank you, Mr. Speaker. I yield the well. Welcome to the people's house. Representative Davis and Chairman Newton, you're recognized. Representative Koye, Representative Koye, you're next. Thank you, Mr. Speaker. Good morning, esteemed colleagues and honored guests. We gather here at the Capitol to celebrate nurses day. A time to express our deepest gratitude and appreciation for the invaluable contribution of nurses to our communities, our healthcare system, and our nation as a whole. I want to take this opportunity to highlight the true spirit of nursing, nurses commitment to excellence, and their empathy towards patients. Please join me in extending the heartfelt thanks and admiration to all nurses. Together, let us support and uplift the nursing profession, ensuring that nurses receive recognition and respect they truly deserve. I want to recognize the GNA president, Dr. Erica Miles, and as nurses, to please stand and be recognized. Thank you and I yield the rail. Representative Gabe O'Koye, and oh, he's singular. Representative. Thank you, Mr. Speaker. Man is going to be short. Man is going to be short. He always sits back there quietly, but he makes sure that the speaker is safe. That is the guy who maintains security for our speaker. And his name is Chris Choi, and there are two other ones, Trooper, Josh, Jennifer, and Trooper, David, Crilling. Please, let's recognize him. Thank you. They have a tough job, I guarantee you that, but they do a great job of it. Thanks, gentlemen. River State, doing McLean, recognize for a morning order. Thank you, Mr. Speaker. You know, it's always good to have some of your former colleagues in the house. And today I have one, I have Tyrone Poo. Tyrone is a local. He grew up in the grain when the Fort Valley State University, and I know Tyrone is in the audience or Tyrone. Can we welcome you to the house? There's Tyrone. Tyrone is not, he's a entrepreneur. He gives back, and if you ever watch a 1080, he's still a good shape. Thank you, Mr. Speaker. Awesome. Good to have you, Tyrone. Appreciate you. Thank you for being Representative McLean's friend. I am too. Representative Ramon is recognized for a morning order. And friends. Good morning, colleagues. Today is Muslim Advocacy Day at the Capitol. It ends at 11 a.m. Not 11 p.m. Apologies for the typo. Today we have here the George and Muslim voter project, Iman at Lanna and Cara Georgia. So please give them a round of applause. There are some on the side, some up there. So thank you all so much for being here. They'll be at the ropes, too. Thank you. Representative Scofield, you're recognized for a morning order. Thank you, Mr. Speaker. Colleagues, I am proud to recognize 40 years of service and leadership of the executives of the Georgia chapter of the National Organization of Black Law Enforcement Executives known as Nobel. Their work in law enforcement and commitments to communities across Georgia is a measurable. Oh, how we love to thank our law enforcement public servants. Noble executives, please stand. They're in the gallery, colleagues. Let's thank GBI and Noble executives that have come here, the National President and all of our chapters. Thank you for being here. We love you. Thank you, Mrs. Bicca. Yield the well. Thank you, Representative. Come down to the Annie Roman. Take a picture with us. Come down to the third floor as you welcome you to the Any Room for a photo. Thank you all for being here. Leader, have Stration is recognized for a morning order. Thank you, Miss Speaker. Gentlemen, we'll suspend just a moment. This is a special morning order. Members, if you'll give the gentleman in the well, your attention. We have a further recognition of a fine group of folks who are here with us today. Mr. Leader. Thank you, Miss Speaker, to add to Representative Enola Woods remarks. Today is Scouts Day at the Capitol where Scouts from all over our state come to see us work here at the state Capitol. I know in my life as a member of Tru 568 in Gwinnett County where I attain the rank of Eagle Scout. My son currently is in a Cub Scout packing Gwinnett County to see the great work that Scouts does. It's the Scouting is the top organization for character development and value-based leadership training in the United States. If you see the Scouts around the Capitol, please say hello. And if they're Scouts in our gallery, if you'll please rise to the weekend recognize you. Thank you, Miss Speaker. Thank you Scouts for being here. You all have a nice crowd here today. Thanks for being here. We appreciate what the Boy Scouts stand for. You develop great leaders. Thank you for what you do. The program of this house, Representative Jan Jones has a morning order and I hope she does have some friends with her as well that know a little bit about education, I'd say. We're good to do joining members. I am delighted to be here along with members of the Pre-K Working Group that Speaker Burns appointed to give you a preview of the 2024 Georgia Pre-K Week, which this year will be held October 7th through 11th and I encourage every one of you.\n\nto go read in one of the pre-K classrooms in your district. 70% of legislators participated in the past, and it's a great opportunity to see the hands of Georgia State government helping our youngest learners. And I just thought I'd mention in 1992, when Governor Zell Miller launched a pilot program, there were only 754 year olds. 32 years later, we have 73,000 children this year in Georgia pre-K. Georgia is one of only nine states to serve more than half of the states four year olds. Will you help me welcome and recognize the few members who are here. First, we have Callie, the decal mascot up at the top. Yeah. And we have Callie McKinney from Voices, Liz Young, Devon Porter, Jerry Brown, and our commissioner, Amy Jacobs from decal. Thank you for being here. Thank you for the work you do. We have Chris Broadman, Broadman from the President of Junior League of Atlanta. And we have one of our Georgia pre-K teachers of the year. Thank you for being here, and thank you for what you do for Georgia's youngest learners. Thank you. Thank you, Madam Proteum. Thanks to that working group. You'll work with a summer wheel to make a difference. Thank you to all of you involved in pre-K. Thank you, Callie. I like the two pink ribbons on your ears. It looks good. Good to have y'all. Thank you for what you're doing. Representative Reese, Representative Buckner, Representative Higley, and Representative Sains, recognize for a morning order. Thank you, Mr. Speaker. Mr. Speaker on this morning, as we welcome nurses from around the state of Georgia here to the people's capital, we would like to acknowledge some very special students that we have from Columbus State University. One of the best and brightest nursing programs that we have in the state of Georgia. If the Columbus State University crew will please stand and say hello. Thank you. Thank you, Mr. Speaker. Thank you, Tarrant. Our nurses, right? Thanks for doing that delegation. We appreciate y'all. Thanks for being here. Thanks for the profession and professional nurses. Members of our can have your attention. That completes our morning orders. We have a very special invite resolution. I know this is your first rodeo there, chair lady. I want you up here. Members, this is a special group of folks that protect us all as Georgians, our property. But there's also something now we call the urban interface. I think it's at that right. That is that barrier between where we all now live, many of us live, that's adjacent to the forest of this state. This group of dedicated individuals make a tremendous effort to protect that forest, but more importantly protect us as citizens. So thank you for that. Before we do this, have this resolution, Mr. Director. So at this time, Mr. Clerk, will you read a resolution to capture? House resolution 1345 by Ruppsen, House of the 170th and Jackson of the 128th. A resolution, recognizing and commending the Duffy Warren County Unit on being named the Georgia Forestry Commission 2023, North Georgia Unit of the Year, the Barrier County Unit on being named the 2023 South Georgia Unit of the Year, Forest Protection Area 9 being named the 2023 Forest Protection Area of the Year, and Jason McMullan on being named the 2023 Forester of the Year. Thank you, Mr. Clerk. We will now recognize Chair Lady Penny Hausten to speak to the resolution. Thank you, Mr. Speaker. It is an honor for me to be here today to recognize two units and a person who's done so much for the state to protect you. Of course, it's really special since one of these people I'm recognizing they're from Barrier County where I'm from, so it makes it even more special because they really protect all of us. And it's like a wise man that sits on the front, represents him, James Persia told me that when a fire comes, these men run toward the fire, not away from the fire like we do. And we do appreciate that because they do protect us and protect our forest land. And as you probably know, Georgia is one of the global leaders in timber in this country. And also, I was surprised to learn that 22,000 acres are privately owned timber land are in our state. And these men protect all of it. And we just want to show appreciation and honor them. And first of all, there's another county representative, Jackson, represents MacDuffy and Warren County. And MacDuffy and Warren County's unit was named the Georgia Forestry Commission, 2023 Georgia Unit of the Year. And also was named for the Georgia, South Georgia Unit of the Year was the Barrier County Fire Department. And the 2023 Forest Protection Area of the Year was also named. And that was Area Number 9 of which Mayor and County is a member and so is Camilla. And I thought I'd point that out to you. And also, I would like to tell you that we have James McMullen here. And he's been named the 2023 Forestry of the Year. And they protect us, they protect our forestry. And these people would name this because of their leadership and their dedication to protect people in forest lands. And I want to say thank you. And if you get a chance, please come speak with them. And I'd like to ask our Forest Commission Tim Lottermell to come say a few words. Thank you, Madam Chair. Thank you, Mr. Speaker. It is a tremendous pleasure to be here. And I'll be brief. I know you've got a lot on your calendar and on your schedule today. I do want to acknowledge that we've got some of our other great employees up in the balcony there. I'd like for them to stay in and make them give them and our folks up here on the podium around the applause. If you will, Mr. Speaker, I would just take a brief moment to say many of you in this house recognize and know that my experience came from the private sector. I've been the Director of had the opportunity to serve underneath Governor Kim. The pleasure to serve him as the Director for the Georgia Forestry Commission now for three years. And one of the lessons, and I think it's pertinent to the day, one of the lessons that I have learned coming from the private sector and getting the work with these great men and women at the Georgia Forestry Commission is just their willingness to serve. Their willingness to serve in communities where they live, their willingness to serve in communities that need their help. Just this past year, the Barian County Office and the Area 9 responded to the hurricane that came through Valdosta. We are generally one of the first on the ground with chainsaws, clearing roads for power companies and for them to get back into restore power. The other thing that makes me really proud and I want to point out to this body is that when we have time here slow and we don't have an active fire season, our state is known around the country to have some of the best and brightest to pick up, get away from their families, leave their communities and go serve other places like Texas, California. Any state where there may be a wildfire, we're some of the first to show up. Right now we have five in Oklahoma and we have one serving on an overhead team in Texas, putting out wildfires. I often get asked, why don't we have major wildfires here in Georgia? I think there's several reasons and I'll be brief. A lot of it is that our properties here in Georgia, 91% of our forest, that 22 million acres, is owned by private forest landowners. Our agency recognizes that, they understand that's an investment account, that's a child's college education account, that's a wedding, that's a retirement account for a landowner, for forest landowner. And we don't have fires in Georgia because we take responding and putting fires out serious in our state. Our average response time to a wildfire is 24 minutes. Our wildfire size in our state is five acres. I would put that up against any other state in the union. So thank you for taking the time to recognize these young men and women and for the work they do. I can promise you they're servants for our state and they get up every day and go to work for you hard and do their job with great pride and great honor. So thank you for recognizing us. And thank you so much for the job you're doing. And the changes you brought to our area. Thank you. Thank you. Appreciate you. I'm away my glasses. Sam, let's go. Mr. Director, I just want to add to your comment from the standpoint of how important our forest are to our quality of life. Sustainable, renewable, environmentally friendly. We can't do without our trees. And we appreciate all the work the men and women of the Georgia Forest Commission do to protect our trees but more importantly protect our citizens. Y'all standing to get farce and we appreciate it. And I will say one more thing. Chairman of Appropriations, do we not stand with the Georgia, does not this house stand with the Georgia Forest Commission supporting them and doing our part to help them sustain their mission? Would I not be correct? Absolutely. We'll talk about that a little bit later today. Thank you members. You Members, we will move on to the rules calendar. We will move on to the rules calendar. Mr. Clerk, will you read the caption to Senate Bill 377377? Senate Bill 377, my Senate artillery, the 19th perpetrator, the 32nd burns the 23rd and others. The title of the act to amend titles 15 and 49 in the fiscal year. The Georgia Anitetti relating to courts and social services respectively shows to provide for the licensing of qualified residential treatment programs. This bill had been referred to the committee on public and community health. That committee recommends that this bill do pass. The doorkeeper is a few monitor, monitor these doors a little closer for me. Members, don't block the doors, they need to be open or closed, but not open on a permanent basis. Members will please come into the chamber and take your seats, and give the lady who is getting ready to present Senate Bill 377 your attention. Chair Lady Katie Dimpsey has recognized to present the bill. Thank you, Mr. Speaker. This is truly a simple but very important bill for our Georgia SB 377. Actually will help amend titles that need to be in a compliance with the federal requirements. Certain funds under Title IV E, the federal code, require that we do this licensing for DHS and clean up the definition to make us eligible for more federal money that can help child welfare services. It has a very positive budgetary impact. So it will define and clarify that a qualified residential treatment program, QRTP, is a type of child caring institution that can be licensed by the Department of Human Services. This is actually a great collaboration between DCH and DHS which both brought this bill and support to help us meet these demands and continue to take care of Georgia's most important services. The most needy children, trauma-informed care, to children with serious emotional and behavioral health disorders. This will be another place not permanent but for them to temporarily reside and get better. Mr. Speaker, if there are any questions I will take them. If not, I will yield the well. The lady has a question to your left. Representative Kinnerd has a question. Yes, do you yield? Yes. What is the age range that these particular centers are serving? I'm going to tell you that I don't have that in front of me but I will go find out real quickly and try to get in front of me. But it is for our minor children. It's for some of the children that have been so hard to place. It will be the best care that they can receive. It is not a mandate. You don't have to do this but it will help greatly. Okay, I'll come see you. Thank you. Thank you. The lady has no further questions. Thank you, Mr. Speaker. I ask for your favorable support to help Georgia's children. Is there any objection to the previous question being ordered? Chair, here's done the previous question is ordered. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no and the clerk will unlock the machine. All members voted. All members vote. All members voted. All members voted I believe. If so, the clerk will lock the machine on the passage of Senate bill. Almost did that. Senate bill 377. The yeas are 168. The nays are zero. This bill, having received the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption of Senate bill 352? 352? Senate bill 352 by Senator Anderson. The 24th albors, the 56th Roberts, the 29th and others to be entitled to amend part one of Article 8 of Title 40. The official go to Georgia annotated relating the general provisions relative to motor vehicles, equipment and inspection. So it's required for standards for the alteration and operation of motor vehicles with modified suspension systems. This bill, I'm referring to the committee on motor vehicles. That committee recommends the disbilled do pass by committee substitute. Representative John Carson is recognized to present the bill. Mr. Chairman. Thank you, Mr. Speaker. I'd like to present before the House Senate bill 352. What this does, folks, is it does to make things. You can take a look at the screens of what is known in some localities as the Carolina squat. I can't say I have a lot of these in my district, but I was asked to carry this bill. But basically what the squat does is it basically lowers the back end or some raise a lower the front end substantially. And it's a public safety hazard if you talk to local law enforcement, state law enforcement. So the first thing this does in lines 48 through 52 is to eliminate what is known as the Carolina squat. As you can imagine, if you're going down the highway and your back end is lowered, your head lights are not on the ground. And you don't really have as good as eyes in front of you on the road in front of you. The second thing this does is removes arbitrary language in lines 17 and 20 in regard to factory recommendations of suspension. Those are not disclosed by Ford or GM or Toyota or Nissan. So we're removing that language going to amount of height between the ground and the frame in addition to prohibiting the Carolina squat. And that's really all the bill does, Mr. Speaker. I'm happy to take a question. If there's no questions, I will be happy to yield the wealth. I think you have a technical question to your left. Yes, sir, I will. This gentleman may want to know how you accomplish that raising and lowering. Chairman Parsons is recognized for our question. Thanks, Speaker. Gentlemen, yield. Yes, sir. I will to my friend. Isn't true. I do not really have a technical question. I don't think. But I have not rid the bill. And I have to admit that I'm kind of surprised that we have this bill. I'm not sure. I'm in agreement with the bill, I believe. But my question is, is this Carolina squat? Is there some definition of, I mean, just to see the picture is one thing, but I've never seen a truck like that. Is there actually a definition of what the Carolina squat actually is? Well, in legal terms, no. But basically, if you can take a look at line 51, it basically, the bill allows owner of a car in a vehicle in the car. And then, in general, it's one vehicle in Georgia to adjust the suspension front or rear by at most four inches. But no more than that. Is there a technical definition? No, I've heard from the whip that there's another colloquialism for the Alabama slumber or something like that. I do not have a legal definition, but you can see clearly what effect that would have on public safety, not having the headlights or the driver's eyes on the road. Further to you? Yes, sir. Well, isn't it true that I applaud you and the author of the bill for bringing it forward? I agree with it. Is that not true? I just am kind of surprised that we're putting it into code that we would certain elevations of a frame off the vehicle, off the frame, would be in a law that, anyway, I appreciate bringing it. I understand that. To my Cobb County friend, it already is in code in 40.8.6. We're removing a secondary reference in another code section. With that, Mr. Smith, here, if there's no other. Mr. Chairman, if you give one more question from someone who may have some firsthand knowledge and experience with all this will be interesting. Yes, sir. To your right, Representative Jason Ridley. Thank you, Mr. Speaker. It's my friend, you old. Of course I do. Well, I got a question for you. So let's just say this is if you do this, but if I've got a truck and I haven't done anything to it, and Lauren McDonald's gets, Lauren Daniels gets in the back of it. Lauren McDonald gets in the back of it. Well, well, okay. You must do it out of order. I can tell you that. Mr. Speaker, I'm going to put a e up and leave for the day. Mr. Speaker, I think it's wise for me to yield the well and ask for the favorable consideration. General is yielded well. I knew there was a technical question on this point, but I think for you Bulldog fans, this is what y'all do to South Carolina. You beat the squad out of them. So let's go on. Is there any objection to the previous question being ordered that Chair here has done the previous questions ordered? Is there any objection to adopting the committee's substitute? Chair here's none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. The bill is agreed to. The bill is agreed to. The bill is agreed to. The bill is agreed to. The bill is agreed to. The bill is agreed to. Have all members voted for what purpose is representing Mayna rise? Is it not true, Mr. Speaker, that in the- Is it a parliamentary inquiry? Is it not true in Atlanta we call that simply car hydraulics? I'm sure the lady may have some- No, maybe she does it. But I'm sure she knows of what she speaks about car hydraulics. For what purpose is representing more rise? Parliamentary inquiry. Is it not true that if you were to take a walk through the legislative parking lot that everybody has a truck? We should know something about that, right? Yeah, I had one most of my life. But it didn't look like that. Have all members now voted? If so, Mr. Clerk, will you lock the machine? On the passage of Senate Bill 352, the Yees are 136. The Nays are 33. This bill, haven't received the requisite constitutional majority, is therefore passed. You You You You Good morning members. Again, we have a special invited guest. Members, doorkeepers, where you are, you don't have to lock the doors, but if you'll close them, that would be helpful. The hear is not coming from the house floor. We have a very special guest and a friend to many of us in this house. Last time I checked, he was mayor of Atlanta. Just confirming that pace gets fast here in the capital city from time to time. So, mayor Dickens is done an outstanding job. Need I say more? We might just stop right there, mayor. His support for the public training center that allows our public safety officials to be, have to be fully trained to work with the public to do their jobs and a very professional manner does not go unnoticed by the professionals who serve us. Or by the citizens of this city, the communities that surround this city and by the remainder of this state. We appreciate your dedication and your recognition of the importance of that mission. We also know\n\nthat the city of Atlanta is not only the capital city of Georgia, I believe is the capital city of the South and there's no doubt about that. One last important piece to what makes not only the people in the leadership of Atlanta that makes it so very very important to the will be in an equality of life in our state is something called transportation. I don't think anyone would argue that the city of Atlanta Georgia is uniquely qualified to be recognized as the transportation hub of this world and we appreciate what this airport does, what your rail system does, what the transportation system does from the highways and byways to ensure that it continues to be the case in the years that come and I think I can speak for the members of this house that you will have our full support to ensure the infrastructure in this great city is second to none especially what a few things you have on the horizon especially in the sports world that are going to make sure that Atlanta continues to have that focus of being one of the best places not only in this country or in the world to live work, raise a family and have a little fun. Mayor Dickens is going to speak to us now. Mr. Mayor. Thank you, thank you, thank you, wow it is awesome to stand here before such great leaders. Thank you Speaker Burns not only for that introduction but thank you for your leadership, thank you for your partnership it's been great getting to know you and working with you so thank you and all of all of you here. Good morning and thank you for welcoming me this morning to have this opportunity to spend a few moments with this great body. Again to the speaker to a majority leader of station and minority leader Beverly members of the Atlanta delegation I see so many of you I see the raise your hand ATL we like to make noism we in Atlanta. And all the members of this great body I think all of you again for this opportunity to speak to you and along with the people of Atlanta I thank you for the work that you do on behalf of all of the great state of Georgia. It is important to me that we are on good working terms we have a good working relationship with our state leadership and that's because of you. I appreciate that although we may not all stand on the same political party we can stand together to uplift the people of Atlanta and uplift the people of Georgia. The city of Atlanta enjoys an excellent working relationship with many of our state partners especially when it comes to one of the most important issues for us and that is public safety. We have had an outstanding set of support from the GBI the Georgia State Patrol and other state agencies as we work together to reduce crime in and around Atlanta. These partnerships have helped us to significantly reduce our crime numbers in 2023. In fact the city of Atlanta had the third highest drop in homicides than any other city in the United States. We ended the year when citywide major crimes against people down by 15% homicides down by 21% that includes double-digit drops in aggravated assaults, shootings and rapes. The horrible crime of rape was down 51% in the city of Atlanta last year. All of this underscores our work to create a safer environment for the people who live and work in the city of Atlanta and I know that's a common goal for all of us. Another common goal that we share is figuring out how to bring more affordable housing options to the people that are in this city and in the entire state of Georgia. The lack of affordable housing, that challenge is not just in Atlanta challenge, that's a challenge for the entire state and that's why I'm so proud to being a partnership with Commissioner Chris Nunn here who's up in the balcony. He is the Commissioner of the Department of Community Affairs that helps us so much. It is especially challenging as we work to house the unsheltered residents of our communities. But luckily for us, again, we have dedicated partners, a rapid housing effort that started with an offer of shipping containers from our state partners at GEMA has led to what we call the melody and nearly 40 previously unsheltered people now have a clean and safe place to lay their heads at night. Thank you. Every one of these people, they have a story and I'll just give you one of them. His name is George. He's a truck driver. George trained to be a truck driver. He has a CDL but then he had a stroke and as he was on his way to Grady Hospital, he had another one and he ultimately ended up having five strokes in a very short amount of time. So he couldn't drive trucks anymore and therefore he lost his job but ultimately he ended up losing his home. Here's a guy who tried to make all the right choices, trained to do what he loves. He paid his bills and all it took was a medical emergency to drive him into the streets of Atlanta. We had people like George and mine when we launched this rapid housing initiative and called this one the melody. When you start putting a face on the problem and you hear the stories, you realize that some of the people who worked the hardest and tried to do the best thing, they can find themselves upside down at the end of the day. And that's where their government is and should be there to help. So part of helping means being able to talk to one another and being able to hear one another. That happened when we were able to keep the city of Atlanta whole last year. As I said then, we're going to keep moving Atlanta forward. We're going to be one city with one bright future and my hope is that we can keep open lines of communication going together between this house and my administration. We're all committed to making the best choices and the best interests of the people of this city and the people of the great state of Georgia. Thank you all for welcoming me today and I'm so excited for the work that you're doing and I want to continue to stay in great partnership between the city and state. Thank you. Mayor, thank you for your remarks. We look forward to continuing this partnership. This house believes in you, Mayor. And we believe this house believes in you and your leadership, the leadership of this house. On both sides of the aisle, every member or leaders in this state, and we look forward to continuing our partnership with the city of Atlanta. As Atlanta goes, so goes our state. So we're all in this together. Thank you for your leadership. Thanks for being here. Thank you members. Members, you may join the mayor in the south any room. If you'd like to have a photo with him, his staff, it'll be awesome. I know he would appreciate your greeting him. Members, let me give you a little bit of information about our posture, the rest of this morning and the day we will be taking it, continue with the rules calendar. We will break around 12 for lunch. Then we'll come back an hour later and we'll take up a very important piece of business for the day and for the state of Georgia. And then we will push all of our committee meetings back one hour, one hour and a half this afternoon so we can get on with the business of this house and the people of this state. Mr. Clerk, will you read the caption to Senate Bill 410-410. Senate Bill 410, Senator Capatric, on the 32nd walker, the 20th Robertson, the 29th and others to be entitled back to men. Part two, Article 3, Chapter 50 of Title 43, the official go to Georgia and attend early in licensing the veterinarians and veterinary technicians generally shows to exempt certain sterilization services performed by out of state veterinarians. This bill I've referred to the Committee on Agriculture and Consumer Affairs, that committee recommends that this bill do pass by committee substitute. Members, I'm going to interrupt the protocol of this house to recognize a very, very important former member of this house, the former dean of this house, Howard Deerefren, Representative Calvin Smirey, Representative Smirey. Mr. Speaker, I come to present bill Senate Bill 410, the author of Senator Capatric, this is a very simple bill. It allows vets and vet technicians that are licensed in other states to obtain a temporary license here in Georgia, a six-months-on-license, to be able to assist in our non-profits and spaying in neutering clinics. It's a good bill. It is not opposed by the veterinarians or the county officials, and I ask your favorable consideration over how you'll find the questions. You have no questions. Thank you, Mr. Speaker, I yield a well. Gentlemen, has yielded the well? Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there an objection to adopting the Committee substitute? Chair, here's none. The Committee substitute is adopted. Is there an objection to agree into the report of the committee, which was favorable to the passage of the bill? The chair, here's none. The report of the Committee is agreed to. This bill now passed. All in favor of passed through the bill. We'll vote yes. All those opposed. We'll vote no, and the clerk will unlock the machine. All members voted. So, the clerk will lock the machine on the passage of Senate bill 410. The yeas are 170, the nays are zero. The bill hasn't received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read a caption to Senate bill 144144? Senate bill 1444 by Senator Islam of the 7th, do, into the 30th. Pain in the 54th, Senator Bartol, the 31st and others to be entitled back to amend. Code section 382, 151, the official code of Georgia and it's either related to the adjunct general, duties, records, seal, and effect on documentary evidence. This bill I'm referring to the Committee on Defense and Veteran Affairs, that Committee recommends a disbile due pass. Chairman Bonner, you're recognized to present the bill, sir. Thank you, Mr. Speaker. Bring to you Senate bill 144. This is a request from our Georgia Department of Defense. It simply removes the requirement for the roster of all of our commission officers to be published in the annual report to the governor. It also eliminates the need to actually print and hard copy all of the Georgia code that relates to our Department of Defense. That's the bill, Mr. Speaker. I'm happy to answer any questions. You have no questions. Thank you, Mr. Speaker. I yield the will. Hispanic Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill, we'll vote yes. All those opposed. We'll vote no, and Mr. Clerk, will you unlock the machine? All members voted. All members voted. If so, the clerk will unlock the machine. On the passage of Senate Bill 144, the yeas are 167. The nay is one. This bill, having received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 337. 337. Senate Bill 337 by Senator Patrick, the 32nd albors, the 56th Kennedy, the 18th and others, being a total of an act to amend Code Section 382, 111 of the official code of Georgia and a tenant relating to personal age to camp. Appointments, commissions, length of service and duties. Those to authorize the governor appointed honorary Georgia colonels for life, this bill, I'm referring to the committee on special rules that committee recommends this bill do pass by committee substitute. Chairman Sains is recognized to present the bill. Thank you, Mr. Speaker. Members of the House, this is a simple bill to ensure that we have adequate procedure to honor our Georgians with this special honor of the honorary Georgia colonel as well as adding a provision for our legislative body to give the honorary title of Lieutenant colonel. It modifies what we currently have in law, which is that the honorary title of colonel is for the length of the term of the governor. It modifies that to the lifetime of the honoree. And as well as the provision to honor a lieutenant colonel would be through the joint resolution of the legislative body, both of the House and Senate would have to pass. So this is something that would be voted on by the entire body. Mr. Speaker, if there's no questions, I'll yield the vote. Gentlemen, has a question. If you'll take one to your left. Representative Bernal has a question. Thank you, Mr. Speaker. That's gentleman Yield. I do. Thank you for bringing this resolution. Those of us that graduated from a total fellowship and Kentucky, we are Kentucky colonels. So now we'll have the opportunity to possibly Georgia colonels. Thank you. Double colonel. Gentlemen, has a further questions. Thank you, Mr. Yield. Gentlemen, is yielded the well? Is there an objection to the previous question being ordered? Chair, here's done the previous questions ordered. Is there an objection to agreeing to the report of the committee, which was to the committee's substitute. Chair, here's done the committee's substitute is adopted. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair, here's done the report of the committee is agreed to. Shall this bill now pass, all in favor of passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Have all members voted? For what purpose does Chairman Collins rise? Point of entry, including Mr. Speaker. State chaing quarry, sir. Is it not true that this house only has one colonel and that's colonel Bill Hitchens? Well I hate to agree with you many times, but I'm going to agree with you on that one. For what purpose does Representative Sains rise? Parliamentary inquiry. State chaing quarry. Is it not true that this corner is blessed with two gray colonels, both in front of me and to the side of me? Who's the other colonel? I don't know if I can name them in house rules, but he's a colonel. Oh yeah, he's a colonel. I didn't forget about that. Mr. Chairman, you're a colonel too. That's why we put you all together. Mr. Colonel, colonel. Mr. Chair, Chair. Oh, he's too young to be a colonel. He can't be a colonel. You have to have a little gray hair to be a colonel. Well, Representative Chess, can I name this all sort of colonel? We stand corrected. Now, I won't take one more here. Representative Kennerd, for what purpose do you rise? Well, let me drink where? State chaing quarry. Isn't it true that my favorite colonel is colonel Sanders? Mine too. Have all members voted, if so, the clerk will lock the machine, own the passage of the colonel bill. Senate bill 337, the yeas are 168, the nays are zero. The bill haven't received a requisite Constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to Senate bill 369-369? The Senate bill 316-9 by Senator Burns, the 23rd, Alvers, the 56th, Roberts, the 29th, and others to be entitled to amend Article 2, Chapter 2, Title 40, the Fisherhood of Georgia, and it's had a really registration and licensing of motor vehicles generally, shows to provide for the issuance of a license plates commemorating the United States of America's semi-quince centennial Miss Bill Labyrinth, referred to the Committee on Motor Vehicles, that committee recommends this bill do pass. We're representative Hagen is recognized to present the bill from down in, let's see, Videa, Tooms County, Lyons, Lyons, yes, now you're recognized. We do love Videa, especially since the packing date for the Videa, Onion has been announced as April 17, but I digress. This is a fabulous bill that's come over from the Senate that would help us in this state celebrate our country's semi-quince centennial anniversary. It would establish a special license plate, the Department of Ed and the Department of Motor Vehicles would be tasked to work together to set up an educational civics program for six through eighth graders. They would submit their designs for this special license plate, celebrating our semi-quince centennial anniversary. And that plate would be available from 2026 to 2030 for us to have on our cars to celebrate. And Mr. Speaker, that is the bill. And if there are questions, I would be happy to yield the well. Lady has a couple of questions. Yes, sir. To your lift, Representative Nullowicz has a question. Does the lady yield? I do. Is it not true that some of us were born during the bicentennial year and that it cannot possibly be the reality that we are approaching 50 years past that day? Well, I know you and I couldn't possibly have been alive during the bicentennial. So I don't know how these people feel about it, but I don't relate. Thank you. Yes, ma'am. Representative Stenson, to your lift in the back of the room, has a question. If the lady were yield. Thank you, Mr. Speaker. That's the general lady yield. I do. Is it not true that you mentioned April 17th as the Valdel, your onion festival? Packing date for the onions. But it isn't at not further true that April 27th is the Georgia Strawberry Festival in Taylor County, Georgia. And yours truly will be in the parade. And she's inviting everyone in this chamber to be at the Georgia Strawberry Festival on April 27th. Is that not true? That is true, but what is also true is that April 26th is the annual Valdel, your onion festival in Valdel, your Georgia. And I would invite everyone to come to that one before they go to the Strawberry Festival. Is that not true? LAUGHTER The lady has no further questions. Thank you, Mr. Speaker. Are you all the well? But I'm going to let you both know. I'm going to say she both affine and contribute that to the both parade dates for so blatant, such blatant advertisement of two fine events. Y'all worked. I believe y'all had that plan. I think y'all did. That was the plan deal. Is there any objections to the previous question being ordered? It's here. Here's done. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is done. The report of the committee is agreed to. Shout this bill now pass. All in favor of the passage of the bill, we'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted for what purpose is represented? Parish rise. While I'm entering, Quarry, Mr. Speaker. State you're inquiry. Mr. Speaker, I witnessed and heard some of that noise that was going on. And is it not true that the Cherry Blossom Festival in May can george it starts on the 15th. Goes through nine days is an international festival. And I am the Cherry Blossom Queen. Well, since you mentioned it, I knew there were a lot of queens in this house, and that just proves it. So let's see, for what purpose? No, you're not. For what purpose is a charity tailor, is Darlene Taylor? Parliamentary inquiry. Isn't it not? No, ma'am. You're out of order. State you inquiry. I want to make sure everybody here is this one. Just while we're talking about all these wonderful things, I don't want anybody to forget that April 26th is the 103rd rose festival down in Thomasville. We'll have a great parade and a lot of beautiful roses and you'll need to come. Thank you. Another rose queen. No doubt about that. For what purpose is the chairman, Colonel Hitchens rise? Parliamentary inquiry. State you inquiry. Is it not true that as a member of the Georgia State Patrol, why marched into by Centennial Parade and Philadelphia in July 1st, 1976? They all tried to give me to say 1776. But what was that? What I'm asking about, 1976. But each state police organization of the 13 original colonies had a color guard. And we marched in order of admission to the union. So we were fourth. Some of our friends to the north actually wanted us to subtract four years for the Civil War. But they maintained his fourth. Good history, and you were there for it. Was the building air-conditioned when you all signed to wait a minute? I won't go any further. I think all members have voted. So the clerk will lock the machine on the passage of SB369. The yeas are 173. The nays are zero. This bill, having received the requisite, constitutional majority is therefore passed. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Herbert Campbell. Honoring the Centennial of Scouts of BSA Troop 1. Recognizing March 11, 2024, is blue and white day to state capital, commending Beleday Berry, Marina Hersh Danta C. Sildo, Maddie Hardy, Hannah Horowitz, and Kars Corals. Congratulations, and congratulations, Andrew Washington, receiving the 2020-24 Yellow Rose, Nicotine Randall Service Leader Award, recognizing commending Gwen Redding and recognizing March 7, 2024, is women in radio state capital, commending and congratulating Dorr Milteer, commending the benefits and contributions of purebred dogs and recognizing May 1, 2024, is purebred dog day in the state capital, recognizing and commending the Duluth Rotary Club, recognizing and commending Atlanta influences everything, recognizing Medal of Honor recipient Colonel Ralph Puckett Jr.\n\nrecognizing and commending Atlanta Fashion Week. Congratulations commending Muscogee County School District's 2024 Teacher of the Year celebrating phenomenal women on International Women's Day, recognizing and commending Georgia Corps in the Fire Regional Cancer Coalition's Response Week February as Cancer Prevention Month in Georgia, recognizing March 11, 2024 as Phil Lander at the State Capitol, recognizing and commending Sumner Max Lowe. Congratulations in a North Hall Middle School Girls Cross Country Team for winning the 2023 State Cross Country Championship Meet. Congratulations in the North Hall Middle School Boys Cross Country Team for winning the 2023 State Cross Country Championship Meet. Recognizing and commending Marty Hohens is the Girl Scouts of historic Georgia Gainesville 2024 Women of Distinction and recognizing March 11, 2024 as PACE Day at the State Capitol and for other purposes that completes the reading of the Privileged Resolutions. Is there any objection to adopt in the Privileged Resolutions? Chair, here's none. The resolutions are adopted. We're going to have, we will have a couple of announcements, but we're going to do a couple of further actions right here and we will recess for lunch. Chair recognizes representing Tyler Paul Smith for emotion. Thank you, Mr. Speaker. I know this House disagree to the Senate Amendment to Senate Bill 73. Representative Smith, Smith moves at the House to disagree to the Senate amendment to Senate Bill 73. Mr. Clerk, will you read the caption? Senate Bill 73 by Senator Tillery, the 19th Brass that the 28th hatched, the 50th and others to be entitled to amend part one of Article II, Chapter 5, Article 46, the Fiscal to Georgia and Teter relating to general provisions relative to telephone service. Representative Smith has recognized to explain the Senate's substitute. Thank you, Mr. Speaker. Ladies and gentlemen of the House, the reason that we move for this is that some language that was supposed to have been included in a couple of commas there were not included to be as specific as what we needed to within this, and that is the reason for the disagreement. So we can get this right. And when it's signed into law, that those who have to interpret it can do so properly. All the gentlemen's motion that the House disagree to the Senate's substitute amendment is objection. Chair, here's none. And the House has disagreed to the Senate's substitute to Senate Bill 73. Thank you, Mr. Speaker. I move that this House disagreed to the Senate's substitute to House Bill 126. Yeah, that's him. Representative Tyler Paul Smith has recognized for a motion. Thank you, Mr. Speaker. I move that this House disagreed to the Senate's substitute to House Bill 126. Representative Smith moves that this House disagree to the Senate's substitute to House Bill 126. The clerk will read the caption. House Bill 126, by the way, on the Smith of the 18th, got over the 8th heavens, the 57th, and others to be entitled to amend Article 2, Chapter 6 and Title 5 of the official go to Georgia and it's a related to a pellet practice. So it's to change provision relative to judgments deemed directly appealable. Chairman Smith has recognized to explain the Senate's substitute. Thank you, Mr. Speaker. Upon reading the Senate's substitute, we found that there was an issue with the procedure within this out of time appeal structure that we were trying to create and to correct as we were guided to do by the court across the street. And so by disagreeing to this, we've already started negotiation with the Senate to hopefully come to agreement on making sure that the procedure is described more succinctly in the bill and that is it, Mr. Speaker, and with that. You have no questions. I'll yield the well-natured, but it's favorable consideration. On General's motion that the House disagree to the Senate's substitute, is there any objection? Chair, here's none, and the House has disagreed to the Senate's substitute to House Bill 126. We have a couple of announcements. We also will be taking page photos during the lunch break as soon as we break for lunch. So if you have a page here today, I encourage you to come on down to the front. I would like to represent and be claim. There he is, is recognized for an announcement. Thank you, Mr. Speaker. Just want everyone to know that the working family of caucus will be meeting in room 307 at CLLB, and there will be lunch. And lunch and sponsors of the Southeastern Covenant Regional Council. Thank you, Mr. Speaker. Thank you, sir. Chair, midnight is recognized for an announcement. Thank you, Mr. Speaker. I want to remind everyone that tonight, Thursday night tonight, from 5 to 8, we're going to have our annual Georgia legislative sportsman's caucus day at the range. That is going to be at Stoddard's Ranging Guns, and that's at Bishop Street in Atlanta. So if you will, if you plan on being there, how about shooting me a text where my administrative assistant, a text, and let us know that you're going to be there. We would certainly appreciate it. We welcome everyone to come out, who's a member of the sportsman's caucus, and join us and support our sportsman's caucus here at the Georgia Capitol in the House. Thank you. Thank you. Leader, illustration is recognized for an announcement. Thank you, Mr. Speaker. There will be a committee chairman's lunch at noon in room 403 of the Capitol. Chairman Mitchell is recognized for an announcement. The Democratic caucus will meet during lunch in 605 in the CLOB. Thanks so much, Mr. Speaker. Representative Henderson is recognized for an announcement. Thank you, Mr. Speaker. It hats off to the House spouses group that had an exclusive luncheon at the exclusive Piedmont Driving Club. This was spearheaded by the First Lady of the House, Dale Burns. And during that luncheon, they celebrated along with my husband for his birthday. So can you, colleagues, help me celebrate my husband birthday? Stand up, honey. Happy birthday, baby. Happy birthday. And hats off again to First Lady Dale Burns. Thank you. Thank you, Mr. Speaker. I've already heard that was a great event. All of our spouses were there. OK. Page photos, house, and recess, until 1 p.m., 1 p.m. today, the house will be in recess until 1 p.m.",
  "updated_at": "2026-02-13T21:07:32.060493+00:00"
}