{
  "video_id": "WHWwlUvb72M",
  "url": "https://youtu.be/WHWwlUvb72M?t=3373",
  "title": "Georgia House - Day 11 (2026-02-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 11,
  "video_date": "2026-02-03",
  "duration_minutes": 241,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 11 (2026-02-03) session:\n\n**Overview**\nThe session featured a moving tribute and background information on Representative Wayne Scott Gayard, as well as a passionate speech by Representative Carl Henderson emphasizing the importance of blessing and serving God.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Representative Henderson highlighted Representative Gayard's impressive background, including his work as a pastor, founder of Savannah Feed the Hungry, filmmaker, and devoted family man.\n- Representative Henderson delivered a rousing speech calling on legislators to praise and serve God, emphasizing the importance of having a relationship with God and doing \"reasonable service\" to bless others.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum was present.\n\n**Adjournment**\nThe session adjourned. The next session is scheduled for [next session date].",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you a right you Wayne Scott Gayard of the 167th District. When I asked Pastor Gayard to speak, I knew he was a man of God, but I did not know he had such a rich, profound background in resume. We work around our colleagues daily, but we may not get to know them that well. So we need to get to know our kind of parts whether they be Democrats or Republicans. Therefore, I'm going to ask you, did you know certain things about this man of God, a few of his rich background accolades? I'm going to share with you. Did you know representative Gayard is the pastor of the Family Life Center in Savannah, Georgia?\n\nDid you know, Representative Yeard is the founder of Savannah Feed the Hungry. Now Feed the Hungry that he organized has served in 10 cities in Georgia. And four in South Carolina feeding over 1.5 million meals served to families. Did you know, Representative Yeard is a filmmaker and has made two film documentaries and it's on National Radio Documentary entitled The Last Days of the King. There are many, many aspiring work that he is doing in the state of Georgia representing Savannah. Last but not least, he is the father of four beautiful daughters. And his wife, LaShanda Yeard, has been married for 26 years. So therefore, House of Representative, I would like for you to join me if you would be so kind by standing and putting your hands together and praising God for our colleague, our brother, our co-worker, our friend, our past and the call, Yeard, would you just put your hands together for him please. Thank you, Representative and Pastor Henderson. To someone that I met about six years ago that says, I feel you're going to be my friend. And I said, I feel you're going to be my speaker. To the speaker of this house. To my brothers and sisters of the Georgia General Assembly, let me say, oh magnify the Lord with me. Let us exalt his name together. I double dare you to stand to your feet. Don't act cute. Put your hands together and give God the praise in this house. Come on in this house. If he's been good to you, you need to be giving him some praise. If he has woke you up this morning, you need to say thank you. Oh magnify the Lord with me. David wrote a song, Psalm 34, he said, I will bless the Lord at all times. His praises shall continually, continually, over and over and over again. I want to digress for a minute to give you this word today that is downloaded in my spirit. That in the year of September 11th, we all remember September 11th, 9-11. And we remember the atrocity in our country. And we remember that the leadership, Congressmen and senators and those that were in leadership got together on the steps and they said, God bless America. Well I tend to digress back to that because I think we have another word in 2022. And if Al Williams was with raise his finger, if he were here, if he's smiling, I know he raised his finger, God bless America, America needs the blessed God. We are in this defining moment where there's a democratic party and there's a Republican party. But I just want to ask some incognito deacons and ministers of the gospel, anybody in the Holy Ghost party on today, anybody that's not ashamed of the gospel. I'm reminded Mr. Speaker that sometimes we walk around like we all that in the bag of chips and we want to bless ourselves. Look at what I did and look at what I've done. And if it wasn't for me, but I'm reminded that there's someone that's greater than you and me that is able to bless you at all times. There's someone that is able to give you power. Now if I gave you my glasses today, you would be able to see or not see some precarious things. If I took your glasses, Chairman Rich, I might not be able to see the same things that you see. But I've learned the Bible says, right division, it makes it plain. Though the vision may carry, it will come to pass. What we need is some vision. And if we got vision and we exalt God, then he will give us provision. Can I just talk to a few people today that won't say bless my soul, but you will say, God, bless America, America needs the blessed God. How do we bless God? We bless them four ways on today. Number one, how many of you know the Lord? Oh yeah, if you know them, you'd be smiling right now because the joy of the Lord should be your strength. How many of you have taken time to have a relationship with God all mighty himself? Are you hearing me today? A year ago when I came here, Mr. Speaker, and we talked about 200,000 and 2,000 blind citizens that their children were being taken away, I remember putting the building and they said that'll never get passed, but the God I served showed me like a VCR, what would happen? And he said, Carl, it will come to pass. You know why it came to pass, Karen? Because I bless the Lord at all times. All you hear me today. I remember sitting up there and filing the bill for the citizen arrest repeal and they said it will never come to pass, but I remember the day that the bill was signed. I remember being at home in surgery, Mr. Speaker, I was in surgery and almost died that day. That's why I wasn't here. To see in the middle of the hospital bed when I couldn't be there for the signature, I was reminded of representative of Henderson and representative of Cugley. It was in a bot call. It was about God getting his glory because God said it will come to pass. So how do we bless God? We bless God without reasonable service. How many of you are serving God on today? How many of you have served God instead of serving yourselves? How many of you taken a minute to say, God, what can I do for the least of me? Why do we feed people? Why do we feed the working poor? Why do we get people on their feet? Why do we get 244 people into houses? Why do we open up a center to get people's credit on the right path? Why do we bless people coming to reentry and getting them into being return to citizens? Because we're just doing our reasonable service. Can I just talk to you for a minute? The third thing that you can do to bless God is you need to let him know that you care. And how do you let him know that you care? You're the greatest citizen in the world. I will bless the Lord at all times. If you bless them and you care, you will know that in the a first of the 30 of that scripture, David says, oh, oh, T is in C. That the Lord is good. How many of you know that if you know that God is good, you'll be sitting up here clapping your hands at all times. My seatmate, Mr. Speaker, we have church every Sunday in a while. We get over there and we just exalt the Lord. And we don't care who watches us. We're going to say, thank you. You went me today. The last thing that you can do if you want to bless God, you need to tell him, thank you. Over two years of COVID, 800,000 people lost their lives. We stand up here every other morning saying so and so left here. Many of you have loved ones that you have lost that have gone on to glory. I double there, you triple there, you double there to get up off of your past areas and say, thank you for blessing me to have that person in my life. Thank you for allowing me to be here with that person. Thank you for allowing them to have been with me. I just want to thank you for making it through when I couldn't make it through, when I didn't see my way through. Lord, I just want to thank you. God bless America, America needs to bless God. Thank you is a powerful word. But you can't say thank you if you don't have love. Dr. King talked about the power of love. Are you with me today? All many of you are caught up on your bills and caught up on your situations. And brother Danna, if we just say the power of the love of somebody, are you with me today? Look at your neighbor and say, where is the love? Some of y'all loving your phones right now. You don't want to love anything else. Love somebody today. Love your neighbor today. Love your enemies today. Love your family today. Love your leadership today. Love your city today. Love your country today. But most of all, if you stand to your feet, you can love God. God bless America. America needs to bless God. As we stand to our feet today, I just want to break a little program, Mr. Speaker, because I know that in the CME church and the MME church and the Baptist church and even Reverend Kendrick's even stands with motivational Mondays to thank God. So I'm reminded that there's a song, Mr. Speaker saying, thank you Lord. Y'all remember that song? Thank you Lord. Come on under the mask. I want to hear some tennis and some finals. Thank you Lord. I just want to thank you Lord. Now here's a verse for you, Majority Leader. He's been so good. Y'all hear me today, Leader. He's been so good. Come on, Chairman. Mr. Humber, it was a spot. He's been so good. I just want to thank you Father, we thank you right now. We bless your name today. We have every name that has power. You have power. El Shadai, Jehovah Jaira, you have power on today. El Nisi, you have power on today. Lord, we just want to say thank you. A few of your children have gathered together in this assembly. We've gathered in this body today to pause for a minute and just say thank you on today. Thank you for putting the 91st song of protection over our families. Thank you today. He that dwells in the secret place of the most. Thank you for allowing us to trust in you with all our heart and lean out to our own understandings. Thank you today for being the light and our salvation. Whom shall we fear? Thank you today for fret not that's something because of people doers because they will be cut down like rats. Thank you today for being that light to our lives. Thank you for our families. Thank you for putting up with our pocketbooks and our bank accounts and giving us a Deuteronomy 888818 experience. The power to have wealth. Thank you today for covering this house, this house of representatives, all of the servants that are in this house. Thank you today for waking us up on today. Thank you Lord for healing us in the midst of every illness and the midst of every disease. Thank you for healing us on today, Lord. But most of all, just thank you for being in our presence today, Lord. We just want to say thank you for walking with us, for talking to us, for being able to lay hands on us, God. We just want to say thank you and we give you praises on today and honor and glory and it is in your son Jesus name we pray. Amen, amen and amen. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation and the God in the inimitable with liberty and justice for all. Thank you, Lord. Thank you, Mr. Speaker. Doorkeepers will unlock the doors. Thank you. The chaplain will be greeting members in the south any room beginning now, south any room. The Williams that I understand are chaplain to say that he and you had been having church over there while we're trying to conduct business here. I understand. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, we have two lives and the second begins when we realize we have only one. Confucius. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on 59 minutes following we establish the order of business in the first part of the unanimous consensus and introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. Third reading and passage of uncontested local bills and resolutions. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. House billed up 55. House billed up 56. The clerk will read. House billed up 55. The clerk will read. House billed up 55. The clerk will read. The clerk will read. House billed up 57. The clerk will read. the 24th Williams this 37th Eugly 136th and others will be Todd and Axe Menchapter one and Todd will 34th the fish go to Georgia and Teddy relating the general provisions of labor and industrial relations. Industry and labor. Hospital 1178 by Representative Bono the 72nd Jones the 47th Dubnick of the 29th or one of the 28th way to the 9th and others will be Todd and Axe Menchapter five arc 16th chapter two and Todd will 20th fish go to Georgia and Teddy relating the review removal of students and elementary and secondary education. Education. Hospital 1179 by Representative McLeod of the 105th Alexander the 66th eventually the 88th Kendrick of the 93rd Scott of the 76 and others will be Todd and Axe Menchapter four, Todd will one of the fish go to Georgia and Teddy relating the holidays and observances. The election integrity. Hospital 117, 1180 by Reps of Corbeter the 174th Jasper's the 11th Watson the 172nd England 1116th Taylor on 73rd and others will be Todd and Axe Menchapter two chapter eight, Todd will 50th the fish go to Georgia and Teddy relating the regional commissions. Governmental affairs. Hospital 1181 by Reps of Jackson the 64th dryer the 59th pays more than 63rd Bruce the 61st Thomas the 65th and others. Hospital 9 to Menchapter 62, a total 36th the fish go to Georgia and Teddy relating the developmental four. Governmental affairs. Hospital 1182 by Reps of Taylor 173rd and Camila on 71st. Bill B. Todd and Axe Mencodes section 36 nine three the fish go to Georgia and Teddy relating the sale or disposition of county real property. Governmental affairs. Hospital 1183 by Reps of Gunner the 8th lumps into the 12th Scott goes on 14th Smith of the 18th Kelly the 16th and others Bill B. Todd and Axe Menchapter six and title 17 the fish go to Georgia and Teddy relating the blonde and coagulants. Judiciary non civil. Hospital 1184 by Reps of Williams the 168th the 168th the 164th Hogan and 179th Smirie the 135th Gaines the 117th he'll be Todd and Axe Men part 12 article six chapter two Todd will 20 the fish go to Georgia and Teddy relating the effect is this of educational program. Education Hospital 1185 by Reps of Lewis Ward of the 109th Beverly the 143rd down to the 94th and Dr. and under the 85th he'll be Todd and Axe Mencodes section 29 22 the fish go to Georgia and Teddy relating decisions on awards will be juvenile justice. Hospital 1186 by Reps of the Austin the 170th dupe Nick of the 29th there when the 28th Cooper the 43rd lot of 120 second and others Bill B. Todd and Axe Men article one on chapter 44 title 43 the fish go to Georgia and Teddy relating the state speech language pathologist. Shelton Human Services Hospital 1187 by Reps of Williams the 148th Grabbling 67th Cooper the 174th gamble with 15th rose the 120th and others will be Todd and Axe Mencodes section 48 three the fish go to Georgia and Teddy relating exceptions from sales and use tax ways and means House Bill 1188 by Reps of a lot of the 120 second Grabbling 67 based more than 63rd Smith the 18th Montana the 17th and others will be Todd and Axe Mencodes section 16 six four the fish go to Georgia and Teddy relating the child molestation and act judiciary non-civil House Bill 1189 by Rose and Williamson in 115 Kelly the 16th will be Todd and Axe Mencodes chapter 7 title 48 the fish go to Georgia and Teddy relating the impositionary computation exemptions and credits ways and means House Bill 1190 by Reps of SCOG is the 14th gamble with 15th Kelly the 16th Bill be Todd and act to men the act providing for the Board of Education in Bartow County. The Intergovernmental Coordination House Bill 1191 by Reps of Smith the 18th Bill be Todd and act to authorize the Minus report of the City of Bremen to charge the government of coordination House Bill 1192 by Reps of Cooper the 43rd Parish on 58th and all of what's in 40th second Hawkins the 27th gains the 117th Bill be Todd and act to men arc the 7th chapter 4 title 49 the fish go to Georgia and Teddy relating medical assistance generally helped in human services and out of the bill 1193 by Reps of Gamble the 15th Smith the 18th Bentley the 139th Mathis the 144th Williams the 145th and others will be Todd and act to men part three of article on chapter 18 to title 43 the fish go to Georgia and Teddy relies licenses for funeral directors regulated industries House of Resolution 683 by Reps of Greens 151st on who the 30th Perkle of 150th Resolution authorizing granting the non-exclusive easements state properties House of Resolution 684 by Reps of Kelly the 16th Smith the 18th probably the 67th resolution honoring the life and memory of Judge Dan transportation House of Resolution 685 by Reps of Williams in the 115th resolution honoring the life and memory of Sergeant James Terry Savage Transportation House of Resolution 686 by Reps of Watson 170th secondbury 759th Burke Nair of the 137th Fortburn of the 174th hatched 150th a resolution proposing amendments with Constitution ways and means that completes first readers second rating of bills and resolutions a clerk or read House bill 1097 by Reps of Jenkins of the 130th a bill to a men and act to reconstitutory Maryweather County Board of Education House bill 1098 by Reps of Jenkins of the 130th second a bill to a men and act creating a board of commissioners of Maryweather County House bill 1099 by Reps of hatched 150th a bill to a men and act providing method of election of the members of the Board of Education of Lorenz County House bill 1100 by Reps of hatched 150th a bill to a men and act creating a board of commissioners of Lorenz County House bill 1101 by Reps of green of the 150th first a bill to a men and act providing a home study exemption from early counties school district ad lorem taxes House bill 1102 by Reps of green of the 150th first the bill to a men and act creating a board of commissioners of early County House bill 1103 by Reps of Chocus of the 138th Stevens of the 164th green of the 150th Williams of the 145th Hawkins of the 27th another a bill relating to separately stated fees and rental agreement House bill 1104 by Reps of housing of the 170th a bill to a men and act creating board of commissioners of Cooke Cook County House bill 1105 by Reps of House, the 170th a bill to a men and act creating a Cook County board of education House of 1106 by Reps of Williams of the 148th and Hogan of the 179th the bill to a men and act creating a board of commissioners of Wilcox County House bell 1107 by Reps of Williams of 148th, Hogan of 179th, Stevens of 164th, the 45th, a bill to provide that future elections for the Office of Pro-Bate Judge of Crisp County, Shelby Nonpartisan Elections, House Bill 1108, by reps of Roads of 120th and Williams of the 145th, a bill to amend and act creating Board of Commissioners of Putnam County, House Bill 119, by reps of Mathiac of the 73rd, Knight of 130th, a bill to amend and act, establishing the Griffin-Spald & County School System, Board of Education, House Bill 1110, by reps of Mathiac of the 73rd, a knight of 130th, a bill to amend and act creating Board of Commissioners of Spald & County, House Bill 1111, by reps of Meks of the 178th, a bill to amend and act, creating Board of Commissioners of Pierce County, House Bill 1112, by reps of Meks of the 178th, a bill to amend and act, providing for the compensation and selection of the Board of Education of Pierce County, House Bill 1113, by reps of parkhold 155th, a bill to amend and act creating the board of commissioners of Ben Hill County, House Bill 1114, by reps of peninsula 31st, 31st in Gaines of the 117th, I built a million acts to reconstitue the law governing the Jackson County School System, House Bill 1115. By rep. Benton of the 31st, I built a million acts, providing a new charter for the City of Commerce, House Bill 1116. By rep. Benton of the 31st, I built a million acts to create a board of county commissioners for the County of Jackson. House Bill 1117, by rep. Demons of the 164th, P3 of the 166th, Tancers of the 116th, I built a authorized assessment and collection of technology, fee by the State Court of Brighton County, House Bill 1118, by rep. Benton of the 23rd, Cantrell of the 22nd, Byrd of the 20th, Carson of the 46th, Thomas of the 21st, I built a million acts, providing a number of positions of membership of the Cherokee County Board of Education, House Bill 1119. By rep. Benton of the 171st, Taylor of the 173rd, I built a million acts, I made an act relating to the Board of Commissioners of Decatur County. House Bill 1120, by rep. Benton of the 174th, Prince of the 127th, Frazier of the 126th, Nelson of the 125th, I built a million acts, providing for the consolation of Richmond County and the City of Augusta House Bill 1121, by rep. Benton of the 124th, Prince of the 127th, Frazier of the 126th, Nelson of the 125th. A Bill to a million acts, regulating public instruction for the County of Richmond, House Bill 1122, by rep. Benton of the 171st, Taylor of the 173rd, I built a million acts, providing for the composition of the Board of Education of Decatur County, House Bill 1123, by rep. Benton of the 179th, July 167th, I built a million acts, providing for the Board of Education of the 126th, by rep. Benton of the 146th, Clark of the 147th, Dickie of the 140th Williams of the 148th, I built a million acts, I made an act for the Constitution of the Board of Education of the 177th. The Board of Education of the House of the County, House Bill 1125, by rep. They're parking over the 150th, the Bill to a million acts, providing for the composition of the Ben Hill County Board of Education. House Bill 1126, by rep. They're delocted to the 167th, the Bill to a million act, creating the Board of Education of Macintosh County, House Bill 1127, by rep. They're the 4th, the second, Ridley of the 6th, a Bill to a million act, creating the Board of Commissioners of Whitfield County, House Bill 1128, by carpenter of the 4th, the second, Ridley of the 6th, a Bill to a million act, a revised and restate the law relating to the Whitfield County Board of Education. House Bill 1129, by rep. They're the Corbett of the 174th and Sains of the 180th, they're built to a million act, providing for the election of members of the Board of Education of Charlton County, House Bill 1130, by rep. They're the belt of the 31st, a Bill relating to the development impact phase, House Bill 1131, by rep. They're the limit of the 99th camp, with 131st, the main, or the 56th, and the 8th, a Bill relating to state government, House Bill 1132, by rep. They're the Hogan of the 179th House, and they're the 170th, the Legend of the 167th Stevens of the 164th Galeyard of the 162nd, a Bill relating to fees taxes, House Bill 1133, by rep. They're the Chukas of the 138th, Stevens of the 164th College of the 68th, Gaines of the 117th, Corbett of the 174th, and others, and they're relating to the Public Service Commission, House Bill 1134, by rep. They're the frustration of the 104th, the 70th, a lot of the 120th, and they're the 26th, and the weeks of the 178th, they're relating to participation in criminal gang activity prohibitive, House Bill 1135, by rep. They're the Smith of the 70th, the 70th, the 70th, and Chank of the 130th, and the second, the second, the single, the 71st, they're built to a million act, providing for the camp.\n\nposition of the Board of Education of Cali De County. House Bill 1136 by Rep. Smith of the 70th Bonner of the 72nd Jenkins of the 130th Second and Singleton of the 71st to build to a main in act creating board of commissioners of Cali De County, House Bill 1137 by Rep. Rorkeiser of the 157th Scofield of the 60th, frustration of 104th McLaren of the 51st to build related to general provisions for administrative procedure. House Bill 1138 by Rep. Niel of the 74th, for now of the 77th, base more of the 63rd Douglas of the 78th, Scott of the 76th to build to a main in act to provide a home stay exemption from certain city of Marrow, Adelora, and Taxes, House Bill 1139 by Rep. Rorkeiser of the 157th to build to a main in act providing for the election of members of the Board of Education of Tatinal County. House Bill 1140 by Rep. Irwin of the 28th to build to a main in act changing the method of choosing the members of the Banks County Board of Education, House Bill 1141 by Rep. Irwin of the 28th, a bill to a main in act creating board of commissioners of Banks County, House Bill 1142 by Rep. Niel of the 17th to an hour and a hundred and nineteen, Friday of the 118th, a bill to a main in act providing a merger of the existing independent school system of the mayor and council of the city of Athens and the existing school system of the city, County of Clark. House Bill 1143 by Rep. Niel of the 23rd, Cantrell of the 22nd, Bart of the 20th, Carson of the 46th, Thomas of the 21st to build to a main in act creating board of commissioners of Cherokee County, House Bill 1144 by Rep. Rouse of Park, the 100th and 1st, Clark of the 108th, McLean of the 100th, Hutchinson of the 107th, Mitchell, the 106th and others, and the 50th to a main in act creating board of commissioners of the 1st County, House Bill 1145 by Rep. Niel of the 19th, probably the 67th butth, the 137th, Maynard of the 56th, Gamble of the 15th and others, the bill relating to the Georgia State Indomification Fund. House Bill 1146 by Rep. Niel of the 120th, Collins of the 16th, Hitchens of the 160th, First Lums of the 12th, and the 12th, and the 12th, and the 26th of Bill, relating to murder vehicles and traffic, House Bill 1147 by Rep. Niel of the 120th, Cooper to the 174th, the 100th, 175th, the 6th Smith of the 18th, the bill relating to wildlife, House Bill 1148, by Rep. Niel of the 120th, Cooper to the 174th, the 100th, the 100th, 175th, the 100th, the 130th, Ridley of the 6th, and Bill relating to possession of servant parkuses, House Bill 1149, by Rep. Niel of the 77th, Boatty of the 62nd, Dryer of the 59th, Allen of the 40th, Allen of the 54th and others, the bill relating to an act, the Georgia Evictions, Beepers Registration Act. House Bill 1150 by Rep. Niel of the 140th, Watson of the 172nd, England of the 116th, the jasper of the 11th, the Perkle of the 155th, the bill relating to treatment of agricultural facilities and operations, and forced land as nustances, House Bill 1151 by Rep. Niel of the 98th, the bill relating to ethics and government, House Bill 1152 by Rep. Niel of the 56th, the 99th, Lopez of the 86th, Jackson of the 128th, the bill relating to the Fair Business Practice, this act of 1975, House Bill 1153 by Rep. Niel of the 56th, the 99th, the 8th, a bill relating to educational programs, on the Dequality Basic Education Act, House Bill 1154 by Rep. Carson of the 46th, that's the 35th, airheart of the $36 of the 45th Seval, the 34th and others, a bill to amend an act, creating a board of commissioners of Cobb County, House Resolution 664 by Rep. Niel of the 151st, the 111st, and the 12th, Dunhu of the 30th Resolution Authorizing at the Least of Certain State Loan Property, House Resolution 665 by Rep. Niel of the 136th, the 135th Mitchell of the 88th Resolution, compensating Ashley Jordan, House Resolution 666 by Rep. Niel of the 31st, a resolution proposing amendments to the Constitution, so to provide the General Assembly, made by General Law, authorized local boards of education to impose levy and collect development impact fees, House Resolution 667 by Rep. Niel of the 56th, the 176th, the 99th Williams of the 37th Mitchell of the 88th, Resolution creating a House Study Committee on the State Integitation Act, House Resolution 668 by Rep. Niel of the 21st, the 14th, the 11th, the 46th Jones of the 47th, and others, Resolution honoring the life and memory of Officer Jess of W. Berson, and dedicating interchanging his memory, House Resolution 669 by Rep. Niel of the 58th, Thomas of the 39th Clark of the 108th, Kendrick of the 93rd, Alan of the 40th, Resolution committing to uphold the reproductive freedom of education at the 49th anniversary of Roe V. Wade. Senate Bill 330 by Senator Albert of the 56th, the 30th, the 30th, of the 29th Miller of the 49th Court, Patrick of the 32nd, and others, the Bill relating to insurance, the Bill 330-2 by Senator Albert of the 56th, Doug of the 30th, Miller of the 49th Court, Patrick of the 32nd, the 29th, and others, the Bill relating to selling and the trade practices, and the Bill 373 by Senator Ann of the V. Wade of the 31st, the Bill to amend and act creating the multi-member board of commissioners of Harrelson County through second readers. Reports of standing committees, the clerk will read. I'm Senator Carpenter, the fourth district chairman of the committee on creative arts and entertainment. Submit to the following report to speak, a committee on creative arts and entertainment and consideration. The following bills of the House and Senate and the report, same back class following recommendations, Senate Bill 157, do pass, House Bill 1053, do pass, respectively submitted, Representative Carpenter, the fourth district chairman. Perhaps the Darlene Taylor, a 173rd district chairman of the committee on government and affairs, submit to the following report to speak, a committee on government and affairs. Is that in consideration the following bills of the House, the struck committee report, same back class, following recommendations, House Bill 826, do pass by committee, Substitute House Bill 840, do pass by committee, Substitute, respectively submitted, Representative Carpenter, Darlene Taylor, the 173rd district chairman. Representative Bill Workhies, the 157th district chairman of the committee on industry and labor, submit to the following report, and the speaker committee on industry and labor, so that in consideration the following bills of the House instruct a meeting report to the same back to the House, the following recommendation, House Bill 1045, do pass by committee, Substitute, respectively submitted, Representative Bill Workhies, the 157th district chairman. Representative Jan Tankers, the 160th district chairman on the committee on intergovernment coordination local, submit to following report, and the speaker committee on intergovernment coordination local, I sound on the consideration. Following bills of the House, the struck committee report, the same back to the House, the following recommendations, House Bill 1060, do pass, House Bill 1061, do pass, House Bill 1063, do pass, House Bill 1066, do pass, House Bill 1067, do pass. House Bill 1070, do pass, House Bill 1071, do pass. House Bill 1072, do pass. House Bill 1073, do pass. House Bill 1074, do pass. House Bill 1075, do pass. House Bill 1076, do pass. House Bill 1078, do pass, House Bill 1079. Do pass, House Bill 1080, do pass. House Bill 1081, do pass. House Bill 1082, do pass, House Bill 1062, do pass, respectfully submitted, down<|jw|> out may the 160th district chairman. Chairman and committee and retirements submitted the following report. We're speaking committee and retirement is out of consideration the following bills of the house. It's struck to be the report to same back the house. The following recommendations House bill 263 do pass by committee substitute respectfully submitted groups and have Carson the 46th district chairman that completes the reading of reports of standing committees. The President called the mayor for the legislative amendment. Okay. Don't worry about it. We'll get it. Just leave it right then. Okay. Okay. Okay. All right. We're going on now to the local calendar. Going on to the local calendar. Members of the House will please come to order and give attention. Third reading and passage of uncontested local bills. One bill on the local calendar relates to homestead exemption and requires a recorded two-thirds roll call vote for passage. If there is no objection we will vote on the local calendar as a whole with a recorded vote. Hearing none it is so ordered the clerk will read the local calendar. House bill 1060 by Rose of Athens the 144th City of Cochran House bill 1061 by Rose of New Year to the 150th Lee County House bill 1063 by Rose of the Meeks the 178th Wayne County House bill 1066 by Rose of the Green to the 150th. De-Stuart County House bill 1067 by Rose of Green and 150th Stewart County House bill 1070 by Rose of the Helms the 129th Jones County House bill 1071 by Rose of the Helms the 129th Jones County House bill 1072 by Rose of the D allotment 67 of Macintosh County House bill 1073 by Rose of Stevens the 164th Brian County House bill 1074 by Rose of the Parish. Lincoln County, House will 1076 by reps of Taylor on 73rd graded county. House will 1077 by reps of Taylor on 73rd Thomas County, House will 1078 by reps of gold to the 19th ballton county, House will 1079 by reps of dicking the 140th peach county, House Bill 1082 by Rose of Rose 120th Wilkes County. House Bill 1062 by Rose of Camp 131th, Upsen County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of the bills on the local calendar. The vote is 104 in favor. 61 opposed. House Bill 1062 has failed to receive a constitutional majority. What purpose does representative camp rise? To make a motion, sir. State your motion. I wish to request reconsideration on the bill involving Homestead Exemption for Upsen County. Lady has that right and she has given notice that will be taken up at the next legislative day. That was House Bill 1062. What purpose does chairman tanker's leave rise? I rise to make motion. State your motion. I move that we immediately transmit the calendar to the Senate. Chairman tanker's leave is moved that all of the bills that did receive a constitutional majority, which are all those except House Bill 1062 would be immediately transmitted to the Senate. Is there any objection? Any objection? Chair, here's none and it is so ordered. On Wednesday, February 2nd, this House failed to pass House Bill 1029, 1030 and 1031 by the requisite constitutional majority. The Lady from the 47th House District served notice of a motion to reconsider the action of the House in failing to give House Bill 1029, 1030 and 1031. The requisite constitutional majority now is the time for the Lady to pursue the motion if she so desires. Chair recognizes the speaker pro-tim of this House. Thank you, Mr. Speaker. I move that the House reconsider its action failing to give House Bill's 1029, 1030 and 1031 a requisite constitutional majority. Speaker pro-tim Jones has moved that the House reconsider its action and failing to give House Bill's 1029, 1030 and 1031 a requisite constitutional majority. If there is no objection, we will vote on reconsideration of the three local calendar bills as a whole with a recorded vote. Hearing no objection on the Lady's motion at the House reconsider its action and failing to give House Bill's 1029, 1030 and 1031 a requisite constitutional majority all those in favor in favor of reconsideration will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members now voted? If so, the clerk will lock the machines on the Lady's motion, the eyes are 102. The Nays are 64. This House has reconsidered its action and failing to give those bills, the requisite constitutional majority. Those bills will now be back on the local calendar. They will go back on the local calendar and be called to the later time. What purpose does Chairman Ballinger rise? Make a motion. State your motion. I move that the House agree to the Senate substitute as amended by the House for House Bill to it to 1A. Madam Chair, I need for you to come down here to the well and make that motion if you don't mind or even if you do mind. I need you to do that. Mr. Speaker, I move that the House reconsider its action and agreeing to the House substitute to House Bill to 1A. So as I understand your motion, you're moving that this House agree to the Senate substitute to House Bill 218 as amended. House Bill 218 as amended by this House. Is that correct? Okay. Clark will read the caption. House Bill 218, the Senate of Ballinger, the 23rd, followed 32nd Chasperies of the 11th. Another speed tunnel, an act to amend, go to section 1611, 126, the Fisher go to Georgia, to the relating to having or carrying handguns, long guns, or other weapons. The Chair recognizes Chairman Ballinger to explain the Senate substitute and the House amendment. And let me point out we're working off of AM390322. Chairman Ballinger. Yes, sir. On the amendment, you can pretty much disregard. 218 was a pretty bill that we sent over to the Senate, the Senate kind of globged all these things onto it, made it very ugly, and we did not like it. So we basically took it back to what it was originally filed. It allows for reciprocity for permit holders to be able to carry in other states. And that's simply what the bill does. It allows for, we move from general, from specific reciprocity to general reciprocity. That's in a nutshell. I'll be more than happy to answer any questions, but really you need to pay attention to the first page. It's the front and back. That's what we're voting on. Everything else has gone away. You need to pay the first line, say that we're striking all of the subsequent pages. The first page is the only one that you need to pay attention to. That's what we're voting on. Did you yield for questions? Yes, sir. I certainly will. Chair recognizes in the gallery representative Scott for a question. Yes ma'am. She waves. Chair recognizes Chairman Parsons to your left for a question. Thanks, Speaker. Lady Yule. Yes, sir. I think you made this clear. I just want to make sure that I am clear about it. This is AM39-0322. Yes. And what you're doing is amending the sentence amending the sentence substitute, is that correct? That is correct. I'm striking all of the subsequent language. Thank you. Dean for the yield. I will yield for one more. Chair recognizes representative Park to your left for a question. Does the general lady yield? Yes, sir. So to be clear in terms of the effect of this bill, this will allow anybody who obtains a gun in any other state to bring it into Georgia. No, it doesn't have anything to do with bringing guns into the state. It has to do with the rights that are accorded people who have weapons carry permits and it will allow for reciprocity. So if we have a permit holder in Georgia who goes to another state, it would allow for them to receive the rights that those weapons carry permit holders get in that state. So it's like if you have a driver's license in Georgia, you have a driver's license there. So further inquiry? Sure. So if another state has weaker requirements to obtain a gun, then they would still be permitted to bring that gun into the state of Georgia. Doesn't have anything to do with guns. To carry a gun, I'm sorry. It only has to do with a carry permit. That's it. Thank you. Have I said gun it up? This is a lady further yield. I'm good. I think everybody has gotten it by now. Again, we're just voting on the amendment. We're striking everything. The first page is the only thing we're voting on. Thank you. I appreciate your favorable consideration. What's the deal? For those members sitting in the gallery, all of your amendments and so forth are outside the door. If you're looking to the books, we've got the clerk's office checking in on us. We'll be at ease here momentarily. Did we locate them? Is there a cart by the tables? I'm not sure what the issue is, but we're not going to move forward until you have your amendments and can have a chance to look at them. Okay, I'm waiting till they plan. I am sure you will have a quickgraph of how many people create this on their way you you all right looks like you now have them what purpose is chairman Oliver rise parliamentarian inquiry is far because ways. It seems to me it goes that a license holder under the laws of whatever other state can carry his her gun into Georgia. Am I right or not right? All I know is that this issue is a lot more complex than it was last year when this was almost a unanimous vote. Chairman Ballinger, you want to take a stab at that with a parliamentary inquiry? Mr. Speaker, parliamentary inquiry. It is true that recipro- this does create reciprocity. It moves us from a specific reciprocity state to a general reciprocity state allowing the attorney general to enter into agreements to allow for reciprocity. Well-purposed Chairman Oliver Reyes. Final parliamentary inquiry, Mr. Speaker. If that's accurate, which I believe it could very much could be accurate, that means we're giving the power to the attorney general to make-\n\nCan he decision he or she wishes to make on that issue? What purpose does Chairman Ballinger rise? It is correct and that the Attorney General will be empowered to make those agreements with states. Okay. What purpose does representative Wollinsky rise? Parliamentary inquiry. State your inquiry. Thank you, Speaker. This year we know that mental health is a top concern for our state and at a time nationally and in our state where mental health is a big concern. Is it not true that is my concern allowing people to come in from other states with different laws to come here and care in weapons and not knowing their mental health could cause grave danger in our state? Thank you, Speaker. What purpose does the minority caucus will represent into Wilkerson rise? Parliamentary inquiry. State your inquiry. Thank you, Mr. Speaker. Is it, if this is the same 218 that we passed a year ago, is it not true that 69 people vote it no? I don't remember the vote count, but if you want it we can go get it. All right. Final, final parliamentary inquiry. What purpose does representative Wiltson rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, I'm confused about the authority this bill gives the Attorney General. The gentleman stated that the Attorney General would be empowered to enter into an agreement, but in the bill, language in line 29, it says the Attorney General shall enter into an agreement. So it doesn't seem like the Attorney General actually has a choice. Well, it does say shall. You want to take a stab at that where I'm about to vote here. What purpose does Chairman Ballinger rise? Parliamentary inquiry. State your inquiry. The gentleman is correct and that it does say shall enter into an agreement. So it does direct him, however he is empowered to make that agreement. I don't know how to make that more clear. What purpose does Chairman Houston rise? Thank you, Mr. Speaker. Isn't it true that we're trying to revive our tourist trade and tourist industry down in Atlanta, down in the South's near the convention center, World Congress Center? I couldn't think of it. World Congress Center. And isn't it true that the crime rate, if you return on citizens along and hear the crime rate coming through citizen along every day and we have people coming in from out of state, that they need to be able to protect themselves when they come down to the convention center. And thank you. So now we found out what you do. You sit around and listen to your scanner. All right, we're going to... We're not... What purpose does Chairman Houston rise? Isn't it true last night when I was listening to my scanner that I found out that there were gun shots, 0.7 miles away from where I live? Thank you. I've had several nights like that. All right, here's where we are. We're going to take up the House Amendment. Is there any objection to the adoption of the House Amendment? Hearing none, the House Amendment is adopted. Now the ladies' motion that this House agree to the Senate substitute, the House Bill 218 as amended by the House. All those in favor of the ladies' motion will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the ladies' motion. The eyes are 96. The knees are 70. And this House has agreed to the Senate substitute to House Bill 218 as amended by this House. The purpose is representative Mayna rise. Wait. She waits, okay. All right, now we get to go into morning orders. Morning orders. House members will give attention to the members in the well. Chair recognizes for a morning order. Two minutes each, by the way, on the morning orders today. Chair recognizes representative Jackson, Edna Jackson, and all the members of the Savannah delegation for a morning order. Thank you, Mr. Chairman. And to all of the representatives in the House today, this is Savannah Chatham County Day. And we want to make sure that you're going to become a part of the activity on this afternoon. There will be oysters, shrimp, our barbecue, you name it, we have it, but we will also have libations. So come on and join us down at the depot. We'll be waiting on you and we will see you at 5 o'clock p.m. Did I just say? Well done, okay. Well done. Okay, perfect. Chair recognizes representative Hingley for a morning order. Thank you, Mr. Speaker, ladies and gentlemen of the House. As we continue to celebrate Black History Month, there was one who said that service is the rent you pay for room on this earth. She also said, you don't make progress by standing on the sidelines, whimpering and complaining. You make progress by implementing new ideas. She said, if they don't give you a seat at the table, bring a folding chair. So today, we take time to spotlight a trailblazer for women and politics. Shirley Chisholm. Shirley Chisholm was born Shirley Anita St. Hill on November 30th, 1924. She graduated from Brooklyn College in 1946 and earned her master's degree in elementary education from Columbia University Teachers College. And I got a pause for my Delta friends to let you know that she is a member of Delta Sigma Theta Sorority. Shirley Chisholm kicked off her political career in 1953 when she campaigned for Louis Flay, Jr. to become Brooklyn's first Black Judge. Chisholm successfully ran for the New York State Assembly in 1964, where she served from 1965 to 1968. She was the first Black woman elected to Congress using the motto, unbalt and unbalst, which was also the name of her autobiography. During her time as Congresswoman in 1972, 50 years ago, she had the audacity to become the first Black person to seek presidential nomination for one of the two major parties. Doing her run, Chisholm pushed a platform focused on racial and gender equity. Mr. Speaker, we yield today to remember this trailblazer and all women of color who served here, or a debt of gratitude to Shirley Chisholm. Thank you, I yield. Chair recognizes representative Wade for a morning order. Thank you, Speaker, colleagues. I just want to come from my hometown, Dawson County High School, to congratulate the Competition Cheerleading Team on winning Georgia High School Association, AAA State Championship. They're a fantastic group of young ladies who have high energy and they're also high achievers in the classroom, and to those young ladies shout out into the coach who has taken this team to state every year that I can even remember. I'm so happy for you and your efforts with these young ladies. I'm making Dawson County Tigers very thankful. Thank you, sir. Chair recognizes representative Carter for a morning order. Yes. Good morning, if you were read, please join us this morning. Thank you, Speaker, Rostin. Today, the members of the Georgia General Assembly, we join in solidarity with the American Heart Association to bring awareness to heart disease and women. Heart disease is the leading cause of death, and Georgia in many cases is preventable. We want you to know some of the signs. If you have chest discomfort, uncomfortable pressure, squeezing, fullness, or pain that can come and go, discomfort in other areas in your upper body, shortness of breath, other possible signs, call 9-1-1. Since 2020, heart-related deaths have increased by 4.8%. Another sign. If you're fit seeing your face drooping or a side of your body is numb, that is a sign that you're having a stroke. During the same period, stroke deaths have increased by 6%. As we join with the American Heart Association, we put some information on your deaths, and that is their legislative priority. I want to close with this. One of the things that they're asking us to is really look at maternal mortality. Where researchers are finding now that women that have an increase in their high blood pressure, doing pregnancy after birth, that have never had any heart-related symptoms, this is a sign that you are pre-exposed to heart disease. So join in with the American Heart Association, and the Georgia General Assembly. Let's increase medical assistance, Medicaid, for low-income people so that we can do a decreased amount of deaths, a heart-related individuals in Georgia. Thank you, I yield the will. Chair, recognize as representative Hutchinson for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. Today I bring to you 13-year-old Shardavia. Shardavia says that her favorite thing to do in the day is to think about the good things in life. She wants to be a comedian, and she said that her favorite comedian is Tiffany Haddish. She also enjoys swimming, spending time with her friends, and drawing. Shardavia is one of the many beautiful children available for adoption in the state of Georgia today. Thank you, Mr. Speaker, and I yield the will. We are now going on to the rules calendar. Going on to the rules calendar. Clerk will read the caption to House Bill 752. House Bill 752, members of the Cooper of the 43rd, Dempsey of the 13th, and others to be entitled to amend, title 37, the fiscal to Georgia, annotated, relating to mental health, so it's a provide for psychiatric advance directive this bill, I'm referring to the committee. On health and human services, that committee recommends a dispelled do pass by committee substitute. Chair recognizes Chairman Cooper to present the bill. Chairman Cooper in the chamber. Sorry to take the moment. You're recognized. Chairman Cooper. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I've come here many times with bills that will help patients or cost our state with medical problems, but I couldn't be more excited than I am today to bring House Bill 752, because it's the beginning of bills that are going to pass this time to make mental health on parity with just regular health. It's something that has been lacking for too long in our state, and it will help reduce the shame in the stigma that many of the mentally ill in our state feel, and how they feel is second class citizens. As I start this, and there is a folder on your desk that shows all the people that are supporting this bill. And I have to thank one person to start with, and that is Representative Pat Gardner, a Democrat who started this process 14 years ago. It's taken that long for it to become a priority and to work through all of the different legal entities and problems until we have this bill. I want to personally thank the Georgia Psychiatric Physicians Association, the Medical Association of Georgia, and the State Bar of Georgia. And particularly Dr. Peter Ash, the psychiatrist that works so closely and spent hours on this bill, and three attorneys from the bar that did the same, Dan Munster, Kyle King, and Nick Jurek. They have given countless of hours of their time to work through this. What this simply does, when you go to the hospital, you are able to discuss with the physician what kind of care you want, whether you want to follow their suggestions on treatment, or if you have tried some kind of treatment, and it didn't work before, you can communicate with your physician. Often when a person that has a mental illness is in crisis, they are unable to do this. So this bill called PAD, the Psychiatric Events Directive allows a person that is diagnosed with mental illness when they are competent and not in crisis to lay out their preferences of care, to let and to donate some of the treatment that they might want, or that they don't want, who can treat them and who they don't want to treat them? What has worked in the past for them and what didn't work? Sort of a guideline so that when they are in crisis, someone has the ability to know that about their history. It also allows them to appoint another person, somebody that is trusted, that can be involved in directing their care when they are in crisis. Who can look at their medical records, who can talk to the doctor, and who can, you know, if necessary, make changes in what they might have wanted, if that is to their betterment, and making them become better. Basically, that is what the advanced directing does. So, Mr. Speaker, if there are no questions, as I try to catch my breath, I will ask for fable consideration of ASCAL 752, and I will leave the well. Ladies, you'll do the well. There were no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 752 will vote aye. Those opposed will vote no, and the clerk will unlock the machine. What purpose does Representative Williamson rise? He waves. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 752. The eyes are 165. The names are zero. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 867. House Bill 867. House Bill 867, my members, have duet $1,2 third. No, there's been total an act to amend. Chapter 64, Title 33, the Fish Dakota, Georgia, and Senator, relating to regulation in licensure pharmacy benefit managers. This bill now refers to the special committee on quality health care. That committee recommends that this bill do pass by committee substitute. Chair recognizes the chairman of the special committee on access to quality health care, Chairman Newton, to present the bill. Thank you, Mr. Speaker, and I appreciate everyone's commitment to access to quality health care. I know we're working on mental health care, but it's something I know the speaker, and this whole body has been committed to for many years now, access to quality health care, including the first chairman of our committee, Chairman Smith. Thank you for the opportunity. Access to quality health care is all of us know involves not only having the hospitals, the doctors, and the pharmacies that you need available, but it depends on having a health plan that helps make them affordable for a patient. We have an opportunity today to advance affordability for patients in a small but often significant way. That is addressing the patient's out-of-pocket costs for prescription medications at the point of sale. So to understand HB-867 and how it lowers costs for patients, I do have to briefly review the complex process that's developed that determines how a patient's out-of-pocket costs is calculated. PBMs have the role in setting the price both to the health insurance plan as well as the patient's out-of-pocket costs at the point of sale. PBMs are very large corporations, and as a matter of fact, the top three PBMs, only three control access to medication and the costs for over 80% of Americans. So these are large organizations. So what do they do? They agree on a list price for the medication from the manufacturer. They determine which drugs, especially newer brand-named drugs, are even on-formulary, which means they're covered by your insurance or not. Their software determines what price the patient will pay at the counter of any pharmacy whether an independent or chain or anything else at the counter. One final thing the PBMs do is they also negotiate with the manufacturer a very carefully protected, even secret rebate from the list price that's paid directly from the drug manufacturer to the PBM. Some of the newer medications that are out there, and we all see them on television, and there's hundreds of others, and we hope for those of us with chronic conditions that there'll be more and more that make lives better in the future. So on these newer medications, sometimes the rebate could be 20%, 30%, even 60% are higher once again paid directly from the manufacturer of the drug to the PBM. As I said, these are very large and powerful corporations. HBA 67 simply requires that the PBM, when calculating the patients out of pocket cost, that the PBM used the true net price, which is described in the bill. The true net price is just that list price I've mentioned, minus any rebates that are received. So as an example, and I said, these are newer advanced drugs, some of it make a vital difference for patients' life, sometimes keeping them off of disability, sometimes even saving their lives. So let's use an example real quick, which is a new medication that's very valuable and it's a thousand dollar list price. Currently, a patient, if they're in the 20% copay portion of their insurance, would obviously have to pay $200. However, if that drug, a thousand dollar drug has a $600 rebate, if we pass in its signed HBA 67, they'd only be paying 20% of $400 or $80. So you've got $200 or $80 out of pocket. Obviously, if you're still in the deductible period of your insurance, which more and more of us might be, for pharmaceutical benefits, it might be the difference between $400 and $1,000 out of pocket. So as you can say, this can have a massive effect on what the out of pocket cost can be. So four things about what this bill does not do. It's not meant to solve every problem. Number one, it doesn't change plan design. The patient still has to pay 20% of that true net cost, and believe me, that's far more than what a generic would be. So there's still a strong incentive to, when it's appropriate with your doctor to use a generic medication, that's much more affordable. Number two, it doesn't benefit pharmacies or pharmacists in any way financially. There are things that PBMs do with pharmacies and pharmacists that are very challenging, let's say. This doesn't benefit them financially in any way. However, pharmacists are strongly in support of this bill. They are the ones. They're the last one between someone being ill, going to their doctor, deciding on a prescription, taking it and then finding out the price. They're the last one there to counsel the patient on how to take the medication. The importance of taking the medication as prescribed. And so they know that if it's a high copay or high deductible, they're much less likely to get the patient. So they care about affordability and compliance. Number three, HB-867 doesn't really ban the process of paying rebates. That's really outside our scope here in Georgia. It's a difficult thing to do nationally. Some of these are international pharmaceutical companies and PBMs that buy medications from all over. So we don't ban the process. All we do is make sure that the patient receives the benefit. So finally, HB-867 does not raise premiums, which some have accused it of doing. We've corrected this by, you'll notice at the end of the bill, where if there's a PBM that passes through 100% of the rebates to the planned sponsor, whether the insurer or the employer, if they're passing through 100% of the rebates, especially if these are audited, and that planned sponsor decides to lower everyone's premiums equally, then we don't, we don't require, that this bill doesn't affect them. So those plans that exist like that, and with some PBMs, large percentage of their plans are done that way. So this won't affect them at all. It won't cause them to have to raise premiums on everybody so that they can give a benefit to some. So this bill doesn't try to correct that. Finally, there are indications that HB-867 may even lower premiums. From the PBMs own material, and I have one from one of the largest out there, when patients have more affordable prescriptions, lower copays, lower cost at the point of sale, PBMs recognize that they're more likely to get their medicines. They're more likely to take their medications and not stretch them out to maybe every other day for a daily medicine or cutting pills in half or other things, sometimes only picking up half of a prescription. That's what the pharmacists see. When they do comply with the doctor and the pharmacist's recommendation, well, guess what happens? They're less likely to have complications. Anybody knows one of the big complications for hypertension is a renal failure. Well, obviously, medications taken properly can help avoid someone going into renal failure and the expense on a life that that can be. So they're less likely to have complications, less likely to end up in the hospital, less likely to end up in an expensive emergency room. Taking patients out of the middle of what are often complex challenges in healthcare has been a strong desire and goal of this body. There's been great progress. I know with Chairman Harkins, House Bill 888, Surprise Medical Building, legislation was signed into law that when it came to Surprise Medical Bills, we took patients out of the middle. Last year with House Bill 454, we dealt with the issue together of a healthcare provider, a doctor being dropped out of network in a middle of a patient's plan year and they can no longer use that doctor. So we worked on once again taking the patient out of the middle. I do hope that we'll join together once again and when it comes to fair prices for prescriptions that will once again take patients out of the middle and by doing that will help hundreds of thousands of Georgians with more affordable healthcare along with your support for House Bill 8867. Thank you, Mr. Speaker. I'd be glad to answer any questions. Do you yield for questions? I do. Chair recognizes Chairman Lynn Smith to your right for a question. Thank you, gentlemen. You'll be glad to. Gladly. behalf of all the people I represent in the House District 70, I speak for them to say thank you very much for your diligence and your patients as you work through this very important issue. Thank you. Thank you, ma'am. It is a large team of us that work together as you know and I appreciate your district. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Do you further yield? Yes, sir. Chair recognizes Chairman Ron Stevens to your left for a question. Gentlemen, yield. I will, sir. In the true what your bill does more than anything else is strip away and get to transparency. When you say that probably is the root of your bill? It is a key part. Once again, we've kept it very narrow. We've kept it narrow to where the transparency is only where it hits the patient in the pocketbook. Recent Supreme Court decisions have concluded that states do have the authority to make sure that when it comes to cost, and that's the main thing this bill is about, it's cost not planned design, we are fully within compliance with all laws and regulations to address costs and save the patient money. Thank you, Mr. Chairman. Thank you, sir. Do you further yield? One more, sir. Chair recognizes Chairman Knight to your right for a question. Make sure to. This is your.\n\nYou know, I'll yield for a short question. Isn't it true that you work very hard on this bill and I for one are very appreciative as I know this general assembly has taken very seriously the role of That we have to make sure patients have access to good health care That's correct sir and access includes affordability Again, if you would one more another bar man great isn't it true just to reiterate what you said I think this is key is that this only is about the patient and so The heart of this bill is is that when that patient goes in is that their copays are determined off of the real price the actual price true net price true net price which is the rebate Okay, the difference between the rebate and what the drug actually As cost it would be the difference between the list price that's out there and the price after rebate their Their copay and their percentage is based on the true price and so therefore that is making sure that the patients have a true copay based on the true cost of the drug Not an artificial list price, which is what is included with the rebate? That's correct. I think the gentleman for his hard work on this bill. Thank you sir. Thank you mr. Speaker. I'll yield the will Gentlemen has yielded the well is there any objection to the previous question being ordered the chair here's none The previous question is ordered is there any objection to adopting the committee substitute? The chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass All those in favor of the passage of House bill 867 or vote aye those opposed to vote no and the clerk will unlock the machine You Have all members voted Have all members voted If so the clerk will lock the machine on the passage of House bill 867 the eyes are 166 the nays are one this bill having received the requisite constitutional majority is there for a pass Clerk will read the caption to House bill 873 House bill 873 to be titled an act to amend an act creating the Board of Commissioners But when that county this bill I'm for the committee on governor LaFaire's that committee recommends that this bill do pass by committee substitute Chair recognizes before that let me let me say the rules committee voted to limit debate to one hour To be allocated by the chair the chair will allocate that 30 minutes each that will not include The presentation by the author it will not include the minority report and it will not include the chairman's time and With that the chair recognizes chairman rich to present the bill Thank you mr. Speaker and ladies and gentlemen of the House today I rise to present to you House bill 873 which provides for the redistricting of the four Gwyneth County Board of Commissioner districts The map contained within this bill complies with the law ensuring one person one vote The districts are compact as you can see we are going to have a digital Copy of the map up on the screen so you can see what this looks like and The lines are drawn to respect the various communities of interest in Gwyneth County In district number one you see in the blue there we have the densely populated suburban urban cities of Duluth Berkeley Lake, Norcross and Peachtree corners This district borders and shares interests with the de cabb cities the de cabb County cities of Dunwoody and Doraville And the Fulton County cities of Sandy Springs and Roswell District number two is shown in the pink This is primarily a little burn and the unincorporated areas surrounding Lilburn it borders the city of Tucker and de cabb County It is one of the older parts of Gwyneth County It's an area that is working to revitalize and redevelop its business district District number three is shown in the gold this includes Snellville and most of our county seat Lawrenceville as our county seat Lawrenceville has a thriving historic downtown district and an arts community Lawrenceville along with Snellville they comprise a more urban part of our county The people who live there tend to do their shopping dining and Recreating within their own communities and over into the areas of de cabb County that they border The northern part of the county is shown in green and this is a less densely populated area It consists primarily of Buford, Sugar Hill and Swanee It actually has four cities that share That are shared among the counties of Hall, Barrow and Jackson This part of the district this part of the county borders Hall County and Forsyth County And it is and Jackson County and it is the most newly developed part of the county and is primarily suburban and rural I will note that every district Shown here is majority non-white which is in keeping with Gwyneth's diversity We all received a handout that had a population breakdown And it is misleading I am assuming it is because of a lack of understanding of the law and that it is not intentional the correct numbers for this district Take into account the total population the numbers that you received on the handout are only for people over the age of 18 and according to the population summary for the total population which is what we use in redistricting to ensure one person one vote The majority of all of these counties are majority non-white all of these districts Including the northern part which is the part that I represent and the part of the county Where we have constituents who have been coming to us and expressing their their displeasure with not having representation at the county level The purpose of redistricting is to draw maps According to the population and the population ships and that means Reworking of the boundaries to ensure compliance with one person one vote and that is exactly what the maps that are included in this House bill 873 do and with that Mr. Speaker I will yield for any questions You Have some questions Chair recognizes chairman of stration to your left for a question Thank you Mr. Speakers the General of the yield I do It is not true that the procedure employed in the proposal of the Gwyneth school board maps Allowed for a survey open to the public with two different different options for submission of public viewpoint as to which of the two maps would be best And that same procedure was not followed in the proposal of the Gwyneth board of commissioners map Yes, that is correct and that is probably why we were able to reach 100% Consensus within our delegation on the board of education map Is it not true also that Concerns were expressed at the Gwyneth delegation meeting about the lack of a compact lack of compactness and Communities of interest specifically by myself with respect to transportation needs and priorities within the respective Commission districts including district three Which which my district my the house district I represent falls into in many ways is that correct? Yes, that is correct Thank you. Thank you, Mr. Speaker chair recognizes representative McLeod To your left for a question Does a gentle lady yield yes idea What is a conservative district and a bedroom suburban district could you describe that for me a Bedroom suburban district are you referring to my comments in the rules committee from yesterday? That is primarily a community where people live there are not businesses there That will bring other other people into the community. It is primarily a bedroom community residences That's a gentle lady further yield. I do So you're telling me that no one eats and hang out there No, that is not what I said This is primarily where people live. It is not an area that brings others into the community other than The people who live there there are restaurants that maybe some people come to but primarily the businesses that are there Serve the people who live there does a gentle lady further yield yes, I do is The correct that you are a minority in the delegation in Gwyneth County and you've chosen to make this map on your own It is true that as a Republican I am a minority in the delegation But it is not true that I chose to make this map on my own I'm joined by all of the other Republican members of the delegation as well as our constituents who have encouraged us to Draw a map that more fairly represent our county does the lady I'll deal for one more representative McLeod and then we'll move on to someone else So you don't think that our constituents matter and do you not know that the Diversity in Gwyneth happened organically I Do believe that all of the communities in our county matter and that is why I drew lines that Represent those distinct communities. We have urban suburban communities. We have more urban communities and they have different interests and different needs legislatively and that is why it is best that we keep those communities of interest together Our older aging infrastructure and our older parts of our county they need attention and Different they have different legislative needs and policy needs than do the more newly developed areas Mr. Speaker I will yield for a question from another representative Chair recognizes Representative camp here to left for a question Does the General Lady yield I do is it not true that approximately in Gwyneth County? There are about 60% Democrats 60% Republicans yet all four of the seats that are held are by Democrats as well as the chair at large Yeah, so the it is Gwyneth County is comprised approximately of 60% Democrats and 40% Republicans and yes all five of the County Commissioners are Democrat. Thank you Chair recognizes chairman Halston to your right for a question Thank you, Mr. Speaker I Isn't it not true that I would like to thank you for putting this colored map on the screen? And isn't it not true that I got this on my desk and it is not true I put my glasses on and it would make people lead to think you didn't have but two representatives in Gwyneth County And is it not true? I appreciate it. Yes. Thank you. Thank you All right, Mr. Speaker. I will yield the well as I know that there are other people who are lined up and signed up to speak to this bill Lady is yielded the well We do have other members who wish to be heard The opponents to the bill will have a collective time of 30 minutes And we'll just turn the clock on and when it's 30 minutes is up. It's up Chair recognizes representative Jasmine Clark to speak to the bill Thank you, Mr. Speaker Colleagues today you are being asked to make history and do something that this body does not do Today you are being asked to treat a local redistricting bill as a general bill Which is arguably unlawful to ignore the will of the majority of the delegation And to abandon the customs and curses of this body for local matters And vote on a substitute map that is only signed by one out of 13 members of our delegation or 8% Is not supported by our local board of commissioners 92% of our delegation nor has been properly vetted by the public But before you push your button at today and forever change the course of how we treat local control and home rule When it comes to redistricting I would like for you to at least make an informed decision Throughout this process a lot of things that have been said that are not true And I think it is important that we correct the record so that least when you cast your history making vote today To eliminate local control henceforth you will not do so under false pretenses First it was falsely stated during the governmental affairs committee and then repeated during the rules committee That the author of the substitute had been communicating her desires since December While this meant there while there may have been some vague texts and phone calls with the county lobbyists The board was not given a proposed map and the corresponding data until 1 a.m Sunday morning this Sunday Now back in my 20s I might have gotten an email at 1 in the morning But as I get up in age an email sent at 1 a.m. Might as well be sent the next day Sunday morning 4 4 days ago The board was given the information they needed to consider a proposal and there was less than 24 hours Between them receiving that information and the maps being released to the media It was also falsely stated during the the governmental affairs committee and then repeated during the rules committee That months once a map was proposed no one responded and I quote with any comments whatsoever That is a direct quote from the rules committee The truth is the author of these maps in a PDF file of a map with no corresponding Appliction data as soon as the map was sent the county lobbyists responded and asked for data that corresponded with the map again That request was not fulfilled until 1 a.m. Last Sunday in the middle of the night and not received until the next morning Also the original map that was sent to the board was numbered in a manner that would have potentially shortened the term of one commissioner And linked in the term of another This required a legal opinion from the county attorney I just want to remind you all this is all happening last Sunday Sunday of this week By the time the lobbyists had information to reach out to each member of the commission for feedback and get a response From the county attorney the author of the substitute map had already sent out a press release and the chair of governmental affairs had already scheduled a hearing at 8 a.m. Tuesday morning the board of commissioners and the county lobbyists were under the impression that there would be time for negotiation But it seems as if the author of the substitute map was playing them the whole time and never had any intention to negotiate further So to be clear the board was in contact with the author of the substitute map almost immediately After it was sent but they were not given adequate time to respond with their concerns before the maps received a hearing and were passed out of committee Another false statement that needs to be corrected is the assertion at the board of commissioner maps where a partisan gerrymander As you will see later these maps made minimal changes to the existing commission districts You can see that on your desk as well It did not carve up the north into three districts as was also falsely described by the author of these maps It instead prioritized Prioritized the request of the community And moved lines to avoid split cities and split precincts Interestingly, however, the original map drafted by our board of commissioners included at least one competitive district While the current map is a clear partisan gerrymander and creates a plus six r district in the northern part of the county But the author of the bill made it clear multiple times in her remarks during our official Public hearings on the original board of commissioner maps that she wanted a conservative conservative Northern district she admitted publicly on the record that her intent was to create a republican district that is partisan gerrymander Another false statement that was repeated in both the government affairs Government affairs committee hearing and in the rules committee hearing was that the map proposed by our board of commissioners split Her constituents into three districts at one point the author specifically states that it happens to her district I took a look at the board of commissioners proposed map and noted that district 97 is nestled solidly in one Commission district. It was not split Interestingly the author's current district would only be split by her current substitute map proposal So then I thought maybe it's the new district for 100 that was drawn in the latest reapportionment But even that district was not split by the board of commissioners original map Words matter none of her constituents were split by the original board of commissioners maps Her map splits her district While it can be hard to clearly define communities of interest I also want to talk about splitting Arguably cities are a good place to start and while the board of commissioners map does not split cities One of the number one priorities identified by the community at a series of open houses Helped by the board of commissioners the current substitute maps split multiple communities of interest Including the city of Lawrence will which gets splits into three districts a city split in three And the city of Suwani which gets chopped in half Another false statement that I would like to correct for the record is where our current commissioners live It has been it has been stated several times and multiple committee hearings that all of our commissioners live in the southern portion of the district While it has been repeated several times and notwithstanding how divisive that statement is this is simply not true While there are several other false statements made throughout this process I think we need to point out that there is this map is questionably in compliance with section two of the voting rights act And even though it does create a total population of 48% in this northern conservative northern district The voting age population is in fact over 50% And The truth is in our county This is a majority of people of color that saw a significant growth in all demographics Except for the white population which actually decreased by 12% Again, I truly question the constitutionality of this proposed map and its compliance with section two of the voting rights act Additionally this proposed map cracks the Asian population one of our fastest growing populations in the county So much that they go from being the second largest voting block in district one and the original map To being the smallest voting block in every single district in the substitute I believe that information is power and misinformation is destruction And all things that we do in this body the one thing that we should all be able to agree on Democrat or Republican is that honesty is the best policy And misrepresenting events and data should never be in order within this chamber Now that the record has been corrected I would hope that when you cast your vote today you will do so armed with the truth with a clear conscious and Conscience and with the knowledge that a vote for this bill is a vote to end local courtesy Local control and will set a precedent that no local governing body is safe Whether you are a member of the minority party or you are a member of the majority party that will not fall in line or go against the establishment No one is safe if what is happening today is allowed to prevail That is why I am asking you all to vote to preserve the customs of respect for the will of the local delegation And I'm asking you to vote no on this bill. Thank you, mr. Speaker Chair recognizes representative McLean to speak to the bill Thank you, mr. Speaker Today I rise in opposition of hb 73 Hb 873 when it was introduced originally it was a great bill The delegation had input from the community and had input from the elected officials It had input and it was transparent and open Transparent and open and inclusive Which citizen wouldn't that all deserve all citizen wouldn't that deserve to be heard and the all Local legislation should have transparency Well The legislation that you heard from the chair lady Was not open it was not transparent And was definitely not inclusive because no one from the delegation was involved You know i i speak from someone who moved to to go in that in 1978 And you know we're not i'm not gonna save much other than i was 24 years old when i moved there And so i don't want y'all to be trying to get get my age anything But when i moved there in 1978 it was 70,000 residents in winette county My wife my two children in which i raised We still live in the same home off Pleasantville road So i just want you to know we bought that home in 1979 That was 43 years ago 43 years ago Yes It was still large But i want you all to know that when i moved there the family moved there it had great schools And the community the county was was responsive and what we had the most of Was everybody got alone in winette county remember i said 70,000 residents But let's fast forward today we're we're slightly under one million one million for 20 years and for 20 years Consequently we were the fastest growing county united states Well The reason i tell you all this is because in 1978 when i first went there It would only take me 10 minutes to get to work. I worked at the Falcon Complex It took me 10 minutes to get eight miles a mile and a half down Pleasantville six miles to get to swanye There were no lights Now it takes me 10 minutes to get out of my subdivision So i say all of that to say that It has grown and i have seen a lot of changes. I want you all to know i have seen a lot of changes In fact miss 78 when it kind of was ran by democrats When i moved there 79 still ran by democrats uh 1980 well President Carter kind of helped us out a little bit uh For president reg and beat him and so therefore what we had was a sweeping winette county as well So 1980 Since 1980 i want to hear this since 1980 Republicans have ran Every commission seat every DA every sheriff i mean has ran everything And winette county since 1980 Well, that's fast forward scene. You know, so i've seen a lot. I've seen the traffic I've seen the schools grow. I mean some of the cities grow We didn't have that many cities either In fact my little two lane on Pleasantville road went from two lanes And in fact if you got by the river you had to slide over to the side to let another car pass But now it's six lanes it is six lanes and i got three turning lanes on club drive How many people can say that they have three turning lanes on one street not one Not two, but i got three Three turning lanes when you were traveling well I just want you all to know that my concern is And 70 and 80 so 38 years later here. It is 2018 And winette elect their first democrat first woman of color 2018. That's 38 years 38 years Think about that 38 years 2018 It took it took 38 years well then in 2020 What you had was They elected all democrats in 2020 Why because the citizens looking for someone that was transparent Someone that was open and someone that was inclusive and not someone going in back rooms making deals I don't know because i wasn't invited to any of the The the meetings that my colleague had and and i am very open because like i say i am part of good at I've lived there 43 years in the heart of guineat pleasant hill road is the heart of guineat And that is the cities of lilovin lawrenceville norcross and deluth Which is the heart and i would like to say to y'all We must We must when we vote we've got to realize all we voting for the citizens of guineat This bill should have stayed local It should have been packed don't get me wrong as you look at the map The north end is packed that is that is not well good That is not the guineat that i've known and that is not the guineat that we had in 1980 census the 90 census the 2000 census the 2010 we didn't have that We didn't have it we didn't have any packing Because we are one guineat we are one guineat So i'm asking this body Today to vote no on this substitute map because many of you all know me and i've all had one saying Right is right wrong is wrong I've always said right is right wrong is wrong and this is wrong This is very wrong to allow the citizens\n\nto not allow the citizens of Gornet to have any input, any input in this map. They had no input. You know, maybe her constituents had input, but my constituents did not have input. And I don't think the other legislators as well. So I do believe that elected officials should not pick their constituents, but their constituents should pick their elected officials. Thank you, Mr. Speaker, and I will yield the will. Chair recognizes representative Liam to speak to the bill. Thank you, Mr. Speaker. I would like, above all, to do my part to center this process of local redistricting around not us, but the people and how we construct our government that best responds to their needs. I am saying all this from the perspective of someone who actually has the most non-white house district in Gornet, but also happens to live in the most under-resourced area of the county over 50% of my district are immigrants like me, but I also have over a third of the county's qualified census tracts six out of 16 specifically. And it's a place where economic development, unfortunately, since the 80s boom in Gornet, missed us by about two exits on I-85. And I'm saying all of this as someone who's constituents across the political spectrum, or those that just don't care about politics generally, feel that in terms of zoning, development, and provision of basic services, certain boards haven't always been the most responsive. And often the issues people care about aren't at all partisan, but bureaucratic, red tape. The issues that are best solved by really listening to what people are saying. No government body is perfect though. We can always strive to be better, all of us, at being responsive. And the current board and I, myself, don't always agree. Every single time I'm drafting them yet another crazy ordinance proposing a low income home-set tax exemption, pleading for yet more ARPA fund allocations to my QCTs, asking for speed humps from spot funds, are showing up to argue against yet another proposed gas station zoning on Jimmy Carter Boulevard. But I do appreciate that each of them, literally all five of the current ones have taken the time to listen extensively to me and the needs of Gornetians. And from everything to broadband, to indigent medical care, to affordable housing, I am grateful for the work they've done, particularly for under-resourced areas like mine. Because again, it's not about us as elected, either state lawmakers or commissioners, or our own partisan affiliations and identities. It is about the people. To that point, I am also grateful for our five commissioners for doing extensive public outreach before coming up with their map, even with a relatively short timeline against their backs. I know I, myself, admittedly have had to take a beat and really analyzed all of the proposed maps. From all of the public outreach and with, I hope, not a totally naive prayer that there is still time to respond, at least partially to what people have said, I profit two things. First, we know there are many ways to draw maps, even beyond all the maps that have already been proposed. I unequivocally support the map that our commissioners worked on that also went through our delegations to public hearing, something I don't think many other delegations did. That said, I do readily acknowledge that other maps may be able to prioritize some of the same principles and arrive at not the exact same outcomes with absolutely zero deviations. Second, and more importantly, adhering to those principles, we seem generally at the broad level to agree on. There are a few points I do hope we might still be able to address, and this is coming from a very personal perspective. Because of the way the lines are drawn in the current bill, naturally occurring Asian-American communities are split among two districts, including one where I live. Two naturally occurring Latino-American communities like the community of Norcross where I also live are split among two districts. The current map, as also has been said, does split more cities like Lawrence, Ville, and Swani, rather than keeping them intact. And again, the district where I currently live would go from having four of Gwyneth's 16 cities to merely one, which will certainly have implications. All of this does matter in terms of abilities for these groups, potentially to elect candidates of choice, and that is obviously very important. But from a very real day to day perspective, it is also important to focus on the impact on governance after an election is over for our communities. Because ultimately, whoever is elected, whatever their affiliations, our commissioners, excuse me, do need to be more responsive to these communities daily. Some district lines to take into account naturally occurring communities is what facilitates that responsiveness and the daily work of governance. And I think in all of my naivete together, we still have a chance to do that, to edit this map here or in this Senate to address existing points. In service, again, I will say one more time. Not of ourselves are local electeds, but again of the people who absolutely deserve wherever you are to have the most responsive government possible. Thank you, Mr. Speaker, and I yield the well. Chair recognizes Representative Beth Moore to speak to the bill, and you have eight minutes left. Thank you, Mr. Speaker. I think I can get this done in eight minutes. Good morning, colleagues. I'm grateful for the opportunity to speak with you today about this bill. But more importantly, I'm just grateful to speak with you. I only regret that half of this room is empty, so I hope that my message does reach the folks in the snap room and out in the hallway. It's no secret that my time in this chamber is coming to a close after this session. But as our other Department colleague this week said earlier, I'm not dead yet. We still have lots of important work to do together, and hopefully our work together will continue next year under a slightly different configuration. Because what I enjoy most about serving in what the speaker calls the people's house is, in fact, the people here. Every day we come in, we say, good morning, how are you? How's your family? We learn about each other's lives, and we become friends. As the day goes on, we engage in earnest debate about some of the most important policy decisions that affect Georgians. We win some, we lose some, and yeah, my side tends to lose a lot. But for those who don't know what it's like to be in the minority party, I'll put it to you this way. After a long, frustrating day, I go home. Sometimes I cry a little. I lose a little bit more of my sanity. And then I dust myself off, I get a good night's sleep, and I come back the next day to say to everyone here, good morning, how are you? How's your family? Why? Because I refuse to abandon my naive ideal that no matter what, at least we follow the rules here. We follow the rules, and when we lose, we lose fair and square. Just because I don't like the results does not mean that the process failed. But this bill, this bill is testing my result. I do not recognize what is happening here. And I suspect that neither do many of you. This bill was introduced originally as a piece of local legislation that in accordance with our county by laws requires the approval of the majority of the delegation. We had a map, a very conservative map, in that we had a map that altered very little from the original map that's been in place for the past decade, which you can see on the screens here. Map number one, the map we have now, map number two, the one that the delegation agreed to propose. Map number three is the one that we're considering here today, which radically reconstructs a county that governs nearly a million people. The delegation approved map, map number two on the screen here, was available for public viewing for weeks. The county commission held five open houses on that map. The delegation held two public hearings, one in person and one virtual. The bill was then supposed to go through the Intergovernmental Coordination Committee, and then onto the local calendar, just like every other local bill. For weeks, we in the delegation took in public comment. We posted the maps on social media. We fielded phone calls and emails from our constituents. We talked with our local municipal leaders, faith leaders, business leaders, everything was done above board, until it wasn't. Until the rules for local legislation were no longer being followed. And if the rules are not being followed, my friends, then the rules, excuse me, the results of these proceedings have to be illegitimate. Without rules, there's no law and order. If there's no law and order, then we are simply living in a failed Democratic Republic. By even considering this bill today, we are effectively telling the public that corporate bylaws no longer have to be appelled, that HOA covenants no longer have to be enforced, that city charters no longer exist, and that contracts are no longer binding. That is not wisdom justice and moderation. That is foolishness, lawlessness and chaos. I'll wrap up soon, but I'll leave you with this. When I first came into this chamber nearly four years ago, I came here with the intention of being honest, congenial, and open-minded. I've enjoyed making genuine friendships with members of both parties. We have sat together, we've shared meals together, we've gone through leadership training together. I've lent my voice and my vote to support some of the bills that were not popular in my party because I believed it was the right thing to do. And now I'm asking you to do the right thing, too, by voting no on this bill. If not because of the substance of it, then please do it because the procedural violations that we're witnessing now has cast a shadow over the entire bill. And I know that asking you to vote no is tough because it requires a level of courage that is uncomfortable for most of us. I know that some of y'all will never vote against your caucus, ever, and I get them. Some of y'all are afraid that if you vote against leadership it could put your chairmanship or vice chair position at risk. I know that. But isn't democracy important enough to pay the price of temporary discomfort? None of us here serve a human master. We all take the same oath of office to uphold the laws and the constitutions of the United States and the state of Georgia. And by extension the rules and bylaws of this house. These proceedings violate that oath. A no vote today is a vote to hit the pause button. A no vote today is a vote in favor of the rule of law. A no vote today makes you a friend of this chamber, both for the members serving here now and the ones that are yet to come. All we're asking for is that this chamber respects the rule of law, that we respect the bylaws that govern our county of nearly 1 million people. A county larger than six states. We're a large delegation but we know our county well. And our local leaders have proven themselves trustworthy to lead our diverse community. This respect, local control, local rules and local processes. Let us do unto others as you would have them do unto you. And so colleagues, both those sitting here in the chamber, I appreciate your time. I hope those in the break room can hear me. This is my ask of y'all. I am looking for approximately 15 brave souls among my Republican friends who know that what I'm saying is true. Who are willing to do the right thing and vote no on this bill? Are you one of them? I certainly hope so. Thank you, Mr. Speaker, I yield. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. So now go to the minority report. Twenty minutes by rule is allocated to the minority report and the chair recognizes representative Park. Thank you, Mr. Speaker. Before I begin my remarks, I would like to direct your attention to the local redistricting map at issue, which members of this body have apparently found so offensive that it has warranted unprecedented legislative action that undermines the integrity of house proceedings. Under left, you will see the current district boundaries for the Winnet Board of Commissioners that have been in effect for the past ten years. In the middle, you will see the proposed map carefully drafted with public input from Wunette residents and voters over a two-month period of time. Unanimously passed by dual elected Wunette Board of Commissioners and supported by an overwhelming majority of representatives and senators who were elected by and for the purpose of serving all of the people of Wunette County. Accordingly, I rise to strongly urge each member of this House to vote no to the Committee Substitute for House Bill 873 for the following reasons. First, the Wunette Legislative Delegation and the Wunette Board of Commissioners conducted a fair process, one that was transparent, inclusive, and legally compliant in every way to produce a fair map, one that abides by traditional principles of redistricting, reflects the priorities of Wunette voters, and complies with all applicable federal and state law. Second, by voting no, you have an opportunity to demonstrate moral courage and put people and principle before political party. A no vote to this use or patient of local control would demonstrate allegiance to the principle of local control and home rule, which ensures the American people that we the people remain sovereign and have the freedom to govern ourselves as it should be in our democratic republic. Lastly, as it is not yet too late, I urge members of this House to vote no to protect the integrity of House proceedings. For the public record, I attest that the following timeline of events is a true and accurate statement of fact, which is supported by written documentation, which I would be more than happy to share with any member here, members of the media, and any court of law that may end up having jurisdiction over this matter. On Thursday, November 4, 2021, at 2.50pm Eastern, as Chair of the Wunette State House Delegation, I sent an email to all members of the House and Senate, Democrats and Republicans, who were members of the Wunette State House Senate and House and Senate Delegation stating, to ensure all members of the Wunette State House and Senate have an opportunity to engage in local redistricting matters regarding the Gwinnett County Commission in a transparent and inclusive manner, which comport with principles of fair redistricting. I look forward to scheduling open meetings and public hearings for Article 2, Section 4 and 6, respectively of the Wunette Delegations' bylaws over the coming months after we get through special session. On Thursday, November 11, 2021, the Wunette Board of Commissioners announced by press release a series of open houses to provide information on local redistricting and to receive public input on what Wunette voters and residents prioritize and how district lines would be drawn. The first public open house took place on Wednesday, November 17, 2021 at the Duluth Branch Library in the City of Duluth, located in the northwestern part of Gwinnett County. Four more open houses were conducted during the months of November and December 2021, including at the Gwinnett Justice and Administration Center, located in the heart of the county, the county seat of Lawrenceville, which is located again centrally in Gwinnett, the centerville senior center in Snellva, Georgia, located in the south, and the Ducula Park Activity Building, located in the city of Ducula, which is in the east of the county. On Friday, December 17, 2021 at 5.42 PM Eastern time as chair, I sent another email to all members of the Wunette State House and Senate Delegations, along with all local elected officials from the Gwinnett Board of Commissioners and the Gwinnett Board of Education, Republicans and Democrats proposing a timeline for local redistricting to quote, provide certainty on next steps and ensure there is a fair process to produce fair maps. In that December 17, email I wrote that local ads will be published for the Board of Commissioners and the Gwinnett Daily Post on January 5, 2022 and on January 10, the first day of the 2022 legislative session, local legislation will be introduced with the Gwinnett Board of Commissioner and the Board of Education's proposals. I further made note that we would hold at least two public meetings in January 2022 to take into consideration public comment and feedback from members of the legislature to complete the process of local redistricting by the middle of February 2022 in cooperation with all members of the Gwinnett State House and Senate Delegations. On Monday, December 20, 2021 at 5.32 PM Eastern, the county attorney for Gwinnett sent an email to Gina Wright and Brian Knight on which I will see seed with five attachments containing the Gwinnett County Commission Districts Redistricting Map submission for technical review and certification by the legislative and congressional reapportionment office and compliance with OCGA 281-14. On December, on Tuesday, December 21, 2021 at 8.39 PM, Gina Wright acknowledged receipt of Gwinnett County's proposed map. They're obtaining certification from the Georgia legislative and congressional reapportionment office as required by Georgia State Law. On Tuesday, January 4, 2022 during the general business meeting, during their general business meeting, the Gwinnett County Board of Commissioners unanimously adopted the original map contained in House 873 that makes minimal changes again in the middle of the screen above you. Later that day at 7.58 PM Eastern, I received an email from Gwinnett County's lobbyist with five attachments providing all information and data for the proposed map. This was the first time I saw the proposed map for the Gwinnett County Board of Commissioners, which I then sent two hours later at 10.14 PM Eastern on January 4 to all members of the Gwinnett State House and Senate Delegation, Democrats and Republicans for their review and consideration. Starting to the Gwinnett Board of Commissioners, the proposed boundaries that make minimal changes to the current structure of local government in Gwinnett were based heavily on public input received during the five open houses conducted throughout Gwinnett County, North, South, East and West. Those meetings indicated that Gwinnett voters and residents were most interested in the following components. Voting precincts, cities, neighborhood divisions, school zones and overlay districts such as community improvement districts. With this in mind, the Board of Commissioners drew a map that improved the integrity of each of these facets from the 2010 or current map. And regards to voting precincts, the district boundaries of the original map respect the county voting precincts with no splits. Per the state of Georgia's analysis, I do not know whether this new map in the committee substitute has any splits in voting precincts, as I've only seen this new map for the past three to four days since it was first published on Monday, January 31, 2022. I have not been able to receive independent analysis to determine whether or not there are any voting precinct splits. As to cities, the 2021 proposed boundaries for the Gwinnett Board of Commissioners map respecting the existing city boundaries with a greater integrity than the current 2010 districts. The Board of Commissioners map again in the middle which we propose, takes into consideration the growth of cities and any annexations that may have occurred, keeping intact and preserving the character area of every single one of Gwinnett cities located in the North, South, East and West. Although keeping cities together was the most important priority of Gwinnett voters and residents, this new map in the committee substitute splits two cities in Gwinnett County, the city of Sawani is in two districts, and for some reason the committee cities splits the county seat of Gwinnett, the city of Lawrenceville, and two three of the four county commission districts. During neighborhood divisions, the original map had some splits in neighborhood development across district lines due to growth of subdivisions. The proposed districts intentionally avoid splitting neighborhoods or character areas which share cohesiveness. If y'all did not know, Gwinnett is the suburbs. We got bedroom communities throughout the entire county, North, South, East and West. Other than a verbal description of the need for a northern district in Gwinnett which based on racial demographic information is majority white, that's just the facts. I am unaware whether the new map in the committee substitute preserves the character areas of neighborhoods throughout the entire county, again due to the lack of time provided for independent analysis and consideration. While school zones were affected by splits in the original map, again in the middle, the impact is reduced compared to the current composition of the districts on your left. Again, I do not know whether the map in this committee substitute improves the integrity of the current map as it relates to school zones. I would note that the map for the Gwinnett County Board of Education that has bipartisan support, as previously mentioned, makes minimal changes to the current structure similar to the original map that was the Gwinnett Board of Commissioners proposal that has now been stripped away from House Bill 873. Lastly, as to overlay districts, the original map has zero splits in Gwinnett County Community Improvement Districts and overlay districts. The original map has minor splits for Gwinnett's tax allocation districts. It is unknown whether the new map in the committee substitute has taken any of the public's priorities into consideration other than partisanship as explicitly stated in public, which is closely tied to race as voting is extremely racially polarized at this time. As to the demographic composition of the Gwinnett Board of Commissioners map, compared to the unilateral new map introduced earlier this week that is opposed by the Gwinnett Board of Commissioners and more than two-thirds of state elected officials who represent Gwinnett County, the county's carefully crafted and vetted legally compliant map ensures that every Gwinn nation who calls Gwinnett home regardless of the district they reside in has an equal opportunity to elect their candidate of choice and have a seat at the table in their local government. Each of the four districts in the original map are demographically representative of Gwinnett County as a whole. Based on the 2020 census, Gwinnett County is 35.4% white, 29.8% black, 21.7% Latino, 12.5% Asian, and 0.6% other. To make sure we are comparing apples to apples, based on the population summary of the voting age population of those 18 years and older, as there is no single racial majority in Gwinnett County, the original map does not create any district that has a majority of one race to the detriment of any other. Instead, the original map creates a plurality white district with 42.2% percent of white voters over the age of 18, a plurality black district of 40.03%, a plurality Latino district with 32.61%, and a near plurality Asian American district in Gwinnett of 22.4%. On the other hand, despite publicly stating multiple times that the committee substitutes new map does not create a majority white district in the most diverse county in Georgia, based on the population summary from the Georgia Legislative Congressional Office of Gwinnett residents over the age of 18, the new committee substitute does just that creating a district with 50.82% of white voters in the most diverse district in the state of Georgia. This new map that one member of the Gwinnett delegation has forced through the legislative process further dilutes the voting power of minority communities decreasing the plurality black district to 37.75%, the plurality Latino district is decreased to 29.95%, and Asian American representation is decreased in 19.42% respectively. To create this majority white voting district in Gwinnett, this new map took white voters out of all the other districts, increased black and litita voters in three other districts, and decreased Asian American representation in three of the four new districts compared to the original map. That is what y'all are voting on today. Going back to our original timeline, after HB873 was introduced on January 10, 2022, we had our first public meeting on the local map on Thursday, January 13, 2022. By this time, all members of the Gwinnett State House and Senate had an opportunity to review the map from the Gwinnett Board of Commissioners for nine days. With members from both parties present, there was no negative feedback on the Gwinnett Board of Commissioners map at this time. On Sunday, January 16, 2022, at 2.25 PM Eastern, I sent an email to all members about the second joint committee meeting to be held on Wednesday, January 19, at 7 PM Eastern. I noted that as of 2 PM that day, no member of the Gwinnett State House or Senate delegation's contact to me regarding any concerns or proposals for amendments. On Wednesday, January 19, 2022, by our second meeting, all Gwinnett legislators had 15 days to review the proposal and submit any amendments. It was during this meeting that for the first time, members of the Gwinnett House or Senate made their concerns or objections known to me and the public. So during that meeting, I respectfully ask members who had concerns to provide me and providing any proposed amendments for consideration. None were forthcoming. As y'all may know, on January, Monday, January 24, 2022, Chair of Governmental Affairs made a motion to move House Bill 873 from Intergovernmental Coordination to Governmental Affairs. And what I assert is violation of House 18.2, which states that once local legislation has been signed by the requisite local delegation members under Rule 18.1, the legislation shall be favorably reported as a matter of course without the necessity of action by the committee unless otherwise ordered by the chairman or the committee. Despite the fact that HPA 873 had the requisite signatures and should have been automatically added to the local calendar or called to Intergovernmental Coordination Committee for additional action by the Chair, for the first time in decades. For the first time in decades, a local redistricting bill was taken out of the regular legislative process and treated as general legislation, which I have publicly asserted is a clear deviation from the regular process that is evidence of racially discriminatory intent and violation of Section 2 of the Voting Rights Act of 1965. One week later on Monday, January 31, 2022, members of the Gwyneth delegation and the public saw a new map that would completely redraw the district lines for the Gwyneth County Board of Commissioners with radical changes. In particular, this Northern District which has not existed for at least the past 10 years if not longer. The full committee of governmental affairs then met at 8am on Tuesday, February 1, 2020-22, which is not during their regular meeting time and without first having a subcommittee meeting.\n\nwhich is a regular process and passed this new map that was made public for less than 24 hours prior to even though as the author of HB873 I respectfully ask to withdraw the bill for consideration or amendment by the committee. In less than 24 hours the rules committee then met at 9 a.m. on Wednesday, February, 2nd and on a partisan vote move the committee substitute to the House floor without my consent although I remain the original author at the time of the underlying bill. Now we find ourselves in this unprecedented situation that undermines the integrity of House proceedings debating a local bill that does not have the support of the local delegation that allows for tyranny of the minority. For decades every local redistricting bill has been treated past as local legislation not as general legislation. Local legislation should require the approval of a majority of elected officials who represent the locality as required by House rule 18. This ensures that the people of Georgia who are impacted by the actions of politicians retain the ability to hold their elected officials accountable. Underlining local control removes the ability of Georgia to hold politicians accountable for their actions that affect or impact the locality they reside in. If this body decides not to respect local control especially as a local redistricting know that you are actively engaged in subverting and undermining democratic norms and processes created to safeguard the foundational American principle that the people are sovereign, that the people that voters hold ultimate power in this country not politicians and definitely not political parties. Underlining local control and the will of the majority of voters in any county but certainly in the second largest county in the state of Georgia sets a dangerous precedent that will open the door and justify politicians from any majority party, Republican or Democrat from around the state to get involved in the affairs of local matters and your district and mine and your home and mine and a manner where politicians will not be held accountable to Georgians for their actions. So I respectfully and strongly urge each of you to vote no to this usurpation of local control to demonstrate respect to Georgia voters who live in Gwinnett County. I urge you to vote no to protect the integrity of the proceedings of this house such that this body does not establish a dangerous precedent that will forever allow any majority party to undermine the will of Georgia voters in an unaccountable manner. And I strongly urge you to vote no to ensure that in our great state of Georgia we the people have the freedom and the power to govern ourselves. With that I'm happy to take any questions and if there are none, Mr. Speaker, I will go. Yeah, no questions and your time has expired. Thank you, Mr. Speaker. I will yield the well. We'll move on now to the chairman's time. Chair recognizes. Chairman Darlene Taylor for the chair's time. 20 minutes. Thank you, Mr. Speaker. I can report that House Bill 873 was fully vetted in our committee. The maps presented were approved by the legislative and congressional office as meeting the legal requirements. All sides of this issue were given time to speak. All of those present and members on Zoom also were heard. This bill was passed out favorably and I'm going to yield part of my time to the author of the bill. To the author of the bill. Okay, Bonnie Rich. Thank you. Chair. I actually am going to yield my time to Chairman Chuck. You need to yield back to the chair. I will yield back to the chair. I will yield my time right now to chairman Efestration. Chair recognizes chairman of strangen for the chairman's time. Thank you, Mr. Speaker. Thank you, ladies and gentlemen of the House. I want to thank chairman Taylor for allowing me some time here to speak today. Of course, I represent a portion of Gwinnett County. I'm honored to do so. Gwinnett counties my home. Followed this process very closely. I've also previously served as delegation chairman. I'm sensitive to the number of members that we have in Gwinnett County and the important concerns and questions that we have to raise. The process here really started when the county commission met with legislators or had an opportunity to meet with legislators. Not everyone came. In early December, we met over near the, I'm going to be brief today. I'm just going to hit the high points here because I think you all understand this issue and this discussion is important. But we met to hear from the county commissioners and at that opportunity, the understanding was the representation that was made was that there would be a placeholder bill put in. There would be language with filler, with an opportunity for discussion to take place. The five hearings that the county commission conducted that you've heard about today that representative previously, I think she mists spoke saying that this map was considered at those five community meetings. That's incorrect. The map was proposed after those five meetings had occurred. The map was first approved by the commission in January. The sponsor of the original bill here introduced it on the first day of the legislative session without any bipartisan co-sponsorship and without any opportunity given for bipartisan co-sponsorship. I can just speak to when I served as chair of the delegation. We would have meetings, we would discuss important issues that were coming up. The county's request, if any member had any concerns with it, we'd have an opportunity to vet that fully and discuss it informally or formally in a county delegation meeting. That just simply didn't take place prior to the introduction of House Bill 873. The discussion that did occur, what was assured just wasn't followed through upon. Now, I also want to cover the, there's been talk today about the opportunities that were sent for comment, for request for amendment, things like that. Of course, until you know what the proposal is, it's very difficult to discuss where you would want an adjustment or a concern that maybe a proposed district isn't compact as it needs to be. And what happened was after the commission approved the map and the sponsor, original sponsor introduced the bill, there was one public hearing for that. There was one meeting where the public was allowed to give comments, and it was about both the commission and the board of education, and there were many members of the Gwinnett County public who showed up to express concerns and problems with the proposed map. This second meeting that was discussed concerning the delegation, that was not a second opportunity for public comment. That was a discussion amongst legislators who were to consider this proposal. And at that meeting, a distinguished member of this body, a Republican colleague, a man, representative Tom Kirby asked if we could have additional time to discuss proposed amendments to this, and the chairman of the delegation denied that request, declined to give additional time so that that could be addressed internally within Gwinnett County. You know, we're here today because of the procedural issues that we've had, the school board map that's proposed by the Democrat majority school boarding Gwinnett, Republican members support. That was put before members of the public in a survey form where they could pick between two choices. Public simply did not have the degree of opportunity for input on the map that my Democrat colleagues are requesting that that has been I think asserted here today. Now with respect to the substantive concerns, I represent Northern Eastern part of Gwinnett County. When I look at a map that includes community that I currently represent Akula, then wraps around the county seat to represent, to include the southern central parts of the county. I can very clearly living in Gwinnett County, I know that I could not drive that distance in under an hour. I mean, that is a huge area with incredibly different needs and concerns. Just taking transportation in demand, which is something I'm always mindful of, traffic congestion and roadway safety. We have so many different concerns and focuses in the Ducule area as opposed to the central area. It is, I think that compactness is particularly important when considering the map that's been proposed before you hear today, to allow districts to have such an extended part of the county without being compact is going to place the future County Commissioner in really the impossible task of having to prioritize so many different needs within his or her position, part time position as a County Commissioner in a district. There was a discussion here today that the ultimate question here for you today is one of openness. And what I would submit to you here today is the legislative process that's been employed here is under the House rules and is consistent with our precedent of allowing debate and discussion to take place within committees. And that is in true contrast to the process with which the delegation utilized. I'd encourage your favorable vote on House Bill 873 both because, procedurally, this is an accordance with what is best going forward. It's what is best for the communities in Gwinnett County. It has afforded an opportunity for discussion and debate as we're having here today in the House chamber. But also, it prioritizes issues of compactness, communities of interest, important responsibilities that County Commissioners will ultimately need to consider. That is best situated with the map that is before you now HB873. I'd ask for your favorable consideration. And Mr. Speaker, at this time I'll yield back the balance of the time to the committee chair, Chairman Taylor. Chairman of Stration is waive the balance of his time to the chair of the committee chairman Darling Taylor. I yield a remainder of my time to Chairman Rich. Chair recognizes Chairman Rich for the balance of the chairman's time. Thank you, Mr. Speaker and Chairman. I will keep this very brief. I want to point out on the slides that you have on the screens, on the left hand side is the map that is proposed by the Democratic delegation. And on the right hand side of the screen is the map that I worked with our reapportionment office to draw in order to fairly represent all of the communities of interest in Gwinnett County. As you can see, just by looking at the map, the map that I worked with reapportionment to draw is compact. There is no gerrymandering in this map, unlike the map that is proposed by the Democratic delegation, which divides the top one third of the county into three of the four county commission districts. I encourage your favorable consideration for House Bill 873 and I thank you very much for your time. The previous question has been ordered. Mr. Clark, you want to ring the bell? What purpose does representative park rise? Mr. Speaker, I rise to make a motion. State your motion. First year into rule 87, I move to lay House Bill 873 on the table. All right. There's a motion to table. All those in favor of the motion to table House Bill 873 will vote aye. Those opposed to vote no and the clerk will unlock the machines. All members voted. If so, the clerk will lock the machine on the gentleman's motion. The eyes are 66. The eyes are 98 and the motion to table has failed. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machine. What purpose does representative Jasmine Clark rise? Parliamentary inquiry. They sure inquiry. Isn't not true that the chairman that just got up and spoke talked about how de Cue la and Cineville should not be in the same district and even the math that we're voting on today, de Cue la and Cineville are in the same district? Well everybody had an opportunity to listen to the presentations all of them so I'm not going to repeat any of those. What purpose does representative McLean rise? Parliamentary inquiry. Stature inquiry. Does any state legislator do local maps? I mean I'll correct it I'll say a slower. The author said that the Democratic delegation presented a map. So the Democratic delegation from Gwyneth County that we produced the map that was presented which is my inquiry. You you should know that as well as I do. I mean I'm not going to try to get into that kind of question. All right we're going to do one more parliamentary inquiry. Chair recognizes chairman Setsler for a purpose to you rise. Parliamentary inquiry. Isn't it true that every map it requires a majority vote of the House, majority vote of the Senate and a signature of the governor. This idea of local delegation rules is a shortcut if there's consensus but this body voting on these maps as a whole is the is the way our system works and applies to every single map and what we're doing here is just a fair reflection of that process. I think that addresses itself to the judgment of each member. All right the final one will be to the minority leader leader Beverly. What purpose do you rise? Parliamentary inquiry. Is not true that according to the handbook that we get handbook for general for Georgia legislators that no local bill can be converted to a general bill by means of amendment or substitution and a day we just violated that handbook. I think we're past that point of in the process Mr. Leader. Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of House Bill 873 the eyes were 96 the nasors 70 and this bill has received the requisite constitutional majority. What purpose does chairman rich rise to make a motion? State your motion. I move that we immediately transmit House Bill 873 to the Senate. Chairman rich has moved that this House bill 873 be immediately transmitted to the Senate. Is there objection? There is objection does the lady move? Yes I do. The lady moves. All those in favor of the motion for a media transmittal of a vote aye those opposed vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will lock the machine on the ladies' motion for a media transmittal the eyes are 96 the nasors 70 and this bill has been immediately transmitted to the state Senate. What purpose does representative air heart rise to make a motion? State your motion. I move that House Bill 1028 be moved from intergovernmental coordination to government affairs. Both chairs agree? Yes. All right it's clerk agreed to caption. House Bill 1028 originally very hard of the 36 and others to be tunneled and act to amend the act providing for the election of members of the Board of Education and Cobb County. On the ladies' motion that House Bill 1028 be moved from the intergovernmental coordination committee to the governmental affairs committee is the objection. There is objection does the lady move? All those in favor of the motion for transferring House Bill 1028 from intergovernmental coordination to government affairs will vote aye those opposed will vote no and the clerk will unlock the machines. What purpose is representative McLaren rise? Paral Minery Encrement. State your inquiry. Isn't it true that the energy that this building is full of right now is the energy of a majority that would really like to date certain counties but those counties don't want to date you back. That's good rhetoric representative. I got to hand it to you. Let's see what purpose is representative park rise? Let's just speak your right rise pursuant to rule 143 to ask for reconsideration on House Bill 873. You're out of order. Motion is not recognized. Have all members voted? Have all members voted on the air heart motion? If so the clerk will lock the machine on the motion on House Bill 1028 the eyes are 97 the nays are 68 and this bill has been moved to the governmental affairs committee. What purpose does representative Maynard rise? Mr. Speaker I move that the rules be temporarily suspended so that a bill may be read for the first time in a son to committee. Representative Maynard has moved that the rules of this house be temporarily suspended so that a bill may be read for the first time in a son to committee the clerk will read the caption. Unnumbered House Bill by Representative Maynard 56 to be entitled an act to amend the act creating the Board of Commissioners of Fulton County. Is there any objection to the motion? There is objection. There is objection. I hear you and we're going to vote. This vote will require a two thirds vote. Two thirds vote. On Representative Maynard's motion that the rules of the house be temporarily suspended to allow a bill to be read for the first time in a son referred to the governmental affairs committee. All those in favor of the motion will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does the minority caucus will representative Wilkerson rise? The waves? What purpose does representative drier rise? He waves have all members voted on the main or motion? Have all members voted? If so, the clerk will lock the machine on the motion. The eyes are 97. The nasa 63. The motion has failed. I guess you can come in Monday and introduce it now. So all right, we've got some bills that need to be first read and assigned to committee. The clerk will read. If there's no. The clerk is going to read a number of local bills. If there is no objection, the bills will be assigned to the intergovernmental coordination committee. There is objection. There is objection. So we're not going to take those up today. You might want to come and look and see whose bills they are, by the way. Okay, we have a resolution. We need to take up. Have a resolution. We need to take up. And it will be House resolution 705. Clerk will read the caption. House resolution 705 by Gremson. It burns. There is no. 59. The other is calling and Joint Session. House representatives. The senate for the purposes of hearing a message from chief justice for the Supreme Court. Chair recognizes the majority leader of the House to speak to the resolution. Thank you, Miss Speaker. Colleagues, as our custom is, long standing, we invite the justices of the Supreme Court and the Pellet Court of Georgia to come to this chamber along with the Senate and it will be on February 8th, Lucky Day 13 for us to hear those riveting comments. But nevertheless, we will hear from the State of the Judiciary next Tuesday, February 8th, and I would ask for your support for House Resolution 705 for the State of the Judiciary of Georgia. Thank you, Miss Speaker. That's the resolution. Now, do you heard the resolution? Is there any objection to House Resolution 705? Chair, here's no objection and the resolution is adopted. Clerk will read the caption. Oh, I'm sorry. Chair recognizes that what purpose is the majority leader rise? Make a motion, Miss State, motion. Speaker, I'd make a motion that we immediately transmit House Resolution 705 to the Georgia Senate. Majority leader has moved that House Resolution 705 be immediately transmitted to the Senate as their objection. Chair, here's no objection and it is so ordered. The clerk will read the caption to a group of privileged resolutions. Raymond Node, Logan, Logan High School's 2022 Star Student Commending Noah N. Brawe, Logan Mill Christian Academy's 2022 Star Student Commending DeLyle Accurbie, Monroe Erie High School's 2022 Star Student Commending Belarus Delo, Walnut Grues, High School's 2022 Star Student Commending MacFarlane and Gerard Jeffery, Georgia Walten of the Academy's 2022 Star Student Star Student, Commending Harley-Vase, Social Circles, High, School of 2022, Star Student, Commending, Conor, Charles Shelton, Victory Baptist, School of 2022, Star Student, Recognizing Commending, Himifilia, Georgia, Recognizing Commending, Mayor Carlos Scoot-Duffy, Recognizing in Commending, the Brunswick African American Cultural Center, Recognizing the rise of Cardiom Vasewood Disease as the world's leading calls for preventable death, Recognizing Commending, the Georgia Building Trade, Academies for Celebrating in Seventh National, Prudyship Week, Honoring the Life and Memory of Elder Cal Merrill, the Happy Preacher. Recognizing Commending, the THANYQ Smith Union, the Partnership for Southern Equity, Recognizing the 73rd University, University of Declaration of Human Rights, Recognizing February 10, 2022, New Americans Day at the State Capitol, Honoring, Georgia, Court of Board and Special Advocates in Recognizing February 10, 2022, is CAST OF DAY AT THE STATE CAPAL, Recognizing February is National Cancer Prevention Month in Honoring the Partnerships between Georgia Agency's and organization to collectively fight cancer, recognizing Commending, Coffers Home in Carton, Recognizing and Commending, Carol A. Jim Borrell, Recognizing and Commending, Dr. Luis Weems Hanson, Honoring and Recognizing Georgia's Career, Technical and Agriculture Education programs, congratulating Lee and Nancy Warren on the occasion of their 69th Wendy Grand Aversary and for other purposes that completes the reading with privilege resolutions. Is there any objection to adopting the privilege resolutions that Chair here has done?\n\nThe resolutions are adopted. We only have one member who signed up for an announcement and chair recognizes representative McLean for an announcement. Thank you, Mr. Speaker. The working family caucus, the box lunches are in room 328 CLOB, room 328 CLOB. Thank you, Mr. Speaker. All right, we have no further announcements. Well, listen up. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I moved to this House standing recess until 4 p.m. today, then stand adjourned until 10 a.m. Monday, February 7, 2022. Majority leader has moved that this House be in recess until 4 p.m. today, at which time we would be adjourned until Monday, February 7 at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be in recess until 4 p.m. and will be adjourned then until Monday, February 7, 2018.",
  "updated_at": "2026-02-13T07:01:05.426259+00:00"
}