{
  "video_id": "wjY86TFy6w8",
  "url": "https://youtu.be/wjY86TFy6w8",
  "title": "Georgia House - Day 30 (2026-03-10)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 30,
  "video_date": "2026-03-10",
  "duration_minutes": 49,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 30 (2026-03-10)\n\n## Overview\nThe session focused on recognizing the legacy of former Georgia Speaker of the House Tom Murphy, whose birthday would have been that day. The chaplain also delivered an inspirational speech about the importance of maintaining a daily spiritual walk with God.\n\n## Key Actions\n**HB593:** No details provided on this bill.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The session began with the chamber observing a moment of silence to recognize former Speaker Tom Murphy's birthday and his long tenure leading the Georgia House.\n- The chaplain, Rev. Jeffrey Ott, gave a speech reflecting on the importance of maintaining a close, daily relationship with God, drawing on his personal experiences and his grandmother's influence.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nA quorum was present, as the clerk conducted a morning roll call.\n\n## Adjournment\nThe transcript does not provide the time of adjournment or the date of the next scheduled session.",
  "transcript": "There are convening having arrived all members of this house will please report to the floor.\nAll members will report to the floor of the house to their assigned seats.\nThe clerk will ring the bell.\nAll members will please take their seats.\nWe're about to have the morning roll call.\nWe're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nand the clerk will unlock the machines.\nRepresentative Vowla Davis, would you please vote representative Hutchinson\nPresident.\nRepresentative Gullet in room 341, would you please vote representative Walensky present.\nhave all members voted, have all members voted, have all members now voted if so the clerk\nwill lock the machines, doorkeepers will please close the doors and keep them closed, well\ngood morning. It's a beautiful day out there today. Before we begin, the chair wants to\nmake mention that today's a special day in the history of this house. I know there's\ngoing to be a morning order later this morning, but today Speaker Tom Murphy would have been\n97 years old. His birthday today. Speaker Murphy served 28 years as the speaker of this\nbody, and at the time he left, he was the longest-serving speaker in the history of the United\nStates.\nI think now he's the second-longest-serving speaker in American history.\nA great, great Georgian left his mark on this state, a son of rural West Georgia who\nsaw the big picture of how the entire state had to prosper together and there's evidence\nof that all over the state, particularly all over metropolitan Atlanta for the good work\nthat he did.\nWe will begin our day with scripture reading and prayer by the chaplain after which we\nwill pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the lady from the 107th House District\nRepresentative Shelley Hutchinson, Representative Hutchinson.\nGood morning colleagues.\nToday it is a thrill to introduce my pastor today.\nIf you know me, and some of you do,\nyou know that I come from an extremely large Catholic family,\nthen I married into a larger Catholic family\nAnd before I left Louisiana,\nI thought it was a requirement to be Catholic.\nI didn't know until Georgia that it wasn't.\nSo I've been in Georgia since 1993\nand I have belonged to three churches since then.\nAnd I loved all three.\nI just felt like something was missing.\nAnd I have a colleague, a mentor.\nShe was my graduate advisor at UGA.\nHer name is Geraldine Jackson White.\nShe's probably watching, so this is a shout out to her.\nShe kept telling me, you've got to come to my church,\nyou've got to come to my church.\nI'll lay the alerts downtown.\nI live in Snellville, so I was like, you know,\nit's a long drive, it's a Sunday morning.\nBut one day I went with my family,\nand when I got there, it was Benye Sunday.\nAnd I said, I hear you, Lord, I'm home.\nSo we had the best, and there are two things,\nI do not eat outside of Louisiana,\ngumbo, and beignets.\nBut our Lady of Lords, if you catch them on Beignets Sunday,\ntake, you know, count your lucky stars.\nSo let me tell you about our Lady of Lords.\nOur Lady of Lords is the oldest African-American\nCatholic church in Atlanta.\nAnd in 2003, they erected the historical marker\nhonoring them for that.\nReverend Jeffrey Ott, who, by the way, went to the high school that's walking distance\nfrom my high school in New Orleans.\nHe is a friar of the order of preachers known as Dominicans, serving as the pastor of\nour Lady of Lords Catholic Church in Atlanta.\nFather Ott also serves as board chair of Interfaith Community Initiatives, Incorporated,\na nonprofit which unites people to create lasting and transformative bonds to build a\nmore humane and equitable society. Father Jeffrey has served on leadership council for\nthe Southern Dominican province. Father Ot received the masters of arts and theology\nand masters of divinity from Aquinas Institute of theology in St. Louis, Missouri.\nhe is that great. He deserves that welcome. He received the masses of arts and theology\nand masses of vanity from a quietness institute of theology in St. Louis, Missouri before becoming\npastor of lords. While the arts served his alma mater Xavier University in Louisiana as\nuniversity chaplain, over the years he has developed a deep interest in the spirituality\nof recovery and persons in recovery.\nHe enjoys travel, singing, and communing with family and friends.\nColleagues, I introduce to you, Father Jeffrey Atte.\nGood morning.\nPsalm 147 verse 12 says, Glorify the Lord, O Jerusalem, praise your God, O Zion.\nFor he has strengthened the bars of your gates.\nHe has blessed your children within you.\nI like to begin my engagement with you this morning\nwith just a little few bars of an old song\nthat I'm sure a lot of you know,\nso you're welcome to join in.\nJust a closer walk with thee.\nGrant it, Jesus is my plea.\nDaily walking close to thee,\nLet it be, dear Lord, let it be.\nI am weak but thou art strong.\nJesus, keep me from all hung.\nI'll be satisfied as long as I walk.\nLet me walk close to thee.\nAs Shelley said in her fine intro,\nSo I am the pastor of the first African-American Catholic Church here in Atlanta, founded\nin 1912.\nAnd so we are celebrating 100 and whatever do the math, 10, 11 years.\nMath is not my forte.\nAnd I bring you greetings from our church community which includes many fine folk like\nRepresentative Hutchinson from throughout the Atlanta area and other parts of the state\nand country since we have been celebrating our Sunday Mass live streamed to everyone.\nAnd we are a growing church.\nWe are about to embark on a $10 million capital campaign to build a new church.\nAnd so I bring you greetings from the hallowed grounds of our church campus where the neighborhood\nchildren used to play, which included the illustrious Georgia Denison, the Reverend Dr. Martin\nLuther King, Jr.\nAnd we're also proud to note in this women's history month that our founders, St.\nCatherine Drexel, not only blessed us with her patronage, patronage, but also with her\nholiness. As we continue celebrating women's history month, I chose that song just a closer\nwalk with thee because it was my grandmother's favorite song. And I wanted to honor her,\nthe woman who helped me to grow into my faith. And many was the day that I heard her singing\nas she went about her chores and cooking. She didn't fail to let me know every time we\nheard it in church, that's my favorite song. And so it conjures fond and loving memories\nfor me. And another reason I like that song is because it reminds me and all of us that\nour relationship with Jesus, indeed our spiritual lives, is a day-to-day reality. And that's\ntrue for all of us. Sometimes it's a moment-to-moment reality. Especially for those of us who\nwho are unemployed or working in the gig economy,\nmaybe our constituents, our parishioners, our staff,\npeople that we know, people that we don't know,\nand those who face the shadows of death\nwith the coronavirus,\nalong with all of the healthcare workers on the front lines,\nand all of those people know the day to day,\nmoment-to-moment reality of life. Now, if you're anything like me, you want the\nquick fix. Thank God for Amazon. The magic pill, the reality of our spiritual\nlives, though, is that they don't work that way. We don't get to take a pill and\nhave all of our problems melt away. In fact, an infinite wisdom, the creator of\nthe universe, the divine intelligence, somebody say divine, intelligence, the one who loves\nus into being that mandates that we have a daily walk, a daily walk, that Jesus teaches\nus that in the Lord's Prayer give us this day our daily bread.\nMy grandmother taught me that and she taught me that to be successful spiritually means\nto surrender to the reality of our humanity, that we each live lives dependent upon one\nanother, that none of us is independent from the other, that we are interconnected, and\nthat's what our relationship with Jesus is all about.\nWe humans take steps literally and figuratively trusting in the divine presence and trusting\nin one another. You know all about that, though, as representatives. You know all about the\nimportance of those relationships. And our prayer for you, I know certainly all of us at Lord's\npray for Representative Hutchinson and all of you, I commit us to praying for you. Our prayer\nfor you is that you understand more and more each day in your daily walk that we are here\nto do good for one another, those that we know and especially those that we don't know.\nThe Jesus I serve, the one who calls us into being, the one who gives us life, who saves\nus, was the one who taught us that we ought to do right by our fellow human, and that we\nought to lift up the good of everybody.\nAnd we ought to do that because we have been lifted up, because we have been given the\nopportunity to live and breathe and walk this day.\nAnd so it's my prayer that you will walk in that way and walk in that spirit in all that\nyou say and in all that you do, especially for your constituents and the good people\nof this state.\nPlease join me in a closing prayer.\nGracious Creator, we thank you for the gift of this day and we ask that you give us\na willing spirit to cooperate with your plan for us and for the good of all the people\nof the state of Georgia.\nAnd we humbly ask these and all other blessings in the spirit of unity and peace and let the\npeople say amen.\nAnd now we'll lead in the pledge of allegiance, I pledge of allegiance to the flag of the\nthe United States of America and to the Republic for which it stands, one nation under\nGod, indivisible with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nChair recognizes Chairman Hogan, the chair of the Committee on Information and\nAudits. Thank you, Mr. Speaker. Your Committee on Information and Audits has\nread the journal of a previous legislative day and found it be correct. And\nfurthermore, Mr. Speaker, when I was able to sit down there with Matt\ndollar. He told me one time there in the middle of the week. Chairman Matt\nDollar said the first five days after a week in are the hardest.\nI have to be careful what you say to him.\nIs there any objection to the confirmation of the journal, the chair here is none, and\nthe journal is confirmed?\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Mayor of the Honor of the 59th, who's following me establishes the order of business\nand the first part of the period unanimous consent. Introduction of bills and resolutions,\nfirst reading and reference of House bills and resolutions, second reading of bills and\nresolutions, reports of standing committees, third reading and passage of uncontested local\nbills and resolutions, first reading and reference of Senate bills and resolutions,\nmorning orders. Is there any objection to the adoption of the resolution\nand establishing the order of business for the day.\nThe chair here's none in the resolution is adopted.\nFirst reading of bills and resolutions,\nthe clerk will read.\nHouse Bill 745, I represent Jackson 128th,\nBuilding, Todd, and Act to amend\nand act to reconstitute the Board of Education\nof Washington County.\nEnter governmental coordination.\nHouse Bill 746, by Representative Limor,\nthe 99th and Maynard of the 56th,\nBuilding Tottenham Act to Men Code Section 342-10, relating to employers' duty with respect\nto the provision of safe employment generally.\nIndustry and Labor House Bill 747 by Rep. Limer the 99th, Maynard the 56th Building\nTottenham Act to Men Code Section 12-9-3, the fiscal to Georgia and the State of Related\nDefinitions relative to air quality.\nNatural Resources and Environment House of Resolution 369 by Rep. Bayesmore on 63rd\nBruce, the 61st Jackson, the 64th podium, the 62nd.\nThomas, the 65th resolution honoring the life of Congressman John Lewis\nand dedicating a road in his memory.\nTransportation.\nHouse Resolution 370 by Representative Roberts, the 52nd Williams,\nthe 37th Schofield, the 60th Lopez, the 86th,\nremainder of the 56th, 56th resolution creating a house study committee\non the impact of active shooter drills in schools.\nEducation Senate bill 280 by Senator Gucci the 51st to build me and Todd and\nactive men then act creating the board of commissioners of Lumpkin County\nIntergovernmental Coordination Senate bill 282 by Senator Anderson the 24th\nMiller the 49th Wallace the 53rd Dugan the 30th Gucci the 51st and\nothers will be Todd and act to men then act creating the board of elections\nand registration for Lincoln County Intergovernmental Coordination Senate\nbill 283 by Senator Anderson the 24th Miller the 49th Wallace the 53rd\nDugan on 30th, goods to the 51st and others will be taught an act to reconstitute and reestablish\nthe board of elections and registration for Lincoln County.\nIntergovernmental coordination.\nThat completes First Readers.\nSecond reading of Bills and Resolution is a clerk or read.\nHouse Bill 738 by Representative Miranda 96.\nI believe the 143rd Mitchell, the 88th part of the 101st scuffle to the 60th and others\nthe bill relating to seeds and plants. House Bill 739 by reps of Ralston of the 7th,\nthe bill to amend an act to provide a new charter for the city of Blue Ridge, House\nBill 740, by reps and benton of the 31st, the bill to amend an act incorporating the\ntown of Pendergrass. House Bill 741, by reps of Scofield of the 60th,\nBeverly of the 143rd, Scott of the 76th, Hutchinson of the 107th, Davis of the 87th,\nand others of bill relating to temporary assistance for needy families. House Bill 742,\nby reps of Dubnick of the 29th, Dunhu of the 30th, Hawkins of the 27th, Bar of the 103rd,\nbill to continue the existence of the Gainesville City School District, House Bill 743, by\nRepresentative Dickie of the 140th, the bill to amend and act, providing a new charter for the City of Fort Valley.\nHouse Bill 744, by Representative Noloitz of the 42nd, Thomas of the 39th Allen of the 40th Bruce of the 61st\nSmith of the 41st and others, the bill to amend and act, creating a new charter for the City of Smyrna.\nHouse Resolution 353, by Representative Cannon of the 58th, Beverly of the 143rd, Williams of the 168th,\nResolution Recognizing General Larry Platten dedicating a bridge in his honor.\nHouse Resolution 354 by reps and galear to 160 second, resolution recognizing it.\nMayor Edna Jackson dedicating interchange in her honor.\nHouse Resolution 355 by reps and galear to the 160 second.\nResolution honoring the life of representative Bobby Lee Hill and dedicating interchange in his memory.\nSenate Bill 10 by Senator Jones of the 10th butler of the 55th James of the 35th say of the 34th Davenport of the 44th and others.\nbill relating to offenses against public order, Senate bill 62 by Senator Tipens over the 37th.\nGeneral D47, Miller the 49th Gouge of the 51st, Albers of the 56th, and\nothers, a bill relating to elections and primaries, Senate bill 72 by Senator Males of the 53rd,\nMiller the 49th Gouge of the 51st, Albers of the 56th,\ntake minute of the 4th and others, a bill relating to primaries and elections.\nHouse Senate bill 74 by Senator Males of the 53rd, Miller the 49th,\nGouge of the 51st, blocker of the 3rd of the 20th, Albers of the 56th and\nthe bill relating to elections of primaries.\nSenate Bill 90 by Senator Jackson of the second miller of the 49th Jones of the 10th.\nMullis of the 53rd and Anderson of the 43rd of the bill relating to state governments.\nSenate Bill 97 by Senator Jackson of the 2nd Harbson of the 15th Jones of the 10th ramen of the 5th.\nJones the 2nd of the 22nd of the bill relating to determination of in-state resident status of students for tuition or fees.\nSenate Bill 98 by Senator Beecher of the 21st Jones of the 25th Gucci of the 51st.\nof the 47th Watson of the 1st, the bill related to highway,\nbridges and ferries, Senate Bill 1 and 6,\nby Senator Diamondport of the 44th,\nJones and 2nd of the 22nd,\nDuggan of the 30th, M's of the 12th,\nButler of the 55th, and others,\navailable leading to multi-tiered system of supports,\npriors of suspension, or expulsion for certain students,\nSenate Bill 120, by Senator Tipens of the 37th,\nKennedy of the 18th,\nCousin of the 46th, Jones and 2nd of the 22nd,\nHillary of the 19th, and others,\navailable leading to solicitors,\nGeneral and State Courts.\nSenate Bill 1, 44, by Senator Tipens of the 37th,\nto the 51st Cowsord in the 46th Miller, the 49th Summers of the 13th and others.\nA bill relating to general provisions for housing authorities.\nSenate Bill 156 by Senator Harbin in the 16th, tip into the 37th.\nLucas of the 26th, Tillery of the 19th,\ndue to the 51st and others.\nA bill relating to labor and industrial relations.\nSenate Bill 162 by Senator Beach of the 21st,\nhours of the 56th, Thompson of the 14th,\nthe bill relating to judges.\nNumber of judges of superior courts.\nSenate Bill 164 by Senator Hustetler,\nthe 52nd, Kirkpatrick of the 32nd,\nfar out of the 36 Butler, the 55th,\nthe bill would lead to definitions relative\nto juvenile delinquency, crimes and offenses,\nand who may perform HIV tests.\nSenate Bill 202, by Senator Burns of the 23rd Miller,\nthe 49th, talking of the 30th,\nLieutenant of the 47th, Anderson of the 24th and others,\na bill would lead into elections and primaries,\nSenate Bill 213, by Senator Harper,\nthe 7th, paying of the 54th,\nMelissa of the 53rd, Summers of the 13th,\ngo to the 51st, the bill would lead into contracts\nand purchases by state public schools.\nSenate Bill 218, by Senator Walker,\nthe 3rd of the 20th, talking of the 30th,\nKirkpatrick of the 32nd Miller of the 49th Kennedy of the 18th and others bill related to vacation of office\nSenate bill 225 by Senator Harpison of the 15th Brett of the 33rd pane of the 54th dog of the 30th\nAnderson of the 43rd and others bill related to prestige license plates Senate bill 226 by Senator Antivarta of the 31st\nMelissa the 53rd Miller the 49th due to the 51st Thompson of the 14th and others bill related to sale or distribution of harmful materials to minors\nSenate Bill 234 by Senator Kennedy of the 18th Strickland of the 17th pair of the 42nd\nJudge and 2nd of the 22nd, Watson of the 1st Bill relating to civil practice.\nSenate Bill 237 by Senator Harborson of the 15th, Dougan of the 30th, Bill relating to\nspecial license plates.\nSenate Bill 238 by Senator Strickland of the 17th, Bill relating to general provisions.\nSenate Bill 241 by Senator Dougan of the 30th, Miller of the 49th, Cuget of the 51st\nKennedy of the 18th, Coucher of the 46th and others, Bill relating to elections and\nprimaries.\nSenate Bill 247 by Senator Anderson of the 24th,\nWalker of the 30th of the 20th, Miller of the 49th,\nGoodman of the 8th, Summers of the 13th,\nand others to build related to agricultural\ncommodity commissions.\nSenate Bill 253 by Senator Meredith of the 9th,\nBurns of the 23rd, Butler of the 50th,\nDuggan of the 30th, Gucci of the 51st,\nand others, a bill relating to elections of primaries.\nSenate Bill 256 by Senator Burkin,\nthe 11th, Gucci of the 51st, Watson of the 1st,\nKirkpatrick of the 32nd, Hustet of the 52nd,\nothers, a bill relating to conservation and natural resources.\nSenate Bill 260 by Senator Harper of the 7th,\nthe bill relating to promulgation, adoption of rules\nregulations and sharing of information. Senate Bill 276 by Senator Kennedy of the 18th\nStrickland of the 17th Mullins of the 53rd Harper of the 7th Dougan of the 30th Bill would\nlike to county law libraries Senate Resolution 1 and 2 by Senator Gouge of the 51st Beach\nof the 21st Miller of the 49th Jettin of the 47th Jones of the 25th and others. Resolution\ncreating the Georgia Commission on e-commerce and freight infrastructure funding. Senate Resolution\n134 by Senator Walker of the 30th Dougan of the 30th Kurt Patrick of the 32nd but for\nthe 55th parents of the 42nd and others resolution to present the amendment to the Constitution to the state of Georgia\nsays to provide for the suspension of compensation for certain public officers Senate resolution 154 by Senator Orrick of the 36th House that\nled to the 52nd moral of the 53rd Butler of the 55th Stricland of the 17th and others resolution created the joint study committee for strengthening Georgia's future workforce through 2nd readers.\n.\n.\n.\n.\nReports of standing committees, the clerk will read.\nI'm saying, Janet Hankensley, the 160th District Chairman of the Committee on Intergovernmental\nCoordination and Local submitted the following report.\nAnd I speak to your committee on Intergovernmental Coordination and Local.\nWe set a consideration to following bills of the House, instructing the meeting reports\nsame back to the House of Filing Recommendations, House Bill 655, Duke Pass, House Bill 682,\nDuke Pass, House Bill 683, Duke Pass, House Bill 684, Duke Pass, House Bill 685, Duke Pass,\nHouse Bill 705, Duke Pass, House Bill 707, Duke Pass, House Bill 708, Duke Pass, House\nThe 7-11 do pass, respectfully submitted, representing\nJan Tancersley, with a 160th district chairman.\nRepresentative Cooper, the 43rd district's chairman\nof Committee on Health and Human Services,\nsubmitted the following report.\nBut speaking of Committee on Health and Human Services,\nhas had under consideration the following bills\nof the Senate, and this is struck to meet reports\nsame back to the House, following recommendations,\nSenate Bill 5, do pass by Committee Substitute,\nSenate Bill 46, do pass by Committee Substitute,\nrespectfully submitted, Representative Cooper,\nthe 43rd District Chairman.\nRepresentative Lomston, the 12th District Chairman\nof the Committee on Insurance, submitted the following report.\nTo speak, your committee on insurance has had a consideration\nthe following bill of the Senate.\nMr. Stockton, me to report same back to the House\nfollowing recommendations.\nThe Senate bill 43, do pass by committee substitute,\nrespectfully submitted, Representative Eddie.\nLomston, the 12th District Chairman.\nThat completes the reading of the reports\nof standing committees.\nAll right, we're going on now to the local calendar.\nWe are going on to the local calendar, third reading and passage of uncontested local bills.\nIf there is no objection, we will vote on the local calendar as a whole with a recorded\nvote. Hearing none, it is so ordered. The clerk will read the local calendar.\nHouse Bill 655 by Robson Wilson the 80th City of Brookhaven,\nHouse Bill 682 by Robson of Jasper's the 11th Pickens County,\nHouse Bill 683 by Robson of Jasper's the 11th Pickens County,\nHouse Bill 684 by Robson of Knicks the 69th Troop County,\nHouse Bill 685 by Robson of Jasper's the 11th City of Jasper,\nHouse Bill 705 by Representative Mathis and 144th Blackley County, House Bill 707 by\nRepresentative Watson, 170 second, City of Coolidge, House Bill 708 by Representative\nDreyer, the 59th City of Hapeville, House Bill 711 by Representative Yeardow, the 150th\nsecond, City of Sylvester.\nIs there any objection to the previous question being ordered on the local calendar?\nThe chair here is none of the previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable to\nthe passage of the bills?\nThe chair here is none of the report of the committee is agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills on the local calendar will vote aye.\nas opposed to load no in the clork will unlock the machines.\nhave all members voted, have all members voted. If so, the clerk will lock the machine on\nOn the passage of the bills on the local calendar, the eyes are 140.\nThe nays are 15.\nThese bills having received the requisite constitutional majority are therefore passed.\nWhile we're going on now to morning orders, this house will come to order.\nwill come to order all members, please take your seats. Chair recognizes for a\nmorning order. The dean of this house, the Honorable Dean Calvin Smiley for a\nmorning order. Come on, you know, come on. This is on Speaker Murphy. So anybody, I tell you,\nI, when Speaker Russell and I were talking other day, we were talking and, and we've talked\nabout Speaker Tom Murphy in the days, his birthday, he'd be 97 today. And I called Michael\nJudge Murphy, as I told, the whip, I'm going to draw the whip, and then I was talking\nto the leader of Beverly this morning, and I mean, the people said, you know the day\nof Speaker Murphy's birthday, and I said, yeah, I said, I'm going to speak of Boston and\nask me to say a word, and I met Speaker Murphy 47 years ago, and I, and Speaker\nRossin has told this story to every freshman class in the last few years, and people say,\nHow did you get so close to speak of mercy?\nAnd I said, well, in December 1974, I went to see him,\nrepresenting Albert Thompson, took me to see him.\nHe was the first African-American chair of a committee\nhere in the house.\nAnd he said, son, he said, what can I do for you?\nI said, my speaker, they told me I need to come see you\nabout my committee assignment.\nHe said, yeah, he said, what committee you want to be on?\nI like to be on the preparations.\nHe laughed, he said, he said, appropriation.\nHe said, you're a freshman.\nI said, yeah, but I'm only going to the bank of business.\nI'm going to be on appropriation.\nHe said, not only will you not be on the committee,\nyou won't be in the room when we talking.\nI said, okay.\nHe said, what's your next committee?\nI said, ways of mean.\nHe's also son.\nWho you've been talking to?\nI said, he said, ways of means.\nAnother one of those, you won't be around when we talking\nabout ways of mean.\nHe said, what's your third committee?\nI said, banks and banking, he said, oh my God, he said, son, I don't know who you've\nbeen talking to, but I've never pointed a freshman to the banks and banking, and that's just\nnot heard of.\nHe said, but since it's your third choice, I'm going to point you to it.\nHe called a lady in and point, going to point this freshman to banks and banking.\nAnd about, and you know how it is, Madam Chair, about two weeks later he saw me at an event.\nHe put his arms around me, he said, you know what, you and I are going to be all right.\nHe said, you keep your cards close to your chest.\nAnd he said, I like you, he said, I'm going to put you on ways of means in four years and\nyou're going to be on appropriations in eight.\nThat's the best I can do.\nAnd I went on, and I said, Mr. Speaker, what Bert told you, what did the Bert tell you?\nThe buyer told me that Banks and Banking\nwas your first choice and you gave it to me as your third.\nAnd he said, that's pretty darn clever, young man.\nSo we became friends over the years.\nAnd he was so pivotal in my career in the house.\nAnd Speaker Marshall was a great person.\nAnd I told him one desk, and the speaker got a load on.\nI was chair of the Democratic Party of Georgia,\nChair of the Democratic Caucus on the House,\nrules committed chairman, and on the budget conference\ncommittee, four positions.\nAnd everybody has one of those now.\nAs in the speak, you need to lighten the load.\nI need to come off of one of them.\nHe said, let me say something to you.\nHe said, when I wake up in the morning,\nI have two people to call, and you one of them.\nI said, who's the other one?\nHe said, Terry Coleman, chairman of the Appropriation\nCommittee, he said, things are going all right.\nBut Tom Murphy was the longest servant speaker in the history.\nHe almost served 30 years at Speaker of the House, 30 years.\nAnd he was a great man.\nHe was a great Georgian.\nAnd I miss him dearly.\nI call his son this morning.\nAnd the speaker I know I went over my time,\nbut I want to thank you for our conversations\nabout our private conversation about Speaker Murphy.\nAnd I want to thank you for your leadership\nand remembering Speaker Murphy today on his 97 birthday.\nAnd all of you all who served would speak of mercy\nand know what I'm talking about.\nAnd he was a great George and happy birthday.\nSpeak of mercy.\nThank you.\nSome of you may have had an opportunity if you haven't, it's well worth the drive to\nthe Murphy Institute over at the University of West Georgia, where they have, they recreated\nhis office, and if you never had the opportunity or the, shall I say, the experience of going\nin his office, it's well worth going over because I don't think he ever threw a coffee\nmug away or a cap that he got in those 28 or 29 years. And they're all over\nthere in that office today. You get a real sense of him. Chair recognizes for\na morning order. Representatives LaHood, Chairman Corbett, Chairman Bershet and\nand representative Sharper.\nThank you, Mr. Speaker.\nMembers of the House, I rise this morning\non behalf of the Lounge County delegation\nto recognize the VSU men's basketball team.\nThey won the first ever in team history,\nour school history, a Gulf South conference title\nover Alabama Huntsville last Sunday, 75 to 70.\nThis awards them a automatic bid to the Gulf South Conference\ninto the NCAA Division II men's basketball South Regional\nhosted by the SU March 13th to the 16th at the complex.\nCould everybody join me on three and say, go Blazers.\nOne, two, three, go Blazers.\nChair recognizes Representative Scofield for a morning order.\nShe waves.\nChair recognizes Chairman Blackman for a morning order.\nThe Chair of the Ways and Means Committee.\nThank you, Mr. Speaker.\nGood morning, I'm here to thank this body for supporting HB593, providing much-needed\ntax relief to our fellow Georgians in what is very challenging times.\nThe current pandemic has taught us at states that run a tight fiscal ship and leave as much\nmoney as possible in the hands of their citizens are much more able to weather this crisis.\nSo I was a bit saddened and confused to learn the federal government's latest COVID relief\npackage, apparently bars states like ours from providing this kind of tax relief to our\ncitizens. So surely this is not true. I feel like maybe we misunderstood. So if someone\ncan explain this Washington math to me, it's concerning. But while I'm waiting for that,\nI'd like to ensure the people of Georgia that this body remains dedicated to lowering\na tax burden on our fellow Georgians and on the farmers and small business owners who\nformed the backbone of this economy. Thank you, Mr. Speaker.\nSo if I understand this, the federal government is going to tell states they cannot reduce\nthe tax burden on their citizens. That's the way the language reads, sir.\nOkay, just want to be clear.\nTarkle, read the caption to a group of privilege resolution.\nHonoring the life and memory of Dr. Randall Barfield.\nHonoring the worldwide victims of genocide\nand recognizing March 12, 2021.\ncongratulating Commending Linda Brenner for receiving the 2021 Yellow Rose\nNijkety Randall Service Leading Award. Recognizing March 29th 2021 this\ncommunity activist day to acknowledge unsung hero activists,\nnights leading and commanding Doctor Beverly Anne Townsend for receiving\nthe 2021 Nikitty Randall Service leager award and for other purposes that\nIs there any objection to adopting the privileged resolutions that chair here's none and the\nresolutions are adopted?\nWhat purpose does Chairman Martin rise?\nA parliamentary inquiry, Mr. Speaker.\nState your inquiry.\nIsn't it true, Mr. Speaker? Sometimes things take a minute to sink in with me.\nAnd it just sunk in, is it not true that I heard a vote in favor of that bill in the U.S. House today\nputs the tax cut we passed in this body by implementing an increase in a standard\nadduction for all Georgians that file without automation, it would put that in jeopardy.\nYes vote on that package in the U.S. House day, isn't that true, Mr. Speaker?\nI'm not sure since we had already acted, but I'm sure that if it is true, that our delegation\nunanimously will oppose that.\nWell, we would fight for our taxpayers, but he would put it, isn't it, true, that it\nmight put it in jeopardy for legalization?\nThank you, Mr. Speaker.\nAll right, going out now to announcements.\nOh, I'm sorry.\nChair, what purpose does Chairman Blackman rise?\nMake a motion.\nWhat purpose does Chairman Blackman rise to make a motion?\nyour motion. Move that Senate bill 193 be moved from the Ways and Means Committee to the\nGovernment Affairs Committee, both chairs are in agreement.\nClerk will read the caption.\nSenate bill 193 by Senator Maul's 53rd Harper, the 7th Harper's and the 15th Jackson's\n2nd, hatched the 50th and others to be entitled back to amend chapter 5 of Title 48, the\nif it's going to George Antony,\nwe'll be adding the Laura taxation to property.\nOn the gentleman's motion,\nthat House bill or Senate bill 193 be moved\nfrom the Ways and Means Committee,\nthe government affairs committee, is their objection.\nIs their objection, the chair here's none,\nand it is so ordered, we're going on now\nto announcements, going on to announcements. Chair recognizes Chairman Tankersley for\nan announcement. Thank you, Mr. Speaker. We've had a change in time for the Intergovernmental\nCoordination Committee. Today it is now 1 o'clock in CLEOB 406. It had been scheduled for\nnew, but I do realize you'd like to eat and some of you will go to the rural\ncaucus. Thank you. Chair recognizes representative Reeves for an announcement.\nThank you, Ms. Speaker. The Reeves subcommittee of Judiciary Noncivil is going to\nmeet at one o'clock at room 415 today and we're going to dissect and tear up\nsome Senate bills. Chair recognizes Chairman Watson for an announcement. Thank\nyou Mr. Speaker. Rule caucus will meet today at 12 noon over at 20 hours\nFloyd Room we've got the propane folks and Georgia link there as our host so\nlook forward to seeing you there thank you. Chair recognizes chairman dollar for\nan announcement. Thank you mr. Speaker your committee on creative arts and\nentertainment we'll be meeting today at 130 across the street in 506 we're\ngonna be getting a pretty robust update on the film industry in Georgia all\nAll members are invited to attend, come here, except for Donholy.\nThank you.\nChair recognizes Chairman Warkhizer for an announcement.\nThank you, Mr. Speaker.\nThe Industry and Labor Committee will meet today at the CLOB room 506 at 3 o'clock.\nThank you.\nChair recognizes or Chairman Green for an announcement.\nThank you, Mr. Speaker.\nState properties will meet today at 330 in the capital room 403.\nThank you.\nrecognizes representative Drenner for an announcement.\nThe DeCab delegation meeting for today at noon and you can pick up food in the CLOB in\nroom 514 beginning at 1130.\nThank you.\nThat completes our announcements.\nThere recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move that this House stand adjourned until 10 a.m. Thursday, March 11, 2021.\nThe majority leader has moved that this House be adjourned until Thursday, March 11 at 10 a.m.\nAll those in favor of the motion will say aye.\nopposed will say no. The eyes appear to have it. This house will be adjourned\nuntil Thursday at 10 a.m.\n",
  "updated_at": "2026-02-12T14:02:36.17413+00:00"
}