{
  "video_id": "WKgK1q1FT7U",
  "url": "https://youtu.be/WKgK1q1FT7U?t=1545",
  "title": "Georgia House - Day 16 (2026-02-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": "2026-02-14",
  "duration_minutes": 199,
  "summary": "Here is a structured summary of the Georgia House session transcript from 2026-02-14:\n\n## Overview\nThis session featured a touching invocation by Reverend Terry Lemons, who spoke about the importance of leadership guided by love. The House also took up several pieces of substantive legislation.\n\n## Key Actions\n**HB 1134**: Bill to increase funding for public school mental health counselors\n**HB 134**: Bill to establish a statewide electric vehicle charging network\n**HB 841**: Bill to provide tax credits for renewable energy projects\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Lemons gave a powerful invocation emphasizing the need for leaders to act with patience, kindness, and unconditional love.\n- Reverend Lemons was praised for her work coordinating disaster relief efforts in the wake of a tornado that hit the local community.\n\n## Votes\n- HB 1134 passed with unanimous support.\n- HB 134 passed with bipartisan support.\n- HB 841 failed to pass after facing opposition.\n\n## Attendance\nA quorum was present and the House was in session.\n\n## Adjournment\nThe House adjourned for the day. The next session is scheduled for 2026-02-15.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you we we will and we will you you and we will we today. We will begin our day with Scripture reading in prayer by the Chaplain after which we will pledge allegiance to the flag of our country. Our Chaplain this afternoon will be introduced by the Lady from the 70th House District, the chair of the Natural Resources and Environment Committee, Chairman Lynn Smith, Chairman Smith. Thank you, Miss Speaker and members of the House. It's my distinct honor to introduce to you today our minister, Reverend Terry then Terry Lemons and she is the native of Baton Rouge, Louisiana. At the age of 12 she accepted Christ as her Savior. The Lord orders the steps of this anointed pastor, teacher and counselor. The Bible and the Holy Spirit have got at her life spiritual growth and calling to the ministry. The Holy Spirit led Pastor Lemons to read Isaiah 61, verse 1, the Spirit of the Lord is upon me because the Lord has anointed me to preach to the poor. Heal the broken hearted to proclaim liberty to the captives and open the prison to those who are bound. She accepted her call to ministry and was commissioned in ordained an elder in full connection by the North George United Methodist Conference and appointed associate pastor at Cascades United Methodist Church for eight years. In June 2015, Reverend Lemons was appointed a senior pastor of Newton and Chapel United Methodist Church. She is a member of the North George aboard the Lordain Ministries. She served as one of the service coordinators for the 2015 North Georgia annual conference. I'm going to read her accomplishments to you right now but I have a title for her now after I finish reading all this I think you will agree with me. She graduated with honors and received her master.\n\nof Divinity Degree from Gammon Theological Seminary at the Ender-Denominational Theological Center. She received the Gammon Theological Seminary Highest Female GPA Award and served as the Student Representative for the Gammon Seminary Board of Trustees. She is the second career commission pastor with expertise in administration and health care. She has a Bachelor of Science in Nursing from the University of Louisiana, Lafayette Louisiana. A dual master's from Avery University at Atlanta, Georgia. And this one is in the Master of Public Health Administration and the other is Master of Nursing Community Health. Pastor Lemons is a Board-certified registered nurse and a Board-certified primary care family nurse practitioner. With more than 20 years of nursing and administrative experience, she has provided health care services at universities where she developed the Student Health Clinics and served students and staff and faculty. There's more. Reverend Terry Lemons' ultimate desire is to be in the perfect will of God by preaching, teaching and sharing the gospel of Jesus Christ. She has served in the Pulpit Ministry at Cascade as a member of the Pastoral Leadership Team during the Sunday Morning's worship services. She provided Pastoral Leadership to the Nurture Division, which includes the following areas, Prayer Ministry, Caregiver Ministry, Marriage Ministry, Christian Education, Sunday School Discipleship, which is new members of Health and Wellness Resurrection and Stewardship Memory Ministry. Pastor Lemons has served as the speaker at several churches as well. At the Ben Hill Cascade, United Methodist Church Marriage Retreat, preacher at churches in Baton Rouge, Louisiana, Dallas, Texas, Atlanta, Georgia, she has been cited among outstanding, young women of America. Is that any surprise? Is up gone through this? Women of America pastor, Lemons finds her joy in sharing the love of Christ. Pastor Lemons is the wife. Her husband passed away last year. She likes so many here without her spouse's is moving on and here for us today. They are blessed with one daughter, Lashonda Lewis. I want to read this about Pastor Lemons in my coat and shut down my computer. So, well, here we go. Pastor Lemons led the effort to have the churches and community organizations served more than 300 families in our church, the new and in chapter, United Methodist Church, days after the tornado. You all heard me talk about that last year, March the 25th. We were so devastated by that. Here is one of the organizers and one of the persons to help pull our community together. So she organized area churches, black and white, as well as churches from the United Methodist Council in Atlanta. They all came together with many community organizations to create a drive to help so many people who are victims of this tornado. I finally concluded that the person I'm introducing to you today is what I call a first responder minister. She has had this training through the Lord and when this tragedy hit my community, there she was. So, please join me in welcoming Pastor Lemons. Thank you. Thank you. Greetings, House Speaker Rauston, Representative Lynn Smith and all who are gathered here. Please accept my heartfelt gratitude for inviting me to be your chaplain on this Valentine's Day. Thank you for your leadership to the service of the citizens of our great state of Georgia. My aim this morning or this afternoon is to maximize the importance of leading with love because our creator is love. And we are to love each other as he loves us. Love calls us to action as described in 1 Corinthians chapter 13 verses 4 through 7, which describes what love is, how to love and explains what love is not. Now here these verses beginning with verse 4, love is patient, love is kind. It does not envy, it does not boast and it is not proud. It does not dishonor others, it is not self-seeking, it is not easily angered, it keeps no records of wrongs, love does not delight in evil but rejoices with the truth. It always protects, it always trusts, hopes and persevere, love demands action. Sometimes we have to deal with some unpleasant situations which require tough love decisions. However, we have pledged to show our brotherly and sisterly concern in thoughts, in words and deeds. Our creator and sustainer loves us unconditionally. As leaders, we have committed to using our time, our talents, resources and influence to make life better for all that we serve. Love causes us to be effective, action oriented leaders who serve all the people with hearts saturated with faith, with hope and with love. This Corinthians chapter 1313 reminds us of the importance of our faith, our hope and our love. Oh but love is the greatest of these. Today on this Valentine's Day we celebrate love. Leaders of the Georgia House of Representative, those who are in authority in the state of Georgia, any visitors and all the citizens of Georgia. I invite us to go forth in faith for the future, hope for tomorrow and choose to share love in all the ways that we can. I want to leave you with this one thought. God, Yahweh, the Lord who is called by many names wants each of you to know that he loves you very much. Indeed, you are loved. Let us pray. To our creator, sustainer, God. And as thy faithfulness to us, give us your faith, your hope and your love. Pour out in this legislative body wisdom, integrity, unity and wise decisions so that they can live in love according to your divine will and your way to continue to make the state of Georgia a safer and better place to live and work and strive for all of our citizens. Bless these Georgia representatives with your spirit, with your courage, with your joy, with your peace and protect them from all hurt, harm, and danger in the majestic name of your son and our Savior. Amen, amen, and amen. I pledge allegiance to the flag of the United States of America and to the Republic of America, which expand the automation under God, the indivisible, the liberty and justice for all. Our keepers will unlock the doors. Members may greet the chaplain in the south any room. Chair, recognize Chairman Hogan, the chair of the committee on information and audits. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and founded it to be correct. And furthermore, Mr. Speaker, it's better to lie to candle than to curse the darkness a Chinese proverb. Mr. Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is not in the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on the 59th, it was finally established as the order of business or first part of the period unanimous consists of introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading of passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is not in the resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 1329, I wrote some math. This is 144th, Bentley, the 139th, Cameron, the first, way to the 9th. Scott guns, the 14th and others will be titled back to men chapter 16 and title 45, the fiscal to Georgia annotated relating to corn. All affairs. 1330, Barbara, so smiley 135th, Barbara, the fourth, Steven, 64th, Bonner, the 72nd, Gillier, the 162nd and others, Bill, the title of the act to men article 2, chapter 7, title 48, the fiscal to Georgia annotated relating to impositionary computation exemptions and credits from state income tax. Ways and means. 1331, Barbara, so the week's the 178th, Burns, the 55th, Dickie the 140th, England, the 16th, Bentley, the 139th and others, will be titled back to men, title 34, the fiscal to Georgia annotated relating to labor and industrial relations. The industry and labor. House Bill 1332, Barbara, so the Wilson, the 80th, Beverly, the 143rd, Metro, the 88th, and Rolker, so the 38th, will be titled back to men, our 7th chapter 4, title 49, the fiscal to Georgia annotated relating to medical assistance generally. Halton human services. House Bill 1333 by Representative Wilson, the 80th, Beverly, the 143rd, Metro, the 88th, Wilkerson, the 38th and Thomas, the 39th, Bill, the title, the act to men, our 2, chapter 3, title 16, the fiscal to Georgia annotated relating to justification and excuse. Judiciary non-civil. House Bill 1334 by Rosa, Gunner, the 8th, Smith, the 18th, Washburn, the 141st, Crow, the 110th, Smith, the 41st and others, Bill, the title, the act to men, our 10th, chapter 5, title 180th, fiscal to Georgia annotated relating to advalorium taxation. Ways and means. House Bill 1335 by Senator Smirer, the 135th, Hugh Glee, the 136th, Buckner, the 137th, and Smith, the 133rd, Bill, the title, the act to men, chapter 4, title 1 of the fiscal to Georgia annotated relating to holidays and observances. State planning and community affairs. House Bill 1336 by Rosa, the 136th, Buckner, the 137th, Smith, the 136th, Buckner, the 137th, and 133rd, Bill, the title, the act to men, our 107th, title 31 of the fiscal to Georgia annotated relating to regulation of hospitals. Health and human services. House Bill 1337 by Rosa, the dukes, the 154th, Green, and the 151st, Hopson, and the 153rd. More than 90th, the Jackson, the 128th, Bill, the title, the act to men, our 107th, title 16 of the fiscal to Georgia annotated relating to homicide. Judiciary non-civil. House Bill 1338 by Rosa, Smith, the 187th, on the 32nd, Green, and the 151st. Evans, the 57th, part of the 92nd. Bill, the title, the act to men, our 102, the title, the title, the 12th of the fiscal to Georgia annotated relating to solid waste management generally. Natural resources and environmental. House Bill 1339 by Rosa, Mitchell, the 106th, Robert Show, the 48th, Scofield, the 60th and the 70th. Wilson, the 80th and others, Bill, the title, the act to men, our 108th, the title, the 45th, the fiscal to Georgia annotated relating to state employees, health insurance. Health and human services. House of resolution, 768 by Rosa, the 27th, the 23rd, Cooper, the 43rd, Williamson, 68th, Green, and the 151st and others. Resolution, creating a house study committee on expanding long term care options. Local committee on access to quality health care. House of resolution, 769 by Representative Smyre, 135th, Buckner, 137, Hugley, 136th, and Smith, and 133rd, a resolution creating a house study committee on reciprocal state immunity. Judiciary. House of resolution, 770 by Rosa, Scott, the 76th, Holcomb, the 81st, Williams, on the 68th and Davis, the 87th, a resolution creating a house study committee on National Guard Military Reserve Veteran Resources. Defense and Veterans Affairs. House of resolution, 771 by Rosa, Mitchell 106, Scott, the 76th, Clark, the 100th, the resolution honoring the life of SBC, Adam L. Herald. Transportation. Senate Bill 281 by Senator Robertson, the 29th, Alvers, the 56th. Harper the 7th, Bill B. Todd, an active man, chapter 16, and Todd, a 47th, fiscal to Georgia, and it's really in the Sheriff's Retirement Fund. Retirement. Senate Bill 343 by Senator Huffstead, the 52nd, Hillary, 19th, or up to 36th. Miller the 49th, parent of the 42nd and others, Bill B. Todd, an active man, Todd, a 47th, the fiscal to Georgia, and it's really in retirement. Retirement. Senate Bill 352 by Senator Thompson, the 14th, Alvers, the 56th. Huffstead, 50th, Dougan, 30th, McNeill, the 3rd, and others, Bill B. Todd, an active man, chapter 143, the fiscal to Georgia, and it's really in general provisions, professions, and businesses. Regulated industries. Senate Bill 396 by Senator Goodman, the 8th Jones, the 22nd, Walker, the 20th, Harper, the 7th, Sims, the 12th, and others. Bill B. Todd, an active man, chapter 17, the title 2, the fiscal to Georgia, and it's related to Georgia State, nutrition, assistance program. Agriculture and consumer affairs. Second, please first, readers. Second reading of Bills and Resolutions, the tarquored. House Bill 1300 by Reps of Holmes, the 129th, the Bill to amend and act to create the Jasper County Water and Zure Authority. House Bill 1301 by Reps of Hogan, the 179th, Watson, the 170th, Gambling of the 15th, Bentley of the 139th, the Meeks of the 178th and others. The Bill will lead into general provisions applicable to counties and municipal corporations. House Bill 1302 by Reps of Bonner, the 72nd, Carpenter, the 4th Lot, the 120th Second, Matthewic of the 73rd, McDonald, the 26th and others. The Bill will lead into income taxes. House Bill 1303 by Reps of the 188th, England of the 116th, Parkle of the 155th, Irwin of the 28th, Bentley of the 139th and others. The Bill will lead into educational programs. House Bill 1304 by Reps of Hockens of the 27th, Jackson of the 128th, Cooper of the 43rd, Dempsey of the 13th, Gaines of the 117th and others. The Bill will lead into health. House Bill 1305 by Reps of Neal of the 74th, Mallow of the 163rd, a Bill will lead into the imposition rate, computation, exemptions and credits from state income tax. House Bill 1306 by Reps of Neal of the 176th, the 133rd, Smirer of the 135th, Williams of the 168th and Buckner of the 137th, the Bill will lead into children and youth services. House Bill 1307 by Reps of House of the 170th, the Bill will lead into fire protection and safety. House Bill 1308 by Reps of Williams of the 148th, Hayler of the 173rd, Gamble of the 15th, the Elgin of the 24th, Cantwell of the 22nd, others. House Bill 1309 by Reps of the 65th, Scofield of the 60th, Limb of the 99th, Lewis Ward of the 100th, the Bill will lead into agriculture. House Bill 1310 by Reps of Dunah of the 30th, Bird of the 20th, Gamble of the 15th, the Elgin of the 24th, Cantwell of the 22nd, others. The Bill will lead into property insurance. House Bill 1316 by Reps of Neal of the 74th, and Taylor of the 173rd, the Bill will lead into insurance. House Bill 1317 by Reps of the Bar of the 130th, Wade of the 9th, Mom Chan of the 17th, Barton of the 5th, Dunah of the 30th, and others. The Bill will lead into elections of primaries. House Bill 1318 by Reps of Carter of the 92nd, Beverly of the 143rd, Mitchell of the 88th, Hullcomb of the 81st, Bruce of the 61st and others. The Bill will lead into general provisions regarding preparation for and conduct of primaries and elections. House Bill 1319 by Reps of the 150th, the Bill will lead into elections of the 17th, the Bill will lead into Georgia student finance authority. House Bill 1320 by Reps of the 130th, Black, one of the 146th, Williams of the 115th, a Bill relating to revenue and taxation. House Bill 1321 by Reps of Persia of the 176th. Demonstrate the 13th, Hitchens of the 161st, Evans of the 57th, Wilson of the 88th, the Bill will lead into commerce. House Bill 1322, by Reps of the 32nd, Jones of the 25th, Jasper of the 11th, Mitchell of the 88th, Barton of the 137th, and others. The Bill relating to public utilities and public transportation. House Bill 1323 by Reps of the 131st, the Bill to provide a home state exemption from Ups and County, Advalor and Taxes, House Bill 1324, by Reps of the 100th, the 131st, Huckons of the 27th, Newton of the 123rd, Taylor of the 173rd, what Lums of the 12th and others. The Bill relating to emergency medical service and insurance. House Bill 1325 by Reps of the 130th, the Bill to provide a home state exemption from Ups and County, Advalor and Taxes. House Bill 1326 by Reps of the 131st, the Bill to provide a home state exemption from Ups and County, Advalor and Taxes, House Bill 1327, by Reps of the 100th, the Bill to provide a home state exemption from Ups and County, Advalor and Taxes. House Bill 1328, by Reps of the 100th, the Bill to amend an act to provide a home state exemption of $10,000 from all Ups and County, Advalor and Taxes. House Resolution 757 by Reps of the 118th Resolution, on orало Life for of course, Irving Snyder, and dedicating a mile of road in his memory, House Resolution 758 by Representative Neal of the 74th Resolution, encouraging all employers in Georgia to adopt streamlined job application processes, House Resolution 759 by Representative Neal of the 74th, and Gailier of the 160th Second Resolution, urging local law enforcement agencies to establish public safety and ambassador units. Senate Bill 231 by Senator Ann Arte of the 31st pane of the 54th, parents of the 42nd albers of the 56th helping of the 39th and others, a bill relating to elementary and secondary education, Senate Bill 277 by Senator Mollis of the 53rd Harper of the 7th Huffsteadler, the 52nd and Gender of the 47th, the bill relating to caring, and possession of firearms, Senate Bill 340 by Senator Kirkpatrick of the 32nd Watson of the 1st Park of the 11th, Dougan of the 30th, owl of the 48th and others, a bill relating to funding of medical education provided by hospital authorities and designated teaching hospitals. Senate Bill 358 by Senator Kirkpatrick of the 32nd Thompson of the 14th, Harbyson of the 15th, Harbyson of the 29th, and Arte of the 31st and others, a bill relating to the Georgia Public Safety Training Center, Senate Bill 361 by Senator Walker of the 30th, the 30th, Harbyson of the 15th, Mollis of the 53rd, Calzher of the 46th, Albert of the 56th and others, a bill relating to income taxes, House Bill, or Senate Bill 453 by Senator Kennedy of the 18th, the Bill to a Mending Act, known as the Maken Water Authority Act. Senate Bill 457 by Senator Burns of the 23rd and Anderson of the 24th, the Bill to a Mending Act providing the consolidation of Richmond County in the City of Augusta, Senate Bill 458 by Senator Burns of the 23rd and Anderson of the 24th, the Bill to a Mending Act regulating public construction for the County of Richmond. Senate Bill 462 by Senator Summers of the 13th, the Bill to a Mending Act reconstituting the Board of Education of Lee County through 2nd Readers. Reports of Standing Committees, the clerk will read. Representative Rick Jasper, the 11th District Chairman of the Committee on Transportation submitted the following report. We speak to your committee on transportation side of consideration following resolution to the House, as the instructor of the media report, same back files, following recommendation, a resolution for 67 due pass, respectively submitted Rick, Representative Rick Jasper, the 11th District Chairman. Representative Jan Tancersley, the 160th District Chairman of the Committee on Irrigable Coordination Locals submitted the following report. Mr. Speaker, committee on Irrigable Coordination Locals added a consideration following Bill's the House and the Senate to instruct the media report, the same back files, following recommendations. Senate Bill 1250 due pass by Substitute, House of 1299 due pass, House of 1311 due pass, House of 1312, for House of 1313, for House of 1313 to pass, House of 1315 due pass, Senate Bill 406 due pass, Senate Bill 407 due pass, Senate Bill 409, do pass Senate Bill 401 due pass, Senate Bill 409 due pass, Senate Bill 1412 due pass, House of 1312 due pass, House of 1313 to pass, House of 1113 to pass, House of 1113 to pass, House of 1313 to pass, House of 1313 to pass, House of 1413 to pass, House of 1315 to pass, Senate Bill 406 due pass, Senate Bill 407 due pass, Senate Bill 409 due pass, Senate Bill 409 due pass, Senate Bill 409 due pass, Senate Bill 410 due pass, Senate Bill 411 due pass, Senate Bill 411 due pass, Senate Bill 412 due pass, Senate Bill 413 due pass, Senate Bill 4 50 do pass, Senate Bill 451 do pass respectfully submitted. Representative Chan tackers in the 160th Century Chairman. That completes the reading of the report's outstanding committees. Okay, we're going on to the local calendar. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing no objection, it is so ordered that clerk will read the local calendar. House Bill 1250 by substitute by Representative Trunner. On the 85th to cab county house bill 1299 by Representative Leber to the 33rd Albert County House Bill 1311 by Representative Perchetta, 176th Lanier County. House Bill 1312 by Representative Hausson, 170th Barrier County. House Bill 1313 by Representative Perchetta, 176th Acquence in County. House Bill 1314 by Representative Cample, 131st Upson County. House Bill 1315 by Representative Perchetta, 176th Acquence in County. Senate Bill 406 by Senator Hickman to the 4th Effingham County, Senate Bill 407 by Senator Hickman to the 4th Effingham County. Senate Bill 409 by Senator Payne and 54th Whitfield County, Senate Bill 4010 by Senator Payne and 54th Gordon County, Senate Bill 4011 by Senator Antony to the 3rd Herylson County. Senate Bill 412 by Senator Antony to the 31st Pope County. Senate Bill 413 by Senator Antony to the 31st Pope County. Senate Bill 416 by Senator Tillery, the 19th Elephant County, Senate Bill 417 by Senator Harper, the 7th Barian County, Senate Bill 418 by Senator Harper, the 7th Barian County, Senate Bill 422 by Senator Goodman, the 8th Lounds County, Senate Bill 423 by Senator Goodman, the 8th Lounds County, Senate Bill 424 by Senator Goodman, the 8th Brooks County, Senate Bill 425 by Senator Goodman, the 8th Leneer County, Senate Bill 424 by Senator Goodman, the 8th Leneer County, Senate Bill 427, by Senator Goodman, the 8th, Ciao. Mitch County, Senate Bill 428, by Senator Goodman, the a 8th, Mitch County, Senate Bill 429 by Senator Goodman, the 8th Brooks County, Senate Bill 432 by Senator Burns, the 23rd Australiaounding, Senate Senate Bill 433 by Senator Burns, 23rd Scroven County, Senate Bill 434 by Senator Burns, 23rd War in County, Senate Bill 447 by Senator Burns, 23rd Glass-Cop County, Senate Bill 450 by Senator Strictly, 17th Newton County, Senate Bill 451 by Senator Strictly, 17th Newton County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none, the report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted?\n\nIf so, the clerk will lock the machine on the passage of the bills on the local calendar. The eyes are 153. The nays are six. These bills having received the requisite constitutional majority are therefore passed. While purposed as chairman tankersly rise. Mr. Speaker, I rise to make a motion. State your motion. I say that we immediately transmit the local calendar to the Senate. Chairman of the committee has moved the bills that were just passed on the local calendar be immediately transmitted to the Senate. Is there objection to the ladies' motion? Hearing none, it is so ordered. Okay, we're going on now to morning orders. Going on to morning orders due to the, we've got several bills on the rules calendar. And I think we've got committee meetings. So I want to limit morning orders to one minute. Today Chair recognizes the leader of the minority caucus leader Beverly for a morning order. Thank you, Mr. Speaker. Today is a very special day because it's Valentine's Day, but more importantly, it's my mother's birthday. Thank you. As you can see, every woman in the house, I have given you all a small token of appreciation for who you are because my mother is actually in Atlanta. She's in my office in 6.09. The reason why I brought her here from Baltimore is because doing Thanksgiving, she's said, I'm seeing you in two years. I say, I just saw you, the pandemic. My come on down for your birthday. So you all say happy birthday to my mother. Thank you, ladies, for being wonderful and happy Valentine's Day. Happy birthday, mom. Chair recognizes Chairman Bennett for a morning order. Sorry, Representative Bennett, I gave you a promotion there. Representative Bennett. Thank you, Mr. Speaker. I'll take that chairmanship when you're ready. There are days you might get one. Well, today I rise on the 8th of February. I stood in recognition of my dad's birthday. And today I stand in remembrance of his home going. One of the things in Black History Month that I neglected, I didn't have the time to put on it. My dad was an activist. He was a member of the PTA in double-acp, AFL, CIO, the president of the labor union for the American paper company for a number of years. And so I am proud to be his offspring and to recognize him today. So thank you very much to my colleagues in the house. On yesterday, you may be seated. On yesterday, my church, many of you know that I passed through a church in Douglasville. And my young people recognized Black History Day. And so I was so proud to have my young people remind us that our lives begin to end the day we become silent about things that matter. So thank you so much as a quote from Martin Luther King, Dr. Martin Luther King. And if I'm given the opportunity to come back, I'll read some of the other things our young people share with us on Black History. Thank you very much and I yield the well. I recognize his representative Wade for a morning order. Thank you, Speaker. I come to you today as a colleague that's very thankful for Valentine's Day, not just to recognize that of romantic love that we all have with our loved ones or that special person, but also that of the creed to love by neighbor. And we are all equals that we're all here as brothers and sisters. And I want to tell you, I want to apologize because I try to be articulate. And I failed to do so when I made a parliamentary inquiry and I recognized that we had fully funded QB in this state. I'd like to also thank every single person on the opposite side, the Democrats in this room that voted for our budget, that fully funded education. Yes, it was under leadership, but we're all brothers and sisters and I know that we all want to invest in that education. And I'll leave this with you that an eight year old gave me this morning before she gave to school. And I think it will stand from the great philosopher Olof. It says together we're strong. Love you all. Thank you. To recognize this representative Mitchell for a morning order. Thank you, Mr. Speaker. And I will start with saying Happy Valentine's Day to Imer Vigvasant because otherwise I will be in trouble. But I also, I was so hopeful today that when I asked for this morning order, what I would be able to remind folks about was an FDA hearing that was scheduled for tomorrow for COVID vaccines for children under five. But science does not always follow the prescribed process and that hearing is delayed to wait for data from the third vaccine dose in the series for children under five, like road of virus, like D-Tap, HEPP, polio and others. However, today I do rise to reorient us all where we are in the time of COVID. Remember that only one in five children five to nine has been vaccinated in Georgia. Less than one in two children between ten and nineteen. And more than 99% of our children under five remain unvaccinated for COVID. Remember our immunocompromised colleagues and friends. And remember our new post pandemic idea of risk is collective. And that taking care of our communities is going to involve more active effort from here on out. Thank you very much, Mr. Speaker. And I yield the well. Chair recognizes representative Malau for a morning order. He waves. Chair recognizes representative Carter for a morning order. Good afternoon, thank you, Speaker Rostad. The month of February is the month where we celebrate love. Of course today is Valentine's Day. But on yesterday on February the 13th we celebrated Gallant's time day. And that's the day when the gall pales get together. So all of the ladies, remember it's okay when we get together with our friends. Happy, belated, Gallant's time's day. Speaker Rostad, yield the well. That completes our morning orders. We're going out of the rules calendar. Going on to the rules calendar. The clerk will read the caption to House Bill 1134. House Bill 1134 by resident administration 104th and others to be taught and act to amend code section 16154. The fish boat of Georgia annotator relating to participation in criminal gang activity prohibited. This bill has referred to the committee on judiciary non-civil that committee recommends that this bill do pass. Just a moment. All right. Let's give presenters and the well, our attention. If you need to have a conversation, please take them outside. Let me remind the members of the House before we start the rules calendar that the rules committee has limited debate to no longer than one hour on all of the measures on the calendar. The time is to be allocated at the discretion of the chair. And I will allocate it equally to both sides. 30 minutes to each side, which does not include the initial presentation and minority report or the chairman's time. Chair recognizes chairman of station to present House Bill 1134. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring to you today House Bill 1134 with a very important message for us to send all Georgians that this general assembly cares about keeping them safe and that public safety is a real priority of ours. Let me begin by giving you some background. In Georgia, the gang investigators alliance has provided some estimates in law enforcement. There was a meeting of the Attorney General's gang task force last Wednesday where some of these numbers were presented. There are currently over 1,500 criminal street gangs in the state of Georgia and over 71,000 active gang members across the state. And this one really stuck out to me. They estimate that 60% of all violent crime that is committed in the state of Georgia is gang motivated. When you think about a majority of violent criminal offenses being related to gang involvement, it really makes clear that addressing the gang issue is a key to addressing violent crime. We of course believe that all Georgians deserve to be safe. Your vote today in favor of House Bill 1134 is your way to demonstrate that. To address the rising issue of gang crimes, the general assembly has appropriated for additional resources for the Georgia Bureau of Investigation, which includes a dedicated gang task force under GBI Director Vic Reynolds. That task force has been in place and has been making cases. In fact, the GBI has brought 493 cases in 2020 and 553 cases in 2021. Those are investigated cases. It's still providing those investigations so that those offenses can be prosecuted is very important. Now a gang prosecution unit has been proposed for this year. In fact, that prosecution unit is needed and with this legislation, it would apply under the Attorney General's Office with concurrent jurisdiction to prosecute gang crimes along with local DAs across the state. It would be restricted to the criminal gang statute for these prosecutions. We have similar concurrent jurisdiction for anti-human trafficking laws. The AG has already empowered to prosecute anti-human trafficking along with DAs. We're just extending similar treatment. In fact, using much of the law as it applies to the human trafficking here in this proposal. The proposed budget, which is going to be coming before us, the 2023 budget includes in the recommendation 12 additional prosecutors for the Attorney General and over $1.3 million to support this new effort. Ultimately, what we're seeing is the GBI can investigate and make these cases, but we need prosecutors who can work in collaboration with local DAs to actually prosecute these offenses, who have support staff in the form of post-certified investigators who can help to serve subpoenas, be present for interviews, and then ultimately present these cases in court before a jury. So under this legislation, I would just say there's a few key takeaways that maybe you can consider. First of all, gangs are multi-jurisdictional. A gang doesn't just stop at the border of the county or the judicial circuit. If they're operating, and their membership is operating, say, along a certain region of the state, involvement from the state is not only appropriate. It's really needed because of the nature of the types of crimes that we're seeing in combating gangs. Second of all, collaboration with local DAs is critical. Prosecuting these cases, and y'all may know, I'm a former assistant district attorney myself. The expertise required to prosecute these offenses is really specialized. I mean, you have to know a lot of, you have to have specific information to investigate these cases and prosecute them because that expertise helps to identify certain aspects of gang involvement. And third, I think this is important to notice. I've met with Commissioner Timothy Ward of the Georgia Department of Corrections this year and discussed the fact that, well, he told me that it's estimated that 14,000 people currently incarcerated in the Georgia prison system have gang affiliation. And we heard in the gang meeting that gang task force meeting last week that many times non-gang affiliated individuals, when they get to prison, then are approached by a gang about becoming involved in that gang. And so the need to address gang activity within the prison system is critically important. And this task force, this prosecutor task force under the Attorney General's Office, will be able to prosecute those cases. Many times our prisons are in real parts of the state, and then need to have prosecutor support to prosecute those crimes as significant. And AG task force that can address gang crimes within the prison system is going to be incredibly helpful. Now there's two letters that are on your desk here today which I direct your attention to. There's a letter from the Georgia Chamber of Commerce. This is a scorecard issue that they've noticed that they've noted. And then there's a letter from the Metro Atlanta Chamber of Commerce. And some might ask, this is a law enforcement bill. Why is the business community weighing in on this? Because safety is critical to all Georgians across the state. And when you have legislation that is going to impact the safety of our citizens, that's important to the business community, just like everyone else. Now at the risk of jumping too far ahead, I understand there's a minority report on this, and then also I saw a paperwork that was put out on the desk today, which is in a different subject matter than the minority report is written. Let me just go ahead and try to get out in front of some of this so that you have all the facts. The bottom line is there have been circumstances where new DAs who were elected in 2020 have asserted that they have a conflict of interest in certain cases. Maybe they were affiliated with a previous criminal defense firm where they feel that they can't prosecute certain cases because it's a conflict of interest. So there's a procedure in place for notifying the Attorney General of those conflicts. And that procedure has been followed. And what is apparently attempting to be done here is to inject some very case specific circumstances from local jurisdictions in a few parts of our state to try to influence your vote on this bill. The first thing you're going to see the top letter that looks that was put out by a member of the House that's on your desk today is out of making, out of Bibb County and the judicial circuit there concerning a prosecution and a request for assistance due to conflict of interest as a ledge. You'll see in the letter that was put out 12 different DAs were requested to be conflict counsel and they all declined in that circumstance. And that bill, the information I've been given is that bill of indictment has been dismissed. That case is not even pending as I'm here before you today. I believe the letters dated from last fall. So that is, I would submit to you an unfair, well an inexact basis to argue that this legislation shouldn't be passed. There's also in the paperwork a letter from a judge and a gust of concerning issue there. What happened was when the district attorney was elected to represent the judicial circuit there, there was a pending 54 charge gang indictment including 17 gang members. And in addition to that case, the newly elected district attorney there, I say newly elected in 2020, issued a letter asserting a conflict in 80 cases which spanned 800 pages. And the daunting number of conflicts alleged and the impact to that judicial circuit was substantial and continues to be now and they are still dealing with that in Augusta. There are stats as to the number of conflict cases which are submitted to the attorney generally cheer. In 2021 there were 486 conflict cases like this submitted. If you average the previous 19 years, it was only 126 cases per year. What am I saying? I'm saying that in 2021 alone, there was a 385% increase and the number of conflict cases sent to the attorney general's office. And while we're talking about Augusta, that specific situation was sent to five other DAs asking if they would serve as the conflict district attorney to prosecute those cases and they declined. And when you're asked as a DA to serve as conflict prosecutor and you refuse, you can't be forced to do it. So they have to agree to take it on. So it's a very difficult situation that has occurred there in Augusta. To make matters worse, the attorney general's office has been restricted despite all of their important work to be done. They've had financial constraints and just simply not having enough prosecutors to try to intervene with a particularly with a large increase in conflict cases that have been submitted. So I would submit to you that the arguments you're going to hear in a moment really go to my point, which is we need greater funding, we need more prosecutors in the attorney general's office so that justice can be served. And having prosecutors with specialized knowledge and anti-gang offenses is all the more reason to support this legislation. The issue here is very clear. We all talk about ensuring public safety of Georgians. With your vote yes on this bill, you can really demonstrate that. We have the ability to put prosecutors on the cases that are causing violence across the state and to work in a multi-jurisstictional fashion and to work in collaboration with local DAs who need the support and need the help. So I'd encourage your favorable consideration of the legislation. Mr. Speaker, I'll be happy to answer a few questions. You have questions if you care to you. Yes sir. Chair recognizes Chairman Setslor to your right for a question. Mr. Jim and you? Yes sir. Appreciate your bringing this bill. I wanted to declare if I for our members. Isn't it true that the Attorney General is the senior law enforcement officer that's elected in this state by the citizens? Is that not true? Yes sir. That's true. And isn't it further true? This bill simply gives concurrent jurisdiction. This in no way takes away jurisdiction from locals but gives the Attorney General duly elected by the voters. Concurrents jurisdiction. If their expertise and their statewide resources are needed by the locals or locals for all the reasons you highlighted are not best positioned to prosecute these multi-cantic cases. Yes sir, that's exactly right. This takes nothing away from a local DA's ability to prosecute a criminal offense. This just allows the Attorney General to work frankly in concert with those local DAs to ensure that these gang offenses are being prosecuted and that there is an opportunity for collaboration to address this very serious issue. Appreciate that clarification. Thank you. Further you? Yes sir. Mrs. Representative Tyler Paul Smith, do you write for a question? Well the gentleman yielded for a question. Yes sir. Isn't it true that HV1134 language was modeled after the human trafficking bill that we passed here in this body a few years ago giving him authority to prosecute these type of cases and that legislation has resulted in 107 victims being rescued last year in 15 indictments last month alone? I'm so glad you brought that up. Yes, you're exactly right, Representative. We have a great track record from the anti-human trafficking prosecutor working in the Attorney General's office currently, working with the GBI. We're talking about actual lives being saved, victims being identified and located and you're exactly right. The track record is there to really show how effective this is. And isn't it further true that this bill before us today will undoubtedly save countless Georgians from criminal gang crimes? That's exactly true, yes sir. Thank you. Chair recognizes Representative McLeod to your left for a question? That's the gentleman yield. Yes ma'am. Why is this a scorecard issue for the Chamber of Commerce? The issue of protecting Georgians is important to the business community just like it should be to all of us. If Georgians don't feel safe or if visitors to our state don't feel safe because of issues concerning gang crime perpetrated for the purpose of intimidating, causing violence, causing terror within our communities, it impacts all of us and it's something that we should all take seriously. I applaud the Georgia Chamber of Commerce, the Metro, Atlanta Chamber of Commerce for their support. Does the gentleman further yield? Yes ma'am. One more. My specific question is why is it a scorecard issue for the Chamber? It's the Chamber of Commerce has a policy that you'll see on their letter of telling you if it's a scorecard issue. You'll have to talk to them about how the ins and outs of that works. But as I've said, protecting Georgians is important to all of us across the state, should be important to all of us across the state and the business community is no different. Chair recognizes representative Meeks, do you ride for a question? Thank you Mr. Speaker, Mr. Dino Manu. Yes sir. Isn't it true that our vibrant business climate will be further enhanced by pro-public safety legislation such as this? That's exactly right. Yes sir. Thank you sir. Mr. Speaker, I know there are some speakers lined up on this so I will yield the well. You have a number of questions and I'm not trying to get you to take one but one opens the majority leader of the house. I'll yield for his question. I didn't want to see you get never mind. Thank you. Chair recognizes the majority leader for a question. Thank you Mr. Speaker. Gentlemen yield. Yes sir. I'll let it get down to the simplicity of the facts on what we're doing here. Is it not true that the folks that we support every day, that we're being in women of low enforcement, risk their lives that go out an apprehend, investigate an apprehend, these are violent crime, these violent gang members that commit these crimes. Yes sir. That's absolutely true. Is it gentleman yield? Yes sir. Is it further not true that we're just giving one more tool in the toolbox of law enforcement to protect Georgia's, not just the business climate, but the people of Georgia to make sure we take these people and prosecute them whether they be in the out in society, whether they're impacting prisoners in the prison system and make sure the rule of law is what we're ruled by in Georgia and this is good legislation that we, let me make sure we provide the Attorney General's Office and law enforcement in this state and means to protect Georgia's. Is that not true? Yes, Mr. Leader. That's exactly right. And I'll just say in our anti gang task force meeting that we had last week, this legislation was referenced as the top priority for law enforcement around the room to see that this legislation passed. I thank you, Leader, for your question and I yield the well. Gentlemen, as yielded the well, we have other members that wish to be heard on the measure and the chair recognizes representative Bowdie to speak to the bill. Thank you, Mr. Speaker. I appreciate the opportunity to speak in opposition today to HB 134. Let me be crystal clear that the reason why, because I want to get straight to it, the reason why that making Rico case was dismissed is because the state was not there to represent the state of Georgia on that gang case. The AG's office did not appear. So now, let me move forward. Members, I rise today in opposition to HB 1134. It's crystal clear that my caucus, the Georgia House Democratic caucus, know myself, condone gang activities or gang crimes. In fact, in 20 or 2002, my family felt the deep pain and sorrow of my aunt being brutally murdered by random active violence. So I know how it feels to get that call. All crimes, including gang crimes, should be prosecuted locally by local elected district attorneys based on the powers and protections of the US and state constitution. However, HB 1134 did not address the root issue of how to efficiently and successfully prosecute gang cases in Georgia. Let me turn your attention to the letter dated November 17, 2021, which I referred to as document number one on your desk. The letters should address to a BIP county superior court judge from the Deputy Attorney General. I won't read the entire letter from the Deputy Attorney General, line by line, however I encourage you and I encourage every member to read the deputy AG's letter in its entirety. This was a 16-coated-finnet case, 27-count indictment, and it was a very complex Rico case that involved bars, false statements, minor laundry and racketeering. The Rico case was indicted in December 2020, and the then DA from making the conflict out of the case. And again, that case was dismissed because the Attorney General did not show up for a hearing. If you read the letter from November 17 of 2021, it stated the state is not going to be appearing today in court at 2pm. So I want to turn your attention to OGCAG.\n\nOkay, OCGA 15-18-5, which is referred to as document number two. Number four, it states that the state attorney general's responsibility in conflict cases is to request the services thereof or there after to appoint additional attorney, a solicitor general or retire prosecutor attorney as provided in the code section 15-18-30 or designate an attorney from the Department of Law or appoint a competent attorney to act as district attorney, pro-tempt, and place of the district attorney. So the base of that means in this particular case, being that no private attorney would take the case and they wouldn't make it because it was no resources left, being that no DA in the Serena jurisdiction would take that case because they have their own cases and you heard the Chief Justice State last week, the backlog of cases, so they had their own cases. So being that no other DA would take the case, it sounds like to me that the buck stops with AG's office. We just heard one of the members ask a question or state that the attorney general is the Chief Law Enforcement Officer so it sounds like the buck stops with him. So based on OCGA 15-18-5, it was only one option left. The attorney general should have designated one of his law department attorneys to go down to make it to prosecute that rico case. However, in the DA, in the deputy attorney's letter to the Bureau of Accounting Superior Court Judge, and I quote, our office does not represent the state of Georgia in this matter. And therefore, cannot appear on its behalf in court. The deputy attorney general's letter was dated for the same day again that the hearing was to be scheduled at 2pm. In my opinion, the real and immediate need of the attorney general's office is to address the backlog of DA conflict cases across the state. This year, which is 2021 last year, the attorney general's office will receive nearly 700 requests for appointment of a conflict council. That's what the AG, the deputy AG said in his letter to the court, November of the 17th, 2021. Nearly 700 requests for assistance for the district attorney's own gang related cases. I don't see that. I have not seen any other requests from DAs about gang cases because they are prosecuting those cases. And when they have the opportunity or the need, they reach out to ask for assistance from the AG's office and from the GPI. So, members of this House, H.B. 1134, is all about perception. This is because any DA, as I stated right now, in the state of George can ask for assistance from the AG's office. So, I would say to you, 1134 is Mirley Bill that as soon as it's passed out of Georgia House representatives is going to be male, deliver, and coming to a post office and mailbox near you. This is all about perception and it's not about protecting Georgia's. If we want to protect Georgia's, give the local DAs the resources, give the local law enforcement officers the resources, give the Department of Corrections the resources to address gangs, and also give our public defenders the resources to represent in the court of law anyone that's been convicted of any crime. With that, Mr. Speaker, because of the time constraints our year, the will at this time without any questions. Thank you. Chair recognizes Representative McLaren to speak to the bill. Good afternoon colleagues. I'm delighted to be up here today. See everybody. We got the Governor's Bill. We got two chambers, one of which is going to scorecard it. We've got a number of law enforcement across the state asking for it. Some. I've thrown a snowball into an oven before, but this is about as high as it gets. But we're up here today because Chairman of Strations write about the first thing he said at the top of his presentation, which is that we in this chamber want to send Georgians a message that we care about public safety and we care about gang violence in community. Today's Valentine's Day. The day of love. Showing love is hard. Showing love takes attention. It takes focus. So does addressing a really difficult complex problem. This bill is political cover. I was kind of, you know, rich that the presenter of the bill said that we were going to try to distract from the issues by addressing specific cases as opposed to generalizations about gangs and violence and, you know, statewide what people want. We put two letters in a packet on your desk today, one regarding making which my colleague spoke to and two, the Augusta judicial circuit, which obviously the chairman spoke to as well. But the issue being that you've got these complex gang cases that again, if you say to a strap local DA, hey, you want to take this case and a bunch of people turn you down, they're tough cases. They're big tough cases. But then you've got people in jail who, by the way, in this country, are still innocent until proven guilty. Always worth that reminder. They're in jail for years. The local conflict that the DA has has been notified by at least a year. And the attorney general's office still has not responded to the call. Representative Bowdie went through that statute with you, 1518.5, I think it is right. And that statute presents three options for what to do when there's a conflict. You ask a DA, you ask a private attorney, which by the way, in that making letter, the AG's office admits the reason that they don't ask private attorneys is because they don't have the budget for it. I know how expensive some of the DC lawyers are that they hire to litigate hot button social issues nationally, and it'll run your budget right out. So the AG doesn't have the resources to hire somebody else, they can't compel a DA to do it. So what is that second option, the Department of Law? You will not find one reference in that making letter. Again, from the attorney general's office to the court, it's a big deal every time you write the court. You want to be as honest as you can. There's no reference in that letter to the even the possibility that the Department of Law could take the case unto itself. Now, let me go ahead and acknowledge something. It may be that these 12 attorneys, I mean imagine like Avengers music and Marvel lighting and cut scenes. And those 12 attorneys, man, you just put in those 12 and now we've solved all our else. Give them a few peace officers dedicated gangs and now we'll show up for court hearings as opposed to letting Rico cases get dismissed. Maybe that's the magic bullet. I don't think it's the magic bullet. I think the issue we're dealing with here is one of political will. The problem is that attorney general Chris Carr doesn't have political will. He's got political won't. And giving him 12 more prosecutors and a handful of cops is not going to change the culture of that office. The culture of an office which y'all know the political legacy, he worked for a really good man. But he was never equipped to do this job. And unfortunately, this assembly is being asked to cover for a political failure by an attorney general who is not qualified and not capable of serving in this capacity sufficiently. Those are really harsh words. And I understood that coming up here, I was going to say something that people didn't like to hear. The reason I say it is because this is my last year in the house. Y'all know I'm making a completely terrible and inexplicable decision to run for the other chamber. I just want to acknowledge the truth where it's true. But the issue is I don't want to leave here unless I ask this chamber to think critically about the way that it approaches criminal legal issues. To think critically about the moves we make, when we move authority around, we add concurrent jurisdiction here, add cops here. You know, there's a lot of buzzwords in this whole exchange, right? Multigiristictional and complex cases and force multiplier. But you can't multiply force if you're not willing to bring force in the first place. I understand why the chambers want you to vote for this. It's because they need a narrative. They need a story to tell their constituents about what we're doing about crime. And crime is hard. And the chamber is not a position over an hour of ex-issues to address the social determinants of crime, to address systemic poverty, to address a lack of health care, a lack of opportunity, job training, access to all kinds of the basics in life that keeps somebody out of this situation. That's a longer conversation. It's really difficult to have. So instead, the chamber says, both chambers, in this case, you all do us a solid by giving us a talking point to tell the businesses we represent. And that is it. That is all you will do with this bill. And it may be a message to the chairman's original point. It may be a message to Georgians you care about public safety. But stories can be harmful. And there are two stories here. One is the story that lets the AG off the hook for letting these conflict cases sit and defendants get dismissed, then indictments to go away, because a lack political will. But the second story is that this criminal legal system does anything to make this problem better. You know, chairman of the station testified in committee in a very lengthy explanation of this bill that the DJJ experiences the following problem. When an individual, a kid, a child, goes into a DJJ facility within 48 hours they recruited to join a gang. Can you imagine 48 hours children recruited to join a gang? So the question is, if you don't want gangs in the state of Georgia, then why do we send kids to those facilities? We are manufacturing gangs in DJJ, in DOC. But when we have budget hearings on those topics, we hear sunshine and roses. Well, we had 97% turn over last year, but this year is 90%. So we made a huge improvement, says the DJJ. Or GDC, which says the burning question on everybody's minds is, do we have sufficient cell phone blocking technology to make sure that people incarcerated can't send pictures of the horrific, unconstitutional conditions that they live in to outside people that advocate on their behalf? Those are the pressing issues that we hear at the budget hearings for these broken systems. But now we have a gang bill and the chamber wants it, so does the governor. So we're going to vote, it's going to be super predictable. But if this chamber wants a prayer, I'll say it again, following the footsteps of Governor Deal and the legacy of criminal legal reform in this country, if we want a prayer of addressing the spike in violent crime, stemmed by social unrest and conditions of mental health that this chamber is addressing otherwise. Thank God, from 2020 on, if we want a prayer of doing that, we got to get our story straight. The story is not the 12 prosecutors will save the world. The story is that we've got one hammer that we use for every nail, and the truth is that we don't even know how to use it or have the political will to use it in the cases where you're not watching. So let's add the prosecutors, let's add the jurisdiction, let's fund everything, that's what we're going to do today. And let's pray that our children find a way to navigate the system we've created for them, and they don't end up in a gang. Miss Speaker, without you, the will. Gentlemen, as you did the will. We have a minority report to understand that it is being waived, which brings us to the chairman's time, total of 20 minutes. Chair recognizes the chair of the committee, chairman, bursht. Thank you, Mr. Speaker. I won't be up here for 20 minutes, colleagues. I just want to stay sitting there listening to my colleagues speak. It was hard to come up with an argument, because I think we're on the same side here. My colleagues were arguing for reform in the conflict appointment statute. We're not in that statute. What we're doing here is simply adding another tool to the toolbox. We're giving concurrent jurisdiction to our AG to be able to prosecute gang cases. That's it. That's what we're doing. And to my colleagues' point about the systematic changes, I say we could probably agree on some of those things. Bring a bill. Bring a bill that fixes those things. Let's start a conversation. But to come up here and say, we don't like your idea. When you're not even arguing against a bill that we have before us, that's not persuasive to me. I do take exception with one thing. What we do here does matter, and the bills we pass do matter. This legislation is structured just like legislation for our human trafficking legislation. I think that has made an impact in Georgia. I take exception with saying that what we're doing here doesn't make a difference. That's all I have to say, folks. This is a bill that gives the AG the ability to prosecute gang crimes in Georgia. And all you all know, we have gangs in Georgia. And they're not isolated to one jurisdiction. They're not isolated to South Georgia, North Georgia, West Georgia, East Georgia. They're all over the state. Why is it a bad idea to give the AG the ability to prosecute this? You ask yourself that. It's not a bad idea. It is not a bad idea. And we're just over complicating the problem. The problem is simple, and the solution is simple. If we want to talk about systematic change, bring a bill. I'm going to Mr. Speaker yield the rest of my time to Chairman Eftraceon. Thank you, Mr. Speaker. Chair recognizes Chairman Eftraceon for the balance of the chairman's time. Well, thank you, Mr. Speaker. Quite some speeches. I will just say this. You know, I'm not ignorant to the fact that it's an election year. But I've only heard one political speech from this well. I've only heard one speech which seemed to me to be more about demonizing leadership than about really getting to the heart of these issues. You know, I worked as a felony prosecutor, and what I think sometimes is removed from this beautiful chamber, from folks who maybe get really into the politics of the moment, the debate, the fact that, maybe there is an issue with making. And it wasn't brought to me before today. Never brought that issue to me before today. But you know, there are law enforcement officers across the state that wake up early in the morning that stay out late at night investigating these types of crimes. They put on bulletproof vests, and they go out to protect you and me. There are prosecutors who take less money than they could make at a private law firm because they care about public safety in their community, and they care about doing something to stop organized crime. That's what we're talking about here. It's organized crime. And I submit to you that it is a disservice to those people, those people who risk their own lives, their own families, lives, knowing that they're taking on these types of offenders. It's a disservice to try to wrap that in politics, and to try to get down here and think this is an issue worthy of having back and forth, and dropping letters on desk the morning of. Well, since Macon's been brought up, I've had a chance to look into it a little bit further. It was not a gang case. It was not a gang case. It was a RICO gambling case. And it was dismissed after the indictment was improperly drawn by the previous DA, who's no longer in office, or his staff. And after 12 different other prosecutors refused to take the appointment, ultimately the court did dismiss the bill of indictment. To assert that that is a failure of this Attorney General's office, I'd submit to you is disingenuous. And it's certainly not applicable to the issue that's before us here today. Now, to just wrap this up, I mean, you know, the issue that we're talking about here is about public safety for our state. And I would submit to you, think about those investigators. Think about those folks who are having to really make these cases, be able to present them to members of the public so that you can get a conviction in front of a jury. Think about the risks, the burden that that could be on you, and the obligation that we have to recognize that expertise and to support public safety in our state by passing measured legislation like this. I'd urge your favorable consideration of House Bill 1134, because this isn't about politics. This is about keeping Georgian safe, and nothing could be more clear, certainly to me. I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered on House Bill 1134? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? No, no, no. Let's see here before we go out again. What purpose is representative Maynard rise? Parliamentary inquiry. It's not true that I myself as a victim in a county that when I went to my district attorney for something, that the county attorney said, no, I am not going to prosecute that, even though the law enforcement asked her to. If the lady so states, what purpose does chairman Newton rise? Parliamentary inquiry. Mr. Speaker, isn't it true that much of our illegal opiate trade, especially including the deadly fentanyl overdose epidemic we're going through, is directly related to the gang activity, and that this bill will help, help give an additional tool to fight that side as well as all the others. Sure, the gentleman believes that to be true. What purpose does representative Holly rise? Parliamentary inquiry. State your inquiry. Thank you, Mr. Speaker. Is it not true that for as much of us who appreciate our colleague representative Maynard, and certainly for her being able to share here with all of us about the pains of the system, that our prosecutors already able to prosecute well, and our attorney general can also prosecute? All it takes is the will of the attorney general to actually prosecute these cases, rather than going to rallies in DC to watch officers get beaten with the American flag. All right, we're going to lock the machines, then. On the passage of House Bill 1134, then ye eyes are 101. The nays are 56. This bill having received the requisite constitutional majority is therefore passed. Clerk or rate decaption to House Bill 963. House Bill 963, by the way, we're going to perish with the 150th and others to be titled an act of amend. Chapter 13 and title 16, the official bill of Georgia and Tette relating the controlled substances, so as to change certain provisions, or else as to schedule one controlled substances, and schedule four controlled substances. Bill haven't referred to the Committee on Health and Human Services. That committee recommends that this bill do pass. Chair recognizes Chairman Parish to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, House Bill 963 is just the annual update for the Georgia Control Substance Act. Most of you will remember that we do this each year and we update just like this. The update list comes to us from the Georgia drugs and narcotics and the GBI's. And as you know, our law enforcement folks have a really tough job out there. I hope you'll join me in passing 963 so that we can help our law enforcement agencies be more effective and more efficient in their work. Mr. Speaker, if it is a question, I'll take it. If not, I'll ask for your favor. We'll consideration. I'll yield the will. Do you yield for any questions? Yes, I'll take one or two. Chair recognizes representative Clark to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. I've noticed on line 57 that we added the COVID-19 vaccine mRNA to this list, but we did not add the vector, which would have been the Johnson & Johnson vaccine. Can you just explain so that everyone's clear why or how this list was made and why that might have been excluded? Yes, I will. This list comes to us from the Georgia drugs and narcotics agency in consultation with GBI. And mostly we're dealing with the control substances and the illegal drugs that we want to try to get off the street and just enable them to do their job more effectively. Some of these drugs are basically what they were, but they'll be a little tweaked to the molecular makeup. And that's what we're trying to get to this. But we'll also, every year, we'll have a new update just like this. And we'll take your question and your interest and have a conversation with them to try to make sure we do that. Thank you. Thank you. No further questions. Thank you. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 963. The eyes are 157. The nasors zero of this bill. Having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1089. House Bill 1089, members. On Smith and 133rd, another is being titled an act to amend Article 9, Title 48. The official go to Georgia and annotate it relating to load tax on road tax on motor carriers. So it's to increase the penalty for certain violations of registration requirements. This bill then referred to the committee on motor vehicles. That committee recommends that this bill do pass. Chair recognizes representative Vance Smith to present the bill. Thank you, Miss Beaker. Ladies and gentlemen, the House House Bill 1089 deals with one item. Over the past year there have been two 873 violations of registration of motor carriers in state of Georgia. And talking with the Department of Revenue, 90% of those violations come from out of state. So the penalty has been $25. Now my observation would be they'd rather ask forgiveness than pay their dues on the registration. So they just take a chance going through Georgia. And when they get stopped for not having that registration, it's $25. We looked at surrounding states and we're going from $25 to $145, which is the same as South Carolina. The law abiding citizens that register their vehicles, it doesn't affect them at all. It's just that ones that do not abide by the law. So I'd ask you a favour of consideration of Miss Beaker, if there are no questions, I'll yield a will. You have no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill or vote aye? Those opposed will vote no and the clerk will unlock the machines. If all members voted, if all members voted, if all members voted, if all members voted.\n\nIf so, the clerk will lock the machines on the passage of House Bill 1089. The eyes are 151. The nails are six. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to the House Bill 1154. House Bill 1154, where it's in the cost of 46 and others to be tall and act to amend and act creating the Board of Commissioners of Cobb County that's bill 11 for the committee on Governor and Affairs. That committee recommends that this bill do pass. Chair recognizes Chairman Carson to present the bill. Thank you, Mr. Speaker. Members of the House, I present to you House Bill 1154. This is obviously a reapportionment year. This is the reapportionment of the Cobb County Board of Commissioners and their districts. Currently Cobb County is a three to two Democrat County, President Biden, one Cobb County. This maintains that three to Democrat majority on the Cobb County Commission. As it's currently stands right now, there's two County commissioners that are dem, two that are Republican and a county chair that is elected at large, of course, and Democrat. Thus, this map reflects the political composition of the county. It maintains communities of interests for Northwest Cobb, including Acworth, West Mariette and so forth. Northeast Cobb, where I live, in Johnson's Ferry Road, East Mariette, Southwest Cobb, including Mabelton, Austin, and a middle of Cobb District that includes the urbanization along I-75, all the way from the battery, Cumberland Mall area, all the way up to town center. And by the way, this map has been done with less than one fourth of one percent deviation. You know, many times when these maps are done, they're attempt to reclaim some sort of political control over the governing body, and this is a three two, a Democrat majority district, and under this map, it will very likely stay a three two district. Like I said, three two commission, Democrat commission majority. Like I said, President Biden won Cobb County in 2020. What the maps do is they bring together, like I said, spheres of influence and communities of interest, churches, schools, other activities, centers that are common across the community. There's been a fair amount of politicization in regard to one commissioner that has moved within District 2. She actually moved seven eight miles from an area of support to an area of Northeast Cobb. And actually ended up living outside. She moved as a result of the urbanization from Smyrna to Northeast Cobb. Commissioner Richardson ended up living outside the new District 2 boundaries. This does not prevent her whatsoever from continuing in her present role as commissioner. She has numerous options as to how to remain on the District 2 representative on the board. There's been discussion and committee in regard to how this is abolishing an office or abolishing a term that's not what this does at all. She is fully able to continue serving it in her position. With that, Mr. Speaker, I'm happy to take a question. But if there are no questions, I know that there might be some other speakers for this bill. I regret that we can't run this through local legislation, but not even our county is able to do so on a partisan basis, even on the Senate side. So because we have a three three split over there as well. So with that, Mr. Speaker, I'm happy to take a question otherwise. I'll yield the will. Do you yield for questions? I'll yield for one question, sir. Chair recognizes the whip of the minority caucus representative Wilkerson. To your left for a question. Thank you, Mr. Speaker. It is a gentleman yield for just two questions. Yes, absolutely. To my friend. Thank you, Mr. Chair. So you mentioned the partisanship. Is that kind of the driving force to kind of keep the balance in same by the part of the line? The driving force here was to keep communities of interest together, the Northwest Cobb, Northeast Cobb, Southwest Cobb, and the growth and urbanization along the I-75 corridor, those areas and communities of interest. OK. And one last question. If you yield. So was there any effort at all? And we're going to hear on this map that you couldn't come to an agreement. And then on the school board map, we're going to hear shortly that the school board approved that map. Was there any attempt at all to try to work with the Democrats on this legislation? The reason I ask that is that I'm not aware of any time that I've been here, that I've watched this legislator, legislature, that we have ever done this. And so I'm just curious, was there any effort at all to try to compromise? I can't speak to that. I think there are other speakers coming forward to talk to that. Reapportionment is always an interesting process. And I regret that it has to come to this way. But unfortunately, not even their county commission had a unanimous vote on this. They were split along party lines as well. So with that, Mr. Speaker, I will yield the well. Like I said, I know the hour is getting late and there are other speakers on the bill. All right, we do have other speakers. And I would remind those that wish to speak. Those speaking in opposition will have a collective total of 30 minutes. They can allocate that amongst themselves as they see fit. And the same will apply to those speaking for the bill. Chair recognizes representative Anola Whits to speak to the bill. Thank you, Mr. Speaker. Friends, arise before you today from a place of frustration and exhaustion. I imagine you were all tired of hearing from me. Cobb County issues are indeed consuming what seemed to be an inordinate amount of our time. Arise before you today is vice chair of the Cobb County Legislative Delegation. I have lived in Cobb County for more than 20 years. From as 15 of those years, I have represented my community in public office. But community, I mean, the diverse and dynamic population, the people and the businesses that call Smurna Farrokes and the Cumberland area home. We believe in our community. We support our public schools. We cheer together for the Campbell High School Spartans who are getting their second shout out in as many weeks. They deserve it. They're awesome. We roar together in victory when the Braves won the World Series. When those Lockheed C-130s fly low over our homes when they make that final approach to Dobbins, we wink to each other about that sweet sound of freedom. These are to sum of what make up the heart and soul of my community. We are indeed a community of interest. What did I not mention as the heart of my community? A road. I have colleagues in this delegation who actually genuinely believe, while ensuring, by the way, that their communities are nestled snug as a bug, hole in their entirety in one commission district, that the true defining trait of my community is interstate 75. A road, a massive highway that roars with the constant cacophony of commerce and commuters. While I 75 is unquestionably a critical commercial artery, it is by no means the stuff that defines a community. My community is, in fact, bisected in both of the maps we're discussing in this chamber today. We've heard a lot about the communities and cities that are kept whole with these maps in committee. We heard about cities that do not yet even exist that are kept whole within these maps. While my community is divided, my city divided, do not be persuaded that these maps we were about to vote on today, that this commission map we are about to vote on in just a moment, prioritizes in any way communities of interest because they do not. What's more, from the time these maps were about a twinkle in my colleagues' eyes, they were concealed. They were concealed from the public. They were concealed from the commissioners and the school board members. And they were concealed from the delegation. If this commission map is indeed a map that all residents in Cobb County can be proud of, why the opacity? Why offer zero opportunities for public input? This obfuscation is intensely discouraging and frustrating. Cobb County is a place that prides itself in transparency and accessibility. But this map process has been neither transparent nor accessible to the public. This was a process done in darkness, the culmination of which you are witnessing before you this afternoon in this chamber, and I am telling you, it is not who we are. It is not who we should strive to be. It is certainly not anything to be proud of. On your desk, see we each have a statement from Cobb Commission Chairman Lisa Cupid. I hope you will take a moment to read it. Of note, she says, no pothole is seeking an R or D for resolution. She continues that these maps undermine the respectfulness of the elected leadership of this county when it fully draws someone out of an area that they have been elected to represent. It also furthers political polarization when districts must be drawn that are either Republican or Democrat and not a combination of both which can result in balanced thought within the leaders that represent them. Again, that statement is on all of your desks. We are about to vote on maps that I maintain are not the product of balanced thought. No, they are the product of fear. Fear of waning influence. The fear that happens when someone realizes they might be at risk of losing power. Fear is indeed a powerful motivator. Fear is why we see a map that brazenly and utterly unnecessarily targets an incumbent. It is why we see a map that tries to convince us that an interstate highway is the defining characteristic of a community. I stand before you today as your friend and your colleague and as someone who, along with my Democratic colleagues in the Cobb delegation, has done her level best to foster a map process that is open, transparent, and collaborative. What we are about to vote on is none of those things and I urge you to join me in voting no. I yield the well. Chair recognizes representative Wynn to speak to the bill. Thank you, Mr. Speaker. There were times in my life where I wasn't particularly the best student. In college, I was waiting tables at night, learning how to be on my own for the first time. There were times in which I was unprepared for class. And that lack of preparedness was met with accountability and consequences from my teachers. They did not cover up for me, make excuses for me, or give me the grades I didn't deserve. That's how it works in the real world for the most part. If we are unprepared in the workplace or elsewhere, we are often held accountable for that. It's understandably hard for the public to see that those rules don't apply at the general assembly. And that's exactly what we saw last week in committee when this bill was presented. It is right and fair for the public to demand that elected officials take our job seriously, especially when it comes to decisions like local redistricting, which impact the future of over 750,000 residents in Cobb County. But as lawmakers, we're not required by law or by rules to be prepared. But we are required to adhere to the standards set forth by law. And when this bill was presented in committee, the bill sponsor said, I've never heard of packing and cracking. Section two of the Federal Voting Rights Act prohibits any electoral practice or procedure that minimizes or cancels the voting strength of members of racial minority. It's called vote dilution. Cracking and packing has been historically used to disenfranchise black voters and other voters of color. So I'd like to re-ask the question that was never answered in committee. You've stated you've never heard the terms packing and cracking before. As you know, when maps are drawn, we do have to comply with the Federal Voting Rights Act, which say you cannot pack or craft. So how can we members be confident that is done in your proposal if you don't even know what those terms are? I never received an answer unless you count laughter, because all questions were shut down after that. And that's not the only question that remains unresolved. This map draws Commissioner Jerrica Richardson out of her district. She was duly elected to serve in 2024. So what happens to Commissioner Jerrica Richards? And if she is unable to move? O-C-G-A-1-3-11. No office to which a person has been elected to, shall be abolished, nor the term of the often shortened, or lengthened by local or special act during the term, for which person was elected. Unless the same shall be approved by the people of the jurisdiction affected in a referendum on the question. This map shortens the term of Commissioner Richardson. When I asked in committee, what happens if she is unable to move? I was told she should just pick up a move again, like we all can on a whim. Would it not have been easier to draw a map that allows Commissioner Richardson to continue to serve the people who elected her? Instead, the options are this. She will be forced to move. If she's unable to do so, this will be litigated in court. And that cost will be passed on to the voters in Cobb County. It's not just fiscally irresponsible. It's very likely to be found unconstitutional in the court of law. So I will be voting against this bill today, because of the content of the bill and because of the process that was used to get this map in front of us. The idea that one representative can circumvent the will of the board of commissioners, the majority of the Cobb delegation, that is anti-democratic. This is the installation of minority rules. It is a dangerous precedent that should be rejected by all of us, no matter what side of the aisle we belong. But instead, we are met with gross indifference, because we have learned here at the General Assembly that you don't have to be prepared. You don't have to answer questions. You don't have to even understand state law or the legal requirements of the voting right act. Because your bill, it will be passed anyway. Mr. Speaker, I yield the well. To recognize his representative, Mary Francis Williams, to speak to the bill. Thank you, Mr. Speaker. So I'm from Cobb, as I've told many of you, many times. And some of you know that my father was a state representative in this house. And as much as he loved serving in public office and he really did love it, it broke his heart, literally. He died at age 50 after his second heart attack. So I myself entered politics with open eyes. I didn't expect fairness or kindness. Although I've been on the receiving end of both. I know that there is nothing I can say to change your vote. So I'm not going to talk very long. I've literally been told by members I respect that testifying doesn't change the vote. Which is really kind of sad because I remember back to the days of Denmark-Ruver. And I think he changed a few votes. We're here with this version of the bill because we never had a chance. I think we could have worked this out. There was willingness on the part of one of the Republican commissioners to work something out. And the truth is we just we never had that chance. We were never given that chance. Because it was pretty well known and said to us about the other map that you'll consider for Cobb, that they didn't have to talk with us. There were democratic members of my group. They didn't have to talk to us. They didn't have to work with us. Because they were going to get their bill passed without talking to us or without dealing with us. Now, I don't expect fair all the time. But my God, that's just not fair. Not to even give us a chance to work it out. And the arrogance to say to us, we don't have to talk to you because we're going to go over your heads and there's not a damn thing you can do about it. So, I just want to say to you, I wish testimony did change votes. I wish we still had that kind of house. But I'm okay either way. But I did want to share with you that it's hard working when there's not fairness. Thank you, Mr. Speaker. Chair recognizes Chairman Setsler to speak to the bill. Ladies and gentlemen of the House, I want to address this issue. I appreciate Chairman Carson teeing this up. And I want to really speak to the heart of some of things that were said and some of things that have been suggested. I won't speak to everything that's been said this week because this body I think has been dishonored by the posture and the words and the candidly the silliness of some of our members, both in legislative proceedings and in public. But I won't go there. That's not appropriate for us to speak to. I'll leave that up to every member to evaluate for themselves. What I want to speak to today is the fact that before you and House Bill 1154 are fair balance maps for the Cobb County Board of Commissioners. Their maps that recognize the diversity of Cobb County. Their maps that are, although these were not the sole consideration, they're politically balanced. They provide that this balance that folks in Cobb County can look at and say, you know, that makes sense to me. When I think about the rural suburban nature of West Cobb, there's a district in West Cobb. When I think about the suburban East Cobb, there's a district for East Cobb. When I think about the high density commercial central Cobb area, there's a commission district that represent that communities of interest. And of course, the suburban, slightly more urbanized, South Cobb County has a community interest that recognizes them. Any citizen who knows Cobb County can say, you know, that map looks fair. The folks in that area tend to think the same way. They're going to want to have single family residential and quality of life commercial around them. And this map recognizes that. It recognizes the truest park in the sort of the central Cobb commercial area that's vibrant, that's growing. A lot of young millennials and a lot of the vibrancy in Cobb County that's new growth that we're so very proud of. But friends, the suggestion somehow that this process is somehow been sidestepter, that this map represents anything other than a fair, balanced, appropriate map for Cobb County is irony that I think is, is almost deafening. Now as we think about the representation here in Cobb County, this idea that the minority party has this grip on Cobb County, at the beginning of this session, when this map was filed, there were seven Republican members who lived in Cobb County of this body. There were six Democrat members of this body who lived in Cobb County. Now, but because of the way the delegation works, there are members who live in Fulton County who represent parts of their district, touch Cobb County, that creates this very, very narrow balance of eight Democrats, seven Republicans in the Cobb County commission, or the Cobb County delegation process. And on the Senate side, it's three Republicans live in Cobb County. One Democrat lives, Senator lives in Cobb County. Again, but with Fulton County representant senators, it's a three three circumstance. I share that to say Cobb is a very politically balanced place in this map, delivers for Cobb County's citizen a map that we can be very proud of that maintains that very balanced political nature. And in addition to those commonly understood communities of interest, what happened, however, and I won't mention names because the people that were part of this or in this room, there was a scheming partisan huddle not by the majority part of the minority party. In December, in fact, I've got an email to that effect right here, ladies and gentlemen. And on this email, there were four members of the minority caucuses. In fact, members who spoke here today were in this email. You know, one of the members spoke about some things happened in a dark room. Well, I can tell you in the dark room, members of the minority party were scheming to put together a map. A map that one of our members in the minority caucuses proposed to create a total five zero Democrat takeover of the Cobb County commission. It was engineered to be a five o' takeover of this commission that they looked at trend lines, they looked at where the politics were, they say, you know what, we're going to create a map that maybe, maybe, maybe, maybe, maybe has one Republican representative now. But we see based on our modeling, this will be a complete Democrat takeover by 2026. In fact, it was very artfully done. If you understand the way this process is done, you study their work, it was pretty ingenious work actually. I'll give them credit for it. But in that dark room that the earlier representative was talking about, members of the Democratic party were scheming and putting together a singularly partisan map to take a county that has 53% Democrat, 47% Republican representation, and deliver a five zero control to their party through this redistricting process. It's interesting to folks who are the most shrill and most ugly in their presentations and their criticism of these maps are themselves the ones in that very dark room scheming a complete partisan takeover of Cobb County. I'm proud to say that the majority party being magnanimous is not even drawing a map for Cobb County that would likely leave a Republican majority on the county commission. In fact, members of the majority party here that I represent and supporting HP 1154 have been criticized by some by saying, wait a minute, why wasn't there more of an effort to try to rest control back from a Democrat controlled county commission? The answer is, that's what not what this process is about. This process is about fair representation that fairly represents communities of interest, that likely when anyone looks at the communities of interest that's manifest in HP 1154 folks can say that makes sense. That looks like Cobb County, and by the way, it's not seeking to change the Democrat partisan control of our county commission. Ladies and gentlemen, it's that same magnanimity, if you will, that I'm proud to be a part of that I think Chairman Carson is wise to have supported in his filing of HP 1154. It's that exact sense that the very critics of HP 1154 had their very hands caught in the political cookie jar in this email that says it's important to get your final feedback before we socialize this with the rest of the delegation and the public. The only members on this email, I won't mention names because we don't do that in the wellers, four members of the minority caucus, scheming in that dark room in December of 2021 for this decidedly partisan Matt Mr. Chairman. Friends, HP 1154 something we can all be very proud of. We don't call names out in this place, but we do call facts. And I will tell you that when you think about the circumstance that's being addressed here, and you think about the ugliness that's been presented in committee, you think about this, the ugly claims, and the half truth that have been shared, I think members of the public deserve better. And I can tell you for sure Cobb County deserves better. You might even see histrionics and excited folks waving their arms in this very well here today, but I can tell you the facts still remain. What we have before us is a fair balanced County Commission, Matt, that everybody can be proud of, that is in fact based on fairness and representing the process that we can all be very proud of. Now the issue is raised Mr. Speaker, and I know we're short on time of one commissioner who chose to move within her district four months after being reelected. Now what you guys do imagine, ladies and gentlemen of the House, what you'd imagine somebody that when they were elected was sitting right here where Houston gains its, if you can imagine this being Cobb County, they were elected, they live where Houston, relative to this chamber about where Houston seat is. And if this is Cobb County, they moved after four months after being elected way back there to about where Bill Yurt is back there, and I can see Bill over there about the door, my friend Bill, moving dramatically across their district. It's someone's prerogative to do that, but when someone moves from where they live when elected up there in a precinct next to one of their other sitting commissioners, that's, are we is a delegation or we as legislators to take the representative lines of 800,000 people in Cobb County and twist and bend and contort those lines to reach up in a big arm and drag them into a district because where they chose to move. Ladies and gentlemen, I've talked to my constituents, folks are mad that politicians self-deal to themselves. We're called to be statesmen, the idea that we would draw maps around where one person in their real estate agent decided to put in their real estate offer.\n\nIt's simply nonsense. It's beneath this body and the fact that 1154 gives a mechanism for that commissioner to continue to serve for the remainder of their term, I think is the basis of fairness in which we're working and that gives her a path forward to continue to represent her district should she choose. Mr. Speakers, I conclude I just want to say to you I am disappointed that members of this body, the fake outrage that's been generated, the ugly things that have been said, I won't even read the words that were said in Cobb County this weekend in a community gathering. But the reckless divisiveness that I believe denigrates, denigrates what has historically been a true fight for freedom and justice for all people is something that this process is I think candidly should not be solid by and I think 8-1154 or something we can all be very proud of with that Mr. Speaker yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none, the previous question is ordered. So we're going on out of the minority report, a total of 20 minutes. Chair recognizes representative Allen for the minority report. Thank you Mr. Speaker and I'm going to try to tone down the fake outrage that we've heard and try not to flail my arms. But we law and order rules, rule of law, all those words that we hear spoken and directed at others but used by most. And I'm going to come back to that but today is a very sad day. A sadness that I like many others in this chamber are uniquely qualified in position to feel. See I've been a minority my entire life. And I'm sort of used to it but the problem is with this comes some very relative superpowers. I can spot things. I can sense things and I can feel things. Now some of you in this room are experiencing being a minority for maybe the first time. So I get it. It's scary. You get a little frustrated when you see rules that are designed to let you work but never let you win. It's hard to go up against rules and structures where you have an appearance for fairness but a reality of failure. So I get it. I've been there. I constantly occupied that space. Now I know I'm going to get accused of playing the race card but let me be clear. I am only playing the hand I was dealt. Plus I'm used to that when uncomfortable truths are spoken that seems to be the default. In committee a colleague of mine mentioned race and I could see that people physically became uncomfortable. But what I want you to understand is how uncomfortable it is for someone in the minority to realize these truths in that moment and articulated. It's not comfortable for either one of us. And this is an opportunity for us to do what's right and to not move forward with producing maps that impact so many who have shown up to vote and let their voice be heard. Now you see the majority came and talked about local control and the fair process but what we can clearly see and the reason we're here today is because it only takes effect when the locals need to be controlled. Once we start having electoral wins we need to start raining that back and as chair of the delegation I knew that our process had to be above board. When I saw the memo from the leadership saying that all local bills will be treated as local I had a little glimmer of hope. We talked with commissioners. We made their edits. We met with delegation members and the community just to make sure we had a chance at getting our maps passed. But when I saw comments in the press from my colleagues that ignored all of our work when emails went unresponded to when meetings produced more and more no shows I knew we had no chance. Remember I see things. In committee this is where the reality really started to set in. There was one argument and you've heard it today that because of our delegation and two of our delegation members not living in Cod County their vote doesn't matter just doesn't count. Now most of us in this chamber represent a county in which we don't live in. That's the nature of how these maps have been drawn. We also know that it was seven times and I'll include today as the eighth. Seven times over two hearings by three different presenters. It has been said that the Cod delegation is a seven six majority of those who live in Cod. This is clearly signifying that the other two members who represent their communities are less than do not count as much. And then my other colleague talked earlier about when in committee the term cracking and packing was was said the presenter actually laughed because he didn't know that those were real terms thought they were made up. When asked if he knew the voting rights and legal requirements just shrugged his shoulder said no and proceed to say this is a map that was fair because they said the balance of power their words not mine. Also in committee a commissioner that has been drawn out of her district was doxed. A single female commissioner they stood up and read of her address in an angry fit in order to incite some type of response that is completely irresponsible. They also told her that she wants to continue to serve and they repeated it today that she should not have bought a new home even though that home is still in her district. As if it's that simple I'll point out that no other commissioner is faced with this burden. I sense things. And to be clear the balance of power that they talk about could have been achieved without this petty vindictive move what is happening is an intentional target of a young universally respected progressive voice that they saw an opportunity to get out of her office three years early one year into a four year term. And it's not just this one black female in 2018 Lucy McBath won a congressional seat. She's been drawn out in 2018 Sheree Davis the first black female elected to the school board in the maps you're going to hear later drawn out. And in these commission maps Jericho Richardson drawn out. Now not to mention during during committee it was also stated that the location of the commission's homes were not a factor. However last month before anyone saw the maps. One of the members that you heard from today went to the press and said I quote she committed political suicide by moving in quote. This is the same member that also told reporters that they did not have to work with Democrats in the delegation because they knew we would be here today. So the overtures about wanting to work together in the question asked of was there a reach out I will answer that emphatically though. So unfortunately now I have to go back to my constituents who mobilized energized went out and selected their duly elected representatives and tell them that that vote really doesn't count. It doesn't matter because the majority has been able to strip us the duly elected members of this delegation of our ability to go out and do the work that you elected us to do. Once again I feel things. So there's also been a reference to the emails I want to speak on that for just two seconds. The member that spoke about emails that went out fails to neglect the four members that were copied on the email that was sent to commissioners and to school board members about this process were members of the leadership. If you want to be in leadership you should have run. The leadership of the code delegation was elected unanimously. If you did not want that leadership you could have said no or matter fact you could have showed up for a meeting. So what was our process? We went through and talked with commissioners and school board members. We then went to the delegation with proposed maps. We then went to a delegation meeting in which no one showed up from the other side and then we had a community meeting where the maps could be discussed. We have followed the process every single step of the way and if you feel like you've been cut out welcome to the minority. So I want to close by just acknowledging that this has been set in motion for months. We knew we were not going to get a chance to do our jobs like our colleagues and the majority. We're not going to be able to respond to the will of our voters. But I will tell you our vote is under attack. Our ability to do our work is being diminished. And it's maddening. It's frustrating but unfortunately it's nothing new. The majority I know you won't join me in voting no but you should. If you really like rules and order then restore it. If you don't like to be called a thief, stop stealing. And if you don't want to be accused of doing things based on race, stop that too. And that Mr. Speaker, I yield the balance of my time representing Wooks. Nine minutes left. Chair recognizes the minority caucus who up representative Wilkerson for the balance of the minority report. Thank you, Mr. Speaker. Man was I wrong and I made it. I believe that we were going to follow the same rules that we followed probably 40 years at least. Where you win your county, you work with everybody, you get a map that you can agree on. This week I have been wrong. I've been called a liar. I've had the state troopers called on me. Well that was last week. But it kind of runs together when the cops are coming after you. We have weaponized a police win too many times. The rules should apply to everyone. I agree elections do have consequences because rules should not. The people that we represent should not. And I wasn't going to speak. It's all guy called a liar again. Let me tell you about that email that was found. Because people are asking about an email that was found. The email wasn't found. We sent it to them. The email was sent to, let me pull up my glasses so I can tell you who it went to. From representative Eric Allen on December 20th. And you all should have it because I think it's very important that you guys know the facts. You can vote however you want, however you're told to, but you should have the facts. On December 20th, Eric Allen, the chairman of our delegation, sent an email to Elisa Cupid, Democrat, Caligambral Republican, Jack Ritcherson, Democrat, Joanne Barrel Republican, Monique Sheffield Democrat, copied Terry Nullowicz, Mary Francis, so my colleague didn't tell you all that. It was never lost. We sent it to both parties. And what he said was he walked through this process. The leadership got together. I've had experience throwing the maps. I was involved as well. And they came with the map. Then they sent it to the commissioners. And I remember we had our hearing. And I talked to the Republican commissioners because I don't meddle in local politics. I remember before I even got here, they say, stay away from local stuff you can. Stay out of that area. And I tried to. I support them, Democrat and Republican. I would love to keep things kind of the same. Cobb County is doing great. The county, the school board is, we'll talk about that a little bit later. But I asked East Commissioner, how do you like the map? They loved it until they started looking at numbers and doing analysis on political data. And then when we had our meeting, Commissioner Joanne Borrell came down here with a 2015 map or some year that was not applicable anymore. But she said, I want to make it look like this. And we said, well, Commissioner Borrell, you can't. But what we will do is we will walk you down to the chairman of our delegation. Walk through down there and say, whatever you, we can do to help you represent your community, we will do that. So let's be very clear, only one group had a public hearings. That was the delegation. Only one group released their maps to the whole universe. That was the delegation. Only one group released it to both Democrats and Republicans. If you ask my colleagues in the back that is Democrats, they didn't see this map any time before the Republicans did it. They weren't a leadership. We weren't huddling in the corner, cutting deals. Because we, Cobb is a great place to live. And if you live there, you wouldn't know that. But you don't. You're just coming to push a button and take over our county. You don't live there. You don't know where Herk Road is. You might, because you might pass through to get to the mall or to a brave game. Or maybe you come into the state and to see. But, you know, every morning we ask each other, how you doing? I'm going to be honest with you. This shit sucks. And I apologize for that. But I go to my wife and she doesn't want to hear about this. And I apologize. She doesn't want to hear about this. I broke the court. I'm just like the person that's been calling me liar. But at the end of the day, it is frustrating. It is frustrating. And I do apologize for that. But at the end of the day, it's hard to go home and tell people that you serve with some great people when they do this to your county, when they do this to people you represent. So, with that, push the button. It should be about 96. Yes, 95. Yes. 60-something. No. And then we'll go back home and explain why we thought this was the right thing to do. Even though they had no hearings, no public input. It was strictly drawn by partisan reasons. And I'm going to ask for a ruling shortly, if I'm allowed. And I'll turn it back over. But thank you for the time. And thank you all for listening. But it's frustrating. Thank you, and I yield the well. We're going on now to the chairman's time. Total of 20 minutes for the chair's time. Chair recognizes chairman Darleen Taylor. Thank you, Mr. Speaker. I would like to report that this bill had a thorough vetting in our subcommittee. And it was again heard and then passed in the full committee. I will tell you our committee follows decorum. And each member was allowed to vote as they wish to. This map met the criteria required by the legislative and congressional redistricting office. And I will yield the remainder of my time to Chairman Carson. Chair recognizes chairman Carson for the balance of the chairman's time. Thank you, Mr. Speaker. Thank you to chair, Larry Taylor, for all you've been through for this. You've been a role model to follow. I just want to reiterate a few points. These are fair maps. These are areas drawn with communities of interest and mine. And they reflect the political composition of Cobb County. Just on a personal note, I apologize that for that this whole process has had to take slander, language, and so forth. Cobb County is better than this. Frankly, to my fellow colleagues, we have not shown you that. But Cobb County, as a whole, I assure you, is better than this. And this house deserves better. I do ask for your favorable consideration for this map. And I yield the well. Gentlemen, as yielded the well, previous question has been ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no. And the clerk will unlock the machines. What purpose is represented to a nullow its rise? Parliamentary inquiry. Yes, sir. Apologies, the by-sound shrill. If this ingenious scheming took place, wouldn't the resulting map that the Democrats drew have changed more than nine precincts? I truly don't know the answer to that question. Chair recognizes what purpose is representative Wolenski rise? Parliamentary inquiry. Statue inquiry. Is it not true that one of the members is spoken the well when they are talking about inappropriateness or ridiculousness? I think the committee had been talking about when he jumped into a press conference he wasn't invited to and got on the microphone. I couldn't hear your inquiry. What purpose is represented in the cloud rise? Parliamentary inquiry. Is it true that the chairman still doesn't know what is in section two of the Voting Rights Act and what packing and cracking is? I don't know what any member of this body knows or does not know. Chair recognizes chairman Setsler or purpose to U-rise. Parliamentary inquiry. It is true that all the concerns with respect to the Voting Rights Act were very well managed in this and in fact the only minority influence district went from 46.3% African-American to 46.7% and that is a model of how we should proceed with drawing fair maps. The gentleman so stage. Final parliamentary inquiry. What purpose is representative Wilkerson rise? Parliamentary inquiry. I was one of the speakers could make a ruling on 18.1 where the line says that the committee shall observe such rules and considering legislation when the delegation has submitted rules that require a hearing. That applies only to the intergovernmental coordination committee, not to governmental affairs. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1154. The eyes are 95, the days are 64. This bill having received the requisite constitutional majority is therefore passed. What purpose does chairman Carson rise? To make a motion. To make a motion. To make a motion. I move that House Bill 1154 be immediately transmitted to the Georgia Senate. The gentleman has moved that House Bill 1154 be immediately transmitted to the Senate. Is their objection? Their objection is the gentleman move, gentlemen moves. All those in favor of immediate transmission will vote aye. Those opposed will vote no and the clerk will unlock the machines. If all members voted. If all members voted. If so, the clerk will lock the machine on the gentleman's motion. The eyes are 95, the days are 61. This bill is on its way to the state Senate. Clerk will read the caption to House Bill 1028. House Bill 1028, by the way, is on the very heart of the 36th and others to be entitled to an act to amend the act, fighting for the election of members of the Board of Education at Cobb County. This bill, that meant for the committee on government affairs, that committee recommends that this bill do pass. Chair recognizes representative Ayerhart to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I bring before you for your consideration House Bill 1028, which sets forth the new district lines for the Cobb County Board of Education. The map achieves the goals of those who drew and supported, which is number one, local control. Number two, legal compliance. Three, equal representation and fourth, the stability of the school district as a whole and the seven individual posts that make it up. The local Cobb Board of Education voted to accept this map. After requesting that a plan be drawn that first and foremost complies with the Georgia Constitution, the U.S. Constitution and the Voting Rights Act. A few facts about the map. The population deviation for each of the seven posts is very minimal, less than one half of a percent. The plan potentially creates three minority opportunity voting districts, post two, three, and six. Each post, represented by or at least contains two high schools, that was a request and a requirement, a preference of the school board. The board considered communities of interest. I'd like to describe those as relates to a school district. For example, the cities within Cobb County falling entirely within an individual school board post was a plus. The city of artwork is completely within the city of post one. Powder Springs where I live all within the city of post three. The city of Ostele mostly in post three, the future city of vines, 100% inside post six. The future city of east Cobb, completely inside post five, the area, the future city of Mabelton, largely in post two. The future city of Los Mountain also largely in post seven. It's worth noting that within the map, things are other things that were considered. Number one, high school attendance zones that is important. Those are largely represented by the same member. School feeder patterns were also considered and reflected appropriately on this map. The current map kept every member who was eligible for re-election inside their same post. That's a difficult job given where some of the members do live, close to each other, and the natural populations shifts that have occurred over the past ten years. Ladies and gentlemen, as a 45-year resident of Cobb County and the proud product myself of the Cobb County public school system, I graduated from Osborne High School, I won't tell you the year. It is my honor to carry this bill and to ask for your favorable consideration of this map, which is both equitable, legally sound. Mr. Speaker, I am happy to yield for questions. You do not have any questions. Thank you very much. Ladies, you did the well. We have others that wish to speak on the bill to recognize his representative Roberts to speak to the bill. Thank you, Mr. Speaker. Good afternoon, colleagues. I don't live in Cobb County and my district doesn't actually include Cobb County. I don't really have a dog in the fight as to the actual maps that are approved today. I do want to talk about the process or deviation there from that has been happening in this chamber because it affects every single person in this room as well as every single citizen we represent. In America, there are certain principles upon which our democratic republic was founded, a government of the people, by the people, and for the people, where the majority rules, and a respect for the rule of law, I heard the majority leader reference the rule of law earlier. So I hope we can all agree how important it is. These principles have given me comfort throughout my life because it gives us a predictable framework for functioning in a civilized society. From those basic tenants, we write laws, rules, and bylaws to provide further guidance. If we abandon these principles, it produces chaos. Imagine if, you know, when we drive, we know that there are rules about who has to yield at an inner section. And if we abandon those, it would, again, provide produced chaos. It undermines our basic contract with each other to respect the rule of law. This body, and specifically the majority party, has a long history of preserving home rule and local control. Legislation impacting local governments or local bills are by our own state house rules, supposed to be left to legislators elected by the people who live in the affected locality. It's both to avoid having partisan fights over the basic governmental services these local governments provide, and to ensure that the citizens in those localities have the ability to hold those leaders accountable at the ballot box when they don't deliver those services. Specifically with regard to local redistricting, I'm told in the history of the house these local maps have always traveled through the process as local bills, not general bills. We have always been, it's really distracting when people talk loud. We've always been a rubber stamp essentially for the maps that are drawn by the local commissioner school board with input from the public. In fact, the last redistricting year in 2011, all of the more than 230 bills were brought as local bills. So I have to ask myself, why would the majority party of this house abandon its own rules, its local delegation bylaws, and a longstanding precedent of local courtesy and deference? During the government or affairs committee hearings, we asked Republican sponsors of these bills, several questions. Was the map the subject of any public hearings? No. Did you consult with other members of your delegation? No. Didn't your local delegations pass rules that say how local legislation should be treated? Yes, but we can do this when there isn't a consistency.\n\nsay you need a unanimous vote? No, a majority. So shouldn't you just have accepted the vote of the majority? Why did you feel the need to go around your delegation? Draw maps, draw your own maps, and ignore the will of a majority, majority of the citizens of your county, because the county has changed. When asked how it had changed, no tangible response was given. All right, let's look objectively at what changed. I feel like we need to break it down to Sesame Street level. One of these things does not look like the other. We are doing this in Guanette and Cobb counties so far. It doesn't take a rocket scientist to see in these counties that demographics have shifted recently, and the majority of citizens in these counties have duly elected. More Democrats and specifically Black and Brown Democrats to local commissions and school boards. Cobb specifically recently elected Democratic leadership to the county commission for the first time in a generation, an all-female commission, and Black leadership for the first time in its history. That shift is also reflected in the representation of the local delegations in this house, who now have the majority in those delegations. Now, before you dismiss me as, was it silly and get defensive at my even hinting that race has anything to do with your deviation from longstanding rules and precedent, and inviting those of you who look like me, because we don't get up here and talk about race a whole lot, to just listen for a minute, because it might help you understand why our friends of color in this chamber feel like they do. The state's history around local rule tells us a lot. Local control historically has been a dominant theme in southern political identity, and very much is associated with the perpetration of racial slavery, racial segregation, and racial discrimination. For example, the Georgia legislature demonstrated an acute awareness of such local independence after Brown versus Board of Education in 1954. When you know what it did, it enacted legislation to defund any local school system that desegregated, to provide vouchers, to parents who sent their children to private schools that arose in a desegregated school system, and to allow public school teachers to maintain participation in the state teacher retirement system if they moved to private schools in desegregated districts. Boy, that sounds similar to legislation pending in front of this legislature right now, some almost 70 years later. In response to Brown, our very own Georgia Senator Walter F. George presented the Southern Manifesto, which I'll paraphrase, and essentially said, why are you outside agitators, federal courts, northerners, coming into Georgia threatening revolutionary changes in our public school system, and destroying amicable relations between the white and negro races that have been created through nine years of patient effort by the good people of both races. This reaction combines the false narrative of amicable relations between the races with an appeal to local control threatened by outsiders. This is the classic plea for local control that was not backed by illegitimate local consensus given the exclusion of minority voices. I could go on, there's lots of examples. These are just a few where history shows local control was used to oppress minority voices here in Georgia. And today we hear similar false narratives under this gold dome about why we shouldn't teach divisive history, because good people on both sides don't need to relive history that makes them uncomfortable. Well, I think people that look like me need to try and walk a mile in the shoes of our colleagues of color in this chamber and try to imagine how uncomfortable racial oppression has been for them, simply because their skin is a different color. Our kids deserve an honest history that includes America's triumphs as well as its failures. That's how we ensure those uncomfortable events aren't repeated. So when my colleagues and I say this sudden abandonment of local control and precedent sounds in racial oppression, we don't say it to be punitive or dramatic. Georgia has a long history of it. And a member in this house wasn't shy at all when he said we're all for local control until the locals get out of control. How are the locals out of control? Are you really saying that electing Democrats and specifically Democrats of color is defined as being out of control? This sudden deviation from process sends a message to more than 750,000 citizens in Cobb County and more than a million in Guenette that if you live in a county where the majority of its citizens duly elect Democrats to lead it, the minority in that county should have the choice to reject their elections. That's dangerous, y'all. And what's even worse, those of you who are using majority control in this house to subvert local control, you can't even be held accountable at the ballot box. You are subverting the voices of citizens who do not have the opportunity to vote you out. That is anti-democratic and sounding more in authoritarianism. We just can't change the rules if we don't like the results. I know y'all love a good football analogy and my friend, Rep McClain, liken this to moving the goalpost in the middle of the game. I have to believe that some of you agree with me that you're sitting there thinking, boy, I don't want her to come down to South Georgia and tell my folks what to do. Today, we pass 31 local redistricting bills on the local calendar. We have passed hundreds this far, thus far during this session. Why are those legislators given the privilege of our long-standing process in rules? Why does majority rule in our delegations only apply to Republican majority counties? By forcing these school board maps on Cobb County, you are saying that only the majority party in this chamber are allowed to be full members of this legislature. Our children are watching and us, and no matter how many books we ban, they will see this anti-democratic change of the rules exactly for what it is. Y'all, it's time that we agree that the rule of law and our social contract with each other, that the majority rules must take precedent over politics and party. Otherwise, I fear we will never be able to agree on anything else. I yield the well, Mr. Speaker. Okay, that is all of the speakers on the bill. And my understanding the minority report has been waived. So, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill. We'll vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1028. The eyes are 94. The names are 59. This bill having received the requisite constitutional majority is therefore passed. What purpose does representative Earhart rise to make a motion? Take your motion. I moved the HV 1028 be electronically transmitted to the Senate immediately. Immediately transmitted. Okay. The representative has moved that House Bill 1038. I'm sorry. We immediately transmitted to the Senate. Is there objection? Is there is objection? Does the lady move? The lady moves all those in favor of immediate transmittal will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the ladies' motion. The eyes are 94. The names are 59. And the bill is on its way to the Senate immediately. House Bill 961 will be postponed until the next legislative day. The chair recognizes representative Tyler Paul Smith for a motion. Miss Speaker, I move this House agree to the Senate substitute to House Bill 907. Clerk will read the caption. The chair recognizes representative Tyler Paul Smith to explain the Senate substitute. Thank you, Miss Speaker. Members of this body, I bring to you House Bill 907. The only change is how the paragraph is written. It's the same as what this body had passed out earlier this month. And Miss Speaker, if there are no questions, I will yield well. You do not appear to have any questions. Thank you, Miss Speaker. On the gentleman's motion that the House agreed to the Senate substitute to House Bill 907, all those in favor will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the gentleman's motion, the eyes are 122. The Nays are 31 and this House has agreed to the Senate substitute to House Bill 907. What purpose does representative Smith rise? To make a motion. State your motion. Miss Speaker, I move this House immediately transmit House Bill 907 to the governor. I'm going to rule your motion out of order. All right. Chair recognizes Chairman Sensler for a motion. I move that this House agreed to the Senate substitute to House Bill 841. Chairman Sensler has moved that the House agree to the Senate substitute to House Bill 841. The clerk will read the caption. House Bill 841, by the represent of dollars, 45th. The Cooper, the 43rd, and Sensler 35th to be entitled an act to incorporate the city of East Cobb. Chair recognizes Chairman Sensler to explain the Senate substitute. Mr. Speaker, ladies and gentlemen, the House 841 is the city of East Cobb. There was some debate and discussion here on the floor when this passed the first time about the requirement for the specific council members to live in the geography of their districts. The bill was drawn broadly to do that, but there was language put in the Senate committee to more clearly specify that each council member must live physically within their district. That was clarified in Senate committee and Mr. Speaker, that was the only change. And with that, I'd be glad to yield the questions if there are any. Do not appear to have any questions. Urge your favoral consideration of HB841. On the gentleman's motion, that the House agreed to the Senate substitute to House Bill 841. All those in favor will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the eyes were 96. The nays were 62. And this House has agreed to the Senate substitute to House Bill 841. Clerk will read the caption to a group of privileged resolutions. Honoring the life and memory of William C. Chris Giles, honoring the middle Georgia State University School of Aviation, recognized in February 15, 2022 as a aerospace state distinct capital. Congratulations to the capital, congratulations to the University College of Law, and its 40th anniversary, recognized in commending Dekidu Pharmaceuticals America, Incorporated, Recognizing in commending Dr. Molley-Hallard, and for other purposes that completes the reading of the privilege resolution. Is there any objection to adopting the privilege resolutions that Chair Harsman and the resolutions are adopted? Mr. Clerk, you want to hold the tray up? The clerk has a tray full of both Senate and House local bills submitted by members of each party. I will entertain the procedure we have followed, which is to ask for unanimous consent that the rules of the House be temporarily suspended to allow these bills to be read for the first time in a signed committee. They will all be assigned to the Intergovernmental Coordination Committee is their objection. Chair Harsman and it is so ordered. Going on now to announcements, going on to announcements, if you have signed up for an announcement, take up position up front, Chair recognizes, Chairman Corbett for an announcement. Thank you, Mr. Speaker. The Motor Vehicles Committee will meet in the morning, 8 o'clock, 606. Thank you. Chair recognizes, Chairman Dickey for an announcement. Thank you, Mr. Speaker, and the Clerk for an Assembly Affairs will meet in the morning, 8 o'clock, 406, CLLB. Chair recognizes, Representative Gullet for an announcement. Thank you, Mr. Speaker. Governor LeFairs will be meeting today at room 506, CLLB. 506 CLLB, meeting upon adjournment. Thank you. Chair recognizes, Representative Gamble for an announcement. Thank you, Mr. Speaker. Members, tomorrow morning at 7 o'clock and 133 capital, the fellowship will meet. Chair recognizes, Chairman Darlene Taylor for an announcement. Thank you, Mr. Chair. Mr. Speaker, the Live and Health Subcommittee will meet in the morning at 8 o'clock and 341. Thank you. That completes our announcements. That completes our announcements. Chair recognizes, the Majority Leader of the House for Emotion. Thank you, Mr. Speaker. Let's speak our move to this House stand adjourned until 1030, 1030 Tuesday, February the 15th, 2022. The Majority Leader has moved that this House be adjourned until Tuesday, February 15th, at 1030 AM. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it, and this House will be adjourned until Tuesday at 1030 AM. Thank you.",
  "updated_at": "2026-02-13T07:05:48.030403+00:00"
}