{
  "video_id": "wlCvTTFR8N8",
  "url": "https://www.youtube.com/watch?v=wlCvTTFR8N8",
  "title": "Rules Meeting for Day 36 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 36,
  "video_date": null,
  "duration_minutes": 25,
  "summary": "Here is a summary of the Georgia Rules Meeting for Day 36 of the 2025 Session:\n\n**Overview:**\nThe session focused on the consideration of several bills, including the Riley Gaines Act (SB 1) and a bill to allow optometrists to dispense and sell drugs they are authorized to prescribe (SB 140). There was discussion around the potential for litigation related to the Riley Gaines Act, as well as clarification on the bill's intent to protect student data from political campaigns.\n\n**Key Actions:**\n- **HR 347:** Passed\n\n**Bills Introduced (First Reading):**\nNone mentioned.\n\n**Notable Moments:**\n- Discussion around the Riley Gaines Act and whether there have been any confirmed instances of transgender student-athletes participating in public high school sports in Georgia.\n- Clarification provided on the bill's intent to protect student data from political campaigns while still allowing traditional voter registration activities.\n\n**Votes:**\n- HR 347 was passed.\n\n**Attendance:**\nNo specific quorum notes provided.\n\n**Adjournment:**\nThe transcript does not indicate when the meeting was adjourned or the date of the next session.",
  "transcript": ".\n.\n.\n.\nmorning everybody. You know we're having fun and visiting and had to wait a few\nminutes for the room to turn over. Before you leave, you might want to check your\ndrawers in your desk and under your chairs there. The Senate was in here with\nprocreation. They may have some money laying around. So you might want to check\nbefore you leave, see if we find any.\nWe're going to call our meeting to order and ask Chairman Linson that he would open\nus with the order, prayer, please.\nYou would bow with me, please.\nOur Governor Father, we thank you for this day, we thank you for your loving and\ngoodness to us for watching over some caring for us and for all the many blessings that\nyou see fit to send our way.\nWe thank you for the opportunity that you've given to each of us who serve here to represent\nthe people that send us here, we just ask Lord that you would give us your wisdom, your\nguidance, and your direction as we seek to do those things that are in the best interest\nof our state, we just ask that you would use us to be vessels of your will and help us\nto do all that, please, as you for creating Jesus' name and for his sake, amen.\nThank you, Mr. Chair.\nBefore we get started, I want to call on Chairman Martin for an announcement, please.\nMr. Chairman, I want to ask the committee to join me in welcoming Miss Singleton and\na group from King's Academy that are on the wall in the back there through the Capitol\nday.\nThank you.\nThank you.\nGlad to have y'all visit with us today.\nHope you have a good day.\nWe've got one little piece of housekeeping we'd like to do before we get started.\nlike to have a motion to send a Senate bill five back to committee have a motion in a second\nit's it's back in the committee okay all right now we're going to hear from anybody who wants\nto make a request today and some of the requests that they may not be on your sheets of some 16\nbills I think came out yesterday from committees but they won't be on our\nsheets until they're reported by this morning when the clerk reads the report\nbut if anybody's here and they want to ask we want to go ahead and and take\ncare of that and let them come and ask us one time and do that so let's go ahead\nand we'll get started at the center\nGood morning Mr. Chairman members of the committee have got two bills on the\nBlue sheet for your consideration today on the first page.\nI have Senate Bill 1, which started as the fair and safe athletic\nopportunities act.\nAnd we have worked with Chairman Bonner and Chairman Irwin to\nmerge your female sports bill that came out of the house with\nSenate Bill 1.\nIt has been renamed the Riley Gaines Act as originated here in\nthe house.\nWe've incorporated a number of other house elements into this\nbill.\nSpecifically, a couple issues having to deal with dressing\nand some carve-outs for coaches and athletic trainers\nthat the house had included.\nAnd the other most significant change in this bill\nis we have made this exclusively a sports bill.\nAs you probably recall, the Riley Gaines Act\nand the house touched a number of different code sections,\nreplacing the word gender with sex,\nand we have taken those changes out in Senate Bill 1\nand Senate Bill 1 exists currently exclusively\nas a sports bill.\nHappy answering any questions on that one, Mr. Chairman,\nor I can tell you about Senate Bill 140.\nOkay, Senator, thank you.\nWe do have a question.\nWhip Park has a question.\nThank you, Mr. Chairman.\nSenator Dullesall, is it not true\nthat there is not a single publicly confirmed instance\nof a transgender, studed, and public high school sports\nin the state of Georgia?\nGood morning, Whip.\nThank you for that question.\nThat is true.\nGood, due to the good work of Representative Will Wade\nand Governor Kempif years ago,\nwe allow the Georgia High School Association\nto make this decision by rule.\nAnd so they have made it such by rule\nthat males are only allowed to participate\nin male sports and females participate in female sports.\nWhat we are doing here is two things.\nOne, we're codifying that for K through 12 in the code,\nand we're also expanding that to intercollegiate sports\nas well, because as you know here in the state,\nwe did have an instant that's become quite famous.\nPerhaps the case that is the most famous\nas it relates to this issue.\nSo that did take place right here in Georgia and we're looking to this law would address that and what one additional question if I may\nIs it not true that this legislation opens up all of our public schools to litigation for again an issue that's already been addressed?\nMr. Whip I there is a private right of action in this bill\nThere is a complaint process currently in Georgia law that we rolled this up into that is a different change\nI didn't highlight it, but thank you for bringing that up\nBut the House bill addressed this through the Professional Standards Commission.\nThe Senate bill uses the existing complaint process that already exists in public schools\nto have the adjudication for any complaint that would arise in this bill.\nThank you.\nThank you.\nOkay.\nSenator, I don't see any other questions.\nOkay.\nMr. Chairman, if I may, I also have Senate Bill 140, which is a bill that's very important\nto the optometrist.\nIt's on the top of page three.\nThis would allow doctors about tomatry to dispense and sell drugs that they have the right\nto prescribe currently under law.\nThis is a good bill for patient access to those drugs and always readily available in the\npharmacy.\nOkay.\nDon't see any questions.\nThank you, Chairman.\nYes, sir, Senator.\nYes, sir.\nSenator.\nMorning, Mr. Chairman.\nThis came back.\nSenate Bill 56.\nState and demification.\nFund for one.\nFund for one.\nFund for one.\nenforcement officers, this bill's already been funded.\nIn the amended budget, we just passed a few weeks ago,\nincentive bill 105, a veterinary, and telehealth bill.\nYou've already asked for that.\nYeah, just want to come visit you.\nRight, just want to remind you, one in you don't have to back,\nbut we're glad to have you here.\nI love you so much.\nI'm here again, sir.\nYes, sir.\nThank you.\nYes, sir.\nYes, sir.\nMorning, Chairman.\nCommittee.\nI'm here to present Senate Bill 212.\nIt's at the bottom of page three.\nThis is the protecting the information of minors and public\nschools built during this last campaign cycle.\nThere were numerous instances of political campaigns and\ncampaigns and politicians masking is alternate reasons to be in schools and they were actually\nharvesting data of minors and then feeding that information directly to the campaigns.\nThis simply protects the information of students from campaigns illicitly falsely presenting\nthemselves as something they are not.\nfraudulently organized is the key word on line 93 of the bill so any of us are still welcome\nand invited come into schools to build a do-butter registrations as long as it's in my invitation\nof administration and not under any sort of a false banner. Have the answer any questions?\nI have a couple of questions for you. Leader Heagley, you have a question.\nThank you, Mr. Chairman. So I want to be clear, you're not suggesting that national organizations\nsuch as Outlook Outlook Office Authority of Delta Sigma Theta Sorority would be banned\nfrom doing their traditional voter registration\nfor seeing years is something they've done.\nFor years and years and years,\nthese are not political organizations,\nbut they do ask to come in there,\nthey're not necessarily invited.\nSo you're saying if they're not invited by their schools,\nthey cannot do that, is that your intent?\nNo, no, in fact, I could refer you to lines 42 through 55\nof the bill, that was an amendment offered\nby leader Harold Jones and Senator Kim Jackson to clarify that exact question.\nWe wanted to make it perfectly clear that organizations that were representing themselves\nas such would be able to continue to do that, or that you could even be free to discuss\npolitics at a Friday night football game.\nWhat you can't do is A.K.A couldn't come in and then say that they were there for a girl\nall scout cookie drive, and then get kids contact information and push it out campaigns.\nVery different.\nOkay.\nWell, we'll pour it.\nThank you, Mr. Chairman.\nSenator, is it not true that there already exists federal law that provides extensive\nprotections regarding student information and the prohibition on disclosure of their\ninformation?\nYou're not alleging that federal law was violated, were you?\nNo, not alleging anything.\nFERPA that you're referring to does prevent the schools from distributing that information.\nBut what happened in the first, fourth and fifth largest counties in Georgia, some of\nwhich we share, schools that we share candidates were going in under the pretense of doing something\ncompletely different and then giving that information to campaigns.\nThis is just preventing that from ever happening again.\nLast question, would this bill in any way, again, I think, you know, my concern is that it would disincentivize students from engaging in the political process.\nI think at least my reading of it is that, again, it should, it's going in the wrong direction, which I would otherwise want to see, of trying to empower and educate students to mean in as opposed to being scared of violating state law.\nNo, this doesn't do anything to students at all.\nThis keeps us, the elected officials,\nor those that are seeking political office\nfrom doing something to be able to harvest child's data\nand then passing it on to campaigns in a very illicit way.\nRepresentative Evans.\nThank you, Mr. Chairman, to the author.\nI believe in protecting student information.\nSo I don't have any problem with that.\nI do think there are federal rules that apply for it,\nbut my concern is there are high schools in the state\nthat have, they have young Republican clubs,\nthey have young Democrat clubs,\nand I'm concerned that the language starting online 92\nis gonna sort of open them up to questions\nbecause I'm hoping, and this is a question to you,\nI assume, and you can let me know if I'm wrong,\nthat you're not trying to stop students\nfrom organizing themselves if they wanna talk about candidates,\nbut since we've got this line 92 that says no candidate,\nShe'll also listen to any individual to fraudulently organize or aren't we opening up those students\nwho for their own reasons because they've read something about a candidate and they want\nto talk about it at a young Democratic club or a young Republican club.\nWe're opening them up to questioning such that we might quash their enthusiasm for making\ntheir voices heard through these clubs which I would hope you would not want to stop.\nSo if you could speak to any of that I would appreciate it.\nThat's a great question.\nSo, line 92, no candidate, campaign committee,\nor political action committee shall solicit an individual.\nThat's very different than a club,\nyoung Democrats, young Republicans,\nor anything in between,\ninviting candidates to be able to come in.\nAdministration has allowed them entry just as any of us.\nIf you go to visit a school,\nyou're coming in there,\nyou're identifying who you are and what you're doing.\nThis is very specific to a situation\nwhere candidates were going in setting up\nfake voter registration drives in school systems\nwith the premise that they were coaching students,\nminors, to set up voter registration drives\nthat were never registered or coordinated\nwith the Secretary of State to actually pass that data\non the State Election Board to register them to vote.\nWas there any consideration given to safeguards though\nthat aren't going to subject students who do organize events\non their own to interrogation from the opposite candidate\nto say, didn't this person ask you to do that?\nJust calling them in to be subject to extra questioning\nthat those of us over 18 wouldn't be subject to\nif we were holding events.\nThat's what I'm concerned about.\nI don't think the word interrogation exists\nanywhere in this billboard.\nIt does, and I'm asking, if you set up a framework\nthat you've got on 92, where we're saying\nyou can't, a campaign can't solicit a student.\nTo fraud, you'll leave the ordinance.\nLet me finish my question.\nIf you'd let me finish my question,\nI'll let you finish your answers.\nSo if the student organizes their own event for candidate A,\ncandidate B is thinking, oh, I bet candidate A put them up to it.\nAnd then we've got an interrogation process.\nWe've likely incentivized that process to the student.\nThat's what I'm concerned about.\nBecause how are you going to find out about this fraud\nthat the student was induced or whatever\nfrom this other candidate?\nThere's no other way to do it except to ask the student.\nThat's what I'm concerned about.\nDid you all think about that?\nWe did.\nAnd if you look at the very next line,\nbecause you're taking the sentence out of context,\nindividual under the age of 18 to fraudulently organize\nan event on the property of any local school system\nwhen the purpose of such event is influencing\nthe nomination for election or election of any person\nfor office.\nI think that answers it pretty well.\nBut you do acknowledge that you're\nsaying that right now a student, even under your bill,\nIf it passed, you wouldn't have any problem with a student or group of students on their\nown through a young Democrat club or a young Republican club talking about and supporting\na particular candidate.\nThat's free speech and they should be encouraged to do so.\nRight.\nAnd so how are we going to know the difference between when that's happening and when\nthey're being pushed by a candidate to do it if we don't allow someone to ask those\nstudents why they're doing it and and how they came to do it and which would\npotentially kill them from wanting to have these kind of events which I don't\nthink we would want to do. That's what I'm concerned about. I represent\nit respectfully. I disagree with your premise on it and I think that you're\ntrying to infer something that's not in the bill. Thank you. We disagree. Okay\nHey, rips any of Williams?\nThank you, Mr. Chairman.\nI think in your long answers, you kind of answered me.\nI was concerned because every newborn baby in my district,\nwhen they come into the world, they\nget a vote out of William Sticker.\nThey take home.\nAs they should.\nChairman Martin, just real briefly,\nIsn't it true what your effort is a campaign,\nthe young Republicans and young Democrats\ncan still meet on campus if they do it\naccording to school policies?\nIsn't it true now that most schools have policies,\nthey don't even allow a campaign sign\ninto a sporting event for a particular candidate?\nThat's a great point.\nIsn't that already the case?\nYes, it is.\nThat's their policy, I don't know.\nAnd that will continue.\nThank you, Chairman.\nOkay, was there another question here wave? Okay, good. No more questions. Thank you, sir.\nThank you.\nThank you, Mr. Chairman. I'll be brief. Senate Bill 40 is a secondary metal recyclers cleanup bill.\nThat we need to change some definitions around and we're removing a sunset on a cash provision.\nI've got a Senate Bill 148, which allows the Department of Education to initiate a pilot\nprogram for outdoor education space, and then I've already asked for 141, so I won't\nask again, but 141.\nThank you, sir.\nAny questions?\nDon't see. Thank you. Thank you. Thank you. Thank you for sharing it.\nWe have to say to God what you got. Thank you, Mr. Chairman. It's on the Yellow Sheet page\nfive. It's HR 347. It's about the fifth or sixth one from the bottom. This is an\nurging resolution for Georgia High Schools to start a girls flag football and it\nhas gotten incredible support across the state. Since we dropped the resolution 34\nadditional teams that already signed up, and that is just the disresolution.\nOkay, I don't see any questions for you, thanks sir.\nMr. Chairman, Mr. Committee, Senate Bill 36, past yesterday in committee will be available\nafter it's reading today.\nIt's a bill that takes the same protections for people of faith from unfair federal government\naction implies it to the state and local level.\nThat's what it does.\nGlad to think much, okay?\nYou got a question for you, who apart?\nThank you, Mr. Chairman.\nSenator Setsler, is it not true that there's a very large\ndistinction between what exists at the federal level\nand if this bill moves forward in that this legislation\nwould serve blatantly as a license to discriminate\nbecause there are no state level civil rights protections.\nIs that not true?\nWell, you're welcome for having an opportunity\nto kind of make that talking point.\nThe fact is, this does not do that,\nwhat this does is it takes the center road.\nThere are some states that preempt\nlocal non-scriminational ordinances.\nThis bill specifically does not do that.\nThis bill takes the center road, it leaves those in place\nand simply provides protection for folks who currently,\nthere's a whole new laws, as you will know,\nthat federal civil rights law applies\nin every circumstance except,\nwith respect to individual free exercise,\nwith respect to state local governments,\nand this bill simply patches that.\nSenator, I appreciate that talking point\nwhich I disagree with, but is it not true\nthat based on the facts of where we've seen\nthis legislation implemented in other states,\nit's resulted in broad-based discrimination\nagainst marginalized communities,\nagainst vulnerable communities,\nand it's resulted in a lot of chaos\nwith respect to public safety laws\nand other generally applicable neutral laws.\nIs that not true?\nTo the gentleman's question, I would love this committee to have the time.\nIt does not have to go case by case by case by case.\nThere's not a single case of that that you could point to by state level refer up in the\ncountry.\nIn fact, we were very careful working with the governor's team to pass the exact same\nlanguage that exists in federal law that's been proven for 32 years that we would ask for\nnothing more than nothing less.\nAppreciate the question.\nThank you, Mr. Chairman, to the author of the author, Mr. Senator.\nAs I understand it, there was offered in the committee process an amendment that would\ninclude anti-discriminatory language.\nDid you support that amendment?\nWhat that amendment was seeking to do was a church and a horse of an amendment.\nWhat it would do is it would completely invalidate any claim of religious exercise against some\nallegation, some allegation of discrimination.\nWhat this bill does actually, it's intended to recognize the circumstances, there's a claim of discrimination.\nThere's a claim of someone's religious rights that balances those circumstances.\nTo suggest that it's going to be not usable if there's some allegation of discrimination is to make this a one-sided question that deals with exemptions.\nAll we're seeking to do is in those very difficult circumstances.\nWe recognize those governmental interests that would prohibit discrimination, and balance\nthose against someone's religious claim.\nWe've seen time and again, in fact, the Zanataber Lutheran case, the US Supreme Court.\nSomeone, the same question was raised, in a 9-0 Supreme Court opinion, where Justice\nKagan actually joined Justice Alita and said the idea that a 1964 Silver Rights Act claim\ncan operate without any balance to someone's religious rights is nonsense.\nEven at the federal level, there's a balancing test.\nAll this bill does is create a balancing test.\nIt's not the exemption you're talking about and those that propose that are mischaracterizing\nthis is an exemption bill.\nThis is not an exemption bill.\nIt simply gives the proper way to people's exercise.\nOK, I just will respectfully disagree with your characterization.\nMy second question is, we have first amendment protections\nalready in place for religious freedom\nand to protect religious freedom in this country\nthat are as old as this country is.\nI'm trying to understand why all of a sudden is that not enough.\nGreat question.\nWe have full federal protections for freedom of speech,\nfreedom of assembly, and freedom of press.\nBut in 1997, the Supreme Court ruled the Bernie V. Flores case\nprotections for free exercise with respect to impacts\nby state and local governments are not protected\nby our federal constitution.\nThat is an indisputable fact.\nAnd that's the reason we have this.\nThis is the whole in law that only with respect\nto free exercise in relation to state and local government\nis they're not federal protections.\nThat's why states specifically have to pass this whole 39 states have done it.\nWe're one of the 11 of not, and that's that's why we have it before.\nThank you, thank you to the speaker and thank you, Mr. Chairman.\nI look forward to looking at that case and\nif appropriate, responding in a different form.\nThank you.\nBernie V. Forrest 1997.\nI'll find it.\nLeader Heagley.\nThank you, Mr. Chairman, to the senator.\nThis is not the first rodeo with this.\nSo tell me what has happened in Georgia since 2016\nthat necessitates that we do this now.\nGive me some examples of what we're fixing.\nFortunately, in 2018, we had an election\nwhere Governor Brian Kemp won by 55,000 votes.\nWhen COVID came along and you look around\nother states, you look at California in particular,\nyou had a California governor that said\nPeople of faith could not sing in their churches\nbecause the expelling of vapor from their mouths\ncreated too much of a risk of COVID,\neven if they're socially distanced.\nYou had people of faith in California, for example,\nwho couldn't gather in church yards.\nYou had people in Mississippi,\nchurches predominantly of color,\nwho couldn't gather in their cars together as a body\nbecause local governments tried to shut them down\nfrom sitting in their cars to be together as a church body.\nFortunately in Georgia, we had a governor\nthat didn't shut our state down,\nthat we saw during COVID that other states,\nthere were significant impacts on people's basic religious rights.\nThankfully, we didn't have those in Georgia,\nand we're trying to prevent that from happening.\nPeractively by putting something in place,\nthe other states were religious protections were protected.\nDidn't see these kinds of violations.\nBut other non-refer states we saw with executives\nwho were indifferent to people's basic rights,\nthere were big violations\nand we're seeking to protect that.\nto the speaker, let me just say that if we're going to talk about COVID, we've got to talk\nabout how many people who died because they didn't abide by the rules that were put\nin place and they died from singing in the choir right next to somebody else. They died\nof sitting in the pews. So let's just not go there.\nOkay.\nMr. Evans, did you have a question?\nNo, see any other questions? Thank you.\nThank you.\nAre there any requests from committee members?\nOkay, I don't see any.\nThis morning we were just going to do hearings only to hear\nhaving any requests.\nThere'll be more coming out when the clerk makes his report\ntoday and we'll have that.\nBut for the members, if you would please see Ms. Lewis,\nshe has something for each of you.\nJust no rush about it, but just when you have time she's over here now if you want to see her or but whatever if you would please see her\nThank you, and we're adjourned\n",
  "updated_at": "2026-02-12T17:36:06.023173+00:00"
}