{
  "video_id": "WlYbC7jXT7o",
  "url": "https://youtu.be/WlYbC7jXT7o?t=732",
  "title": "Georgia House - Day 39 (2026-04-02)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-04-02",
  "duration_minutes": 228,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House floor session transcript:\n\n## Overview\nThis session focused on passing several bills related to professional licensing requirements, including changes to the process for obtaining a professional engineering license. There was some debate around the potential impacts of these changes, but overall the bills appear to have broad support.\n\n## Key Actions\n**SB 125**: Amends requirements for obtaining a professional engineering license, decoupling the order of internship hours and the PE exam. Passed with House Bill 34 and 187 added.\n**SB 244**: No further details provided.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Rep. Lauren McDonald presented SB 125, noting the bill provides more flexibility for engineers to take the PE exam without compromising requirements.\n- There was discussion around the vetting process for the bills by the House Professional Licensing Subcommittee.\n- Some concern was raised by Rep. Gabe McCoy about the potential for unqualified engineers designing infrastructure.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript indicates the House was working to get all members to the floor for the start of the rules calendar.\n\n## Adjournment\nNo adjournment time or next session date was provided.",
  "transcript": "Mr. Clerk. Mr. Clerk. I'm already behind time here. Would you ring the bill and everyone know we're about ready to go to work? Thank you, Mr. Clerk. Mr. Clerk. Mr. Clerk. Mr. Clerk. Mr. Clerk. All members, all members, all members, if you'll come to the floor. We're getting ready to get started on the rules calendar. Okay, members, we're going to start on the rules calendar. Mr. Clerk, will you read the caption to Senate Bill 125-125? Senate Bill 125 by Senator Walker, the 20th and others to be entitled to an act to amend chapter 15 to title 43 of the offense go to Georgia and attending relaying your professional engineers and lands surveyors. So it's a couple of sequential orders of experience and examination requirements. This bill, I'm here for the committee on regulated industries. That committee recommends a dispelled do pass by rules committee substitute. The representative Lauren McDonald is recognized to present the bill. Representative McDonald. Thank you, Senator. Thank you, Senator. Thank you, Senator. Senator, would you like to give the gentleman your attention, please? Thank you, Mr. Speaker. First of all, thanks for changing the board. I do that to my friend from Hall County. Mr. Speaker, today I've got Senate Bill 125. A good part about this bill is earlier, can you not hear me? Earlier, I went to my desk and somebody crept in and took my bills, my notes, and crept out with them. I put them on my desk. I worry about this A block over the practical joke chart plan. But with arrives today to present Senate Bill 125, which has a rules substitute, include House Bill 34 and House Bill 187. Both of the measures carried by my good friend from Macon. These two bills previously passed a chamber with only two dissenting votes. The original bill SB 125 addresses the process for obtaining a professional engineer license. By decoupling the sequential order of the internship hours and the PE exam. Under current law, engineer and graduates must complete a four-year internship, but they are allowed to sit for the PE exam. However, the exam is academic in nature, and many engineers struggle to re-enter test taking mode after the years in the workforce, often requiring multiple tips to pass. This bill will allow engineers to take the PE exam and meet after earning their degree, while still requiring them to complete the four-year internship before becoming license. This change provides flexibility without compromising professional engineer requirements, often helping engineers succeed. The American Council of Engineering Companies has expressed its full support for this piece of legislation. In addition, House Bill 34 establishes a continuing education tracking system to ensure compliance with professional education requirements before certain license are issued. This system, to be implemented by the Secretary of State by January 1, 2026, will help address the licensing issues we've all heard about and codify the clear expectations for our professional licensing in Georgia. House Bill 187, a comprehensive 1158 line bill that passed with only two descending votes, provides regulatory cleanup for electrical contractors, conditioned air contractors, low voltage contracts, and utility contractors. This legislation streamlines regulations, professional standards for industries, reducing red tape, and stimulating economic growth for hardworking Georgians and their businesses. The government affairs groups representing contractors across the state have had input in this legislation fully supported. I want to thank the Blue Ribbon Committee that went around this state. They put a lot of effort into these pieces of legislation representing all the licensing professionals in the state of Georgia. Mr. Speaker, I yield for any questions. The gentleman has a couple of questions and we have some speakers on the bill. Representative Al Williams who you're left right on that front row is recognized for question question. Thank you Mr. Speaker for the gentleman yield. Just to make sure 125 SB 125 in no way compromises the competency of engineers or puts in any way compromises safety. No sir, not at all. There's not anything changes with this piece of legislation of what the PEE exam is. It's an academic in nature test. All they're doing right now is moving it closer to these young males and females leaving out of the engineering degrees. They're having to wait four years now and they're just out of test taking mode and having, you know, they're failing it two or three times before they kind of get back in the groove of taking the test. Yes sir. This bill in no way compromises or stops my wife from performing a little voltage test that I signed to her around my house. No sir, not at all. Thank you sir. It's a good bill. Yes sir. You'll be shocked when you get asked for that when you get home I bet you. The gentleman that led the co chair of that blue ribbon committee did such a good job. Chairman Hatchett has recognized for question. Thank you Mr. Speaker to the gentleman you. Yes sir. Is it true that the representative from Liberty County said a lot of what I was going to say. Yes sir. Is it further true that this bill when it passes will culminate or when the Senate takes final action will culminate several bills that have addressed our issues in the licensing division that the speaker and the lieutenant governor realized and wanted the commission to correct. That is correct. These have been the issues that we've all been dealing with around the state, the hard work that you all did over the over the summertime. This thing the different communities and listening to professionals this cleans that up sends a message to those that oversee the professional licenses that they have to act and be big. I guess response to our to our professionals. Deeper than you. Yes sir. And is it further true and I have to say this. This simply as far as engineers are concerned this will allow them to take the P.E. exam closer to the time of all of their education and hopefully will increase our success and pass rate. To allow them to become a professional engineer but they still have to do all of their apprenticeship requirements before they are a licensed professional engineer. That is correct. You should have been engineer rather than a preparation share. I won't yield for any statements. I hope you have any hope. I don't have anything in the budget but anyway we're talking about that later. Do you know what I want to take one more question if you will from an engineer. All right. Representative Gabe McCoy. Yes. I can ask for a question. Thank you Mr. Speaker. Does the gentleman here. Yes sir. Thank you my friend. I think I have been registered in engineer for about three decades now. And I am so concerned about this bill because it might cause unqualified people to design the bridges you're going to drive through. And I will be working against the bill because it's important that for you to be a licensed engineer you need to have the experience before you take the exam. Thank you. Yes sir to my friend you're going to be taking the same academic test. We're just allowing these degrees to get this degree to take it sooner when they're coming right out of school and having a challenge with the failure rate that they're having four years after. The gentleman here for this may really be able to have a speaker on the bill if you take a question from representative Powell. The gentleman recognized. Yes. Well the gentleman here. Sure will. Is it not true that the product in front of everybody has been a culmination of work of the committee commission that worked last year on professional licensing. That is correct. Is it not also true that this bill was fully vetted by the house professional licensing. Subcommittee chaired by chairman. I can't remember the one over there. Oh buddy the loach I'm sorry that it was fully vetted by chairman the loach. Yes sir. That is correct. Was it true that there was is it also not further true that there was no negative votes from both his subcommittee and the full committee. I appreciate his hard work in getting this and putting this package together. One last question. Is it not true that every professional organization association representing from the plumbers to the engineers to the underground utility contractors. That every one of these groups came together to help craft this bill and there's no objections from any one of those professional groups that are listed in this bill. That is correct. Mr. Chairman. Thank you so much. Mr. Speaker I yield the well. Gentlemen did a good job of answering questions. Thank you. Chairman Powell. Are you waving on your he waves. I think we're ready. Is there any objection to the previous question being ordered hearing none the previous questions ordered. Is there any objection to adopting the substitute offered by the committee on rules hearing none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the past to the bill hearing none the report of committee is agreed to shall this bill now pass all in favor of past to the bill will vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine. Have all members voted. All members voted. If so, Mr. Clerk will you lock the machine. All the passage of Senate bill 125 the yeas are 104 the nays are 61 this bill has recited requisite constitutional majority as therefore passed. Mr. Clerk will you read a caption to Senate bill 100100. Senate bill 100 by Senator Robertson the 29th and others to be entitled natural man code section 3110 14 of the fish go to Georgia and Tate relating the issue to a new birth certificate following adoption of legitimation or paternity termination. So it's to provide for the issuance of a copy the original birth certificate to certain adult persons who were adopted this bill ever for the committee on judiciary that committee recommends this bill do pass. Representative Joseph gullet is recognized present the bill chairman's recognized. Thank you Mr. Speaker bring for you house Senate bill 100 this brings fairness to the process of adopted individuals when an adopted person turns 18 they will now be able to request a copy of their original birth certificate directly from the public a department of public health just like anyone else. Previously they would have had to hire an attorney petition the superior court and obtain a court order. That's to be 100 removes those barriers and treats adoptive individuals with the same respected dignity as everyone else in Georgia. Happy to answer your questions Mr. Speaker. Gentlemen has one question representing butner to your left is recognized for question. Thank you Mr. Speaker does the gentleman yield. What happens until they get to that legal age what do they use for a birth certificate when it's required. So when you adopt someone I adopted my son and when we adopt him there's a form that you fill out with DPH. Turn the adoption do you want a new birth certificate or do you want to keep the original you get to choose. So if I chose a new birth certificate with my name and my wife's name is apparent then at that point that is their actual birth certificate when they request say they become 18 years old and want their original they'll go to DPH and request it just like anyone else would for the original it won't be a certified copy but until you're 18 if you got a new birth certificate that new birth certificate is your birth certificate even after 18 that's still your birth certificate this is just a copy saying this is my birth record. So follow up. Sure. If the adopted parents decided that they could use the original birth certificate is that available to them at adoption. It is. Okay. This is just for people that chose the other and the child wants the rich. That's correct. Thank you. Thank you. There no further questions Mr. Speaker. You have several you want to take at least one more I'll take one more yes sir. Representative Beckles to your left is recognized for question. Representative Beckles. Thank you Mr. Speaker. This is a gentleman you do. Does this bill consider international adoptions. If they have a I guess it depends so if you got a Georgia birth certificate. I would say it probably doesn't because your original birth certificate would be from wherever it's from and not transferred here so I would say it does not. Do that but I'm not completely positive it depends if your original birth certificate is a Georgia birth certificate. Would the gentleman for the you sure would you consider thinking about including the international adoptions. Not for this bill because we're so far but we can look at that for sure in the future. Thank you. Mr. Speaker appreciate your time and members I ask for your favorable consideration. You're the well. The gentleman's year to the well. We have a couple of speakers in favor of the bill representative Lisa Campbell has recognized speak to the bill. Representative Campbell give the lady your attention please. Thank you Mr. Speaker. Colleagues today I rise in support of SB 100. Georgia has been a restricted state and Georgia born adopted people currently must obtain a court order to get a copy of their own original birth certificates. However with this bill we are working to change this law and that's why I rise today in favor. Many may not know that up until 1961 a Georgia adopt could have attained a copy of his or her original birth certificate without a court order. As long as the adopt was of age. I did not know this until a dear friend of mine wanted to learn about her birth parents in middle age. And I was surprised to learn you may know but I didn't that for most.\n\ntheir birth certificate remains their only birth certificate. However, for adopted individuals, a new or amended birth certificate replaces the original after the adoption is finalized with the names of the birth parents replaced by those of the adoptive parents. My friend was not able through birth certificate research, but through DNA research she was able to identify her birth parents. And this was a vitally important step in her life. Her desire to know where she comes from was and still is a key part of understanding herself as it is with all of us. And today, at long last, hopefully with the adoption of this bill, we can restore the equal right for adopted persons 18 years and older to obtain their original birth certificate. This bill will give adopted young people the same opportunity that non-adoptive people have, in knowing who they are, a fundamental right that every person should be able to count on free and fair democracy. I would like to share three quick reasons why this bill will have a positive impact on our families. One, it restores equality. Adopties will have the right to obtain their original birth certificate without government interference. A right we should have regarding access to all of our healthcare information and data. Number two, it protects privacy. Many of us use consumer DNA tools and it's an alternative, but it's very public and it does not allow for private, sensitive communication between adoptees and their first families a fundamental right. And number three, it promotes health and well-being. Thousands of adoptees, birth parents, adoptive families, professional orgs, all agree and many have reached out with me to share that truth and transparency are vital and promote health and well-being. In Georgia, I believe we should respect the rights of young people. Parents and healthcare experts to help us understand the most effective ways to expand options to information and care that supports individual choices for healthy adult lives. All adopted adults should have the legal right to obtain their own original birth certificate without restrictions. This birth certificate is a record of the moment of their birth. We call it literally a vital record. Adopties deserve to have their birth certificate the same way that non-adopted people do. I support this profound bill because I respect the rights of our children, all of our children including our adopted children, our foster children, our gay children, our transgender children. This bill recognizes the rights of our youth, all of our youth to have knowledge about their DNA, about their physical health, and understand themselves more fully. So they can make healthcare choices using this information privately with their families and their healthcare providers without government interference. And this bill leads into evidence and research that supports access to expanded information and resources so our youth can make decisions that are right for themselves. This bill allows all of us to know who we are, where we come from, and this is a dear human right indeed. I applaud the authors and I thank you and encourage the same kind of respect in the future for all of our young people and I ask for your favorable consideration of SB100. Because the truth of one's origins must be an invaluable right to all individuals in a fair and just society. Thank you and I yield the well. And lady has yielded the well. Representative Ann Allen Westbrook gives recognize to speak to the bill. Representative Westbrook. Thank you Mr. Speaker and good afternoon colleagues. I also rise in support of Senate Bill 100, Andy's Law, and I will invite you to join me in voting yes at the close of my remarks. Senate Bill 100 grants adoptees access to their own vital records, their own original birth certificates that reflect their name at birth, the time and place of their birth, their birth parents. Adoption is a beautiful, loving event and life changing for so many people. But under our current law, part of that process is the loss of one's original birth certificate information. Our current law requires adoptees to go to court to obtain information that is rightfully theirs that they are entitled to. Generally speaking that requires them to hire council, their council has to sue the Department of Vital Records. There is almost never an objection by the Department of Vital Records so it's done as a consent order. And then the adoptee can get that information. But why should they have to go through all of those obstacles to get information to which they are entitled? SB 100 corrects that and restores access to all adoptees not just with those who have the resources to go to court. Our current law is not just unjust, it's also outdated. It's designed to protect adoptees and families from a stigma. We have worked hard to overcome. It is a relic of a time when shame of out of wedlock pregnancy was the norm, when exclusion was the norm, when shunning was the norm. And we've made great strides in overcoming all of that. Our law should keep pace with the strides that we have made. Our law should not prop up systems rooted in shame. I want to specifically shout out the advocates on this issue. I have no idea if any of them are, I see some waves. Thank you advocates. I have been here for three years. And for three years, y'all have been here. You have been in our committee hearings. You have been on the rope line. You have been filling up our email inboxes. And I want to thank you for your engagement. One of the challenges of this job is we have to be generalists. We have to know a little bit about everything that comes to this floor. And I will be the first to say that until you engaged me, I didn't know much about this issue. I didn't know how that worked. You have been patient. You have been dogged. You have been committed. And I have learned from you. So thank you. All these advocates are asking us is for something they are already entitled to. They are their own origin story. As my colleague stated, this origin story is essential to that sense of identity and that sense of self. And we all are entitled to that. Our law should facilitate that. It should not hamper it. So I am proud to speak in favor of SB 100. And I hope you will all join me in voting. Yes. Thank you, Mr. Speaker. I yield the well. Thank you, Representative Westbrook. That concludes all our speakers. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? No. For what purpose is representing William Ross? For what purpose is representing? For what purpose is representing? For Ross. Parliamentary, Mr. Gory. State Jane Quarrie. Mr. Speaker, isn't it true that with the potential passage of the SAVE Act, which is in front of Congress, the federal Congress right now, that every adopted individual in the state may have trouble voting in the next election. In that true, Mr. Speaker. I'm not sure that's true, but I'm sure that's where the gentleman reads it. Have all members now voted? If so, Mr. Clerk, will you lock the machine? All in the passage of Senate Bill 100, the yeas are 145, the nays are 14. This bill, having to see the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption of Senate Resolution No. 8? Senate Resolution No. 8. Senate Resolution No. 8 by Senator Barthay of the 31st and others of Resolution honoring the life and memory of Deputy Brandon Cunningham and dedicating an intersection in his memory. This resolution, he haven't been... This resolution, having been transferred to the Committee on Transportation Act Committee recommends that this bill do pass by Committee Substitute. Thank you, Mr. Clerk. Members, this begins the process of our road namings. Mr. Chairman, Brian Prince is going to give you some instructions as he works his way through this resolution. Pay attention to the gentleman, Noel, not only because he's going to do a great job here, as he should be recognized, but because of this very, very important opportunity to honor some Georgians. So pay attention to the gentleman, Noel. Chairman, Prince is recognized. Thank you, Mr. Speaker. Good afternoon, colleagues, and this is the road naming bill time, but I do want you to marry seats in your seats because we have a couple of dedications first, and then I will actually stand when we do the memorials, please. House Resolution No. 8 includes a dedicates part of state route in Clayton County in the honor of the former State Senator, Valencia-C. House Resolution 539 dedicates a bridge in Chatham County in the honor of Mr. Noel S. Smith, Jr. House Resolution 63653 dedicates an entire portion of state route in Caulfi County in honor of all veterans. House Resolution 657 dedicates a bridge in Gilmer County in honor of Miss M. Lue Stover. House Resolution 660 dedicates an intersection in Darty County in the honor of Mr. Lamar, Huggins, House Resolution 751. Dedicates a bridge in Monroe County in the honor of William A. Flickling, Jr. House Resolution 810 dedicates an intersection in Chatham County in the honor of Mr. Benjamin R. Pollett, Jr. House Resolution 814 dedicates a portion of state route in Jasper County in the honor of the former Representative Susan Holmes. Colleagues, will you please stand for those in memorial? Senate Resolution 205 dedicating an intersection in Fulton County in memory of the former Senator Vincent D. Fort. House Resolution 666 dedicates a bridge in Carroll County in memory of Mr. Mason, M. Mays, Macintyire. House Resolution 71 dedicates a portion of state route in Baldwin County in memory of Miss Latasha R. Butz. House Resolution 189 dedicates a bridge in Fulton County in the memory of Dr. Roy Charles Bill. House Resolution 427 dedicates a portion of state route in Appalain County in memory of Dr. Esco Hall, Jr. House Resolution 480 dedicates a portion of state route in Banks County in memory of the War War II veteran Bobby Blackwell. House Resolution 547 dedicates a portion of state route in Fulton County in memory of Mother Frank Lee, May Arnold. House Resolution 4, excuse me, House Resolution 548 dedicates a portion of state route in Fulton County in memory of Mayor Betty Hannah. House Resolution 559 dedicates an intersection for Scythe County in memory of Miss Ruby and Mr. Loey Grogan. House Resolution 567 dedicates an interchange in Cook County in memory of Mr. 0D Story. House Resolution 658 dedicates a portion of state route in Cherokee County in memory of David Allen Donnelly. House Resolution 812 dedicates a bridge in Chatham County in memory of Coach Carl Milton in House Resolution 886 dedicates an intersection in Camden County in memory of Miss Rachel Hogue. Can we please have a moment of silence for all those in memory of? Thank you, Mr. Speaker, and I yield the well. Thank you, Chairman Prince. Is there any objection to the previous question being ordered? Here in none the previous questions ordered. Is there any objection to adopting the committee's substitute? Here in none the committee's substitute is adopted. There any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution. Here in none the report of the committee is agreed to. This resolution now be adopted. All in favor of the adoption of the resolution will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machine. Thank you. All members voted. All members voted this. So Mr. Clerk will you lock the machine. All in the adoption of Senate Resolution 8, the yeas are 10068, the nays are zero. So the resolution having received a requisite constitutional majority is therefore adopted. Mr. Clerk will you read the caption to Senate Resolution 231? Senate Resolution 231 by Senator Albers and 56th. A resolution honoring the life of officer Jeremy Loponte and dedicating an interchange in his memory. This resolution I have been assigned to the committee on transportation. That committee recommends this resolution be adopted by committee substitute. Representative Scott Hilton is recognized to present the resolution. Members please give the gentleman the well your attention. Thank you, Mr. Speaker. Members, if you would please rise with me. We've got a series of road naming for officers who are killed in the line of duty. I've got the responsibility of speaking to the first one. And on behalf of the entire Roswell delegation, the interchange at Georgia 400 and Hulkenbridge is being named an honor of officer Jeremy R. Loponte. Who passed away in the line of duty on February 7th, 2025, while responding to reports of a suspicious person as shopping center in Roswell. Jeremy was a hard working and protective soul who found purpose in serving others. He graduated with honors from Kingsway, Christian and Douglasville, Georgia. He earned his Bachelor of Science in Criminal Justice from Georgia State University and began his law enforcement career in 2021 with the Roswell Police Department. Jeremy was the Roswell Police Department for three years and served during that time with compassion, courage and unmatched dedication to the detection of others. He has left an indelible mark on everyone who knew him and the city of Roswell is honored to be able to participate in the sharing of his memory and the continuation of his legacy. Jeremy has survived by his wife Alyssa, his parents Roger and Brandy, his sister's Morgan and Ashley, his nephew Grayson and his grandparents Tracy and Jeff Wheeler. With that, I believe Chairman Gullet. Jeremy is going to yield the will. We're going to recognize Chairman Gullet to present Senate Resolution 8. Thank you, Mr. Speaker. Today I rise to honor a true hero, Deputy Branding Cunningham, by presenting a resolution that dedicates the intersection of State Route 92 and State Route 120 in Paulton County as Deputy Branding Cunningham Memorial Intersection. Deputy Cunningham wasn't just a good deputy. He was one of the very best. He was the kind every man, kind of man, every community hopes were the badge. A man of deep integrity, steady courage and quiet strength. He served our county with honor and heart protecting families, supporting fellow officers and doing the hard work of justice with humility and grace. But Branding was more than a badge. He was a loving father, a cherished son and a faithful friend. He was the kind of man who showed up, not just on patrol, but in the lives of people around him. Whether it was encouraging a fellow deputy or helping a neighbor in need, Branding was there to serve others. On August 17th, 2024, Branding was doing what he always did, protecting others. He was on duty, headed to a home and high room responding to a domestic violence call. Upon exiting his vehicle, he was executed. He died serving the people of Paulton County. He died a hero. And now we carry the sacred responsibility of remembering him. The intersection where two state highways meet will stand as a daily reminder of Branding's sacrifice. It's a place where lives cross paths, just as Branding's life crossed the path of so many others and impacted so many others in our community. When people drive through it, I want them to see his name and feel the weight of what it represents, courage, commitment and the ultimate sacrifice. To his children, his mother and to all who loved him, we will agree with you. We honor Branding's life and promise to keep his memory alive. Deputy Branding, Cunningham will never be forgotten, not in Paulton County and not in the great state of Georgia. Thank you, Mr. Speaker. Thank you, Representative. Representative, Emory Donahue is recognized to present House Resolution 70. Thank you, Mr. Speaker. Every morning, the men and women that wear the uniform, never know if that will be their last. We thank them every single one of them here that protects us in the blue. We give them thanks. Binaigras police officer Christopher Lee Rousse in the watch, December 29, 2004. Rousse, who was 45 years old, was shot after a pursuit on Highway 29. The vehicle involved in the pursuit wrecked as Rousse approached the vehicle as all officers do to make sure that this person is secure and could render aid if needed. Took place in the shootout. He was struck in the chest and the head, a shotgun blast, as he went to the perpetrator for help. He was in the Jackson Herald of his heroism. He returned fire striking back and suspected he shot the suspect in the leg. Following his death, Rousse was remembered for his optimism, Servant's Heart. Rousse was also active with Boy Scouts of America. He was members of his troop. They all showed up the tribute at the funeral service for Christopher Lee Rousse, the Church of Jesus Christ, the Latter-day Saints. Rousse previously served in the Army and the Marines. He worked for the Winder Police Department for 12 years and the Arcade Police Department before joining the Pindagras Police Department where he lost his life. We would dedicate the intersection of U.S. Route 129 in Wayne Poetry Road, Village Parkway in Jackson County, at the Christopher Lee Rousse Memorial intersection in honor of his service and dedication to our city, County and the State of Georgia. Thank you. Representative Sandy Donatoucci has recognized to speak to House Resolution 809. Representative Donatoucci. Members, today I'd like to introduce you to the memory of senior corrections officer Scott Osborne Reiner. Scott was a devoted man as a husband, father, grandfather, brother, and uncle. Officer Reiner tragically was killed December 13, 2022, outside the corrections facility once by his car and once after he had fallen. He was preparing to start a shift. During Scott's 13 years as a career correctional officer, Scott led a program that led as Rousse teens here from Gwyneth County officers and offenders at the complex. This was to instill in these young lives the reality of a life of crime. Even after the program was dissolved in 2017, Scott continued to work with at risk youth and provide guidance to their struggling parents. The program was revived in 2024 and renamed the Scott Reiner Prison Awareness Program. The irony is that the man that killed Scott was exactly the type of young man that Scott would have helped. This will be the intersection of high hope in 316. Thank you. Representative Chuck Eftration has recognized to speak to House Resolution 813. Today I rise to recognize and honor the life and service of Trooper Ginny Sinuscar. Trooper Sinuscar was born August 8, 1995 in Porta Prince Haiti to loving parents. In addition to being a dedicated law enforcement officer, he was a devoted fiancé, son, nephew, cousin, grandson, brother and friend. In his honor, a bridge on State Route 324 in Gwyneth County is named in his memory. Jimmy was a man of faith, a dedicated public servant and a natural leader who lived with purpose. He began his law enforcement career with the Atlanta Police Department, serving for three years. During his tenure at the APD, he was awarded the 300 Club of Atlanta Award in 2022 for rescuing a driver who had driven off a bridge. In 2023 Trooper Sinuscar joined the Department of Public Safety and graduated from the 114th Georgia State Patrol Trooper School Class in September of that year. He was assigned a post-9 in Marietta and took great pride in his service. For Jimmy Law Enforcement wasn't just a job. It was a calling and a way to uplift and protect his community in his State every single day. Despite the demands of his career, Jimmy was pursuing a degree at Georgia Gwyneth College in Criminal Justice with a minor in Political Science. He was scheduled to graduate in May of 2024. On January 28, 2024, Jimmy's life was lost in the line of duty while pursuing a suspect in Gwyneth County. He is survived by his loving family, including his fiance Natalia Crume, with whom he shared two years of love and companionship. To wait today, we honor his courage, his compassion, and his unwavering dedication. Jimmy's legacy will live on in the lives he touched and the example he set. May we never forget Trooper Sinuscar's service and may his memory continue to inspire us all. Thank you members. Thank you to Transportation, the recognition of these brave lives that these brave men who lay down their lives for us to protect us. As we know, they ran to the danger to protect us. Moment of silence, if you will. As we remember, there are families that will, as well those that are left behind. Amen. God bless those families and condolences to them. Members, you may be seated. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution?\n\nI'm going to report the committee's agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution? Will vote yes. All those opposed? Will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted this so, Mr. Clerk, will you lock the machine? On the passage of Senate resolution 231, the yeas are 163, the nays are zero. The resolution having received a requisite constitutional majority is therefore adopted. Thank you, Mr. Chairman. Mr. Clerk, will you read the caption to Senate Bill 259-259? Thank you. Senate Bill 259 by Senator Brass, the six, the none, is being titled back to amend chapter 11 and title 15 of the fiscal to George annotated relating the juvenile code. So as a reminder, certain procedures to be followed, whether it's a determination, a suspected child abuse or neglect, this bill haven't been assigned to the committee and the juvenile justice that committee recommends a disbill due pass. Chair Lady, Ballinger is recognized to present Senate Bill 259-259. Representative Ballinger. Thank you, Mr. Speaker. I rise today in support of Senate Bill 259. This is a very important bill. And we heard in Judiciary Juvenile, we heard very heartbreaking stories about parents whose children have an illness or they have a condition or an illness. They have an injury or an injury of some sort and they go to the hospital to get their child treatment. And they take the child in, they're in the emergency room, they're being examined by all these different doctors kind of flowing in and out, all these caregivers. And then they're told that their child is now in the medical professionals come in, say the child is now a victim of abuse. And that they will see their child the next time at the 30 day hearing if they are awarded custody. Now the parents are cut off from any kind of record or any kind of medical record where they can have anybody look at them or examine them or receive them. So this bill fixes that. The first change you'll notice is online 21 and the right to obtain an independent medical evaluation or pediatric specialty consultation as provided for under code section 151131.1.1. And I'm going to skip over to that one because here's really the substance to the bill on page two. As used in this code section, the term pediatric specialty consultation means a consultation with a physician licensed to practice medicine in this state and board certified in the relevant pediatric field. Or other medical conditions related to different diagnosis of child abuse or neglect. There's a laundry list of conditions of pediatric specialties that the physician can hold, but it has to be a pediatric specialty that they have to be board certified. For them to be able to qualify under this code section. Any parent or legal guardian of a child who has taken into temporary protective custody pursuant to code section 151131. She'll have the right to obtain an independent medical evaluation or pediatric specialty consultation as such child at his or her own expense unless prohibits specifically by a court order. Physicians and medical professionals law enforcement officers and defects shall corroborate as maybe reasonably necessary to facilitate an independent medical evaluation. So in other words, this compels everyone that has custody of this child to comply with this code section and make them have the child evaluated wherever the parents have picked. This is not wherever the child is right now, but this is wherever the parents have picked. This is a specialist that the parents have picked and they want their child to be a second evaluation done. And so that child can be evaluated. It also gives the parents the right to the records because right now once defects, custody of the child, they're no longer entitled to the medical records. So they don't even know what's being alleged against them. So any hearing concerning a child before the court in a dependency proceeding pursuant to this article, the court shall consider the results from an independent medical evaluation or pediatric specialty consultation as such child. No adjudication hearing scheduled in accordance with part eight of this article shall be continued solely because the results from an independent medical evaluation or pediatric specialty consultation of the child before the courts are unavailable. So nothing will be continued, but the judge has to consider the results of this secondary medical evaluation that has occurred at the parents at the parents consent, at the parents choosing. So this just, like I said, just to sum up, this bill allows the parents access to the medical records. And it allows the parents to arrange for a secondary medical opinion for the opinion that has been rendered by the initial hospital that custody of this child can be evaluated by an independent pediatric specialty, according to the statute. And the judge has to consider that. So that is the bill in essence. Mr. Speaker, I'll be more than happy to answer any questions. I know one of my colleagues who actually heard some of the heartbreaking testimony that we heard in the committee hearing is also going to speak. So I'll try to be brief, but I'm happy to answer any questions. Ladies, ask no questions. Thank you, Mr. Speaker. You're the well. Mr. Speaker, I rise in support of Georgia Senate Bill 259. I practice criminal law and family law. And juvenile court is sometimes the combination of both of these. I have represented parents whose kids have been wrongfully taken away. And this bill will seek to solve that problem. This bill strengthens protections for our most vulnerable citizens, our children, while ensuring that medical decisions made in cases of suspected abuse or neglect are thorough, accurate, and fair to all parties involved. It addresses a critical gap in our current system. When a physician takes temporary protective custody of a child due to suspected abuse or neglect, a profoundly serious action taken only in grave circumstances, we must ensure that the practice that follows serves the best interests of the child while respecting the rights of families. At its core, 529, a men's chapter 11 of Title 15, to establish a vital right, the right of parents or guardians to obtain an independent medical evaluation or pediatric specialty consultation when their child has been placed in temporary protective custody by a physician. Let me tell you what the bill does not. First, 259 does not diminish a physician's authority to take temporary protective custody when they believe a child is in danger. That critical protection remains firmly in place. Physicians will continue to exercise their professional judgment due to safeguard children from imminent harm. What this bill does do is establish a more balanced approach when that initial protective action has been taken. It ensures that families have access to a second medical opinion, a fundamental right in nearly every other medical context. And why is this so important? Because medical diagnoses, particularly in complex cases, that may involve conditions that mimic abuse, require careful evaluation. In conditions like L.R. Donlost syndrome, osteogenesis and perfecta, vitamin D deficiency and rickets, which are all specifically named in this legislation, can present symptoms that may be mistaken for abuse by even well-trained physicians. The stakes in these cases cannot be higher. On one hand, we must protect children from abuse and neglect. On the other, we must not traumatize families or separate children from loving parents based on medical misdiagnosis or incomplete evidence. In order to prevent abuse, we must not be able to take care of children who are in a state or incomplete evaluation. 259 addresses this balance. Some may ask, won't this just delay protection of genuinely abused kids? The answer is no. The bill preserves all existing protections while adding necessary medical safeguards. The temporary protective custody remains in place during the evaluation process. The child's safety is never compromised. It also does not put an undue burden on defects. By ensuring accurate medical diagnosis from the outset, we actually prevent unnecessary proceedings and interventions that drain resources and cause needless trauma to families and children. This legislation reflects a growing national awareness of the need for medical second opinions in cases of suspected abuse. How many times did we hear about shaken baby syndrome only to find out years later that the child actually was harmed or died of another cause after their families or their mothers have generally been in prison for cases like this? In closing, I urge you to vote in support of Senate Bill 259. This balance, thoughtful legislation, strengthens our child protection system by ensuring that medical determinations in these critical cases are accurate, thorough and fair. By supporting this bill, you stand for both child safety and family justice, values that all Georgians share. And I take the chair lady for allowing me to speak on this. I yield the wealth. The lady has yielded the will. That concludes our speakers on Senate Bill 259. Is there any objection to the previous question being ordered? Here in the previous questions ordered, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in the other report, the committee is agreed to. This bill now passed all in favor of the passage of the bill. Will vote yes, all those opposed? Will vote no. And Mr. Clerk, will you unlock the machine? Yes. So worth so much, I think. That's grounds for something I don't know what but I'll leave that up y'all back there have all members voted All members voted if so mr. Clerk you lock the machine On the passage of Senate bill two fifty nine the yeas are 163 the nays are zero this bill have received their requisite constitutional majority is therefore passed Mr. Clerk will you read a caption to Senate bill 132 132 Senate bill 132 by senator strict one of the 42nd to be entitled not to amend part two of Article 6 chapter 7 and Title 17 I think fish Dakota George and attend a relating insanity and mental incapacity So it's required hearing before court orders and evaluation of the mental competency of an accused person's stand trial This bill I've referred to the committee on judiciary non-civil that committee recommends that this bill do pass by committee substitute Represented Tyler Paul Smith is recognized to present the bill mr. Chairman is recognized Thank you, miss speaker. We'll get after name members of this august body happy able to you today. I bring to you Senate bill Senate bill 132 This was originally introduced by chairman Strickland over in the state Senate Ladies and gentlemen the key elements to this piece of legislation are as follows This would actually require a hearing before a mental competency evaluation currently in our state Right around 60% of the valuations come back as those individuals being competent to stand for trial 60% so a lot of the aims of this legislation ladies and gentlemen is try to make sure that our state resources Are not tied up when they shouldn't be due to those that may be using the system to their advantage to as a Technic of delay or to you know basically come up with some Merit list defense I'll go through the bill with you Through certain of these sections ladies and gentlemen Basically these shorter time frames and the misdemeanor cases provides for us to move those individuals Not only through our mental health evaluation courses, but I also to a faster adjudication of those charges Just so you know that if an individual is founding competent the court could in order an evaluation to assess whether Restoration is likely That defendant would then be transferred to DBHDD custody For those non-violent offenses a court may also allow Outpatient evaluation instead of inpatient that you see so many times currently The time frames for the valuations ladies and gentlemen would be 90 days for evaluation if in custody and Only 45 days if the defendant is charged with a non-violent misdemeanor and That would not include DUI or domestic violence which are certain Those crimes are misdemeanor is recognized in this state. So that would provide for shorter time frames This actually Reflects a proportionality that the minor charges get faster resolution Those non-violent misdemeanors are the major aim of this This basically ladies and gentlemen is going to hopefully save our state much need of resources in our aim to combat the mental health Christ these that we see and we've done a great job I'll end by just wanting to thank director or commissioner Tanner and his agency's hard work on trying to make sure that our Resources are going to those that need them of misspeakable that I will yield for any questions if there are any Gentlemen has a question Yes, sir. I remember that to remind Your left-end is Suner. I'll thank you mr. Speaker does a gentleman you'll oh you'll for a question Thank you I know there were some concerns that were brought up about the prosecutors role in all of this can you speak a little bit more to that and just Sort of let us know how this bill could potentially address that specifically related to attorney client privilege Yes, so you'll note within the bill that's prosecuted onto this language would not be They would not be privy to that evaluation report until a case is actually set for trial Mr. McGraw yield for one more question if there is one Gentlemen has one more question representing San toes to your right and that will be your last one does the gentleman yield to our lawyer in the making yes Thank you If this shortens the window from 90 to 45 days would that not put some strain on our judges that already have a backlog of cases I would say this and this comes from you know having practice before They would readily be glad to have those misdemeanor charges that Judicated those are the easier charges in our criminal code section to You know go through in a judicate rather than a lot of our other complicated felony cases And so we had no one reach out from our court system saying that they were concerned about fast tracking those Miss speaking with that I'm going to yield and ask this body's favorable consideration Gentlemen's yielded the will he had no further questions Representing Mary Margaret Oliver is recognized speak to the bill representative Oliver Get the lady Yorktention, please. Thank you, mr. Speaker. I rise in support of 132 We have a constitutional obligation to the individual who's accused of a crime But is also alleged to be mentally incompetent is he or she competent to participate in a criminal trial There are about 690 beds Managed by the Department of behavioral health and developmental disabled that are totally assigned to those individuals who Have been determined to be incompetent or in a process of determination Over a third of those people really growing number every year Our folks who are never going to recover From their severe mental illness that will allow them to participate as a competent human being Court the backlog of evaluations for this legal process the backlog that leaves Misdemeanuts in our jails for over a year with these allegations pending when as a misdemeanor they couldn't serve wouldn't be Serving a year if they were found guilty raises logistical issues 132 is a product of a forensic subcommittee of the behavioral health commission There were any politicians on it. There were judges and caregivers and lawyers who really were looking at this Incredibly important legal process that is moving too slowly at this time is Costing too much money particularly to your local jails and which needed a modern update Ask for your favorable consideration of Senate bill 132 so we can Protect the constitutional rights of individuals severely mentally ill and Also make our system work in a more efficient manner NLS costly manner. Thank you, mr. Speaker Lady has you to the well is any objection to the previous question to be in order here in another previous question is ordered We do have a minority report. It is waived. Thank you Is there any objection to adopting the committee substitute here in under committee substitute is adopted? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in another board of committees agreed to shall this bill now pass all in favor of passage the bill We'll vote yes all those opposed will vote no, and mr. Clerk will you unlock the machine? Have all members voted I got you take your time Have all members now voted if so Have all members now voted this so mr. Clerk will you lock the machine all on the passage of Senate bill 132 132 the yeas are 142 the nays are 24 this bill having receded requisite constitutional majority is therefore passed You Mr. Clerk will you read the caption to Senate bill 185185 Senate bill 185 by senator Robertson the 29th and others to be entitled an act to amend chapter 5 of title 42 The fish Dakota Georgia and it's under relating to correctional institutions of states and counties So it's a prohibitive use of state funds or resources for certain treatments for state inmates this bill I Refer to the committee on public and community health that committee recommends a dis bill do pass We're representing Scott Hilton has recognized to present the bill chairman Hilton Thank you mr. Speaker Thank you mr. Speaker I present to you Senate bill 185 which is department bill brought to bring clarity To the issue of sex reassignment surgeries for inmates You'll note lines 76 to 85 for brides for exceptions when medically necessary You know what struck me most about this bill is that non-criminal citizens But not be able to get this surgery for free in the outside world unless you are prison so I don't know why we would offer better health care For criminals than we do for law-abiding citizens I would submit to you that a budget is a reflection of our priorities and By voting red We are signaling that our priorities Lean more to paying for sex reassignment surgeries than budget dollars for teachers Pre-case students and for law enforcement Which is why my mind SB 185 is a common sense piece of legislation Far constituents and with that mystery go yield for questions Gentlemen has a couple questions representing park cannon is recognized to your left Recona ask for questions. Thank you mr. Speaker do you yield? Yes, ma'am yesterday when we heard this bill in committee It was made very clear there are possibly Maximally up to five individuals that this would impact how much is that going to cost our state those five individuals if they received The best as you would say health care I would submit to you any tax dollar I would have a hard time going back to my constituents and telling them that someone in prison ought to be receiving better health care than someone in the free world that someone in prison ought to be receiving tax dollars as opposed to increased pay for teachers Firefighters and health care workers representative. I'm gonna ask again respectfully Yesterday we heard this bill in committee so you've had time and it said there would be five possibly Individuals covered with this overnight have you taken a look if they received the best as you would say health care how much would that cost the state of Georgia? With whether it's one dollar or one hundred million dollars. I would submit. It's too much Do you know for one more question? I know we have a lot from the audience here. So I'd like to hear some more So I do not yield Jim was not using for the question to represent the Barnes is recognized for a question Thank you, Mr. Speaker. Does gentleman you left sir? Okay. Thank you So are we increasing the mental health care for these patients if when we discontinue their care? I know we've got our Appropriations chair here is done a fantastic job in responding to the needs of our correction facilities And I know we'll see in a budget here pretty soon a budget that reflects that So yes, I think you're gonna see an increased budget for corrections coming out in the next air so thank you I appreciate it representative help nerd to your left is recognized for a question Thank you, Mr. Speaker. Does the gentleman you yes, ma'am? Yes, sir. Is it not true that this policy is consistent with the federal policy on this type of procedures for Individuals that are in the military I'm not familiar with the federal military policy. I know that the Department of Corrections approached us in regards to this legislation seeking clarity Which is what this bill does for Department of Corrections here in Georgia? Yes, sir this year federally that Permission was rolled back and Military personnel who serve on foreign soil in other countries do\n\nnot have that type of access, they would have to pay for it. Isn't not true that I will be supporting this bill because I support individual's choice, but I support the people's decision on whether or not they pay for those elective procedures. Well, thank you, ma'am, for your support and for your support of our military. I appreciate your comments. Representative Rice, excuse me, Representative Rice, you'll take one more. Yes, sir. The lift is recognized. Thank you. Thank you, Mr. Speaker. Does the gentleman yell? Yes, ma'am. Is it not true that this bill carefully provides exceptions for inmates with verifiable medical conditions ensuring necessary treatment is not denied? It does, and I'm glad you mentioned that to my seat maid. I really do want to highlight lines 76 through 85. When medically necessary, we do provide that treatment. As it was previously mentioned, taxpayer dollars should not be spent for elective surgery for those who are in prison. And with that, Mr. Speaker, I know we're late in the day. I will yield the well. Gentlemen, this yielded the well. Is there any objection to the previous question being ordered here in the previous question is ordered? We do have a minority report and chair's time up to 20 minutes for the minority report and up to 20 minutes for the chair's time. Chair Lady Miller is recognized to bring us to minority report. The lady is recognized. Thank you, Mr. Speaker. Colleagues, here we are. Day 39. Our constituents sent us here to address serious pressing issues affecting their daily lives. Affordable health care. Underfunded schools. Housing affordability. Public safety concerns. Workforce development. Crumbling infrastructure. Rural hospital closures. Rising drug prices. Mental health crises. And economic. In security. Yet instead of addressing. These real problems. My colleagues in the majority party. Continue their extreme. Agenda. Agenda. Of alternating between. Using the general assembly. As Donald Trump's vengeance machine. And solving problems. That do not exist. The presenter of this bill shared today in rules. That there is not a single case. Not one. Of an inmate. Receiving. Yet even asking for. A sex change operation. This is absolutely ridiculous. It is a waste of time. And I would like to know. What is it? What is going on with my colleagues that they have become so obsessed with what is happening. And transgender citizens. Panies. And they're underwear. And their box are shorts. And their bed rooms. And their medical rooms. When they talk to their doctors. When they deal with their families. Why is it that this has become. Such an obsession. There are five. Five cases. Of someone. Maybe. In prison. And I would please please leave. Because actually today I'm talking to the citizens of Georgia. Because I need to know the mess that's going on down here. I am tired. We are all away from our families. We are away from our children. We are away from our jobs. We are not seeing patients. We are not seeing clients. We are taking financial hits. And you are wasting our time. Better still wasting the taxpayers' money. Down here solving problems. That no one asked you for. That do not in fact exist. It is exhausting on day 39 when I go back to my constituents who care about the affordability of child care. Who care about all the children in Georgia that don't have healthcare. Who care about the children. Who only get two meals they can count on in this state. And that's when they are in school. A free lunch. A free breakfast. And in the summertime. Our left to fin for themselves. We come to this body asking to feed hungry children. And what do we get? We couldn't feed hungry children when somebody else's money. So let me just, I just want us to focus a little bit. And I'm talking to the citizens of Georgia. Wherever they are. I want to talk to you about some of the things that we could be focused on down here. But instead we are worried about maybe five people. We don't know if they want to appeal. We don't know if they want to shot. We don't know what their doctor has prescribed. Then we don't know anything about their health. We don't know what their doctor has prescribed. Then we don't know anything about it. But I want you to count the hours of debate time that we have wasted on this issue. This is what I think the people want to hear. According to the American Society of Civil Engineers, 2024 Infrastructure Report Card for Georgia, we were given a C plus. C means mediocre. That's barely a passing grade. How do we feel about that? Each category was evaluated on the basis of capacity, condition, funding, future need, operation, maintenance, public safety, resilience, and innovation. Drinking water was giving a C plus. Barely passing grade. Public parks were given a C. Roads were given a C. Solid waste and water treatment was given a C. Stormwater management was given a C minus. Transit was given a D. Not a single infrastructure category was given an exceptional rating. We settle for mediocrity when our infrastructure is crumbling. But tell me more about the ambiguous five people who may or may not exist. Who are going to get a sex change operation in prison? We might be and I'm very proud of the fact that we are the best state to do business in. Very proud of that. But we are also one of the most dangerous states for a woman to be pregnant. Women die here trying to have babies. We're one of the worst in the country. One of the hardest states to get access to quality health care. In fact, we are number five. We are the fifth worst state in the country for health care access. Five. There are ten counties in this great state that have no doctor. There are seventeen counties in this state that have no family medicine doctor. There are 37 counties with no internal medicine doctor. There are 67 counties with no pediatric physician. There are 73 counties with no emergency medical physician. There are 82 counties with no OBGYN. There are 82 counties with no general surgery physician. There are 53 counties citizens of Georgia, rural counties that don't have a hospital. When these folks constituents in this room have an emergency. 53. No hospital. Rural counties in this state. But tell me more about prison sex change operations. Because my God, let us continue to waste time on solutions to problems that do not exist. There are families in my community working and looking to buy a home for the first time. Young families, hard working families who are priced out by skyrocketing rents and greedy corporations who are gobbling up the American dream in this state. This body could be focused on that. We could be addressing this affordable housing crisis. We could be making this a safer and better state for women and families to have children. We could be solving and tackling the big problems that we are sitting here. This body of 180 members with a learned speaker collectively representing this state. Solving as best we can, the big problems. But yet, we waste time. It's silly season apparently in the opposition party. I'm going to ask us to do this. When you all have worn yourselves out, when you all have gotten this obsession with the transgender community, probably one of the smallest, tiniest populations in this state. They're so tiny. You're talking to me about five potential, but we're not even sure. Who knows how many children go to bed hungry in this state. Who knows how many women in their district die trying to have a baby. Who knows how many children in their state, excuse me, their county, their district, can't afford to eat over the summer. Who knows how many of your constituents can't afford to buy a home, the American dream is completely foreclosed to them. Who amongst you has outrageous crime in your district? Who amongst you is focusing on not only the criminal justice system and our critical infrastructure, but the crumbling prisons we have. We are abysmal. I appreciate the funding this year, but the problems with this department of corrections in the state of Georgia are long-standing. I'm glad we're paying attention to it now. Lightweight. Because the federal government has been crawling all up in it. I would ask you this, as we barrel towards the last day of our precious time here in this esteemed body, please stop wasting my time. On behalf of the 60,000 strong I represent, please stop wasting their time. Stop playing in their faces. Stop manufacturing crisis. Stop making up stuff that nobody asked you for. Stop planning seeds of division in our communities. Stop picking on people. Let transgender people live. My God. Now, I'm sure that that was all lost on many of my colleagues. Unfortunately, I can't do anything about it. I see little baby Jesus up here. Maybe he's watching. But I do hope that the citizens of Georgia understand the great capability this body has to solve the big problems affecting you. We do. And this is how your representative potentially has chosen to spend their time. Mr. Speaker, I will yield the well. And I thank my colleagues for their attention. The lady has yielded the well. We have now, we now have up to 20 minutes for the chairman's time. Chair Lady Cooper has recognized for the majority report. Chair Lady Cooper has recognized for the majority report. Chair Lady Cooper has recognized for the chairman's time up to 20 minutes. Thank you, Mr. Speaker. I would like to yield my time to representative Kelly. Thank you, sir. Gentlemen, we'll have up to 20 minutes. Representative Kelly has recognized to speak to Senate Bill 185. Thank you, Mr. Speaker. Colleagues, I didn't plan to get down in the well today. I didn't plan to talk on this topic. And I know that for some of y'all who may be following that long at home about this, it may be a little unclear what just happened. But for those of us who weren't in the room that weren't able to just see what happened, the Democratic Party and the Georgia House representatives have walked out of the House chamber, instead of standing in here fighting for fiscal responsibility of your tax dollars. The jobs that you go to every day, the hours that you put in every day, the funds you work hard for to put food on the table for your family, the you work hard for, the you sweat for, that you bust your back for, the plumber in rural Georgia, the factory worker down on the coast. The tax dollars that you send up here to us should be treated with respect. And for the minority party to walk out on debate as we're trying to be fiscal stewards of your taxpayer dollars is a abomination to this House and a disrespect into corn that I don't know if I've ever seen. This should be common sense legislation. All of us at home have to prioritize the necessities of our life. We sit around our kitchen tables, we ring our hands, we worry how we're going to get by day to day month to month as we're fighting the inflation that was caused by the minority parties administration. Are the House where we're framed from the... I take this party, the Republican Party, the majority party takes spending your tax dollars seriously. We prioritize some important things in our state. I didn't know I was going to be doing this today because I almost threw away the House budget research office House highlights that they'd given us earlier in the year, but I remembered it earlier. But let me talk about some of the priorities that we are leading on. We are prioritizing $6 million to improve homeless initiatives in our state. We are expanding summer food programs so that children who live in areas where they're not able to get food during the summer where they can do that. We did that. That was in the budget we voted on. The fiscal year 2026 budget includes $14 million in lottery funds, expand Georgia pre-K. $10 million in new funding towards maternal health. We've added funds for a behavioral health crisis center in North Fulton. $19.2 million to address growth in foster care and the increased cost of care. We had to put $250 million in new funds to try and strengthen our corrections facilities to address some of the systemic problems that have needed to be addressed and we are doing that. And we can't at all ever forget about the millions and millions of dollars in new funding that this house has put into school safety improvements. Those are the priorities of those who are still standing in this room. Those are our priorities. The minority parties may clear that they want your tax dollars to be used a much different way. We don't print money like Washington. Every dollar we spend of state taxpayers dollars comes from somewhere and must be taken from somewhere. It has to balance. And so every dollar that's spent on unnecessary care. Let us be clear on necessary care. This bill before us is measured. This bill before us makes clear exceptions when medically necessary care should be provided for an inmate. Y'all and inmate. Somebody who's committed a crime and is locked up, been convicted and locked up. This majority parties may clear what our priorities are and that's for protecting our state taxpayers dollars. Mr. Speaker, I yield the well and ask for this body's favorable consideration and I'll yield to our majority will. The will is recognized as speak to the bill. Wept Berkshire is recognized as speak to Senate bill 185. Thank you, Mr. Speaker. And I just rise to speak to my support of this bill and the fact that I know my colleague was a former prosecutor but it appears as though that it's a tactic of the defense. If you don't like what the other party saying, all you do is poke holes in it and distract. If you recall, there was very little conversation about the bill that we're undertaking. And so I want to speak to you about what the bill does. And my friends, it's easy to distract and talk about things that are not in the bill when you don't have an argument for the bill. The argument that should have been made up here is you disagree with the policy. The fact of the matter is that elections have consequences. Elections have consequences and our folks here in the state of Georgia have resoundingly said, and not in just the state of Georgia but across the nation, this issue right here is one that is supported overwhelmingly. Taxpayers do not want to pay for elective surgeries. The bill specifically cuts out and exempts the ability to utilize some of these treatments for medically necessary purposes. But for an elective surgery, taxpayers don't want that. It's very, very simple. And I'm just appalled. I'm appalled and I'm disheartened that my colleagues in the minority party have left this chamber. And to me, that's a testament of the fact that they understand where they are on this issue. They understand that they are in a position that is untenable, that cannot argue it so they distract from it. The fact of the matter is we have put in $365 million into the Department of Corrections because you know what? This body, the Republicans and the Democrats have noticed that we need to invest in our Georgia Department of Corrections. We need to do that. We have to do that. That was an issue that this minority party pointed and directed to all last session. Now we're putting the money there and now it's distract. Let's talk about other things. We're bringing a very physically responsible bill here that I don't think I have to convince my colleagues of. The fact of the matter is this is just this terrible disheartening to look across these chairs right here and see that they're they're they're folks back home sitting in my period of good work. They sit in my period of good work and because they don't agree with the policy, they don't want they just want to throw their hands up and leave. That's not something that you and I have the ability to do here. We don't have the ability to just walk out on our obligation to represent the people of Georgia in our districts. Apparently my friends in the minority party, they don't take that too seriously. They don't take it seriously enough to stand here and argue their perspective. Argue it on the merits. Argue on on the basis of what your policy objective is not on some pie in the sky and just poking holes and diverting to some other issue that we're not even talking about. That's all I heard up here. I heard about rising cost of drugs. Brick and Bill, those let's do that. I heard hungry kids. Let's do that too. I think everybody in here supports that. I didn't hear not one thing about the actual policy and the actual bill. All I heard was destructive tactics and that's something that we don't need to do. We're wasting time. The fact of the matter is if we would just get to the policy and discuss the policy, we would not be wasting time. But every time we have cross examination by the minority party instead of getting to the root of the issue and determining what we can do as a house to get it done. And Mr. Speaker, I yield the rest of my time to Mr. Leader. Leader, illustration is recognized for the remainder of the chairman's time. Thank you, Mr. Speaker. Ladies and gentlemen, I'll be brief. But this is probably the most disheartening moment I've ever had my service here as a member of the House to see members flee the chamber because they are unwilling to actually represent their constituencies, put the vote on the board and let it be known to all Georgians where they stand is incredibly disappointing. Now I want to begin by saying there are members of the minority party who are still in this chamber. And I want to commend those colleagues who are still here. We're here. Willing to do the job we... The members, the further rules of this House, laws and shouts and whatever you want to do is not allowed as we maintain to core this body. Remind the members of that. Gentlemen, we proceed. Thank you, Mr. Speaker. Members who are still here are here to do the job we were all sent here to do, which is to represent our constituents, represent our districts and advance policy best to the citizens of Georgia. Now this legislation was requested by the Department of Corrections as we heard to adopt fair and sound rules ensuring care within our state prison system can forms to policies which are explicit in Georgia law. Make no mistake by the minority party caucus chair taking this well and saying what she said here today as chair of her caucus. That is taking a position of support for taxpayer funded sex changes of state prisoners. And the fact that those members fled the chamber to avoid putting their vote up on the board should be considered appropriately based upon what the minority party, the Democrat caucus chair said from this well just a moment ago. I have no confusion about it. I submit that none of you should either. And Mr. Speaker with that I yield the well and ask the body's favorable consideration of SB 185. Gentlemen, as you were to the will that completes the chairman's time. That completes the discussion on Senate Bill 185 is the any objection to agreeing to the board of the committee which was favorable to the passage of the bill hearing none the board of the committee has agreed to. Shall this bill now pass now before I call the vote I'm going to ask the clerk to ring the bell. So all members of this House will have adequate warning and giving the opportunity to be in this chamber and cast their vote Mr. Clerk will you ring the bell. Okay. Okay, members all in favor the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine. All members voted. All members voted this so Mr. Clerk will you lock the machine. All in the passage of Senate bill 185 the yeas are 100 the nays are two this bill have received\n\nThe REC was a constitutional majority is their four past. Thank you members, all members for being here and voting your conscience during your job. Mr. Clerk, will you read the caption of Senate Bill 244-244? Senate Bill 244 by Senator Beech, 21st and others to be titled an act to amend Article 1 of Chapter 11 of Title 17. The official go to Georgia and Tate relaying the general provisions regarding the assessment and payment of costs of criminal proceedings. The shows are required for an award of reasonable attorneys fees and costs in a criminal case to the defendant upon such defendant making successful motions to disqualify the prosecuting attorney. This bill ever further the committee and to you to share a non-sevalid committee recommends a disbilled do pass by committee substitute. Chairman Martin is recognized to present the bill. Thank you Mr. Speaker. Ladies and gentlemen, excuse me, Senate Bill 244 has two propositions and I'm going to speak to you about Part 1 of the bill and some of my colleagues, including Charlie Dempsey, as the speaker allows will speak to you about Part 2. Part 1 of the bill is just this. I can almost read you the bill, but it provides that a prosecuting attorney in a felony or misdemeanor case is disqualified for improper conduct on the part of such attorney and the cases dismiss and a subsequent court or prosecutor will not take up the case because of the disqualification that the defendants are able to ask for reasonable fees and costs. Much has been said and much has been written in the minority report about this applying to a particular case. I've been fortunate to be a member of ways and means in this body for a number of years. I'm very educated on how sometimes people focus bills on a particular county using the used used population and now they use descriptions of what taxes are available. There is absolutely nothing in this bill that focuses this on a single county nor does it have a signs that for a single issue. So we have an opportunity here to protect our defendants in cases so that they have a fair shake. Mr. Speaker, there are other speakers on the bill and I will stand for questions over here and step aside and you'll the well. You have the gentleman's yield of the well. If you have a question that he may can explain to you. He said. He indicates you may come over to his desk. We do have speakers on this bill. I'm going to allow up to 15 minutes for those opposed and up to 15 minutes for those in favor that will be allocated amongst those speaking in favor of and those opposed. First recognize represent Derek Jackson. Speak to Senate bill 244. Representative Jackson. Thank you, Mr. Speaker. Colleagues, I strongly stand before you in opposition of Senate bill 244. I stand here with a deep sense of concern. As we face a crucial moment in the history of our society. We find ourselves at this crossroads a point where the very foundation of our civilization. The rule of law is being tested. The question we must ask ourselves today is this. What kind of society do we want to be? One that opposed justice and fairness or one that rewards law breakers and undermines the principles that have guided us for centuries. Yes, it's a rhetorical question that isn't just theoretical. It's a question we must address right now today. Because what we allow today we will become a precedent for tomorrow. The rule of law is the bedrock of our society. It measures that every individual, every individual, regardless of status, wealth or influence is held accountable for their actions. It provides a sense of security and belief that right will prevail over wrong. And that those who break the law will face consequences. Without the rule of law we have no structure, no fairness and no justice. Unfortunately, there are moments in our society where we see the opposition of this right now. We see laws broken with little to zero repercussions. And worse, we see those who disregard the law being rewarded. That's why I'm in strong opposition of Senate Bill 244. Taxpayers should not pay criminals legal fees. When those who break the law are given a pass or even celebrated, we said a dangerous precedent. We sent a message that the rules don't matter, that accountability is optional, and that justice is a mere suggestion rather than a fundamental truth. Imagine what this means for future generations. If we allow this to continue, what are we teaching our children? What are we telling our communities that changing the system is acceptable? That power, money or influence can shield us from consequences of our actions. That the very principles that we claim to hold dear, fairness, equality and justice are nothing more than empty words. When we fail to protect the rule of law, we risk unraveling the fabric of our society. It's not just about punishing wrongdoers. It's about ensuring that everyone from the poorest of us, to the riches of us, understand that no one is above the law. No one is about fairness, it's about equality. It's about making sure that justice is not a privilege for the few, but a right for all. We cannot afford to be passive in the face of this injustice. We cannot afford to allow the erosion of the rule of law to continue unchecked. For each time we reward those who break the law, we weaken our society's trust in the system. We undermine the very values that have allowed our civilization to thrive. And once that trust is lost, it is very difficult to rebuild. So today, I ask this body to stand with me and vote no to Senate Bill 244, to demand that the rule of law be protected, to reject the idea that law breakers can go unpunished and that the principle of justice are for sale. Let us be the generation that stands firm that refuses to let the integrity of our legal system to be compromised. Let us be the generation that ensures justice remains blind, that fairness is not negotiable and that the law applied to us all. The choice when you press your button should be read. So that way we are telling today and tomorrow that we will choose wisely. Let us choose justice. Let us choose the rule of law and stand with me and vote no to Senate Bill 244. And with that, I yield the well. Chair, the Chair recognizes Representative Holland to speak to the bill. Thank you, Madam Speaker. Colleagues, I rise in opposition to SB 244. This bill breaks my heart twice. The first time is as someone who lives where I live. So I'll admit now I live in the city of Atlanta in Fulton County. I have learned a few things in this chamber if that's the case. First, I cannot ever complain about how long my commute was to get here to the building at 5.6 miles. I should always keep quiet when I'm celebrating that I can get home in time for my son's baseball game. I get lots more blue slips than any of you because my constituents live so close by they can come find me. I can travel my district from the furthest point to the furthest point in about 20 minutes. Assuming there's no traffic, there's never not traffic. This bill is a general statewide bill but it was inspired by a very specific district attorney in Fulton County by a very specific case being tried by that district attorney in Fulton County. And no offense but sometimes it feels like the city of Atlanta and Fulton County are a punching bag in this building. It is not appropriate to set a precedent that says that my tax payers entirely in Fulton County, my tax payers become responsible for the costs of other people's court dates. This is not going to be borne by the state. The cost of this is going to be borne by the counties and by definition if we're talking about one specific expensive case in Fulton County, it's going to cost the Fulton taxpayers the money. It's punishing the local tax payers for statewide political problems and it has a chilling effect potentially on our district attorneys who maybe are no longer going to take the high profile or very sensitive cases for fear of the trickle down effect for what it's going to do for the taxpayers who elected them in the first place. That's the first reason it breaks my heart. The second people in my district asked me a lot about whether it's difficult to be down here, whether we have hard days and they asked me if I can think of times when I feel like we've pulled together as a chamber and the example I give more than any other time is on signy die when we all stand together and we pass wrongful conviction compensation legislation. There is something that feels so good about so many of us coming together in a bipartisan way to try to make right something that went so terribly wrong for these individuals and it breaks my heart that this year our wrongful conviction compensation legislation has been tacked onto this bill that puts a burden on taxpayers that isn't appropriate forcing people like me to make a decision. Do I want to protect the people in my district and protect my district attorneys and our court system? Or do I want to be able to vote in favor of the wrongful conviction compensation legislation that means so much to me in this house and do right by the wrongfully convicted? Unfortunately I have no choice but to make that choice. Our wrongfully convicted compensation legislation deserves its own stand alone bill and not to be hung on like an ornament to a Christmas tree to something else like this that feels very much like it is a pro-Trump bill aimed directly at the people of Fulton County. I would ask that you join with me in voting no on this bill and hoping that we can find a space for wrongful conviction compensation legislation elsewhere. Mr. Madame Speaker I yield the well. The lady is yielded the well the chair recognizes representative canon to speak to the bill. Thank you Madame Speaker. Let's be clear Fulton County is the largest county in the state of Georgia. Like many of your smaller counties we have some state constitutional officers who work in our county. One of those individuals is a district attorney. She is a state constitutional officer meaning the money her power comes from us as well as a little bit from the county the county supplements her offices budget. In these cases in general there could be any type of old case any felony case. When that officer is deciding how much time do I research this issue how much time do I prepare for this defense how can I maybe see some humanity in this person and provide a way for them to become better after being involved in this system. When that officer is deciding in those moments they mean time they mean resources why would we decide as a state it's a great idea for us to possibly bankrupt our largest county and do that over a state constitutional officer. I'm confused let's do some math here I think math is important our one job is to balance the state budget and there have been so many bills that have come down here no fiscal note no idea how much it costs just saying that this could be really expensive so let's look at this the amendment the new version of this bill yes it does directly impact Fulton County of which I'm proud to serve as a chair of the delegation the members who sponsored this legislation the individuals who are supporting this legislation this is not just the beginning you have been messing with Fulton County for years starting with smaller things getting to bigger things but you won't come to our delegation meeting and speak to us about it you won't go to the external affairs and ask the impact that it will have so I'll let you know very directly Fulton County understands this legislation with its intentions the intentions make it so that the district attorney's office will not be able to address court back logs help people who are in jail this bill is to punish taxpayers in Fulton County they are the ones who will have to pay for this legislation in real time help me understand this if this was happening in your county your county was possibly the money that your county is supplementing to this from the state said we don't have enough this is not going to be possible would you support this legislation would you honestly sit here and say well even though the money doesn't add up I'm still going to support it I am concerned that as state officers as legislators here you enjoy your time in Fulton County you enjoy your time in the capital city we see you out here in Fulton County well we're not in session we see you enjoying the amenities that we have how do you think that we get to be this type of county it costs to enjoy and what we are asking you today is to take one moment away from your whip reports that say fall in line that say you'll be penalized from the top of the political spectrum all the way down to here and to realize that this measure is fiscally inappropriate this measure does not deserve to become law and Fulton County will continue to defend itself against any bad actors that make phone calls against any elected officials who as well were made unnoticed that what they did was wrong that was wrong and this is wrong I ask you to vote in opposition to Senate Bill 244 thank you the lady is yielded the well the chair recognizes chairman Dempsey to speak to the bill thank you madam speaker I know we're once again in a very hard place I have great respect for each and every one of you and the feelings you're wrestling with right now not on try that again that's much better isn't it I understand that each of us are wrestling with some very hard decisions right now I have great respect for each and every one of you even when our opinions are very very different there is a very important second part to this bill that I want to ask everyone regardless of where you live or what party represent to pause and think about we have worked for years I will say particularly that representative Scott Hilton has worked since 22 23 24 with bills that have failed to change the dynamics of a procedure that was pointed out once again very early yesterday morning does not work we I'm so sorry you are right I said I'm so sorry I'm looking right at him too and y'all cannot imagine how much I care about him oh god forgive me Scott please understand there is no doubt there's a lot of passion in this room and there was in the last billionaires in this one too I want you to pause and think though just a minute we've talked about injustice that's already been stated up here we talked about what kind of society do we want to be I've listened I'm paying attention I care when right must prevail over wrong there have been some wrongs that have occurred over the years many of us have worked on them we've helped some people succeed in getting that compensation we've helped others not the way we are doing it right now does not work will not work I wish it could be a standalone bill it was we've tried in 22 23 24 we beg to be on anything else anyway possible and I want you know I feel like I am just the carrier for this bill that it truly does belong to represent hookham but it belongs to all of us when I stop and think about this the injustice of a wrongful conviction just breaks my heart when you think that undoubtedly it could happen to anyone anyone we love care about any family member anyone of us as a matter of fact I think we are often more vulnerable than others because we're pretty public and if someone gets mad at us there's no telling today and this world that we live in with AI with social media what could be made up completely and a process could go forward in our legal system and before you know it we're in prison it has happened it has happened particularly in recent years and we cannot compensate these people the way it is right now the house has had a huge heart for it y'all have each voted so many times to support those resolutions and that's a painful process to go through without a doubt but our friends across the hall are not interested in doing it this way so we need to find that way that we come together and we do create the society that we do want to be we find the way for right to prevail over wrong I cannot imagine personally myself spending one night in prison I can't imagine being there for years and years some of the people that we are fighting for today whose time is going to expire but who really deserve and need this need this to start their lives it is so important when a wrongful conviction has occurred it is our responsibility to make it right today legislators are not equipped to do it I don't even believe we should be doing it but it's what we must do right now and the battle lines are drawn on making that possible we are only one of 11 other states that don't have the policy a statute to deal with compensation because we should not do it 39 others have figured it out and so time has gone forward from from the years that Scott has excuse me represent Holcomb has worked on this to make this better and better we have a great piece of legislation in front of you attached to something that we can really make work so when you pause and you think about how you are going to vote today I want you remember part two on this how important it is and I want you to vote with Joseph Samuel Watkins Darryl Lee Clark Michael Wolf Oak Mario Stinchcom Cedric Moore for the tens of 20s of 30s of 50 and more years combined they have given of their lives for something they did not do. Madam Speaker I yield the well. Lady has yielded the well the chair recognizes representative Holcomb to speak to the bell. Thank you Madam Speaker I'm going to speak on part two of the bill which is the wrongful conviction and incarceration compensation act for those of you that are new the way that it works is if an individual has been wrongfully convicted meaning that you are innocent you didn't commit a crime but you were convicted and then sent to jail and our prison system is after you are released and that alone is an extremely challenging process to get to you have to find a state representative or a state senator to sponsor a bill for you get it all the way through the process get the governor to sign it and that is a process that candidly has been broken for a very very long time what it leads to is inconsistent results some people get compensation some people don't some people get a certain amount of compensation some people get less some people get more and what's happened since 2022 is no resolutions have moved period in the senate period they haven't entertained them they haven't considered them last year they didn't even have hearings for measures that were passed here yesterday there was a subcommittee hearing at 6 a.m. I was there along with leader of station along with chairman dempsey along with representative evans along with representative barns and what's beyond problematic about that besides the time it was too late for the senate to even act on it yet we had a committee hearing with no potential action with no potential way to help these people and what drives me about this is that I know some of these people now and what you learn by talking to them is and it's obvious on its face is just how devastating wrongful convictions are and in particular the gentleman that chairman dempsey has helped they lost their 20s and their 30s how many of us would give up our 20s and our 30s for most of us those are our best years there are most fun years and they missed all of that even worse they didn't have a chance to invest in their careers they didn't have a chance to have jobs because of that they have no participation in social security so they have no safety net it's just broken so what this bill will do and it does make me uncomfortable that this is not moving alone but I also and forgive me for those who disagree with me on this I'm so invested that I can't stop now sorry so what are we trying to do? What this will do is it will set up a process so you can have an understanding of it where an individual can file a claim with the office of the state administrative hearings in prior years we had a commission and those of you that remember this may recall that the reason why we opted to switch to a judge is twofold one this is so important that we don't want it to be a secondary role we don't want this is a get to when people have time we want it to be one of our judges who already has staff capacity ability to move it forward what this also does is it sets very clear time periods by which the claims need to be filed it also provides an exception in terms of the statute of limitations if new evidence is found which is a very fair component in addition and this is the part that I think is most important what I think has got the Senate or has limited action in the Senate has been they've wrestled with the word exoneration and whether exoneration means that somebody is truly innocent or whether exoneration means\n\nthat there may have been an incident where a person actually committed the crime, but because of a constitutional issue, they were freed and exonerated. What this bill does, and interestingly, it's the same as it's been in 2022, 2023 and 2024, but I don't know if it was read and considered, sorry for that, is that this states that the claimant did not commit the crime for which the claimant was convicted and did not commit any lesser included offense, which means that the administrative law judge will have to make an actual finding on the record of evidence that the person was, in fact, innocent and did not commit the crime. In addition, within this process, notice is given to the Attorney General and the Attorney General and the District Attorney that prosecuted the case can, after the claim is filed, they can file a written response if they oppose the action. They can also, at the hearing, which has to take place within six months, we want these to move along quickly, then the Attorney General and or the prosecutor can also participate in the hearing and present evidence of which we think is fair. If after that there is a finding that the person was, in fact, innocent, then that person, the judge will make a recommendation of an award of $75,000 per year. How did we get the $75,000? Well, we looked and we did a survey across the country and that is a fair amount based on how compensation is handled across the country. It's also close to what the federal amount is for compensation and then there's an additional $25,000 given per year if an individual was on death row, because of the recognition of the stress and trauma of being sentenced to death row. If in fact you were innocent. There is a provision for an offset of any monies that may be obtained from civil litigation and so an individual couldn't double dip for lack of a better phrasing. That's all taken into account with respect to the process. And then through this a wrongful conviction and incarceration compensation trust fund would be set up through which the monies would be paid if there is, in fact, a recommendation. In addition, and I hope that you can see that this is a well thought out process, there is also an appellate component both for the claimant as well as for the attorney general or for the prosecutor. So if they disagree with the finding and if there is no appeal then it becomes final and it can move forward so these individuals can ultimately get compensated. And just to share with you a little bit of color in terms of some of the cases and in particular the cases that Chairman Dempsey has worked on. The Supreme Court published an opinion called Ballinger who was the warden versus Watkins and if you take the time to read it, it's unbelievable that this person was convicted. It's so clear that the evidence did not support a finding of guilty. It's so obvious and yet so tragic that he was convicted in the state ruined his life because of that. Yesterday at the hearing we heard from the prosecutor who prosecuted Lee Clark who was another one. He said throughout the trial he had concerns. He had concerns about the evidence and then he went further and said for one witness who had a disability, he went behind the accused and asked if he could be identified. And then we sent the person to jail. It's wrong. This will help fix it. I understand my colleagues that disagree with part one but I wanted to explain part two. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. There is a minority report that the chair recognizes representative Roberts for the minority report. Thank you Madam Speaker. Colleagues. I honestly hoped this bill wouldn't make it to the floor. I wanted to believe that we were better than this. I held out hope that the majority party in this chamber would not use its legislative power for blatant political retribution. And tacking the wrongfully incarcerated compensation by partisan bill that our colleagues have worked tirelessly to pass for years onto this punitive SB244 makes me physically sick. Y'all know this provides if a prosecutor is removed from a case due to misconduct and the case is later dismissed. The defendant shall recover all their attorneys' freeze from the county's prosecutor's office budget. It's going to be rare when these circumstances arise because typically another DA can step in if a prosecutor is disqualified. So why bring this bill? I'm not sure why my colleague said that this isn't about a single case or a single county because the bill sponsor proudly acknowledged during committee and to the press that his purpose in filing this bill is not a single case. In filing this legislation is to have it apply to the ongoing election interference case against President Trump and the 14 other co-dependence, one of which happens to be his colleague and the other chamber across the hall. To the press when asked why he would do this to his own constituents, the bill sponsor unapologetically said they should have thought about that before they voted for her. It's public record. I have never seen such a disgusting display of punitive politics. We are talking about a man who is facing charges related to a coordinated effort to overturn the results of our Georgia election. A case that was thoroughly investigated, a case that went before two grand juries, a case where four defendants have pled guilty and are ready to testify against the remaining defendants. Guilt or innocence has not been determined by a jury in this case. Regardless of whether you think they're guilty or not, it is not appropriate for us to use our legislative power to punish a state constitutional officer who has a duty to defend. It is wrong for us to punish the citizens of Georgia for voting for someone who charges one of your friends. This bill is fully intended because we all know that another DA is not going to take over if Fannie Willis is appeal is not overturned. So what prosecutor is going to come in and actually prosecute the case against the sitting president of the United States? That is what this bill is about. It is about Fulton County. It is about that case. Let's talk about the money for a moment. The Trump prosecution involves multiple defendants, teams of lawyers, years of investigation and court time. If the case is dismissed and this becomes law, Fulton County residents will be forced to pay millions to cover the bills. That is money that could be used for schools, for roads, for public safety. Instead it would go straight into the pockets of a millionaire. And the fees must be paid out of the county prosecuting attorney's budget. Fulton County is the largest county in the state with more than a million citizens hitting their office with a bill of millions will devastate their prosecutors' ability to do their jobs. They are already overworked and underfunded. It will make it impossible to process cases timely, leaving our jails more full and our citizens less safe. And last time I checked this capital sits in Fulton County. What are we doing? The bill sponsor is headed on to bigger and better things in DC. This bill looks like a parting gift to his colleague and a bonus to his new boss. No wonder people don't trust their government anymore. Let's also think about the consequences beyond the Fulton County case. This legislation could be used to scare prosecutors away from doing their jobs, especially when their work threatens powerful people. We all know what this is really about. It's trying to punish a local prosecutor and elected official doing their job because some folks don't like who she's prosecuting. It's about weaponizing this body to interfere in an ongoing criminal case. And frankly, it's about protecting powerful people at the expense of the public, the people who put us in our seats. Colleagues, we cannot allow ourselves to become accomplices to that kind of overreach and especially our Fulton County delegation. How are your constituents going to feel about you voting to force them to foot the bill for this lawsuit? Ask yourself, if this provision becomes law, what message are we sending? That if you prosecute a high-profile defendant and they succeed in getting the prosecutor removed fairly or not, then taxpayers have to pay for the defense? Would this body ever consider such a policy if the defendant weren't Donald Trump? Let's be honest, there are already systems in place to address prosecutorial misconduct, the courts, the state bar, the prosecuting qualifications commission that we passed legislation on. We can all handle that. SB 244 would create an entirely new financial burden targeted at one county, for one case that's not policy, that's not politics, it's beneath the dignity of this chamber. Let's put the Trump case aside, maybe these rare circumstances do occur. What if the next time I prosecute it brings charges of child molestation and the case is dismissed on a technicality? This bill means Georgia taxpayers will be forced to pay for that molestor's legal bills. What about if it's a sex trafficker, a fentanyl trafficker, rapist? Are we ready to go down that road? How will any of us in this chamber explain this to our constituents that we force them to pay for the fees of someone who might have committed these heinous crimes? Talk about an unintended consequence. What's worse, and I think every member in this room should be deeply troubled by this, is that the bill ties this Trump carve out to the wrongful conviction compensation fund. It effectively holds justice. For the innocent hostage to political protection for the powerful, how do we explain to exonerees people who have spent decades in prison for crimes? They did not commit that their long awaited compensation is tied to a bailout provision for wealthy defendants in an election interference case. Attaching this bill to SB 244 is cruel and sickening. Our House colleagues, bipartisan bills designed to compensate people who were wrongfully convicted and incarcerated, caged people who lost years, sometimes decades of their lives to an unjust system. Men and women who sat behind bars for crimes, they did not commit who missed out on weddings, funerals, births, graduations, and the everyday freedoms we take for granted. Let that sink in. The same bill that provides relief to the innocent also includes a financial bailout for a man charged with trying to overturn an election. This is a slap in the face to every exonery in Georgia to say, yes, we see your suffering, but by the way, we're also going to help Trump if he gets off on a technicality. It's disgusting and it's deliberate. Attaching these two policies together isn't just bad policy. It's cynical politics at its worst. It puts legislators and voters in a moral straight jacket. If you want to support justice for the wrongfully convicted, you also have to support protecting powerful politicians from accountability. That's not leadership, that's hostage taking. And what message does that send that the rules don't apply if you're powerful enough that you can weaponize the legal system and then get a reimbursement check if it doesn't work out. This is not about good governance. This is not about due process. This is political retaliation, plain and simple. It's insulting, it's cynical, it's cruel. Let me be clear, I want to vote for a clean, wrongful conviction compensation bill. I believe many of us on both sides of the aisle want to do right by people who've suffered at the hands of the criminal justice system. But I will not be forced to swallow a poison pill that turns local accountability into a partisan cudgel. And I urge you, regardless of how you feel about the Trump case, to think about the precedent, this sets. If we start tying local prosecutorial outcomes to the financial liabilities of this jurisdiction, where does it end? We're lawmakers, we are here to protect the integrity of the system, not to corrupt it through selective legislation. So I ask you my colleagues, vote with your conscience, vote with your integrity. Do not let this chamber be used as a shield for anyone, no matter how powerful, no matter how connected justice should be blind, not bought. Madam Speaker, I yield the well. The lady has yielded the well. The chair recognizes chairman Smith for the chairman's time. Thank you, Madam Speaker. I'll be brave. I'm going to yield my time to enjoy to later. I did one point out, something real quick, even though I got confused for a minute, thought I was in an extended part of the Fulton County delegation meeting. Ladies and gentlemen of this body read in the bill, but also realize why it's not in there. This applies to every one of the 51 judicial circuits in this great state. Every single one of those. Now there are some high profile cases that you hear about all the time. You see it broadcast all the way up, Anchorage. Everybody sees it up there. I get calls about it and classmates mind stationed up there with the Army of the Coast Guard. It's like what's going on. It's like, you know, talk about it. This applies to those regular Joe's and Jimmy's and James and Jamie's all the way from Chickamaga to Clinch County. This affects them. And so I just want to point a clarification there, Madam Speaker, and I appreciate that. And I'm going to yield the balance of my time to the majority of the leader. It recognizes leader of station for the chairman's time. Thank you, Madam Speaker. But yet this issue is I've been listening to the debate on this. I felt compelled to come here to the well because the bill, the matter that's being debated, I believe is very clear if you look at the substance of this legislation. First of all, Senate Bill 244 passed in the Georgia State Senate 55 to zero. It was a bipartisan bill. This part one, I'm seeing a head nod, 55 to zero with part one that's being objected to right now by the minority party. And if you look at the legislation, it's about fundamental fairness for those who are in the justice system. And in circumstances where a prosecutor in a criminal case commits misconduct serious enough to be disqualified. In these kinds of egregious situations, a person who has been subjected to the criminal justice system unfairly due to a prosecutor ultimately being disqualified should have the right of recovery. And as this was not controversial in the state Senate, it passed unanimously with bipartisan support. I would submit that it should receive such support here in this chamber as well. Now part two of this bill is something as the representatives who have spoken on this have referenced has been an issue that we have worked on in this chamber for years and years. There has been bipartisan hard work that has been put forth on this measure that will allow for a process to be in place in consideration of these compensation cases. This critical landmark legislative effort is important for our state into the future. And I think is a testament to the work and dedication and recognition that we need this law on the books. So ladies and gentlemen of the House, I'd ask for your favor consideration on Senate Bill 244 as to both of these sections. I'd submit these really should not be controversial. They should be supported with a bipartisan vote on the board. And I would ask you to vote green on this bill. Thank you, Madam Speaker. The gentleman has yielded the well. Is there any objection to adopting the Committee substitute? Chair, here's none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. All members voted. All members voted. All members voted. For what purpose is representative Neal rise? I think to speak, I want to invoke rule 133. The gentleman lady has that right. The record was so reflect. So all members voted. If so, Mr. Clerk will you lock the machine? On the pass just Senate bill 244, the yeas are 103. 103, the nays are 61. This bill having to see the requisite constitutional majority is therefore passed. Because I hope you'll join me in recognizing a former member of this body representing Mike Jacobs. Good see, Judge. Always. Thanks for coming back. We appreciate your service. Former representative Mike Jacobs. Come up and let's get a photo if you will. Good luck, too. Mr. Clerk, will you read a caption to Senate bill 291-291? Senate bill 291 by Senator Gucci, 51st and others to be titled an act to amend Code Section 40-286.1 of the fiscal to Georgia and Tana relating to special license plates promoting or supporting certain worthy agencies, funds or nonprofit corporations and qualified voter vehicles or drivers with proceeds to deposit in the general fund. This bill I refer to Committee on Motor Vehicles that committee recommends this bill do pass by committee substitute. For representing Martin Matahand has recognized to present Senate bill 291. The gentleman is recognized. Thank you, Mr. Speaker and colleagues of the House. Today I rise and present Senate bill 291. It's an opportunity for us to do something simple yet very powerful. It's a license plate but not just any license plate. It's one that reflects the soul of this country and its state. A plate that says loud and clear, America farce. Here's why it matters. Ladies and gentlemen, this license plate is more than just metal and paint. It is a tangible expression of patriotism. It is the echo of the words, my country, tis of the sweet land of liberty of the icing. This bill is about putting America first but not in a partisan way, not in a divisive way, but in a way that she'd unite us all under the great red, white and blue. Here's what this bill isn't about. This bill isn't about a president in the past, in the present, or folks even in the future. It's not about who's in the White House. It's about this land, this sacred land from every mountainside, let freedom ring. It's about recognizing the greatness of our country and the state of Georgia. It's about the values that make America strong, economic stability, national security, and the rights of our citizens and all that we hold there. The phrase America first should not divide us. It should inspire us. It calls us back to the foundation. God shed his grace on thee and crown thy good with brotherhood from sea to shining sea. It's as Dr. Martin Luther King said, if we are caught in an inescapable network of mutuality tied in a single garment of destiny, this means that the common good in the love of our country is above partisanship. It's above partisanship. Continue. Thank you, Speaker. I'll tell you, as a young man in a public school, I remember those times why I'd go to music class and we'd sing songs about this great country. About the fields of Midwest, about the great state that we live in today. And I think it's time for this house to rise above this partisanship and recognize that we ought to put America first and we better put it behind the vehicle, behind our vehicles, too. This bill gives Georgia's the way to show pride in their country, their values, and their home. It says, I believe in this land. It says, I believe in this land's promise. I believe in its people and I believe in America first. I respectfully ask your support of Senate Bill 291, a unifying symbol, a voice of patriotism and a reminder that this is still the land of the free and the home of the brave. And will that Mr. Speaker, I will yield for a couple questions. You have a couple questions. Let's see now. A representative Carter to your, where she, she, she was representing, representing the barrett, right up to your left, up the middle, representing Carter Barrett, recognize for a question. Thank you, Mr. Speaker. Does the gentleman yield? Ah, he is. That's true that introducing an America first license plate will give Georgia, it's a fantastic opportunity to display their patriotism. Oh, you got that right. It doesn't matter who you are, who you affiliate with. This is about America first, and that's the week and all unifying around. Thank you for your question. General, has two more questions representing Wilkerson to your left and the back, recognize for a question. Thank you, Mr. Speaker. Is the gentleman yield? You're from my friend. I know you quoted a lot about, I guess Martin Luther King, America, you did not sing the, America the Beautiful. Would you be willing to do that? And my vote depends on how you sound because as a patriotic person who grew up in a, near a military base, I tried to think back when my father would think about this and, and to be honest with you, he didn't need a license plate to serve his country. He didn't need a license plate to go to Vietnam. He didn't need a license plate to teach us that America was what we should all strive for it to be, which is a great country. But I'm just trying to figure out what the purpose of this bill is. Well, I mean, frankly, your father couldn't get one because it wasn't available. And that's what this bill does. It makes this license plate clear for every Georgia that if they want to display America first, they can have it. Thank you for your question. I think Chastain has recognized for a question to your right. Thank you, Mr. Speaker. Is Jim and you? I give you from my friend. Is it not true that introducing an American first license plate allows Georgia to publicly display their patriotism? It sure does. Thank you for the question. This is a true display of unifying patriotism. And I'd ask this House of Pastors this great Senate bill and with that, Mr. Speaker, I will yield the well. As you do the well, we have a whole lineup of speakers here. Chairs going to allow them about four minutes would not a hard time line about four minutes each to speak to the bill and their bill. But we're going to start with representing Spencer Fry. Speak to the bill. Representative Fry. I want you to try to hold it before, but it won't be a hard time line. But try to hold it before, please. General is recognized. Thank you, Mr. Speaker. Hey, I'll listen up for a second. You know, I respect my friend. I respect a lot of folks in this room. Most all of you actually. And I've got to say, if this is how you express your love for your country, if we're seeing examples of you expressing your love for this country, I'd hate to see you hate it. I would hate to see you hate this country.\n\nBecause what we're seeing now is the dismantling of the institutions that has made this country what it is today. When you want to put a license plate on your car or your truck, your dude rancid your truck that you wash every weekend, that you ain't got a speck of dirt on. That's all shiny. Come on, you know I'm talking about 90% of you truck drivers. It's all like actually only two dirty trucks in this parking lot. One's mine and one is some other guys in the Senate. But you want to put American first license plate on your truck or your car. You might want to look at where that came from. And it derives from the isolationist policies. And the 1920s and the 1930s right after World War One. And it survived through the Great Depression. And it survived all the way up in the World War II. And then you know it was used to put America first before we agreed to go fight the Nazis in Nazi Germany. It was used as a message not to enter the war. People have asked me why I care so much about what's going on in our country today. And I really sat down and thought about it. You know 23 years after he was Shema. 23 years after he was Shema. I was a two year old boy of a United States soldier. And I was a two year old boy as an occupying force in a country that America had defeated in a World War II. 23 years after that. Growing up on an army base when I see soldiers carrying guns and chanting the cheers and going on down the way. This stuff has been emblazoned in my head. 23 years after World War II. I was in Germany. And this stuff was hammered into my head. Why are we here, Dad? Well because we beat the Nazis. And when you folks, you say you love this country. And you folks say you love this state and you love the people here. I'm going to hate to see you hate it. Mr. Speaker, I yield the well. The gentleman is yielded the well. Representative Holland, members I'll be honest with you. You picked up another speaker on me. So I'm going to give you a hard stop at four minutes if you don't mind. Thanks. Representative Holland has recognized. Thank you Mr. Speaker. I'll try to talk fast. I wanted to start quickly with a story about my grandfather. And I promise this is relevant. But in 2018, my grandparents decided to move down to Atlanta from up north to be closer to their daughter and two of their grandchildren and a great-grandchild. And as soon as they arrived, one of the first things we did was take them to the DMV so we could update their voter registration. Because they had moved into a district where their oldest grandchild was running for office for the first time and she wanted to make sure they would be able to vote for her. And my grandfather, who admittedly has more conservative politics than I do, would ask me, well why should I vote for you? And at first I thought he was joking and so I would say things like because I'm your favorite grandchild or because I'm the mother of your favorite great-grandchild. But he kept asking and I began to realize he might be serious. And so I started giving answers about health care and public schools and taxes trying to win his support. And finally one day exhausted when he asked me again, why should I vote for you? The best thing I could say was I will always work to make you proud of me if I make it to the general assembly. He didn't ask again after that so I'm hoping that that maybe nullified him. I'll get to that in a minute. First a little bit of history. I'm a history nerd like my predecessor. And so the history of the America first phrase started in the 1850s actually with the Native American Party, which was not actually Native Americans, but Native East Americans. Who were specifically trying to keep Irish Catholic immigrants out of the United States. It got picked up again during World War I as an isolationist policy and then was adopted in the 1920s as one of the catchphrases of the Ku Klux Klan. In World War II, the America First Committee then picked up the America First Moniker in ways that have since been described as isolationist, anti-Semitic, and profascist. Even Dr. Seuss of all people criticized the slogan tying it to Nazism. Now what does any of that have to do with my grandfather? I want to bring this full circle. Obviously he wasn't around when they know nothing Native American Party. That was its actual name, no nothing. Created the slogan. He was just a little boy growing up in Wichita Falls, Texas when this became a slogan of the KKK. When the Americans First Committee came together, he was in college. He had gotten on a train from Wichita Falls to go to a foreign land called Massachusetts that he'd never been to before to attend MIT. He was 16 years old. And when he graduated from MIT, he married a lovely woman from a nice Jewish family in New York and joined up with the Army. And unlike a lot of folks who were dispatched to Europe or Japan, he was dispatched to Oak Ridge, Tennessee. If you know much about your World War II history or if you watch the movie Oppenheimer, you have an idea about how my grandfather contributed to the end of World War II. He then went and settled and had a family up in Connecticut and then later, as I said, moved down to Atlanta in 2018. He actually passed away one week to the day after I was sworn in here in this chamber. And so I think a lot about that promise I made with him. And while I think a lot of the time he wouldn't agree with every stance that I've taken in this house, I'd hope he'd be proud of my conviction with which I took them. But today is pretty specific. This man who served our country during World War II when America first stood for Naziism and fascism and anti-Semitism. Could have one day been driving in the state and seeing a license plate that trumpeted it. That would not have made him proud of me. I cannot support this bill. I hope you won't either. Mr. Speaker, I yield the well. The lady has yielded the way I represent Derek Jackson. They'll look at me like that. Mr. Speaker, I represent Jackson is recognized to speak to the bill. Thank you, Mr. Speaker. Colleagues, I stand here in strong opposition to Senate Bill 291. If you have to tell someone you are a patriot, but your actions are not aligned, you may want to rethink your statement. It's almost like telling somebody you're humble and your actions do not align to it. It's almost like saying America's first, but it doesn't resonate that way. When you hear America's first, you hear Make America Great Again to a lot of us. Some of us, when you hear Make America Great Again or America's first, you hear racism, segregation, and discrimination. Why? You ask because your actions and your policies and the content of your legislation says racism, segregation, and discrimination. From the time that the Constitution and the Bill of Rights were written, America has been the greatest experiment of diversity and inclusion. Yes, I use the word diversity. Yes, I use the word inclusion. It's the greatest experiment on this globe. The founding documents of our nation were crafted with the vision of liberty and justice for all. And I underscore all. Yet from the very beginning, the promise of these ideas was tarnished by the exclusion of the entire groups based on race, color, and creed. The paradox of American democracy is that while it professes equality and has simultaneously struggled with the implementation of true inclusivity, racism, the belief and the superiority of one race over another has its own discord and division among our people. It has manifested countless ways from systemic oppression of African Americans to the marginalization of indigenous people, women, and immigrants. The scars of slavery, colonialism, xenophobia are the deepest and persistent effecting generations in shaping the social economic landscape in our nation. Discrimination, the unjust treatment of people based on prejudice is a blight on our society. It permeates all aspects of life from the criminal justice system to corporate America. The scrimatory practices in hiring, promotion, and ways to distribution. These are the things when you hear America's first should come to mind, but it's our policies that tells us something different. The adverse effects of racism and segregation and discrimination are not limited to those directly targeted. One of the things as I'm about to yield this well, we got to combat racism. It takes all 180 of us in this chamber to make a decision on our deaths. Are we going to be the chamber that says no to Senate Bill 291 because the future is looking at us. Are we going to be the chamber to eradicate discrimination? We must champion equal treatment in the opportunity for all. And with that, Mr. Speaker, I yield the well. The gentleman is yielded the well. Representative, out in Sonia is recognized as speak to the bill. Representative out in Sonia is recognized. Representative, out in Sonia is recognized as speak to the bill. Thank you, Mr. Speaker. Colleagues and fellow Georgians, today we are asked to endorse a bill that claims to promote patrioticism. The Senate Bill 291 proposing an America first, special license plate. This gesture is not a symbol of a national pride. It is a calculated maneuver to inject partisan bias and dipping social divisions. It is not merely about a piece of metal on a car. It is about the values we choose to elevate as a state. Patrioticism is not just a slogan. It's not a bumper sticker. It is the daily work of building a Georgia that leaves up to its own ideals of wisdom, justice and moderation. That is patrioticism. The phrase America first is not neutral like the gentleman mentioned earlier. In the 1930s and 1940s, there was a committee called America First Committee. Their stance and position was to oppose the US intervention against the Nazi Germany. Even as the Holocaust unfolded and millions of people died, this committee stood in the way and did not want any support for the Jewish community and what they were going through. Do we really want our highways with cars plastered with slogans that echoes some of our darkest moments? When I hear the slogan America First, I think about Maria, who is a DACA recipient? She has been in the United States since two years old and she teaches in kindergarten. So Maria, that sounds like a threat. She has lived their whole life. And Georgia, her husband Maria is a home home to Jamal, a black veteran in Savannah. It's things. He fought for this country. But when he hears the slogan America First, he remembers the time that he was told to go back to where he came from. This slogan doesn't unite us. It divides. This bill would hurt people emotionally and probably physically. If we consider the extremists who will be excited about this bill and how empowered they probably would feel. It is despicable that the majority party will spend our precious time debating an unsensical measure as this. Listen folks, we are inviting chaos. This is not pitchy. It's the same. This is silly. It is performative. It is about action. Somebody said earlier if we truly care about national pride, why not invest in veterans, health care and their well-being. If we care about doing the work down here during the 40 days, why not expand access to voting? We're a state of civil rights. Heroes like John Lewis, heroes like Correta's, King and Dr. King, a very legacy. It teaches us that patriots are in means holding America accountable. So it's own ideals and we're living an era with deep political division. It is embarrassing that we're spending time doing this. I see my light is up, Mr. Speaker and I will respectfully yield. Thank you, Representative. I appreciate that. The gentleman's yield of the well. Representative Doreen Carter is recognized as Speaker of the bill. Representative Carter. Thank you, Mr. Speaker. I am so disappointed that I have to come up here to speak about this. You know, one of the things that flashed in my mind as the author came up here was a flashback of shopping with my mom as a kid on a pastry street in downtown Atlanta and how white people treated my mother. America first. As the audacity to mention Dr. King's name. And you know Friday, but we are realizing tonight is the anniversary his assassination. And I thought about being this five year old sitting in the living room when they had now stayed assassinated him. And the image of a kid standing in his long line with my mother as we were waiting in this line of proper hours to view his body. Are you happy or the audacity to mention his name in the same sentence as a tag for America first. So let me just tell you what America first means to me. You know, the slogan that was predominantly associated with the person who occupies the White House. You know, as a black female who grew up in the city of Atlanta, it depicts a message of racism. And how black people have been and continuously excluded from what we want. It is American dream to be. Then I think about this book that I recently read. There's a fever in the heart laying. And for those of you who are really excited about getting your tag, you should read that book. Because it outlines the history of how the client was rebirthed and how they did it through the church and they used pastors and how they trained their children on America first. And then how they infiltrated our government. See, that's the America first that we see. And I literally had to just take a walk because when we talk about our mental health and we think about triggers, y'all triggered me today. Y'all triggered me in a space that I hadn't been triggered. It says probably I was a kid because being black in Atlanta, Georgia. See, I don't. Civil rights wasn't a history lesson for me. We were in it. So when you guys come up here, you bring this up because you know you're excited about America first. Can we be Georgians for a minute? Because when you think about how this affects all of us, right, it's not just about a tag you're sending a message of hate. Please vote no. I yield the well. The lady has yielded the well. That completes our members speaking against the bill. Is there any objection to the previous question being ordered here? None of the previous questions ordered. We now have a minority report and and chairs time 20 minutes. 20 minutes up to 20 minutes will be a lot of free. Up to 20 minutes and I'll let you police yourself when it comes to your time. Mr. Weop. We'll park you. Want to recognize represented Campbell to speak to the bill as part of the minority report. Representative Campbell. Thank you, Mr. speakers. To my white brothers and sisters. Are you listening? To my white brothers and sisters, are you listening because this bill is a bill to put hate and discrimination and racism not from the past but from the present on display. I'm asking you to truly think about the long, the dark, the horrific history that these words bring today. I'm asking you also to oppose this bill. I'm asking you to think about all of those who've come before us who've served. Like both like my grandfather who served in the Navy during World War II and my other grandfather who was apart from his family building ships in World War II. And like my father who served in the Army in Vietnam who all gave their lives and sacrifice along with millions of others. They gave everything to stop the scourge of Nazism, racism, fascism, white supremacy and they would be absolutely appalled to know that today in this body that there was even a mention of these words that are known around the world to stand for hate. And why are we doing this? Why are we reporting this as patriotism? It is a rallying cry for discrimination, for shunning, for isolationism and division. But we can say no, we don't have to do this. This fight against extremism is here again. It's raising its ugly head here. And some of our colleagues want to put this slogan on specialty cartags. I rise in extreme opposition to this gross display of hypocrisy and hate, a decal of discrimination. We know that this slogan comes with so many echoes, but I really do wonder how much the people who chant it now really know about its history. We've heard America first was the slogan of the clue clucks plan. I'm making this up. Look it up. Google it. Pictures everywhere. Banners dating from the 1920s. They actually had a coin. It was a token. It was bearing the slogan America first on one side and on the other side it said preserve racial purity. It said the invisible empire. It was struck to celebrate the KKK's founding. During the election of 1944 the America first party ran on a platform that included calls for Jews to be sterilized and deported. Around the same time an organization called America first incorporated made a club like weapon that was designed to murder Jews in America. The America first committee and anti war group formed in 1940 was very controversial because of its support of hate organizations, anti-Semitic, fascist leaning members. And it at America first rally. Linberg said that the US should defend the white race against foreign invasion. That's what this plate symbolizes. And with so many very important bills to consider it is inconceivable to me that we would waste again even a minute on this bill. Some have said this bill is patriotic, but it is not this partisan. The authors proclaim it promotes unity, but it's clearly divisive. It only supports one presidential candidate. It's literally out-nactive living political party today. Some have said it's about national pride, but how can that be true when the slogan's history promoted religious intolerance, white supremacy, racism, fascism, and anti-Semitism? If our colleagues truly, if we truly want to be patriotic, we could be bringing a bill today to expand health care for all Georgia families. You really want to promote a sense of shared purpose? You could have hosted just a hearing on any other bills such as the Equal Rights Amendment. There's a slogan that has a history that actually is patriotic, that actually supports freedom, unity, freedom for all of us. You want to bring a bill, bring one about child care, affordable housing, living wages, all of these bills that didn't even get a hearing. This is a bumper sticker. It's a rollback to known discrimination, hate, and division. And again, I'm going to close. Everyone in this chamber should listen, but especially to all of my white brothers and sisters, if you do not feel shame in this moment for the racism that this slogan and this bill perpetuate, you have lost the plot. It's a tag of outright discrimination for all to see. We should stop this bill for all those who came before us, and we should do it for all those who will come after us. We should send this decal to the trash heap where it belongs, and get on with something worthy of our time. Vote no, just no, I yield the well. A lady as you are the well, who represent Steve Willis, has recognized the speak to the bill. Thank you, Mr. Speaker. I appreciate the recognition. Good afternoon colleagues in the sustained and historic house. Built on the ashes of historic land. Words matter. Fraziology does as well. And people's choice of words can be also revealing. America certainly is first in incarceration. Oh, it's first in a multitude of places and is going to be first in discrimination. I want repeat what's already been said. You know the origins of the slogan. I wanted to tell you a story about going to the airport with my father who is 98 years old before I do I'd like to remind you that there are people in this chamber. Including Madam Leader of the minority party and some of you who were born into segregation. You can continue talking about this. Me not. I am the descendant of America's greatest stain. Part slave and part slave owner. Praise that a high you like. But you don't get to come up here. And invoke Martin Luther King. As if you believe in equality for all. You don't get to mask our hero. In this bill while playing with our safety and our time. Because you like him. Okay, light. You like excerpts from I have a dream that make you comfortable. Because it's aspiration. But you don't like letters from the Birmingham jail. So instead of telling you the story about going to the airport with my father to meet his fraternity brothers when I was six years old and seeing the clue clicks clan for the first time. Hooded. And him saying get down. Get down to my mother and I. And for the first time seeing fear in my heroes eyes. I'll instead read an excerpt of full MLK. Wights. It must frankly be said are not putting in a similar mass effort to reeducate themselves out of their racial ignorance. It is an aspect of their sense of superiority. That the white people of America believe they have so little to learn. The reality of substantial investment to assist then Negroes into the 20th century.\n\nadjusting to having black neighbors and genuine school integration is still a nightmare for all too many white Americans. It makes them uncomfortable. There are the deepest causes for contemporary abrasions between the races. And this is what reminded me of this moment, loose and easy language about equality. Resonant resolutions about brotherhood fall pleasantly on the ear. But for us, there's a credibility gap that we cannot overlook. We remember that with each modest advance, the white population promptly raises the argument that the black American has come far enough, each step forward accents and ever present tendency to backlash. Now that's Martin Luther King. Where do we go from here? 1967. And so I ask you, where do we go from here? It may not offend you. But we will not go quietly into the night. Symbols matter. You virtue signaled that this is acceptable? I think not. Of a 98 year old black man watching me at home. I'm the pride of his heart who walked across the Edmund Pettis Bridge with John Lewis. You don't get to invoke our heroes with quotes that please your agenda and not take in the comprehensive movement. We are here. We are human. We are worthy of respect on your car, in your speak, and in this country, in this chamber. It matters not if you say yes. We can have a statue for the original 33. But if you want to invoke Martin Luther King ever again, I remind you of one thing as I close. He was assassinated to. He was assassinated to. So America first, first for whom? First for whom? And if you're all right with that, just understand this begins the resistance. And with that, Mr. Speaker, I yield the well. The lady has yielded the well. Representative Dewey McClain has recognized the speak to the bill. Thank you, Mr. Speaker and colleagues. I strongly oppose SB 291. And a lot of you all know a lot of things about me. And I found out today, half of y'all didn't know how to play pro football. That's sad. But I'm former Atlanta Falcon. And I'm going to just get it out because I want y'all to know something. But I also graduated from college. I did four years. I'm a history major. So I'm one of those very few that you can say that play sports and graduated in four years. A lot of folks can't say that, but I can. And I'm a history major. But reason I say that because I want y'all to know a little bit about me and a little bit about what I went through. The slogan American first, you all heard all the colleagues say when it started in 1920. The Nazis was the sympathizers and all of that. 1940, Native Americans, the committee said America first. But for me, 1978 was when I first saw a newsletter that had America first. I bought the home in Lawrence Field, Gwyneth County in the Midwest of the vision. And I say all of it because I want you to know I didn't know. I went out in my front yard and there was a newsletter in a bag with some rocks in it. So what do I do? Well, I get it because it's in my yard. But what's in it? The first thing, you know, the reason I heard my colleagues say that brings up scars. It brings up memories. I have a two year old and a newborn, a two year old and a newborn. And what do I read? What do I get? America first news. KKK. And I'm saying to myself, what the? But I guess I knew I was in the South, but I'm religious, Oklahoma. But we don't have a lot of KKK in Oklahoma because Native Americans don't believe in KKK. Native Americans will take care of KKK. Okay? So I say to you all that the American first slogan has a deep root to me. It has something that I would tell you that it's no way that I could support anything like that. You know, what's wrong with Georgia first? I mean, are we Georgia's? Are we Georgians? I mean, I'm an Oklahoma, but I live in Georgia. I spend 47 years being Georgia and 22 years in Oklahoma. What's wrong with Georgia first? I can support a Georgia first tag. I would be happy to sign on to a Georgia first tag. And in fact, early this week, we passed eight tag bills, eight. Let's think about it. You know, we passed DNR. We passed the DNR tag bill. We passed the Shipper Center Tags bill. We passed Southern University, Delta Sigma Theta. All these tag bills we passed all together. They were not racist. They were not divisive. They were not segregation. They were not partisan. This is partisan right here. This bill is partisan. This tag is partisan. And I hate that. I hate that because I know this body is better than that. I have seen this body. And anybody that knows me knows what I say. Right is right and wrong is wrong. And this bill is really wrong. This bill is so wrong that I can't see how anybody can vote for it. And I don't even see how anybody could support it. It came by itself. You know why it came by itself? You know why? Because nobody else would go with it. The other eight bills, the other eight bills, they were all together. They were not partisan. They were not racist. They were not segregation. They were not partisan. I didn't find anything in my front yard in 1978 that said anything about those bills. Let's just fast forward. It took five years. You know, I received those that mail from five years to 1983. And I guess they realized I was only blocking the neighborhood, but it was okay. But I had to explain to my young children that everybody is not the same. But all you have to do is have love in your heart. Just a little love and a little understanding. And I think that will make you a whole lot better. Well, it didn't scar my children, but it scarred me. And it scarred me because I was 24 years old in 1978. I was in five years old. I wasn't for you. I was 24 years old. And what I'm saying to you all is this. We've got to move past partisan politics in this building. We've got to do what's right for Georgians. And I do not like coming to this well. Only on a few occasions that I will come to this well. And you all know when I come to this well, it's only because it's something has bothered my constituents one, two, brings up memories that I have that I need to make sure that I get out and three to share with you all about the working family caucus on Thursday. That's it. But today, but today I'm asking you all to vote no. And today I'm saying that you all, American First is racist. America First in 1978, I received letters, the news letters. So to me, it is racist. It is personal to me. So Mr. Speaker, all I can say to this body is is that Georgia First, what is wrong with Georgia First? Is anything wrong with Georgia First? I can support Georgia First. I think we all can support Georgia First because we live here in Georgia. You know, we must do better. We should do better. A no on this sends his back. It sends it back to the author to let him know that we support Georgia. I mean, Americans, you know, that's one thing. But what I want us to understand is we have to. We've got to do better. Group, you have to listen. If we don't do better, how can we expect our children to do better? Our children cannot do better. We don't do better. My children, like I said, they were not scarred by this because they were two years old and a newborn. But I was scarred. Well, I know that I've already know what one side is going to vote. I already know how you're going to vote. But I'm going to still be okay with it because I already know that. But I don't understand how you can support racism. But then again, that is a choice that I can say that everybody can make. I say that because I, in 78, I saw the words American First. You didn't see them. I saw them. And to this day, that brings up something in me. But speaker, I can sit here and talk to them. I'm Native American. And I know that this bill, SB 291, is still going to get the 91 votes it needs. Regardless of what I say or what I do. But I still want you all to know that I do care for you. And it has nothing to do with you. It's just very personal to me. But speaker, with that, I yield the well. The gentleman yielded the well and that concludes those. Speaking on the minority report, we'll now have Chairman's time. Up to, up to 20 minutes for Chairman's time. Chairman John Corpett has recognized to speak to Senate Bill 291. Chairman Corpett. Thank you, Mr. Speaker. I rise today to express my unwavering support for Senate Bill 291. Legislation that embodies the spirit of patriotism and our commitment to American values by introducing the American First, especially licensed plates for the citizens of Georgia. Especially licensed plates of long serves as means for individuals to express their affiliations, beliefs, and support for various causes. By offering an American First, especially plate, we provide Georgia's with the opportunity to proudly display their dedication to the principles that have made our nation exceptional, freedom, democracy, and the pursuit of justice. We live in the greatest nation on earth, a country founded on liberty, free enterprise, and the enduring belief that America must always come first. Those single person, party, ideology should ever take precedence over these principles. This bill provides a simple but powerful way for the people of Georgia to declare their devotion to our country, to our Constitution, and to the values that have made the United States the beacon of freedom across the world. This bill also is fiscally responsible. It ensures that funds from the plates sale go directly to the state's general fund, including Georgia continue to invest in our infrastructure, public safety, and economic growth. At the same time, it is structured to prevent unnecessary costs to taxpayers, allowing production only if the man supports it. By supporting SB 291, we affirm our commitment to the values that define us as a nation and as a state. We empower our citizens to express their patriotism openly, and while simultaneously bolstering our state's fiscal well-being, I urge my colleagues to join me in endorsing this bill, allowing Georgia's another avenue to showcase their pride in our nation. And now I'm going to tell you a personal story. You've always heard, you know, all gave some, some gave all. Well, let me tell you about a person, someone that gave all. And this person is Corporal Dewey Lewis. He's from my home county. He died as President of war in Korea in 1950. His remains were not returned home until two years ago. They were identified through DNA testing. They returned his remains home. I had the honor of speaking to his funeral, most humbling thing I've ever done, ladies and gentlemen. You sit there, it's the military honors, taps playing. If it don't bring patriotism and tears to your eyes, nothing will. I sit there as I looked at his mother and father. He was the only child. They went to their graves, not knowing where their son was. He gave all for this country. And that's what this tag means to me. The patriotism is chance, he put America first. I think we should all do that. And I hope you all would join me in supporting this bill, Mr. Speaker. I yield the well. The gentleman has concluded the chairman's time and is yielded the well. Is there any objection to adopting the committee's substitute here in the committee's substitute is adopted? Is there any objection to agreeing to the report of the committee, which was favorable to the pastor's bill? There is objection to the gentleman move, gentleman moves. State your objection. Thank you, Mr. Speaker. As this bill came out of committee, there were members who were deeply concerned about the issues filed a minority report and have been told that there was not notice that there was such concern about this bill, but the minority report has been here for weeks. And we've given 20 minutes as our rules indicate. We go by our rules and the minority report was recognized for 20 minutes. As well as those, a sound hearing on the bill, I recognize those who spoke in opposition for over 20 minutes. So we've had a thorough hearing of the bill and I think we'll certainly follow in our rules. So the objection is not sustained. Is there any objection to agreeing to the report of the committee, which was favorable to the pastor's bill? Hearing none, the reporter committee has agreed to shall this bill now pass all in favor of the pastor's bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. It's so. Mr. Clerk, will you lock the machine? On the pass, just sent it bill 291. The yeas are 95. The nays are 68. This bill hasn't received a requisite constitutional majority. It's therefore passed. We're getting ready to take a break and have some pizza. And let's all eat it all. My condolences to the ones that didn't get any out of neither. I'm going to recognize the chairman of rules for an announced, but I'll let you know first before he does that. We do have pizza for those of you who were listening to the conversation that was going on here to debate. There will be pizza in the any room for members. Pizza in the any room for members. Mr. Chairman, you are recognized. Yes, we will come back. We will be in standing recess until seven. So if that helps you make your announcement, chairman parish is recognized. Foreign announcement. Thank you, Mr. Speaker. I'd like to ask the members of the rules committee to meet us in 341 at 630. Thank you. This house will be in recess until seven p.m. 7 p.m.",
  "updated_at": "2026-02-13T22:28:20.957736+00:00"
}