{
  "video_id": "wrssN2vMqnE",
  "url": "https://youtu.be/wrssN2vMqnE",
  "title": "Georgia House - Day 28 (2026-03-12)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 28,
  "video_date": "2026-03-12",
  "duration_minutes": 214,
  "summary": "Overview:\nThis Georgia House session focused on passing several bills, including ones related to environmental regulations and honoring various individuals and organizations. The session featured a quick presentation on HB 857, which aimed to prohibit the burning of chemically treated wood products in certain plants.\n\nKey Actions:\n- **HB 857**: Prohibits the permitting of burning chemically treated wood products, such as railroad ties, in biomass generating plants\n- **HB 1037, HB 1039, HB 1079, HB 1122, HB 720, HB 833, HB719, HB906**: Bills referred to committees\n\nBills Introduced (First Reading):\n- No new bills introduced\n\nNotable Moments:\n- Quick, efficient presentation by Chairman Allen Powell on HB 857\n- Recognitions and resolutions honoring various Georgia women, public servants, sports teams, and organizations\n\nVotes:\n- HB 857 passed with no objections\n\nAttendance:\n- Quorum present, no notes on attendance issues\n\nAdjournment:\n- Session adjourned, next session date not specified.",
  "transcript": "House will come back to order. This House will come back to order. Mr. Clerk, you want to ring the bill? This House will come back to order. The Clerk will read the caption to a group of privileged resolutions. Recognizing commanding Georgia women of achievement, recognizing the importance of civil discourse and better arguments, recognizing commanding of Rashad Jamal Taylor on the South-Standing Public Service as a political consultant and legislator, recognizing commanding the public service career of Rehawns Merritt upon retirement, recognizing commanding Sally Jackson atkins, recognizing commanding Velma L. Rucker, recognizing June 6, 2020 as women's golf day, recognizing given in action, incorporated, commanding and recognizing March 28, 2020 as a state-capital, recognizing commanding a live home care, congratulating the Westwood Lady White Cat Wildcat basketball team for winning the 2020 GISA Class AA State Basketball Championship, recognizing commanding the African Women in Leadership Organization, recognizing and commanding Camp Sunshine, commanding the touchdown high school boys class 5A, 2020 State Champions, recognizing October 9, 2020 as PANDAS Awareness Day at the State Capitol, and for other purposes that completes the reading of the Privileged Resolutions. Is there any objection to adopting the Privileged Resolutions that Chair Here's None in the Resolutions are adopted? Okay, I know people are sort of wondering where we are. You didn't go talk to a lobbyist during the lunch break to find out. One thing I know is that we are going to do today as we do cross-over day normal. We will be in session tomorrow, but we'll have some instructions about that later on. And then we're still working out some details on where we go from there. But again, I won't repeat what I said this morning. The protection of the health and best interest of the members and staff and those that work here is going to be paramount both to Lieutenant Governor and the Governor and myself. And we're having some good discussions together about the best path forward. So, depending on the announcements, and I've mentioned this to you because those of you that have bills on the rules calendar that was set earlier in the week or the supplemental rules calendar. The future schedule may obviously dictate which of those get called and which don't. So, with that, we're going to move forward and the clerk will read the caption to House Bill 857. House Bill 837, I'm sorry. The clerk's in a Powell, 30 second and others to be entitled next to men, Chapter 9 and Title 12, the EFISCO to Georgia Entity relating the prevention and control of air pollution. So, to prohibit the burning of certain chemically treated wood products, this bill ever referred to the Committee on Natural Resources and Environment. The Committee recommends that this bill do pass by Committee substitute. Chair recognizes Chairman Allen Powell to present the bill. Thank you, Mr. Speaker and ladies and gentlemen of the House. I bring to you this afternoon House Bill 857. And it does quite simply a very short thing and I'll tell you, it prohibits any permitting of the burning of Christophe Railroad ties and a biomass generating plant. I'll give you a little bit of the history about this and what made this so important. Representative McCall and I brought this bill forward because there's two counties that have been highly impacted by this. Back in 2015, a company came in and wanted to build a generating plant in both the counties, Madison and Franklin County. And they were told, or the county commissioners and the citizens were told, that these plants would be burning biomass, basically forest products, clean type forest products. Well, before the plant was ever constructed or finished, EPA changed the rules about burning of Christophe forever. And I couldn't tell you how long Christophe burning had been banned by EPA, the federal government. So in 2016, EPA changed the rules of the game. So when these two plants opened up operations back last year, they started burning railroad ties. Now, the two plants quite frankly had suffered from certain problems of management. And they were cited for stormwater runoff. And I mean, this stuff is such a terrible compound that even when the railroad ties were unloaded next to the plant down in Cobbitt, it rained on them. And there was a steady stream of black fluid that went in around people's wells and they were cited for that. And it goes on and on. I could tell you all the other things that happened. The bottom line is what happened is when they started burning this stuff, the people that lived in close proximity were impacted. So I'm up to this day, you're still calling me because they've had to move out of their homes. Senior citizens have moved to live with their children and other parts and they want to keep up with what's going on. And that was the reason we had talked both representative and mechaolamyself had talked to EPD. They acknowledged the fact that there were some problems with these plants and how they were doing their operations. And with consultation with EPD since they can't actively lobby against any industry, they gave us the language. First language I'd looked at was basically giving local governments, as you know they're always so anxious about preemptions. But this is one I want to give the commissioners the authority to approve or disapprove of material to be burned. Well because of the litigation and the courts couldn't do that. So the next issue was to ban the burning of this type of material. At this particular time there's no other plant in the state of Georgia that burns Christophe. Both Tom and myself and we were consulted about it. We didn't know you could burn Christophe because I don't think many people even knew that EPA had changed the rules of the game in 2016. Now there is a plant in Dublin, Georgia, supposedly are down in that part of the woods, that they're permitted to burn maybe. And it's a manufacturing plant and they wouldn't be burning this biomass to generate power except for their own personal usage. So we agreed to an amendment as we're usually agreeable to allow that to happen in that situation and that was the only amendment put to it. But that Mr. Speaker is adjusted this bill. I can assure you that the good folks over in Franklin and Madison County that are suffering from the problems of this and their county commissioners who have passed resolutions and such as that would appreciate your favorable consideration for this bill. And that Mr. Speaker is adjusted this and I would be grateful if you'd vote for it. You have a question but first the chair wants to make an observation. Do you, members of the House, do you realize what you've just seen? You've just seen a very short presentation as defined by Chairman Powell who assured me that he would be so fast it would make my head spin. That's pretty fast. So if there's no serious questions, I'll step aside. Please just warn me when you have a long presentation. You have a question if you care to heal. Okay. I'm sure you had a good question, representative Williams. It will forever go unanswered. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute the chair here is none? The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable? To the passage of the bill. The chair here is none. And the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does Chairman Martin rise? Parliamentary inquiry. The state you're inquiry. Isn't it true that I believe our colleague from Hartwell was trying to channel the former member of this body. Chairman Wendell Willard there in his presentation this afternoon. Well, I did somehow Chairman Willard went across my mind while he was okay. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 857. The eyes are 163. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 761. House Bill 761, my reps and of Carter, the 46 and others to be entitled to an act to a men title 46. The official go to Georgia and say to relay new public utilities and public transportation. Those to eliminate the percentage limitation as the amount of investments in electric membership corporation may make. This bill ever referred to the committee on energy utilities and telecommunications. That committee recommends this bill do pass by committee substitute. Chair recognizes representative Carson to present the bill. Thank you, Mr. Speaker. Folks, I have before you a House Bill 761. What this bill does, and this is not the other EMC bill by the way we're considering. All this does is it raises the statutory cap in which an EMC may make an investment in a natural gas marketer. The caption says eliminate, actually we made a compromise in committee and we have gone from 15 to 60%. What this does is levels the playing field between an EMC and non-EMC parent. Back in 2002, this general assembly after natural gas deregulation in 1997, we came back with in 2002 to basically provide some consumer protection and relief provisions. This 15% was added. Not many people know why it was added. It could have been done to marry along with some federal, rural electric standards, excuse me, rural utility standards, RUS financing, but it was really unnecessary. We're looking to just raise this percentage and allow some Georgia jobs to stay in Georgia. This keeps the prohibition on cross subsidization. All loans must be at market rates. This Georgia EMC obviously supports this. You have a letter on your desk and Georgia Power is neutral on this. I'd very much ask for your favorable consideration. This speaks very simple bill, very straightforward. And if there's no questions, I'll yield the will. You have a question if you care to yield. I'll yield for one question. Chair recognizes representative Ridley to your right for a question. So gentlemen, you'll... I do, yes sir. I just got a quick question. Did you say that there was 15% and you're not sure why it was put there originally and now we're going to 60? We had... It was put in back in 2002 under House Bill 1568. And what this says is that an EMC can make up to 15% of their net plant investment into a gas marketer. We're raising this to 60%. I originally wanted to get rid of the percentage, but again, there was no real necessary reason for this regulation. It has nothing to do with cross subsidization or anything like that. This had to... It was married off of a federal regulation that was unnecessary at the time. It's definitely unnecessary now. Okay, thank you. Thank you very much for the question. I'd appreciate this body's favorable support and I yield the will. Gentlemen, as yielded the will, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 761 will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Carpenter arise? Paul or Mentor? They're your inquiry. Is it not true that I understand complicated utility matters that affect just one organization? You don't really want me to answer that, do you? Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 761. The eyes are 158. The nays are seven. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 901. House Bill 901, my representative, Chokus, the 138th and others to be entitled to amend part one of Article 1 of chapter 23 of Title 50, the fiscal to Georgia, and to be relating the general provisions regarding the Georgia environmental finance authority. So is to provide for the power and make loan commitments and loans to local governments, this bill ever referred to the committee on natural resources and environment. The committee recommends that this bill do pass by committee substitute. Chair recognizes representative Chokus to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring before you today House Bill 901, the Georgia Environmental Finance Authority makes loans to local governments for the purpose of land conservation. When we passed the Georgia Outdoor Stewardship Act last year, we inadvertently left out NGOs, non-governmental organizations. This cleanup legislation simply adds NGOs back to the code. There is no cost to the state because these loans are federally funded. And I have placed on your desk several examples of loans that the NGOs have done in the past for land conservation. If there are no questions, I respectfully ask for your favorable consideration to HB. You have no questions. Thank you, Mr. Speaker. I yield the well. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 901? Will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 901. The eyes are 165. The nays are one. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 991. House Bill 991 by Representative Knight of the 130th and others to be entitled to the act to amend Title 31 of the EFISCO to Georgia Antietta, relating to health. So it's to provide for transparency relating the state health care plans and its contractors. This bill, having been referred to the Special Committee on Access to Quality Healthcare, that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Hatchett to present the bill. Thank you, Mr. Speaker. I'm going to practice the five B's. Be breathed, brother, be brief. House Bill 991 creates the health care transparency and accountability oversight committee to review the performance and conduct of all state health care plan contractors and subcommittee will be composed of a physician, a pharmacist, and a consumer member of the state health benefit plan, chosen by the governor, six members of the general assembly, two appointed by the governor, two by the speaker, and two by the lieutenant governor. The reason that we are doing this is to allow us some access to these contracts that we have had trouble getting. Are there any questions, Mr. Speaker? I will take the question. You have no questions. Thank you. I appreciate your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 991 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 991. The eyes are 166. The knees are one. This bill, having received the requisite constitutional majority, is therefore passed. What purpose does Chairman Hatchett rise? Thank you, Mr. Speaker. I guess it's a parliamentary inquiry, but it's also an announcement. Somebody left this mug on my desk and it's not my shade of lipsticks, so maybe somebody can come get it. Okay. I'm just waiting to see who's it is. We're waiting to see who comes. Clerk will read the caption to House Bill 929. House Bill 929 by version of Smith of the 133rd and others to be entitled to amend part 1. Article 2, Chapter 8 of Title 12, if you're just going to George Ante, we're leading the General Provisions Relative Solid Waste Management, so to provide for a post-closure ground water monitoring. Just bill 11 for the committee. The natural resources and environment that committee recommends that this bill do pass. Chair recognizes Representative Vance Smith to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, this bill deals with surface and palmet areas. And if you have the bill out and you go to Section 2 of the bill, that's where the real meat of the bill is. What it does, there's a post-closure inspection and care of these ground surface and palmet areas for 30 years. Number 2, there will be monitoring the ground water. This information that is received will be put on the website and it stipulates in the bill that the information that is put on the website will be put where a person without a science background will be able to read the information, so reasonably understood. And also, EPD will do inspections once a year up until the closure and then once the closure comes, there will be an inspection every five years. So, sure would appreciate your favor consideration if there are any questions, Mr. Speaker. We glad to answer if not. I appreciate your vote. You've got a couple of questions if you care to yield. I'll take one, yes. I recognize as Chairman Watson, do you're right for a question? Thank you, Mr. Speaker. Is it gentleman yield? Yes, sir. Is it not true that in the budget that we passed yesterday that we allocated some money for two environmental engineers to work on this exact issue across the state? Yes, or $500,000 to ask the people of the EPD to take care of these inspections. Thank you. Appreciate the question. Mr. Speaker, I'll yield the well and ask for your favor consideration. We had another member that wished to be heard on the bill that Chair recognizes the minority leader of the House, leader Tramble. Thank you, Mr. Speaker. This bill is about coal ash. It's a problem that tens, tens of millions of toxic coal ash sit in Georgia on top of aquifers, online. And today we'll pass without us taking up legislation that would address the danger of that situation. So I'm really here not today to talk about the missed opportunity. But while we have this bill on the floor that deals with testing, the reason we test is to see if there's something wrong. But you know what? When you know that there's something wrong, there's a call to action. And when you know that there's something wrong and you don't do anything about it, that's an action. Our job is to protect Georgians. And the fact is, today we'll come and go and we will not have done what we could have done to protect Georgians when it comes to toxic coal ash. That's all I'm going to say. But I do want you to hear from two other people on this subject. Good afternoon. Thank you for sponsoring House Bill 756, conditions for the issuance of a permit for solid waste or special waste handling for coal combustion unit or landfill. This is such an important issue for our state and especially for the residents in Monroe County, Georgia. I attended a community meeting last night held to inform the public of the plan to shut down or cap in place the ash pond and to provide information regarding testing being done by ultimate high river keepers. I live less than a half mile from the ash pond. The same house I grew up in since I was four years old. My well was tested in October 2019 and including alarming levels of chemicals like hexavalent chromium and strontium. My 16 year old daughter was diagnosed with cancer when she was four. She is a thriving teenager now. Thank the Lord. I'm concerned based on the results of the many tell West many wells have been tested in Juliet. I'm sure you will agree that you will continue your fight for these bills and you will echo the voices of hundreds of people who attended last night's meeting and saying enough is enough. We need to do the right thing. My daughter's life should not be a calculated risk that is allowed to take. You have the power to enforce the excavation of the ash pond in a manner that will protect our future water. One more voice and I'm done. In August of 2019 I bought .93 acres in Juliet, Georgia and Monroe County, moved into a house paying in full cash for the house in the land. I spent every penny I had to accomplish this. My plan was to live out the rest of my life here, mortgage free, happy and in peace. I had some knowledge that there was some potential water contamination issues before I bought the property. Requested realtors have the well tested to make sure the water was good. They put in a request through the local environmental department who took a water sample and sent it to the UGA Extension offices. I was told it came back clean and unfortunately did not read the report but took the word of my realtors as they knew exactly what my concerns were. I just in the past couple of weeks came to realize that the water test was for bacteria and did not include the chemical contaminants for plant shares, coal ash ponds. I take partial responsibility because it was my duty to double check that my request had been honored but I evenly went forward and signed on the dotted line. At this time I will still has not been tested for chemical.\n\nContaminants, but due to the proximity of my property to the plant, I must assume that it is contaminated and take the necessary safety precautions to protect myself, my daughter, any visitors I have, and my dog. I cannot express how important this is to me, my family, and my neighbors. I am normally not a radical or hysterical person, but since I've come to know the seriousness of the situation we're all facing, I've come to fear the water in my house. Every time I look at my waterfall set, it's like I'm staring at the face of a venomous snake. Every time I wash my hands, I wonder if they are actually clean, and every time I take a shower, I wonder if I have just bathed in deadly chemicals. Nobody should have to live with these fears. Nobody. Please help us. We are not big enough to get this done on our own. Any consideration you can give to this matter is greatly appreciated. Testing. When we know that people need help, our job is to help. And it's not to leave Georgians as human canaries in a coal mine. Mr. Speaker, I yield the well. Gentlemen, as yielded the well, what purpose does representative Vance Smith rise? Parliamentary inquiry. Mr. Speaker, is it true that I too have communicated with people in that area and also communicated with the riverkeeper in that area and had several conversations and had asked for information that I would walk personally over to EPD and work with him. And it is true that it took ten days for me to get that information from him. And I turned that information over to EPD. And as a viet, I have not been contacted to say that any contaminants were there that would cause a well to be closed. So I also had that great communication down there with those people. Thank you. The purpose does Chairman Lynn Smith rise? Thank you, Mr. Speaker. Parliamentary inquiry. Is it not true that House Bill 29 is a result of efforts by all the people involved in this issue, members of the Natural Resource and Environment Committee and from the citizens around the state? Is that not true? I know that there has been no higher priority given by your committee than to this issue this session. Further parliamentary inquiry. State your inquiry. Is it not true also that the presence of the EPD during the closing time and for the several years after that, one of the reassurances we feel is very important for the citizens of Georgia, is it not true? That the EPD has the authority to stop all operations and require the offenders to remediate the land? If the lady so states, I'm sure she knows where off she speaks. What purpose does Representative Jasmine Clark rise? Parliamentary inquiry. State your inquiry. Is it not true that monitoring pollution after the pollution has already happened? Does not protect people from being exposed to the pollution? If the lady so states, I'm sure she believes that to be true. Thank you. All right. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 929? Will vote aye. Those opposed to vote no and the clerk will unlock the machines? I'm going to give them a hand. I'm going to give them a hand. The stands are going to come up here for five minutes. Five minutes. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 929, the eyes are 113. The nays are 52. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 959. House Bill 959 by Representative Meeks, the 178th and others. The Natal Nactiman Code Section 12, 839. The fiscal to Georgia and Tate are relating to waste management, cost reimbursements and surcharges. This bill I refer to the committee on national resources. That committee recommends that this bill do pass by committee substitute. Chair recognizes Representative Meeks to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I bring for you today consideration of House Bill 959, a legislation that will increase the tipping fees paid to local municipalities for the dumping coal ash. One thing I would note, we have a substitute from the rules committee. Is it appropriate to discuss that at this time? Okay. If your note on page on the second page, line 35, the original bill would reduce to 10%. The fees that are collected for what the community could use those for. Currently, was it 58? Bill passed out of the committee at 10. The rules committee amended that to 40% of the fees collected. Shall be used for the list of activities below in the community for those for that increase. So Mr. Chairman, that's the crux of the bill. It increases the tipping fees for coal ash to equal that of municipal waste going to land fields. Mr. Chairman, I'll be happy to answer any questions. You have a few questions if you care to yield. Yes, Mr. Speaker. Chair recognizes the minority leader of the House to your left for a question. Is it gentlemen, you? Yes, sir. Isn't it true that what animates the bill and the reason this bill is a good idea is because coal ash is toxic and a danger to the communities in which coal ash is deposited? I believe the gentleman knows of what he speaks. Did you further yield? Yes, sir, Mr. Speaker. Chair recognizes Chairman Rhodes to your right for a question. Does the gentleman yield? Yes, sir. Is it not true this bill will deter coal ash from being dumped in our municipal land fields from outside of our state? Yes, for the gentleman knows of what he speaks. As many members of this chamber are aware, several of our neighbors around the country have or under water to excavate their coal ash ponds. And without raising this dumping fee or tipping fee in the local communities, we will be receiving more out of state ash. Mr. Chair, I have a further questions. Thank you, sir. I yield the will. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The Chair hears none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The Chair hears none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 959? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 959. The eyes are 162. The nays are one. This bill, having received the requisite constitutional majority, is therefore passed. The clerk will read the caption to House Bill 927. House Bill 927, my folks, and the Parsons of the 44th and others to be entitled back to amend Article 9 of Title 12, the official to Georgia annotated relaying their air quality, so it's required for the reporting of any unpermitted release. This bill I refer to the committee on natural resources and environment that committee recommends that this bill do pass. Chair recognizes Chairman Parsons to present the bill. Thank you, Chairman Rostin. House Bill 927 relates to the use of Ethnelyne Oxide as a condition of a permit from the EPD. It does two things. The bill requires that any release, any leak of Ethnelyne Oxide is reported to EPD within 24 hours. And it also requires that EPD place on their website any information related to those reports. It's a good bill for the people in the areas where these any use of Ethnelyne Oxide is located. And it's that people in many areas, especially in the areas of Somerna, are very happy about this. And it was very happy this morning to receive. I think about 30 calls from the area very excited about the passage of this bill. And I would ask for your favorable consideration, Mr. Speaker. If there are any questions, I'll be glad to take them. There are no questions. Well, there is one question now. Chair recognizes Representative Belton for a question. Do you have a question, sir? Yes, I do. Is it true, sir, that this bill will ensure better health air quality in the state of Georgia? Yes, that's absolutely true. People around the state will be very happy to have a passage of this bill. Thank you for the question. There are no more questions. Would appreciate your favorable consideration of House Bill 927. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The Chair here is none. The report of the Committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 162. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1070. House Bill 1070. House Bill 1070 by Representative Gaines, the 117th and others to be entitled to enact a man article 3 at Chapter 3, the Title 44. The official go to Georgia and Tate to relay the condominium. So, to provide new insurance policy disclosure requirements. The bill will have referred to the Committee on Insurance. That committee recommends that this bill do pass by Committee Substitute. Chair recognizes Representative Gaines to present the bill. Thank you, Madame Speaker. Water damage claims in condominiums often result in confusion from all parties. So, House Bill 1070 is intended to assist both the Unit Owner and the Condo Association by providing a mechanism for each party to request in writing a copy of the certificate of insurance or the contact of information for the assigned adjuster from the other party. Madame Speaker, I'm happy to answer any questions. There is a question. The chair recognizes Representative Wolenski for a question. Thank you. Does the representative view? I could just clarify in a little more detail. Sorry, first I'm seeing this. What more specifically it does in terms of? Sure. So, all the bill does is it allows either party to request in writing from the other party, which it would be, again, both the Condo Owner and the Condo Association, would be able to request from the other party. The other party would have five days to provide the information, which is a certificate of insurance or the assigned adjuster's contact information. That's all the bill does. Thank you. Does the members of the board want to talk? Sure. Thank you. So, is this just clarifying the big issue between homeowner associations and the owner of who's covering the issue? Condo is, Condo's and Condo's associations. Thank you. There's only a water damage claims. Any other questions? Chair recognizes Representative Cannon for a question. Thank you. Do you yield? I do. And so does this bill create any further action on either party or allow for any punitive nature? All the bill does is it requires the other party to provide that information within five days. Do you further yield? Sure. And so what would be the reason why Condo Association, a homeowner association, would need it within five business days? What does that provide? Because in water damage claims, time is of essence. And so that's why it only applies to water damage cases. That's why the bill has five days. Thank you. Thank you, Madam Speaker. I yield the will. The one has yielded the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 157. The yeas were 4. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 93. House Bill 93. By Representative Jones, 167th and others to be entitled to amend Article 2, which after 5 of the title 12, the official go to Georgia and to relating the control of water pollution that surface water use is bill 11 referred to the committee on natural resources and environment. That committee recommends that this bill do pass by committee substitute. The chair recognizes Representative Williams to present the bill. Thank you Madam Speaker. Ladies and gentlemen, bring to you today House Bill 93. This is a little simple bill and I'll be the three B's also. It just requires that when they do the dewatering of the co-ash ponds that they give the local jurisdiction written notice so that they can let people know that the co-ash ponds are being dewatered. We glad to take any questions. There are no questions. By the command of Speaker, I ask for your favorable consideration. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes? All those opposed will vote no and the clerk will unlock the machine. the mayor in question. The��록ra bans a memorial of Mr. White, And the authorities in questionтеee. Go on. Move on. Go on. If you'd like to complete a their vote, then no. I think this would... Food will be wszystkией accomplishment now. Food is List cie. achos address right away. Uh, toเข ud rug? No. To Through.Up malroyment of syrup. David Maquilouc restauration. You in question? Purs follow. Eleboarding there? How's that sound? Recon van déc is след. I pick up.用 errors to dropped rekke уж okay. Là it's a hitte הק to understand when someone says it's for garlic. If so, the clerk will lock the machine on the passage of the bill. The yeas were 165. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 833. House Bill 833. House Bill 833, my motion of Stevens and 164th, me and Todd on act to amend, Title 52 of the official go to Georgia and in tentative relating to waters. The state ports a water craft so as to authorize the department to promulgate rules and regulations. This bill then referred to the committee on natural resources and environment that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Petrie to present the bill. Thank you, Madam Speaker. Ladies and gentlemen of the House, I bring to you HB 833. A bill that simply clarifies a marine vessel's ability to overnight in our marine waters, short term, overnight and long term. Anchoraging, long term acreage described in this bill would be defined as that which is over 14 days cumulatively. And it would that would require a permit from the DNR commissioner. Short term anchoring would be up to 14 and including 14 days. Anchoring would be allowed except within 300 feet of a marina, 150 feet of a marine structure which would include private and public docks, over then 500 feet of an approved commercial shellfish growing area which as you know we established in legislation last year. Madam Speaker, that is simply what this bill does and stand for any questions if that is necessary. There are no questions. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. A Road to Spokee if a visitor is currently next to his missed phone please rest哦 three by the way. have all members voted. Have all members voted if so, the clerk will lock the machine on the passage of the bill. The yeas were 157, the nays were six. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill. For what purpose does Chairman Smith rise? Thank you, Parliamentary inquiry, please. State your inquiry. Is it not true that I wish to thank our representative Patry for presenting this bill? And he did that on behalf of Representative Ron Stevens, who is not here today, so I want to thank these gentlemen for what they did for Representative Stevens. Thank you. As the woman states, clerk will read the caption to House Bill 906. House Bill 906. House Bill 906, by the way, Senator Taylor, the 173rd and others have been titled an act to amend Part 2, Article 3, Chapter 3, Title 12 of the EFISCO to Georgia and Tate are relating to the Heritage Trust Program. So, as the condition, the method to utilize for conveyance of preserved property is bill I refer to the Committee on Natural Resources and Environment. That committee recommends that this bill do pass by Committee substitute. Chair recognizes Chairman Taylor to present the bill. Thank you, Madame Speaker. Good afternoon. Today I bring you House Bill 906. It's a Department of Natural Resource Bill that deals with how the state handles state-owned specifically classified and historically protected properties. The Heritage Trust Act established Heritage Preserved Designations for State-owned properties. This designation is extremely restrictive, and when the designation is placed on a property, it must remain on the property in perpetuity. Unfortunately, the state has several unusable and irreparable facilities with the Heritage Preserved designation. They are of no operational use and they would require substantial resources to maintain or redevelop. Some of these properties are of interest to other parties, such as local governments, nonprofits, and even private entities. This bill is to allow certain properties to, with a Heritage Preserved designation to be conveyed to a partner. It includes a requirement that no more than 15 acres total can be removed. The remainder will continue to have the Heritage Preserved designation. The conveyance would ensure the land is still protected through a conservation easement, which contains the strict protection value central to the Heritage Trust Act. Why is the state doing this and what will the state gain? Continuation of the preservation of the property and care and upkeep to the property. Why an interested and concerned entity at no taxpayer expense. The conveyance would be in exchange for other land, property, or an outright purchase. This will not be an easy process, but it will be very transparent because it requires the conveyance to meet certain requirements and have a final approval. The DNR must submit a request to the Board of Natural Resources for approval. A perpetual conservation easement must be placed on the property. In question, the Board of Natural Resources must hold a public hearing on the DNR's request and determine if that is the best interest of the state. With an aforementioned vote from the Board of Natural Resources, the request must be approved by the State Properties Commission, and then a final approval by the Georgia General Assembly and a conveyance authorization resolution. DNR must file a notice of heritage preserve removal and coercion easement placement with the Secretary of State and the Superior Court of the affected county and counties. A maximum total of 15 acres via one request or multiple request can cumulatively ever be removed from a current heritage preserve property using this process. Why do we need this bill? As I stated, there are several unusable, irreparable heritage preserved designated DNR properties that are of no operational use and would require substantial resources to maintain. DNR can intentionally manage property by allocating their resources to enhance user experience and conserve the natural resource presence. There will be an open and transparent process that allows for a more efficient change of use process. It increases a partnership that the DNR can have with local governments, nonprofits and private entities that are committed to this preservation. This legislation would allow the facilities to go to good use, be conserved and be assured they would be properly maintained as the property itself would still be and a protected conservation easement. There have been properties that could have been saved if this legislation had been in place. Finally, HB906 preserves the spirit and purpose of a heritage preserve while working with caring partners to turn a previously unusual property into a new opportunity. This is a good bill. It helps preserve our heritage through our historical properties. Therefore I ask for your favourable consideration of House Bill 906. Madam Speaker, if there are no questions, I will yield the well. You have questions? All right, I'll yield. Chair recognizes Chairman Silcox for a question. Yes, Madam Speaker. Yes, the General Lady Yield. Yes, ma'am. Isn't it true, Representative Taylor, that this will actually preserve these historic properties by offering this multi-stilt process for any changes? Yes, ma'am, you are correct. Thank you very much. Thank you. Chair recognizes Representative Beasley T for a question. Thank you, Madam Speaker. Will the General Lady Yield? Yes, ma'am. Will the persons that are going to have this designation change so that they can fix the properties up, will they pay taxes on it? Yes, they will. It is not excused from tax. If a government gets it, they would. Like if a county or city obtains it, but if someone else does, they would have regular application. Thank you. Chair recognizes Representative Thomas of the 56th for a question. Does the Generalwoman Yield? Yes, ma'am. Is this, does this legislation have the support of the, like, Atlanta, does this bill have the support of groups like the Atlanta Preservation? I'm not sure who all supports it, but I have a piece of property in Thomasville that wants this very much because they want to preserve a building that the state can't afford to maintain. This will help that. There are several properties. I will tell you of a sad one, which was in the Savannah area that was falling apart. If we had this bill, it could have been saved. Thank you. Thank you. Final question, the Chair recognizes Representative Williams of the 37th for a question. Thank you, ma'am. Well, the Generalwoman Yield. Yes. Okay. There you are. Isn't it true that I've heard from a colleague in Savannah who's been involved with Osabah Island for years that is concerned that some of the people who have worked to preserve some of these islands and some of these areas are concerned that private folks might come in and develop it against the will of the folks who've been working to preserve the properties. I think they're misinterpreting the purpose.\n\nof the bill I have spoken to and corresponded with several folks from that area. I will tell you and as the bill stated, the maximum property that could ever be involved in this is only 15 acres and it's still in a conservation easement. And this is not to open doors. It is very restricted. I went a little more than I usually do to go and how much you have to go through to get a property redone. And I will say there is no one that cared about preservation in this state more than Marguerite Williams who has now passed. And her family is wanting this so that these properties can be maintained. Thank you. Thank you. There are no more questions. Thank you. I yield the well. The lady is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Now this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no in the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The a's were 160. The a's were seven. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 720. House Bill 720. House Bill 720 by Representative Saints of the 180th to be entitled an act to amend Article 1 of Chapter 10 of Title 17, the Vistula of Georgia, and Tadya Relief and the procedure for sentencing and imposition of punishment. Dispillot referred to the committee on judiciary non-sevalle committee recommended that this bill do pass by committee substitute. The chair recognizes Representative Saints to present the bill. Thank you Madam Speaker. House Bill 720 addresses the new environment our state's public safety network is in after the decision of Park V State last year and ensuring compliance for our state assessed dangerous sexual predators. One of the major provisions of the bill allows for GPS tracking for twice adjudicated sexual predators who are much higher risk of being leveled a dangerous sexual predator. It also provides for great work. Representative Mandy Balinger has been working on in terms of the fender risk review board. It names them to clarify what they do which is level our sexual offenders and this will allow for clarity and also a more comprehensive report through making sure they have access to all departments information on that sexual offender. It also clarifies that a statutory rate defends any individual under the age of 16 that has a claim of consent that cannot be used as a defense for prosecution. It also and Representative Scott Holcomb has worked greatly on this and I think we'll speak to it. The creation of the statewide sexual assault tracking system which will ensure that the most prevalent and useful tool in prosecuting our state's sexual crimes when available is kept safe and tracked well. There's any questions all yield. There are no questions. Thank you. Senator gentlemen has yielded the well. The chair recognizes Representative Kenner to speak to the bill. Thank you Madam Chair. Today I rise in opposition to HB 720. To be clear I support holding someone accountable for their wrongdoing and crimes of this nature they are particularly harmful and I believe we should also protect our larger society with effective security measures. As a director of a transitional reentry program that works with justice involved men and women we occasionally have someone in our program who is on the registry seeking real rehabilitation. It is my professional opinion that there are already strong sufficient and appropriate safeguards to protect the community. Everyone on the registry must check in with a local sheriff's office if there is a change of address. If they change jobs they must also check in with the sheriff and they must annually check in on their birthday. In addition the registered individual cannot live within 1000 feet of a school day care, church or park. The registry is public record on a state funded highly accessible website. Any concerned citizen, any concerned parent can know who lives in proximity to them. We further penalize beyond these already stringent penalties with a residential warning sign and to impose a lifetime sentence of probation I find unduly punitive and stigmatizing. Research proves that the offending individual who is further penalized and stigmatized will cease to respond positively to treatment because there is a sense of futility. HB 720 along with other legislation created this session isn't about face to the criminal justice reform policies of the previous administration that have been working to make Georgia more just and more safe. Georgia already has more of its citizens own probation than any other state we are four times the national average. Our very own community supervision commissioner Michael Nell has told us that probation is not effective after 24 months after that it only serves as a trap to violate. It's also worth noting that probation administered by four profit companies is a $30 million business in Georgia. To be clear, I support holding someone accountable for their wrongdoing and crimes of this nature are particularly harmful and I believe we should also protect our larger society with effective security measures. But I also believe that we want to offer a path forward for the guilty party and an opportunity for redemption. The Southern Center for Human Rights, Georgia Justice, they oppose these measures. Department of Community Supervision, they have a lot of concerns about the impact on their agency that is already buckling under an overwhelming caseload. In efforts to time, I yield the well. Thank you Madam Chair. The gentleman has yielded the well for what purpose does representative Sains rise? Parliamentary inquiry. State's inquiry. Is it not true that under the reforms that were done under Governor Deel there was a more lenient system of ensuring that we had the capacity to monitor dangerous sexual predators and that this bill ensures that after 10 years of probation, those who have acted in good faith have a state required review of their probation and the judicial discretion is in place to allow for that probation if that applicable be terminated. As the gentleman states, the chair recognizes representative Holcomb to speak to the bill. Thank you Madam Speaker. I want to talk about the second half of the bill. For about the last year, the Georgia Sexual Assault Response Team Project State Expert Committee has been meeting and thinking about other reforms that we can make to Georgia's sexual assault policies. That committee includes members from the Prosecuting Attorney's Council, the Council of Superior Court Judges, Law Enforcement Agency, Statewide Sexual Assault Nurse Examiner, Assistant District Attorneys, and the Georgia Sexual Assault Initiative Project Coordinator. If you turn to page 13 of the bill, that's where this section starts. It was previously House Bill 1076, but that has been in Toto added into this legislation. The first thing that it does is back in 2004, the General Assembly required each judicial assault circuit to establish a sexual assault protocol to come up with policies and procedures for how sexual assault cases would be handled in each jurisdiction. What we have found is that many jurisdictions are not in compliance. The first thing is in Section 5-1 is to require compliance by having each judicial circuit and form the Governor-Lutente Governor's Speaker of the House and Chief Justice of any non-compliant jurisdictions. We hope that that will force each jurisdiction to actually adopt and implement a protocol. The next thing that it does that's significant is that this bill will implement for the state of Georgia a tracking system for every sexual assault kit, meaning that when a victim reports to either a sexual assault crisis center or to a hospital and evidence is taken and put into a kit, it will then be tracked from that point all the way through to prosecution, which I think is something that we need and it's something that we've been working on for a long time. In lines 448 and 449, you'll see that it allows victims of sexual assault to anonymously track or receive updates regarding the status of their sexual assault kits. The next major part of the bill is that in coordination with the FBI, they have a program called the Violent Criminal Apprehension Program, ViCap for Sure, and it is the most violent serial murderers and serial sexual offenders. I've worked with the FBI to craft language so that way we would have data shearing from our law enforcement officials with the FBI to try to use all cases. So that ViCap is also very significant in Section 5-5. And then finally, the last part of the bill is with respect to sexual abuse of patients by doctors. It is very, very rare, but it does happen and under this legislation it would force the board, the medical board, to take action. Right now they don't have to take action and in the past they would refer a doctor for counseling if a doctor is sexually assaulted a patient. So this magnifies and increases and I think improves the response that we'll have on that issue and it's supported by the Medical Association of Georgia and others. So I wanted to just walk you through those changes because I think that they are significant and worthy of favorable consideration. I'm happy to answer any questions on the sections that I discussed. There are no questions. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. There is a minority report. The chair recognizes minority leader Tramble to present the minority report. Thank you, Madame Speaker. And I want to make clear from the outset that I completely support the section of the bill that Representative Hulcombe just talked about and just described. But when we get to this portion of the session when it's late you get bills that are combined together. And so sometimes you have to take a choice between a bill that combines some really bad things with some good policy like Representative Hulcombe's policy that is incorporated in this bill. So my remarks are going to be very succinct on this. The heart of the issue that's the problem on this bill is line 64 to 66. And that is that we are creating a life sentence for a whole new section of crimes. It's two strikes and you get a life sentence. And not all of those crimes that are enumerated below are equal in nature and magnitude. And this is a step backwards. I mean, if we decide that any of these crimes need to be synced in a more harsh manner than we should deal with those crimes individually. But what we should not do is tack on at the end probation for life. Because probation may not sound bad. It's like, oh, it's just probation. But you are under the supervision and control of the state when you're on probation. And if you get a traffic ticket or you go and you commit another offense that's a misdemeanor in nature, you can have the balance of your probation revoked. So this is a life sentence bill. And if you're four life sentences, you can be in support of the bill. But if you want to take a step back and carefully consider, I ask that you do that before you vote upon this bill. Madam Speaker, at this time, I would yield the balance of the time for the minority report from the gentleman from Sandy Springs, Representative McClaren. Chair recognizes Representative McClaren for the remainder of the minority report time. Thank you, Madam Chair. I'll start very quickly with a story. Around 2008 or 2009, you'll have to affect me on this. I had a grad school project to come to the Georgia General Assembly from Athens and sit in on any committee in my choice and watch any bill of my choice and report back on what I saw. And I went to the Judiciary Non-Civil Committee, the committee that I sit on now. And I watched as we passed the SuperSpeeder Law. Y'all remember, we added 200 bucks to speeding fines, right? And after about 50 minutes of the sponsor's presentation, the question was, how did you pick 200 bucks as the fine amount? Well, an aid walked up and whispered in the representative's ear. And after considering, the representative said, a little bird just told me that that seemed like the fair and just amount. And then a judge spoke for about 10 minutes and tried to fit as much words into a speech as I normally do when I get up here. And she goes, you don't understand, this isn't going to change behavior. People are going to keep speeding. They're going to get caught. They're not going to be able to pay the fine. They're going to get trapped in the system. And the committee said, well, if you can't afford to speed, then why do you speed? She said, what do you think I tell the people who come into my courtroom? I got on the elevator with her on the way down. And she's just shaking her head, talking to somebody. She said, I did my best. I tried to tell them what would happen. But it didn't work. Now I don't have any data for you on super speed, but what I do know is this. We have a legacy of criminal justice reform in this state that I am proud of. As a Georgian, as a current member, the deal criminal justice reforms are one of, to me, the bright lights of governance in our state. And my commitment when I came in Randolph's office was, that was one of my number one priorities. I asked the speaker to be placed on judiciary and non-civil. He was gracious enough to put me there. Because that's the work that we need to be doing. But it's hard work. And one of the reasons it's hard work is because sometimes the people that you're advocating for, that you're talking about, are not the most popular people. I think that's the hardest part about our jobs is that when we're put to the test to ask the hard questions about what should happen to people who nobody is publicly going to stick up for. And in this case, you know, the play, Les Miserables, Jean-Valle Jean, right? Injective society, nobody wants to worry about what's going on with him because he committed a crime. So he's on the outside of what we consider to be the in-group in society. That's these folks. These folks are the ones who have committed some, in some cases, pretty heinous crimes. But like the leader just said to you, not every crime is created equal. And we can't just do something because it sounds right because the narrative's simplistic. Well, you know, they did a really bad thing, so lock them up for life and just throw them away. That can't be our attitude. Our job is the hard one. We have to be sensitive to what the crime deserves. Proportionality does the punishment fit the crime. And the story of this bill is that we were putting lifetime ankle monitors on people who committed some of these crimes. But the Supreme Court ruled that it violates the Fourth Amendment to the Constitution to put a lifetime ankle monitor on somebody if they're not subject to a valid sentence. So what did we do in our wisdom? Instead of saying, well, maybe we should rethink whether ankle monitoring is the best way to achieve our ends. You heard the gentleman representative Kennerd speak to other ways that we restrict the lives of people committed to these crimes. Instead of doing that, you know, we did. We flipped it the other way. We said, well, why don't we just make every sentence a life sentence? Then we won't have that Fourth Amendment problem. We can put an ankle monitor on anybody. That's what this bill does. That's the legacy that we're going to be moving in the direction of. Not the deal criminal justice reform legacy, which is less restriction, more thoughtful, more proportional evidence-based approaches. Instead we just put a list of crimes that now they get a life sentence because we had a logistical constitutional problem. Just a small constitutional problem with the way we wanted to do business. That's the card before the horse. I don't know how many metaphors for backwards I could use, but it's all up. What we're asking you to do today is to think about proportionality. We're asking you to think about the way that this process should be done. I have a greatest respect for the chairman of the judiciary and on civil committee, but I do not want to do policy where we say the result is going to be this and we're going to get there no matter what, even if it violates our sensibilities. I'll tell you one last thing about this that I think is telling about how this bill is put together. We said over and over again in committee, if you're going to extend the maximum sentence for these crimes, you've got to go into each code section. Every single one of them, you've got to open them up where they have maximum sentences. Some of these have maximum sentences, 10 years, 20 years, whatever. You've got to go into every single one of those code sections and say the maximum sentence is not 10 years. It's life for every single one of those sentences. You know what we did? None of that. We didn't go into each individual. There may actually be a logistical problem where courts don't even accept this because they say you didn't change the maximum sentences. This life probation language doesn't mean anything because you didn't go in and open up every maximum to make it life. And I think the reason we didn't do that is because we don't want to admit that that's the way we're trying to solve this problem. We don't want to be on record making every single one of these crimes a life sentence because it looks bad. And if your probation gets revoked, guess what? That's life in prison. 30 years before you get to apply for parole if the balance of your probation gets revoked. I just want us to think about what we're doing today. There's going to be a lot of green on that board, but it's not going to be up there without us at least having an opportunity to make us think about it. Thank you very much. You'll be well. The gentleman has yielded the well. For what purpose does Representative Sains rise? Parliamentary inquiry. State your inquiry. Isn't not true that I've twice heard a metaphor of a traffic ticket for a offenses that are listed within this bill, including aggravated assault, kidnapping, trafficking, and an individual for sexual servitude, rape, aggravated salto misstetritory rape, child molestation, aggravated child molestation, and ticing a child for indecent purposes all listed within the bill. And that this bill also provides what is already utilized as a split sentence to include the ability to put a life probation on the new environment we're created with after the Parkview State decision. Is that not true if the gentleman so states the chair recognizes chairman of stration to present during the chairman's time? Well, thank you, Madam Speaker. Ladies and gentlemen of the House know that we have many bills on the calendar today. So I'll just join jump right to the point here. A no vote on House Bill 720 will endanger the public in Georgia. Will endanger our children? Will endanger the citizens of the state? And a lot's been set up here which I'm afraid are unfortunately mischaracterizations of what brought this bill about and what this bill does. So let me attempt to correct the record here so that you can understand what's actually before you. In 2019 while we were in session the park versus the state case, an opinion in Georgia Supreme Court was rendered which said that sex offenders could no longer be held under certain sex offender conditions if it was beyond the term of their sentence. And as a result overnight, ankle monitors were cut off across the state of Georgia on sex offenders immediately when that opinion happened. And Georgians and law enforcement looked to us here at the state capital to address the issue. What do you do when the law only provides for a certain period of time for supervision but you are dealing with a dangerous individual who poses a risk to the citizens of this state if they are not under certain supervisory conditions? So we got to work immediately on it. And Representative Sains as a freshman legislator took on this very difficult issue and introduced House Bill 720. Now we didn't rush a bill through. It was late in session. We didn't rush a bill through. We didn't we studied it throughout the year and came back this session and Representative Sains did a great deal of work to refine the policy and bring to you much of what's before you here today. And that is this. In order for probation for life to be available, you must have committed your second what I would submit to you is an inherently dangerous felony. Okay, not within the legal statute but there's a list of dangerous sexual felonies for after a second conviction the court would give probation for life not a life sentence in prison as has been said from this well here today. That's incorrect. That's not what the bill says. And on top of it, as Representative Sains identified a moment ago, there is language in the bill which requires judicial review when a sentence is given under those circumstances at the 10 year point and then each every five years thereafter to make sure that a continuation on probation is appropriate. Now did a little birdie give us 10 years? No. The sex offender review board, Sorb testified in the committee in which I chair that that is the appropriate length of time in order to determine whether or not a person will be a danger to the public going forward. 10 years is a minimum that's necessary in order to make that determination. All right, I served on the Council on Criminal Justice Reform for over three years. All right, the cornerstone of criminal justice reform in this state was public safety. That's how I was able to come before you on so many bills, as you recall, in that area and promote good policy that was smart on crime in our state that really went after the underlying causes of criminal offenses. Not just simply having heightened sentences and throwing people in prison and saying, you know, we won't think about that. It was the exact opposite of that. It was, let's be smart about how we address criminal justice in our state. It's the morally right thing to do, oh, and by the way, it saves the taxpayers money. This bill is completely consistent with criminal justice reform. Because what are we doing? We are saying that for the most serious offenders where public safety is in jeopardy, we are going to allow oversight to ensure that the public is protected. But we are not going to have these excessive sentences or respectfully these other matters that Representative Kenner tried to bring up to confuse this issue. That's not what this is about. What this is about is protecting the public and there being supervision to see that through. Now the Sex Offender Review Board also testified in committee that they need additional information in order to make their reviews and make their assessments, to make the best possible recommendation to judges and for ultimate parole conditions and things like that. And that's also included in this bill. I haven't heard anybody speak about that today, but that's a critically important component. Don't we want the Sex Offender Review Board to have as much information as possible so they can determine what tier of threat level the Sex Offender is? When we have comprehensive legislation and important areas like that, it can be really easy to sit back and say, oh, I see life sentence written in here somewhere. I'm just going to reject it. I'm going to reject it and go campaign and say how I truly believe in criminal justice reform. But when we're governing and making decisions about what is actually in the best interest of Georgians in the state, what's going to keep them safe, what's going to keep their children safe, we have a responsibility to truly call the bill what it is. And that has a measured approach to ensure public safety to give judicial discretion where it's needed and to allow for adequate supervision of offenders who need it. I'll also just commend Representative Holcomb here for his outstanding work. We have had a very busy session and his legislation is included in this bill because it is so important, his bipartisan measure to allow for sexual assault kits to be tracked in the state of Georgia for doctors who are known to have committed sexual assaults on their patients to not be able to hold medical licenses in our state. All of this is included in this measure. And any member that puts up a red vote on this bill is voting against all of those important measures. There's no two ways about it. A yes vote is a strong message that we care about ensuring that law enforcement, the courts, sexual assault board and many other agencies do what needs to be done to protect Georgians. A red vote is a rejection of the underlying public safety concerns that brought this bill about. And I'll leave the choice to you. Thank you Madam Speaker. The gentleman has yielded the well for what purpose does Representative Clark rise? She waves for what purpose does Representative Park rise? Parliamentary inquiry. Stature inquiry. Isn't that true that Georgia is the number one state for having the most people on probation and spend about $40 million a year on private probation? As the gentleman so states, for what purpose does Chairman Petri rise? Parliamentary inquiry. States inquiry. Madam Speaker, isn't that true that according to the Bureau of Justice Statistics and a study that was done in 2005, release sex offenders made up only 5% of the population released from prison in this country, yet accounted for 16% of the arrests for sexual assault or rape in the 9 years following. Is that not true? As the gentleman so states, is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee has agreed to. Now this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so, the clerk will lock the machine on the passage of the bill, the yeas were 98, the nays were 63, the bill having received the requisite constitutional majority is therefore passed. Clerk agreed the caption to House Bill 1039. House Bill 1039. House Bill 1039, I represent Watson, 170 second and others to be entitled to amend chapter 12, the total 13, the fiscal to Georgia and the state are relating automatic renewal provisions.\n\nSo, to provide additional protections for consumers who enter into service contracts. This bill will have an refer to the Committee on Agriculture and Consumer Affairs. That committee recommends that this bill do pass. Chair recognizes Chairman Watson to present the bill. Thank you, Madam Speaker. Members, I bring before you today HB 1039. This is dealing with contracts that automatically renew more than 12 months. And it's mainly service contracts. And all we're saying is if you're going to renew that contract for more than 12 months, automatically you need to get permission from the consumer to verify that they do want to renew that contract for multiple years. And that's what the bill will do. It's a good bill. It will probably have lots of ripple effects across our state. I'll be glad to hear for any questions. There are no questions. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is not in the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes? All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 163. The nays were one. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House bill 993. House bill 993. House bill 993. By the remission of Dempsey, the 13th, be title of an act to amend. Chapter 10, the title 31 of the official go to Georgia. Annotated relating to vital records. So, it's a provide for vital records reports and data from state registrar relating the child abuse reports. This bill I refer to the committee on juvenile justice. That committee recommends a dis bill. Do pass. Chair recognizes Chairman Dempsey to present the bill. Thank you, Madam Speaker. Members, House bill 993 comes at the request of the division of family and children's services to allow access to vital records, reports, and data in a timely fashion so that the division of family and children's services of the Department of Human Services can act upon those. They need the report of abuse or neglect concerning a child or his or her parents or siblings quickly and immediately and all of the cases regarding foster care and our children's safety. This will require an agreement with the Department of Public Health and the division to make sure that this is carried forth. The Department of Public Health has cleared the language and fully supports this measure. If there are any questions, I will take them. If not, I will yield the well and ask for your favorable support. There are no questions. Thank you, Madam Speaker. I yield the well. The lady has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. Have all members voted? Have all members voted if so, the clerk will lock the machine. On the passage of the bill, the A's were 166. The A's were 1, I'm sorry, 0. The bill having received the requisite constitutional majority is therefore passed. I know there ever was 0. Clerk will read the caption House bill 1015. House bill 1015. House bill 1015 by resident of Weedau, 119th, to be entitled to amend Article 5, Chapter 6, Title 12 of the fiscal to Georgia, and Tate overling the Georgia carbon sequestrian registry. So it's to provide for the inclusion of building products and construction on the registry. This bill I'm referring to committee on natural resources and environment that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Weedau are to present the bill. Thank you, Madam Speaker. How can I bring you House bill 1015? Nature is the living visible garment of God. And this invent innovative measure will have Georgia leading the way on developing a voluntary market driven solution in addressing carbon offset and sequestration. This measure will expand Georgia's carbon registry to include an array of sustainable building products which will be verified and validated. The rigor of this process will have Georgia producing carbon credits and offsets who value will further incentivize innovation throughout our state. As the number one state for forestry in the union, this is not just a win for Georgia grown products, but for all the Georgia businesses who choose to use the materials that increase carbon sequestration and deconstruction. Now I'm excited to bring this legislation as it utilizes a private market solution that puts the state of Georgia at the forefront of this issue. I ask for your favorable consideration of this measure. Madam Speaker, I'll yield for any questions that there are any. You do have questions. The chair recognizes Chairman Watson for a question. Thank you, Madam Speaker. It is gentleman yield. I do. Could you tell me how your bill relates to natural super naturalism? No response required. The chair recognizes representative Clark for a question to your left. Does it, gentlemen, yield? I do. Can you just give us an example of these carbon sequestration building materials that we are adding to the code? Certainly, it could be anything from mass timber to CO2 and fuse concrete. Thank you. Thank you. Madam Chair, I'll yield the will. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The A's were 156. The A's were 10. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1017. House Bill 1017. House Bill 1017, members of the LaRiccia, the 169th to be entitled to an act to amend code section 459, 85. The fiscal code of Georgia amputated, relating the payment of indemnification for death of disability. This bill I will refer to the committee on public safety and homeland security. That committee recommends the disbilled do pass. Chair recognizes floor leader LaRiccia to present the bill. Thank you, Madam Speaker. This comes from the Georgia Indimification Commission. The governor is the chairman of that commission. And what this does is clarifies and revises the indemnification payments for those that are killed in the line of duty, law enforcement, prison guards, highway workers. This just makes sure that the indemnification benefit payments go to the proper family members once they apply for them after the death of someone in the line of duty. Madam Chair, that's what the bill does. I'd be glad to take any questions. There are questions. The chair recognizes representative Wolensky for a question. Thank you. Does the representative view? I do. Thank you so much for this great bill. Just a quick question. For section B, how come it's to the legal guardian and not and or the spouse? Was that something that was considered? It says there on line 15 that they're surviving unmarried spouse. Unream married spouse, I'm sorry. Yeah, all right. Still be unmarried. Chair recognizes representative Ridley for a question. Reluctantly? Yes, ma'am. My friend in the well in the well yield. Get a little bit closer to the microphone. Yes, sir. All right. I appreciate you bringing this bill. It's a good bill. I just got a question. Is this your first bill? No, sir. No, sir. It hasn't been up here all year. It is my first one this year. All right. Thank you. Yes, sir. And finally, the chair recognizes representative Hansen for a question to your left. Thank you. Will the gentleman yield? Yes, ma'am. Thanks. Are we saying that the spouse, the surviving spouse must remain unmarried? No, ma'am. But the intention of an indemnification benefit is to replace the income earner for that unremarried spouse or that widow or widower. And so that you've got two years to apply for this after the time of death. If for whatever reason they had already been separated, divorced whatever, and they remarried before that time of death or whatever, it just makes sure that that benefit would have went to that person had they not been remarried. And so it just clarifies that. And that's part of what they intended to do with this bill. Thank you. Yes, ma'am. Madam Chair, I'm going to yield the will and ask for your favorable consideration. Thank you so much. The gentleman has yielded the will. Is there any objection to the previous question being ordered? The Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Will vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 163. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to HR 1163, HR 1163. House resolution 1163, by Representative Gamble of the 15th. Recognizing Georgia Supreme Court Justice Robert Benjamin, dedicating a bridge in his honor. This resolution was assigned to the committee on transportation. That could be recommended that this resolution be adopted by committee substitute. The Chair recognizes Representative Gamble to present the bill. Thank you, Madame Speaker. Members of the House, you have before you, HR 1163, which is our annual road naming bill. And for the sake of time, I'm not going to go through each individual road naming part. But I want you all to know that they've met the requirements as prescribed by our transportation committee to be approved by us at this time. And I would be happy to answer any questions about any of the road namings that we have in this legislation. There are no questions. I yield the well. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The Chair here is none. The report of the committee is agreed to. Shall this resolution be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no. And the clerk will unlock the machine. The Clerk will be elected. Have all members voted? Have all members voted. If so, the clerk will lock the machine on the adoption of the resolution. The A's were 166. The Nays were zero. The resolution have received the requisite constitutional majority is therefore adopted. The clerk will read the caption to HR 1300, HR 1300. House resolution 1300 by Representative Perkwood, 155th authorizing the change of the use of certain property located in Glinn County, currently dedicated as a heritage preserve, this bill evidence, this resolution evidence, assigned to the committee on state properties. The committee recommends that this resolution be adopted. The Chair recognizes Chairman Perkall to present the resolution. Speaker. Thank you, Madam Speaker. HR 1300 was not part of the annual state properties easement since conveyance bill because it involves a heritage preserve property. This case, we must first change the destination from heritage to non-heritage and then convey it to GDOT from DNR. The first of these involves a road widening and roundabout in Glinn County. It sits on a tight curve. The second is a bridge in Murray County that needs replacing. The easement there is .194 acres and the other is about six acres. DNR states that both projects change of use is, I quote, imperative and unavoidable necessity for public safety for which no other solution exists. I ask for you to vote for this. There are no questions. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is not in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The Chair here is not in the report of the committee is agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine. On the adoption of the resolution, the A's were 164. The Nays were one. The resolution having received the requisite constitutional majority is therefore passed. The House will be at ease until 415.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you uh objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is done. The report of the committee is agreed to shall this bill now pass all those in favor of the passage of House bill 848 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House bill 848. The eyes are 167. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Resolution 1216. House Resolution 1216 by Representative Gilear to the 160 second. Recognizing Miss Betty and Petro Rapé and rededicating a road on Georgia Ports Authority property in her honor. This resolution have been assigned to the committee on transportation. That committee recommends that this resolution be adopted. Chair recognizes Representative Gilear to present the resolution. Thank you, Mr. Speaker and members of this distinguished body. I bring to you House Resolution 1216. It is a resolution requested from Georgia Ports Authority on a great individual who worked for Georgia Ports for 53 years. This is a part of Georgia Ports' property as a road asking to be dedicated in her honor. Yeal the well or take any questions, Mr. Speaker. You have no questions. Thank you. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The Chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the adoption of House Resolution 1216, the rise of 169, the nasor zero, this resolution having received the requisite constitutional majority is therefore adopted. If I could have your attention please. After a number of discussions today we have now reached an agreement with the Senate. I think it takes care of many of the things that we have talked about today in terms of how we deal with where we are now in this state with regard to the coronavirus situation. So I want to kind of go through this one step at a time with you. We will be in session today as we normally would be on cross over day. Which means it could be a late night. It could not be a late night. But this will be a we will finish our work here today. We will have session day 29 tomorrow. But I'm not going to say I'm not even going to discourage people from coming to the gallery after some of the ways I was misinterpreted earlier in the week. But I'm going to encourage members to go home tonight or in the morning. The only thing that we will do tomorrow and I only need one member here for that is to do first readers of the Senate bills that they're passing today. We'll get those in committee. Then we will be suspended. We will be suspended. Which means that this this thing's going to end sometime soon. Don't you all agree with me? Amen. And when it does we're coming back and we're going to be back ready to go on day 30. But we will not be starting over at the beginning of the session. Because we will be suspended and not adjourned until further notice. And that notice will come upon the call. That will be issued jointly by the lieutenant governor and myself. So I'm going to again reiterate normal business tonight. But go home early in the morning and be with your family. And then we will get through quickly here with first readers tomorrow and then that's what I'm going to do. So House offices will be put on a telework basis beginning tomorrow to further notice. And that's all employees of the house will be teleworking until further notice issued by our office and the Senate will do the same through the lieutenant governor's office. So that's kind of where we are. Our hope and prayer is that we are over reacting. But I'd rather do it this way than to under react. And so that's why we're doing it this way. We will not be here for a few days and hopefully it won't be long. The governor had a press conference that chairman Cooper was at. And I think some others at three o'clock and he's taken a little bit more of an aggressive position on this problem. He's going to allow local school systems to make their own determination about whether they go to school. And we're not closing down state government but we're going to be teleworking all across state government. And I join him in encouraging all of us and all Georgians. In fact, we have a particular obligation. I think during this time to take care of our grandparents and the older members of our family because they are clearly the most vulnerable. So we're going to become and get through our business. And then we will entertain a motion to suspend later in the evening. And we will suspend until we get the all clear and we'll be back to do the people's business on day 30. So with that we'll go back to work. Clerk will read the caption to House Bill 1037. Councilor Tenth, 37, I represent a dollar of the 45th to be entitled an act to amend Code Section 487, 40.26. The official go to Georgia annotated relating the Georgia entertainment industry investment act. This bill ever referred to the committee on ways and means. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman dollar to present the bill. Thank you Speaker. On a far less serious note, I bring HB 1037, which is the update to the film tax credit. This bill is, I think, can be viewed as largely. This is a process improvement bill. It does a number of things. It's a fairly complicated measure. I'll try to get through it as we do have a large number of bills on the calendar. I'll go over the major points and try to explain those and then go through some of the individual things that the bill does. First and foremost, it calls for mandatory audits of all productions. It strengthens the process for how these audits are conducted and what are what qualified expenditures are and how they are submitted. It authorizes DOR to set up a third party independent auditor list and establish a credentialing program for those that want to be on the list. Auditors seeking to be included must follow a list of procedures in order to qualify and in order to stay on the list. So DOR will also set up a process for removing auditors. It's worth noting that currently all productions that are audited and that's an only percentage choose because right now it's mandatory, only a percentage choose to. The majority of dollars that go out are audited but all of those audits are conducted out in California. One of the things that this bill does is it says that any auditor that wants to be on that included in this list, they must be licensed in Georgia. So when we passed this, the idea was this was supposed to grow jobs in Georgia and I think that this is a natural expansion of that effort. Because of the sweeping change, there is a three-year phase in. This is to give DOR time to implement and for the number of CPAs and firms that can do this for that industry to ramp up. That industry needs time to grow in this area just has the rest of the sectors in this industry have. And it's also worth noting that DOR will be reimbursed for all audits or portions of the audits conducted and so that there will be no further expense to the taxpayer. This changes the process that GDEC and DOR award the credits, both the 20% and the 10% promotional uplift. Currently GDEC certifies a project at 20 and the 10% at the same time and this can be done up to 90 days before principal photography starts up until the end of the production. It certifies them and sends a letter to DOR letting them know that it's a certified production. What this does is this changes that process to a two-level certification process. A production is certified as a qualified production by GDEC. That doesn't change. What changes is that upon completion of the production, that production submits to DOR for an audit and upon completion of the audit the credits are issued then by DOR and that's done in the form that's when the 20% is issued. The 10% promotional uplift compliance is certified by GDEC and then GDEC notifies DOR the credits are then issued to the production and that does not take place until that advertisement that promotion has been realized, meaning that once the production is done and it's been distributed then it gets certified for that 10% credit. This process helps to ensure compliance of all productions and expenditures and remove possible clouds on credits and this is to the benefit of both the taxpayers and the productions. This bill changes the carry forward of the credit. It moves it from five years to three years. There are really two main reasons for this. I'm happy to go into those if anybody has a question but again I'm trying to be respectful of the time. This bill removes the clawback provision that\n\nin the current language and that provision, it only applies to productions that do not go through the voluntary audit. So since we were going from a voluntary audit system towards a mandatory audit system, I think it logically followed that we would remove that clawback language. And additional changes are in the bill we define what a presentation is. This industry has changed a lot since we did it first in05 and then when we really passed, I guess the credit that has brought success to the state in08. The industry has changed, technologies change, the industry in Georgia has significantly changed. And this is one of the areas that needs some addressing. It defines a presentation and removes eligibility for the 10% uplift for them. Again, I can go into what a presentation is if there's a question. The bill moves sound recordings from a qualified production to a qualified expenditure, the way it's currently written in the film language. It makes it seem as though sound recordings are standalone, certify a project and it was kind of like shoehorned in there. This does not affect, I do want to point out this does not affect the Georgia Music Investment Act, which is in different code. This bill addresses post-production and clarifies what qualified post-production, aquatic expenditures are. And lastly, for larger audits, DOR and what will be the third party auditors, they will perform what is called sampling and there's different methods that audits can be sampled. And that's where they get a list of all the expenditures and the auditor or DOR will request certain ones. And based on that audit, any expenditures that are found to be ineligible will then be projected across the population of the audit. And this is a very good deterrent for submitting what might be considered suspect expenditures. Mr. Speaker, that is the bill on happy to take any questions. You have a couple of questions if you yield. I will yield. Chair recognizes representative Al Williams to your left for a question. Thank you, Mr. Chairman, with the gentleman yield happily. Is it not true I support this bill because of what the FIM industry has done for Georgia and this is prudent legislation to improve our position. But what is really done can't even be counted in dollars and cents because of the notoriety it has given us throughout the world. Is that not true? I think the gentleman is spot on. There are definable numbers that we can look at to where this has been its success. The exposure and the impact it has had on the lives of Georgians I think is it is in measurable. Thank you for the question. Do you further yield? I do. Chair recognizes representative Williamson to your right for a question. Thank you, Mr. Speaker. This is the gentleman yield. Yes, sir. Contrary to an email many of us received earlier this morning. Is it not true that Americans for prosperity do support this measure and this bill does not expand any of the current underlying programs under the FIM tax credit program? Thank you for the question. That is true. This bill was vetted through the House Entertainment Creative Arts and Entertainment Working Group. It was also then vetted through the House Boys and Means Committee and through rules. And that issue never was brought up. This has been a very well crafted and vetted bill I believe. Thank you. Do you further yield? I will. Chair recognizes representative Chairman Lynn Smith to your right for a question. Is gentleman yield? Yes, ma'am. Is it not true that your committee and under your leadership several meetings and times have spent in trying to craft a bill that reflects our gratitude and our pride in the fact that we're one of the states for this whole film industry. Is that not true? We wanted to get this right and not mess up the success that we've had. Georgia is the envy of the country in this and in many ways in this global industry we are. We have in many ways set the bar globally. This man. Where are the yields? Yes, ma'am. Also is it not true that the emphasis was on good stewardship with the credits that we were giving out and I thank you for that as well. Thank you. I think it was universally agreed upon that we needed to be good stewards of the public money. Yes, ma'am. Do you further yield? I'll yield for one more speaker. I recognize this chairman Martin to your right for a question. To your right. Chairman, do you yield? Yes. I know you mentioned the auditors are going to be certified by DOR in Georgia. Previously isn't true that the Department of Revenue hired and paid for the auditors out in California. They worked for our Department of Revenue and reported them. My question, I know we had talked about it. I can't find it. The line numbers are a bit different than the last version of the bill I saw. Can you clarify for me to whom the auditors are responsible for whether they're doing the audit if in fact they're being paid for by the film company? The question is this. I am, is it not true that I'm concerned with the film company could hire them through an attorney and some of the information in the audit could be protected by attorney, privilege and work product in our Department of Revenue might not be able to see it all. Do you feel comfortable that that is taking care of in the bill with the revenue being able to propagate rules and regulations? Thank you for taking the question. Yes, and I discuss that with DOR and it's a very simple answer. If they want to go through an attorney and try to hide that from DOR then DOR does not certify it and they don't issue those credits because DOR has a last word. They will have the last viewing of all audits. They will be able to audit every single audit. They will be doing all the above the line auditing. If that scenario presents itself then they won't certify the credits. Thank you, Speaker. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is not. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is not in the report of the committee. Is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 1037 will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Carson rise? Mr. Speaker, pursuant to rule 133, I ask to be excused from this vote. Gentlemen has that right and the journal will so reflect what purpose does representative Holland rise? Mr. Speaker, pursuant to rule 133, I ask to be excused from this vote. The committee has that right and the journal will reflect that. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 1037, the eyes are 156, the nays are 10. House Bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 881. House Bill 881 by rep. A couple of the 43rd and others to be entitled to amend Title 19, if it's going to Georgia and it's relating to domestic relations, so is the revised provisions relating to safe places for newborns. Mr. Bill, I'm referred to the committee on Health and Human Services. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House today, I bring you the following substitute to House Bill 881. Over the past several years, we've passed two or three bills. One to provide a safe place for those that women who under great dress and I'm sure personal agony feel like they have to give up a newborn could do so safely. The first bill we passed, they had to give their names and their addresses when they came forth. Then we found that people didn't want to do that, often not wanting to give their names. And so we went back and revised the bill and said, okay, you don't have to give your name, but you have to come in person and give up that baby. Unfortunately, we still have mothers that don't want to do that. They don't want for anybody to know who they are. They want to give up that baby and totally without anyone knowing. And unfortunately, we've had two instances this year, one where they left a baby in the woods to die and one on the side of the road. So there was a group that came to me and they produced what they call Hope Boxes. And this is where if a hospital or a fire station where there's 24 hours a day, somebody is in that building and ready to look after a newborn, qualified to do it, that they would put a sort of like a mini incubator where you could open it from the outside, put the baby in, it would lock, an alarm would go off and it could be open from the inside. And no one would know who put the baby in the Hope Box. Well as we begin to study this, I decided that it really needed very careful scrutiny about what those boxes were like. Exactly what the specifications were, who could put them in, all of those ramifications. So this bill sets up a group to study that. It's made up of the commissioners of Public Health Human Services, the director of the Division of Family and Children Services and the Department of Human Services. So that they can come back by December 30th this year and make a recommendation on all of the questions we ask in this bill to us and that if we want to go forward in the next legislative session and approve that such boxes could be put in. They would be put in with private donations, nothing with state money. It would just be one more avenue to give mothers that feel like they have to abandon their child, a safe place to put that child. And Mr. Speaker, if there are no questions, I will ask for the, this body's approval of the substitute to House Bill 81 and I will yield the well. You had no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machine. On the passage of House Bill 881, the eyes are 168th and the knees are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 719. House Bill 719 by Representative Silcox, the 52nd, to be titled an act to amend Title 16 in the fiscal to Georgia and Tate who are relating to crimes and offenses, still to provide for the modernization of HIV related laws to align with science to ensure that laws and policies support current understanding of best public health practices. This bill then refer to the committee on Health and Human Services. That committee recommends that this bill do pass by committee substitute. As is Chairman Silcox to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I've ranked to this afternoon House Bill 719. House Bill 719 modernizes our HIV related laws to align them with current science. Specifically, House Bill 719 does three things. Number one, it redefines the term HIV test and a person living with HIV. Number two, it lowers the maximum penalty for someone living with HIV who knowingly engages in a sexual act with another without disclosing their medical condition from a felony punishable up to 10 years to only five years of imprisonment. And finally, it removes a hyperdermin needle or syringe from several sections of the criminal code so that we can promote clean needle exchange in our harm reduction programs. It is my sincere hope that this bill will help reduce the number of new cases of HIV in Georgia. And then one day soon we can eliminate HIV in Georgia and in our country. With that, I will be glad to take any questions, Mr. Speaker. Do you yield for questions? Yes, sir. Chair recognizes representative Cannon to your left for a question. Thank you, Mr. Speaker. Do you yield? Yes. Just a question around how this guidance has been formed. Is it true that the Department of Justice as well as the CDC have recommended criminal justice reform in this way? The lady knows I'm sure what she speaks. If you're thinking of further questions, I'd be glad to yield. If not, I'll yield the well then. Appreciate your favorable consideration. Ladies, yielded the well. Chair recognizes representative Park to speak to the bill. Thank you, Mr. Speaker. I rise in support of House Bill 719 and to encourage each member of this body to vote yes. I'd like to begin by thanking the author of the bill, Chairman Silcox and Chairman Cooper for their hard work. I'd like to thank my colleagues, Republican and Democratic leaders who helped move this bill forward. And most importantly, I'd like to thank those living with HIV, advocates and organizations who support this bill and are committed to doing all they can to end the HIV epidemic. Together, their courage and our fearless desire to do good will help move our state in the right direction to end an epidemic that has taken more than 700,000 American lives. As Chairman Silcox noted, HB719 updates our laws to reflect best public health practices for preventing and treating HIV, which will help save tens of thousands of lives in Georgia. This is a nationwide effort. House Bill 719 follows recommendations from the CDC and the U.S. Department of Justice as my colleague, Park Cana noted. It will also help us achieve the president's goal to end the HIV epidemic in the United States within 10 years. Thanks to advances in medicine, we can stop the transmission of HIV today. According to the CDC, preventative measures and self and safe practices can reduce the risk of transmission by 99.2%. Today, Georgians living with HIV are able to live full, meaningful lives. Recent studies show that with medication, a 20-year-old living with HIV in the United States has approximately the same life expectancy as a 20-year-old who is HIV negative. It is time to end the fear and stigma. Too many Georgians do not get tested because they are still scared. It is time we do our part to help our fellow Georgians get the testing, prevention and treatment they need. As leaders in this state, we have an opportunity to come together and take a step toward ending an epidemic. As we face a new pandemic, it is my sincere hope that we will continue to stand united to protect the lives of Georgians. By working together, we will improve the health and safety of those we serve. I urge each and every one of you to vote yes, vote yes to help end an epidemic, vote yes to help save lives, and vote yes because it is the right thing to do. Mr. Speaker, I will yield for any questions and if there are none, I yield the well. You have a question if you care to yield. Yes, sir. Chair recognizes Representative Morris to your left for a question. Does he, gentlemen, yield? Yes, sir. One of the finest young men that ever worked for me was infected with AIDS by someone that knew he had the disease. So my question is this. How is it by reducing penalties that we are actually going to reduce the spread of this disease? Because this young man, incredible young man, if you ever met him, just one of the finest people I have ever known. Life was changed forever because someone intentionally infected him with this disease. So the bill does nothing to change current law which makes it a felony to intentionally transmit HIV to cause harm. That said, these criminalization laws do make it harder for people to get tested, which scares people from preventative measures that could help end the epidemic once and for all. Moreover, if I may, those who are currently living with HIV, who are on medication can no longer or if they are virally suppressed, cannot transmit HIV. And so this is an epidemic in which we have the capacity to bring to an end by encouraging people to get tested and by encouraging people to stay on their medications. Does the gentleman further yield? I'm sorry. Does the gentleman further yield? I'll yield for one more question. So if we look at line item 38, beginning at 38, it indicates that we're still talking about intentional spread here on this. Is that correct? And it looks like we're reducing the penalties for that intentional infection. This is this bill keeps the penalty for an intentional spread as a felony. I will yield the well. Thank you, Mr. Speaker. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is none. The committee substitute is withdrawn. Is there any objection to adopting? The substitute offered by the committee on rules. The chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 719? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 719. The eyes are 124. The nays are 40. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1098. House Bill 1098, our resident of Carper, the fourth of being titled, NAC2, amen. Title 32 of the official go to Georgia Annotated relating to highways. Bridges and Ferry chose to provide for development of a statewide strategic transportation plan. The committee recommends a dispel do pass. Chair recognizes representative Carvinder to present the bill. Thank you, Speaker. This is a real simple bill. It's brought to you for the department. It basically is about efficient government. It streamlines and synchronizes the statewide plan with the federal plan. Instead of doing two plans, we'll just do one and they'll match up. I appreciate your favorable consideration and this is not about short term rentals. And I yield the well. You have no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1098. The eyes are 167. The nasor zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1057. House Bill 1057 by Representative Rhodes, the 120th to be entitled an act to amend Article 3H, Chapter 12, the title 2 of the fiscal to Georgia Antietta relating to soil amendments. So it's authorized further regulation of soil amendments. This bill emits further committee on natural resources and environment. And then transferred to agriculture and consumer affairs. That committee recommends that this bill do pass. Chair recognizes Chairman Rhodes to present the bill. Thank you, Mr. Speaker. Industrial byproducts. Industrial byproduct waste. That is being spread as soil amendments and fertilizer. We've got to have a place to put this stuff. But what we need to do is protect our neighbors. If you have not had the privilege of smelling this concoction, you can come down and visit myself. And Tom McCall, a few of the others, basically all this bill does is it says that you can't put domestic sceptage in this concoction. And if you do, there are stiff penalties that will meet you along the way. The other thing it does is they are going to start paying tonnage fees for the commissioner to hire an agronomist so we can have someone to monitor these situations. And none of the companies have complained about that one bit. The last part of the bill gives our locals at home a little bit of ammunition to protect the neighbors. Basically they can go in with an ordinance or set back or buffers and they can kind of say that you can't just put this right on top of a church or school or neighbor or whatnot. So Mr. Speaker, that's the bill and I'll answer any questions. You have a question if you care to yield. Yes, sir. I'm scared. Chair recognizes representative Jasmine Clark to your left for a question. Does the gentleman yield? Yes, ma'am. Just so I can make sure that I understand, can you define domestic sceptage? It is cesspools and a whole lot of other things that do not smell very good. And does the gentleman for the yield? Yes, ma'am. And so this domestic sceptage is being put into fertilizers that can you just kind of explain? Yes, ma'am. It has been done and we're trying to stop that. Thank you. Yes, ma'am. I yield the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is...\n\nis agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1057 the eyes are 164 the nasa tune this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1073. House Bill 1073 by the motion of the Watson 170 second being taught on act to amend chapter 62 it's title 3060 fiscal to Georgia and Tated relating the developmental authorities so to provide for the creation of regional developmental authorities this bill ever referred to committee on governmental affairs that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Sam Watson to present the bill. Thank you Mr. Speaker. Members of the House I'm reading before you today HB 1079 this is creating regional development authorities this is an initiative and created out of the rural development council and it was actually an idea that was actually started by chairman Jay Powell to bring counties together in three to five and number allow for the lowest tier and allow for some one Georgia grant money for medical facilities within within that park and it's a good piece of legislation to try to grow jobs in rural Georgia and we glad to take any questions. You have some questions if you care to yield. Chair recognizes representative meeks to your right for a question. Thank you Mr. Speaker. Is it in them in you? Yes. I just wanted to double check is it impact any current regional commissions that are that have already been set up with multi counties? It does not impact any joint authorities that are already in action or in motion or doing their thing this will be in addition we're just wanting to put a structure in place. Currently a lot of counties can do the joint and we have joints around and some of them have profit sharing some of them don't this will kind of put a structure in place to allow for the revenue sharing to allow for the lowest tier and just put something in place to to get them to join together. Thanks sir. I'm just figure if there are no other questions I'll yield the well. Gentlemen as yielded the well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed the vote no and the clerk will unlock the machine what purpose does representative Stovall rise parliamentary procedure inquiry. What's not true I was going to ask the gentleman was this similar to the Atlanta Regional Commission on how it's established. He might do a delivery back there and answer your question. Thank you. All those in favor are voting aye those opposed are voting no have all members voted have all members voted if so the clerk will lock the machines on the passage of House bill 1073 the eyes are 155 the nays are 11 this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House bill 1122 House bill 1122 by Mr. Watson the 170 second to be titled act to amend Article 2 of Chapter 8 of Title 50 to fiscal George annotated relating to regional commissions so as devised provisions regarding the appointment of non-public members this bill and refer to the committee on governmental fairs that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Watson to present the bill. Thank you Mr. Speaker I do bring before you today HB 1122 and this may clear some of some of that last question this is dealing with regional commissions the previous bill was dealing with the creating regional economic development parts this is re-arranging current makeup of the regional commissions everyone has one of those in their in their part of the state they have very large boards some is as high as 60 and so what we're trying to do is maybe get the board get the boards to a smaller number where there's a lot more interaction among those councils so that they can do better work they're already doing a lot of great things so all we're doing is we're just doing away with some appointments that either don't ever get appointed or they're really late and so we're reducing through that number and then we're also creating an executive council that is elected by the larger council to help do the day-to-day the budget the detailed work of the regional commissions and this is also another initiative of the of the roll development council having glad to take any questions you do not have any questions thank you Mr. Speaker appreciate there is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machine on the passage of house bill 1122 the eyes are 168 the nasor one this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 1045 House bill 1045 I represent Hogan of the 179 to be entitled to amend code section 38 8 8.3 the fiscal to Georgia annotated relating the funding of services or the reduction of bad valorum taxes this bill ever further committee on governmental affairs that committee recommends that this bill do pass by committee substitute I have not asked this question this session but I have a feeling on this one that maybe it involves the creation of a city you're sure representative Kelly and representative William say they've read the bill and they're concerned too chair recognizes chairman Hogan to present the bill thank you mr. speaker members of the house I bring before you today house bill 1045 this is a tax revenue from insurance premiums has restricted the use in unencorporated areas these uses at this time or for fire police protection garbage protection and streets house bill 1045 would simply add flood risk reduction to this list that the counties could be using this these taxes for it also allows them to use 25% of this tax money to apply for grants with FEMA which would in short a larger 25% match means larger grant awards to Georgia communities and basically that's what the bill does and I'd be glad to answer any questions well you have a question chair recognizes representative owl Williams to your left for a question other gentleman you yes I do is it not true that this bill and I don't only greatly help the people in coastal Georgia certainly the people in the Cincinnati area but also the people in the much prettier area north in the Liberty County and for your information I did get flooded very badly with Irma don't say assignments but this applies to all counties in the state and it gives flexibility the county commissioners to use this money for flood reduction in the communities across the state no further questions thank you and I will yield well and ask for your favorable consideration is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machines on the passage of house bill 1045 the eyes are 168th and nasa 1 this bill having received the requisite constitutional majority is therefore passed chair wants to recognize on the floor of the house a former member of this body former state representative Tom Taylor clerk will read the caption to house bill 1032 house bill 1032 by rubs and have hatched to the 150th to be entitled and act to amend code section 317-3 the fiscal to Georgia annotated relating requirements for permits to operate certain healthcare related institutions this bill having been referred to the special committee on quality health care that committee recommends that this bill do pass by committee substitute chair recognizes chairman hatchet to present the bill thank you mr. speaker colleagues this bill does three things two of them will help increase access to mental health hospital beds in rural Georgia counties less than 50,000 to be a little more specific the first section will allow and incentivize joint ventures between these rural hospitals and institutes for mental disease which are private hospitals that provide mental health services section two I was section one a will allow a hospital in rural Georgia to swap over acute care beds to mental health beds by going through the CON process so making sure they have all the meet all the regulatory requirements that it gives them one step up that they do not have to prove the need for mental health in their area because we all know there's a true need for more access to low to to mental health beds for people low cost low income individuals section two corrects a problem that's taking place now because of a guideline change a national guideline change we allow ambulatory some ambulatory surgery centers to exist without operating rooms they are they are they have to apply they don't they don't have any they do not have to go through the full CON process because they're they don't qualify as a as a facility that actually does procedures in a sterile environment that's what this bill does and mr. speaker if there any questions I will take them if not I'll yield the will you have a question if you care to yield yes sir chair recognizes representative gardener to your left for a question thank you very much mr. speaker thank you very much for this bill um line 45 the question I have is does it in fact change the certificate of need law significantly and does that change only apply to rural hospitals the change only applies to rural hospitals and it if you look at line 51 it'll say that the only thing that they don't that doesn't have to be considered in the CON process is subsection a a paragraph two which only addresses having to prove that there's a need for the mental health service so am am I correct that some of the psychiatric hospitals even in the Atlanta area will then be able to partner with rural hospitals to provide psychiatric beds yes thank you you have another question if you care to yield I will yield for one more chair recognizes chairman Beverly the year left for a question does gentleman yield yes sir in section two of the bill it says that ambulatory surgical centers do not require certificate of need even if it does not have an operating room is that is that correct so ambulatory surgery center will not need a certificate of need is that no they would still need a certificate of need these particular institutions that already exist in our state there's about 50 of them because of guidelines within the CON process architectural guidelines is the hold up they already exist and they've been through the process and it's it's real technical but I mean they they still have to go through the process to get the to make sure they meet the regulations and have all the expertise they need but they don't have to have an operating room and and and the a it this says that they don't because in the past they have not had to have an operating room but these this will make sure that they don't need 50 that are here still can still exist you have one more question if you care to yield mr. speaker I'm going to yield the well and ask for your favoral consideration you better take a friendly question from her chair recognizes chairman house ten for a question is it is it not true that in rural areas we have many hospitals with empty hops fiddled beds but maybe the person that lives in that area does it really need mental health but we have overcrowdedness in other areas that need mental health and they could use this bed and that's when you talk about proven whether need is the seal in says they have to need it in that area that we have a shortage of mental health beds all over this state madam chair thank you for that question I can agree with it more thank you is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines have all members voted if so the clerk will lock the machines on the passage of House bill 1032 the eyes are 124 the the nays are 41 this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to House bill 1020 House bill 1020 by remnant of gravity the 67th being titled back to amend chapter 5 of a title 40 the fiscal to Georgia and Tate relating the drivers licenses system revised for license suspension for conviction of drug related offenses this bill I'm referred to the committee on motor vehicles that committee recommends that this bill do pass by committee substitute chair recognizes vast chairman gravely to present the bill thank you mr speaker members of the house I bring to you today house bill 1020 for your favorable consideration friends this measure simply requires the completion of a risk reduction program before obtaining a limited driving permit after a DUI risk statistically we know that with a first time DUI it is more than a high probability not the first time the driver has committed the crime of drinking and driving data also shows us that it could likely be upwards of the 50th time the driver has driven while under the influence of drugs and alcohol according to saferoads.org 29% of all vehicle crashes involve an alcohol impaired driver the risk reduction program provides three things and as we talk about mental health courts drug courts and how we're trying to help recidivism reduce it let me tell you a risk reduction program does three things it provides an assessment of family circumstances dealing with prior substance use and abuse it also addresses addiction and possible mental illness indicators to help with intervention solutions the program participant may seek if further treatment is needed and most importantly a risk reduction program is a proven method in reducing recidivism risk reduction programs are required for the army navy marine core coast guard and are required for the coast guard for any alcohol or drug policy violation 18 other states utilize these programs as well but also want to let you know this the success of our drug courts have been recognized nationwide however depending on the jurisdiction you live in you may not be eligible as a participant in drug court until after your third DUI a risk reduction program simply does this when we evaluate and change our personal risk perception we start changing our behavior and changing our behavior could likely prevent the individual from having to end up in DUI drug court mr. speaker all in with this john adam said this facts are stubborn things and whatever may be our wishes our inclinations are the dictates of our passion they cannot alter the state of facts and evidence ladies and gentlemen if we can get these folks in an education program to help them understand while they're making high risk decisions hopefully we can reduce recidivism keep our roads safer and help these folks that are struggling with possible addiction mr. speaker I will yield the well for any questions I think john adam's nailed it down for you you have no questions thank you mr. speaker ask for your favorable consideration on house built I'm not sure he ever drove while he was impaired but uh he had a wagon or two mr. speaker is there any objection to the previous question being ordered the chair heirs none the previous question is ordered is there any objection to adopting the committee substitute the chair heirs none the committee substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favorable to the passage of the bill the chair heirs none the report of the committee is agreed to. shall this bill now pass all those in favor of the passage of House Bill 1020 will vote aye those opposed to vote no and the clerk will unlock the machine. What purpose does representative mom to hand rise? Mr. Speaker and the court is through number one thirty three I would like to be excused this vote. Gentlemen has that right and the journal will forever reflect the fact that he did not vote on this bill. Have all members voted? Have all members voted? If so the clerk will lock the machines on the passage of House Bill 1020 the eyes are one hundred and fifty three the nasor nine this bill. Having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1014. House Bill 1014 by representative tankers leave the hundred and sixtyth to be entitled back to amend chapter forty two entitled thirty sixty fifty fifty for Georgia and it's under relating the downtown development authorities this bill have referred to the committee on governmental affairs that committee recommends that this bill do pass. Chair recognizes chairman tankers lead to present the bill. Thank you Mr. Speaker this is a department of community affairs bill and it only involves downtown development authorities in Georgia we do have two hundred thirty one development authorities and while DDAs can go and active they cannot be dissolved. We have the thirteen hundred plus authorities that we do have in this state of these are the only authorities that require perpetual existence. The department of community affairs has had many requests to provide a way that they can be dissolved so this bill will do exactly that it's going to allow municipal governments to dissolve downtown authorities development authorities that are no longer active they don't hold any assets and they have no outstanding debt or other obligations. By simply striking the sentence that you'll see on the bill each authority shall have perpetual existence will allow the bill to those in active authorities it will allow them to dissolve to be legally dissolved and that's important if there are no questions Mr. Speaker I would you have one question you you I do chair recognizes representative stove all to your left for a question. That's the one me I do the question I have is what happens if they do have outstanding debt and they wanted to dissolve they cannot dissolve dissolve until they have no debt. So if does it want me that's a general ladies for the year. So if say if they have removed them had the members had end up resigning from the position on development authority and they had debt that was still left on the books how is that handle. I would have to defer to the department of community affairs but I would again just state that they cannot dissolve until those issues are settled okay thank you. If there are no other questions Mr. Speaker I would like questions no further questions thank you Mr. Speaker I would. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines. Have all members voted. If so the clerk will lock the machines on the passage of House bill 1014 the eyes are 164 the nasors zero this bill having received the requisite constitutional majority is therefore passed the clerk will read the caption to House bill 914. House bill 998. House bill 998 by Representative Rhodes the 120th and others to be entitled an act to amend title 2070 of physical Georgia and it's a related to game and fish so it's changed change the effective dates of rules and regulations promulgated by the board of natural resources bill haven't referred to the committee. Game fishing parks that committee recommends this bill do pass by committee substitute chair recognizes chairman Rhodes to present the bill.\n\nThank you, Mr. Speaker. The sub to House Bill 998, this bill is real simple. There's a few things. It updates our rules and regs. It updates our implied consent on hunting under the influence and boating under the influence. And it completes our DMAP program by allowing our commissioner to go in and increase or decrease bag limits as he sees fit. But the main part of this bill is a promise that was made last year on day 40 to represent a Debbie Buckner. And we're going to make the showbass, the state riverine sport fish for the state of Georgia. Mr. Speaker, if you have any questions, I'll try to answer them. I don't. Well, you have a question. You have a question. It's up to you. I'll you. You yield for a question? Yes, sir. I recognize this representative, Larickia, do you ride for a question? I should yield it to you. Does the gentleman yield? Yes, sir. To my friend. Is it not true that we have heard the expression, the little man in here a number of times this session? We have. And that I have received a number of calls with one of our hunting and fishing federations about looking after the little man, the little hunter, and that we are going to continue to work on that as we move forward. Yes, sir. We will. Yes, sir. Mr. Speaker, I yield the well and I ask to vote green for the show. Yes. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee has agreed to show this bill now pass. All those in favor of the passage of House Bill 998 will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 998. The eyes are 163. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes representative Cannon for an announcement. Thank you, Mr. Speaker. The hearing on the Crown Act and the House Resolution 345 is canceled. Thank you. Chair recognizes chairman Beverly for an announcement. Thank you, Mr. Speaker. The Georgia House Democratic Caucus will have dinner and room 506 CLOB, 506 CLOB, and then we'll go to 514. Thank you, Mr. Speaker. The chair wants to announce that members that we have boxed dinners for members and staff in room 230 with seating in room 216 during the dinner break. But first, the chair recognizes the chair of the House Rules Committee for an announcement. Thank you, Speaker. Somebody left a real nice looking pin up here. Right. I'll keep it. Rules Committee will meet promptly at 7 o'clock. Thank you. House will be in recess for dinner until 715 PM.",
  "updated_at": "2026-02-13T12:09:43.571703+00:00"
}