{
  "video_id": "wx_JsA9i07Q",
  "url": "https://www.youtube.com/watch?v=wx_JsA9i07Q",
  "title": "Japanese Consulate in Atlanta 50-year Celebration 1-23-2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 21,
  "summary": "Here is a structured markdown summary of the Georgia Japanese Consulate in Atlanta 50-year Celebration session:\n\n## Overview\nThe session celebrated the 50-year anniversary of the Japanese Consulate General's office in Georgia. Notable aspects include recognizing the strong economic and cultural ties between Georgia and Japan over the past 5 decades.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Governor Brian Kemp and First Lady Kemp recognized for their support of the Georgia-Japan relationship.\n- Remarks from Senator Kay Kirkpatrick, co-chair of the Georgia-Japan Caucus, highlighting the state's long history of cooperation with Japan.\n- Governor Kemp's speech emphasizing the importance of the Georgia-Japan partnership, noting Japan as Georgia's top international employer and over $4 billion in Japanese investment over the past 10 years.\n- Presentation of a commendation to the Consul General on behalf of the state.\n- Recognition of former Governor Nathan Deal and current Commissioner of Economic Development Pat Wilson for their roles in strengthening the state's business climate and international partnerships.\n\n## Votes\nNone detected.\n\n## Attendance\nNo quorum notes mentioned.\n\n## Adjournment\nThe session adjourned after the celebratory remarks. No next session date provided.",
  "transcript": "Welcome everyone to Japan Day at the Capitol. Governor Mrs. Kim, Commissioner Wilson, former\ngovernor of Diel, Council General Maeda, Mrs. Maeda, thank you so much for being with\nus today and all of our other honored guests including Senators and Representatives.\nI'm Senator Kay Kirkpatrick and I'm the Senate Co-Chair of the Georgia-Japan Caucus\nand the General Assembly.\nThe other co-chairs are standing up here with me today.\nWelcome everyone, and welcome to all the companies\nthat have joined us today, both outside in the rain\nand inside, and where it's nice and warm and dry,\nincluding my favorite personal favorite company,\nToto, made right in Heyville.\nTo all of you, thanks very much for joining us\nas we celebrate 50 years of the consulate general of Japan's office in Georgia.\nOver these many years, this important relationship has grown significantly.\nGeorgia has welcomed many Japanese companies with a huge economic impact on our state.\nI've had the opportunity to visit Japan and I greatly appreciate our state's mutually\nbeneficial economic and cultural cooperation.\nIf you've not had the chance to visit,\nthe annual Japan Fest that's held every fall\nat the gas out the arena in Gwyneth County\nwill give you a very good taste of Japanese culture.\nThis year's event is September 14th and 15th, I believe.\nWe were proud to present a resolution\nto console General Maeda and the House and the Senate today.\nOur state's leadership has appreciated the importance\nof the state's relationship with Japan over the years.\nIn fact, Georgia's first international trade office\nwas established in Tokyo in 1973,\nand a delegation from Georgia celebrated\nthe 50 years of this office in 2023.\nMost recently, Governor Brian Kemp and First Lady Kemp\nhave been extremely supportive of the ties between Japan\nand the state of Georgia.\nOur Governor understands the importance of positioning Georgia for success by attracting\nbusinesses from Japan and other nations friendly to our country.\nWith Governor Kim's leadership, Georgia continues to thrive and grow where the envy of\nstates across the country, and like any successful endeavor, the success or failure of any enterprise\nstarts at the top.\nI've worked with a governor and the first lady on many issues during his term, and it\nis no surprise that our state is in the hands of a person of integrity, honesty, and determination,\neven when his decisions are unpopular.\nThis combination has led to unprecedented success for our state.\nI know you are all anxious to hear from our very busy governor, so without further delay,\nI'm happy to introduce the 83rd Governor of Georgia, Brian Peak-Kemp for his remarks.\nWell, thank you, Senator, I didn't realize I'd made any unpopular decisions, but much\nlike my predecessor, Governor Deal, didn't either.\nIt is an honor to be here this morning.\nI want to thank you for the kind introduction and for the support of the members of the\nGeneral Assembly, Councilor General, it's honor to have you here with us at the Capitol.\nWe are proud to welcome you all to the best state in America for business.\nThe first lady and I are just excited to be with you this morning, and I just want to\nrecognize Governor Dele has been such a strong supporter of Japan and a strong supporter\nthat a business in our state has started our run on 10 consecutive years for the number\none state in the country for business, so Governor's good to have you back with us.\nAgain, I want to thank the members of the General Assembly for your strong support.\nI know Governor Dill would echo that the General Assembly's partnership with the executive\nbranch in making this business friendly environment is unprecedented.\nAlso glad to have the best commissioner for economic development in the country.\nWe've got Wilson Wilson today, Pat and his team, especially our colleagues that are serving\nin the international marketplace and places like Japan have just done an incredible job\nrepresenting our state, but also facilitating trade and economic development between the\nstate of Georgia and Japan.\nI want to start by offering my condolences on behalf of all Georgians for the victims\nof the recent earthquake, and we will continue to have your people in our thoughts and prayers\nas they recover from this disaster.\nYou know, when I look around the room, I see a lot of partners that are with us today,\nand that is certainly something that we value in Georgia, and it represents the approach\nthat we take at every level from all the way from local governments that we have good\npartnerships to also our partners on the international level. That approach has\nserved us very well in this state and I know it will continue to do so in the\nfuture. And we're seeing the fruits of that. International investments were\nresponsible for 47% of the jobs and 65% of the total investment in our state in\nin 2022, our trade was over $196 billion across 211 countries and territories, and we broke\nour previous records by nearly $5 billion. Thanks to our ports on the Georgia coast, which\ncontinues to be one of the fastest growing U.S. container terminals in the country. Japan\nhas been a prominent part of that success now going back 50 incredible years.\nToday we're celebrating the Japanese Consulate first coming to Atlanta in 1974, but as you\ncan imagine, our history goes back even further.\nThe state of Georgia opened its first ever foreign trade and investment office in Tokyo\nthe year before in 1973, and even before these official assets were opened, multiple companies\ndecided to come to Georgia. YKK, the zipper company, broke ground on a factory\nand making way back in December of 1972, and in 1973, Marata Manufacturing opened its\noperations in Smurna. Economic ties like these between our state and the\nnation of Japan have only grown and streaked the number over the past five\ndecades. In fact, Japan currently serves Georgia's number one international\nemployer and that translates to tens of thousands of jobs for people all\nacross our state. Just over the past 10 years alone, Japanese operations have\nbrought over $4 billion of investment to our state and trade between Georgia\nin Japan, now stocks $9.75 million annually.\nThose are just a few of the benefits\nthat come from the partnerships you see represented\nin this room.\nSo again, I wanna thank the Council of General,\nthe members of the General Assembly,\nwho helped us further this important relationship,\nthe team from the Department of Economic Development,\nwho are always available to help you\nor answer any questions that you may have\ninto those, all of those who had a hand\nand making today possible.\nWe are proud to be your partners,\nand we look forward to growing this friendship\neven more in the months and years ahead.\nSo here's to another 50 years of shared success.\nCongratulations.\nApplause.\nCouncil general, I'd like to present you\na commendation on behalf of the state of Georgia\nfor an incredible partnership.\nThank you very much.\nCongratulations, Mr. Freeman.\nCongratulations.\nThank you very much.\nThank you, Governor Kent, for your leadership and all that you do for Georgia, especially\ncontinuing the legacy of making Georgia the number one business, the state to do business\nin the nation.\nAnd with that being said, you've got to have great leaders and one of our great leaders\nwith the Georgia Department of Economic Development is Pat Wilson, he's an old friend and he\nHe is certainly one of the cornerstones that knows more about international trade in\nbusiness and has been part of the success and again a governor deal, I believe he grew\nup under your administration and was there early.\n2010 is the Deputy Commissioner of Global Commerce.\nHe served as the CEO of the Georgia Department of Economic Development and Commissioner since\n2016 and again that record of 10 consecutive years of Georgia being the number one state to do business\nWe owe a great deal of gratitude to Pat Wilson and certainly he more than most knows the importance of our partnership with Japan with that Pat\nPlease. Thank you.\nChairman Knight, thank you so much.\nEverybody, thank you for being here today.\nGovernor and First Lady, Governor Deal.\nIt's an honor to have you here today.\nAnd David's right, I grew up under Governor Deal.\nIn fact, my first job out of college was in Washington\nwithin Congressman Deal.\nAnd he was the reason that I stuck around.\nSo thank you, Governor.\nthe Japan caucus. Thank you guys for organizing today. This is an unbelievable\nopportunity to celebrate one of our most important partnerships. So happy\nJapan day everybody. This is this is really fantastic. It's an honor to be here\nto celebrate what Japan has meant to Georgia and that's our individual\ncompanies its communities and it's the citizens of this state in literally\nevery corner. So if there's one thing that's clear and I think the governor\ntalked about that is that Georgia and Japan value long-term partnerships. So in 1973,\nGovernor Jimmy Carter opened office in Tokyo, soon thereafter, Japan opened office in Atlanta,\nand from there that partnership blossomed. It's kind of like a cherry tree. But beginning\nWorking with YKK, investing in making, Japanese companies have followed, they've believed\nin us, and they've invested in us.\nAnd so in cities like Gainesville, Pindergrass, Monroe, Noonan, Dublin, and many others,\nthese companies have now become part of who we are as Georgians.\nThey've become part of the fabric of our communities.\nAnd for that, we are grateful.\nSo as the governor said, more than 400 Japanese companies employ more than 40,000 Georgians.\nY'all, those are individual lives of people.\nThose are families that have hope and they have opportunities that are inherent in having\na job.\nSo thanks to the hard work of Jessica Kork, the Japan-America Society of Georgia and many\nothers a peace belt tower was built in 2022 in the Carter Center to house the\nKonu peace belt. If y'all have not seen it you need to go see it yourself it is\na beautiful exhibit and really a cultural peace that ties our two countries\ntogether. So last year as we celebrated 50 years of Georgia in Tokyo I had the\nopportunity with a delegation to go ring that peace belt and to visit Konu the\nThe original home, we got to ring the replacement bell.\nSo that was an honor, but it was an unbelievably moving experience that highlighted how important\nour two countries are culturally and economically to each other.\nSo from WAKK, our first investor to Yacult, our most recent investor, and I am a convert\nif you haven't tried it, it's fantastic.\nToday we get to say thank you.\nSo, Council General Mehta, thank you from the Department of Economic Development and the\nmany communities around the state that have been benefited from this important relationship.\nThank you.\nHappy Japan Day and Happy Birthday to the Council.\nReally appreciate it.\nHello everyone, I am State Representative Terry Anelo-Witz.\nI am the House co-chair of the Georgia-Japan Caucus, and it is such an honor and a privilege\nto be here today with so many of our friends from the Japanese community in Georgia with\nthe Japan-American Society of Georgia.\nI see so many people who have been at the honor of visiting their facilities, traveling\non the state. I've had the privilege to travel to Japan twice now most recently with my family\nand I echo everyone who is going to urge you if you can experience Japanese hospitality,\nwhether it is by visiting Japan or by going to the Japan Fest here in Atlanta, I highly encourage\nyou. I'm here today to introduce Consul General Miyamaeda. He is here with us along with his wife\nCouncil General Maeda was posted to Atlanta in the\nSoutheastern United States in November of 2002.\nHe joined the Ministry of Foreign Affairs in Japan in 1990, and during that time his\npostings have ranged from Switzerland, Vietnam, Italy, and Afghanistan.\nThis is his first posting in the United States, and since he has joined us in 2022, he has\nbeen an absolutely steadfast partner and friend to us here in Georgia. He has\nbeen such an advocate to again continue to strengthen the friendship that we\nhave between the state of Georgia and the nation of Japan. It is my honor to\nintroduce him today, Consul General Mio Maeda.\nThank you very much for the kind introduction and well thank you very much\nfor all of you today to attend this ceremony.\nWell, first of all, I'd like to express my sincere condolences\nto the victims of the Noto Peninsula aspect,\nwhich occurred New Year's Day.\nAnd also I'd like to express my sincere sympathies\nto those who are still suffering from the disasters\nWe still have a lot of people who are facing difficulties and we do hope that they will resume their daily life as soon as possible.\nAnd once again, thank you very much for inviting me to this very important event.\nWell, as Therese mentioned, I've been here for just one year, one year, two months.\nSo I'm very, I've said, young, young here.\nAnd the construction offices has 50 years old.\nSo it has a long history, but I really feel that it's a great honor to be posted here,\nbecause Georgia and Japan,\nJapanese community here has established a four-star,\nvery good and friendly relationship between us.\nAnd for that, I really appreciate the warm,\nwarm and the hospitality we received\nour Japanese community received\nfrom the people of Georgia and state of Georgia.\nAnd for that, I really, I'd like to express my sincere gratitude to all of you.\nAnd also, we have a 50th history, but we could be here for 50 years because we have a lot of good Japanese community here.\nAnd you can see that a lot of Japanese companies are here explaining their business and their\ndoings and without their effort, we couldn't be here today.\nSo again, I would like to express our sincere appreciation to those Japanese communities\nand Japanese companies who have been so active and so effective and so keen to do business here.\nSo I'd like to ask you all of you to join with me to give them an applause.\nAnd also I really appreciate the, well, we could be here because our predecessors has made\na great foundation for all of us to do business here and to stick in this great great state.\nSo I'd like to say a great appreciation to our predecessors, such as President Carter,\nfrom Magabarandil as well, and other predecessors as well.\nAnd based on that, as a Consul General of Japan in Atlanta, I'd like to continue or make\nour best to continue our good friendship and also part to further enhance the good relations\nbetween Japan and South-East in Japan and the state of Georgia. So I do wish that if you\nlend us your valuable support to create more prosperous and friendly relations between\nJapan and the state of Georgia to for the next next generations for the next\ncoming 50 years. So thank you very much I want to thank everyone for\ncoming today all of our partners if you'll forgive me for just one minute for\npersonal owner privilege. At the end of 2017, I had the privilege of being on the\nfirst legislative delegation to actually travel to Japan. I think it was since\nthe Carter administration. And what an experience it was. I was introduced to\nnot only Japan as a country but to the culture and to the people. Constantine\nGeneral, I want to say what a beautiful country and I've said it before, what a\nbeautiful people, kind and welcoming. And I am absolutely a trip of a lifetime and\nit absolutely open our eyes to why we are great partners and great friends with\nJapan. I'll say this one more time. Not only economically or weak great partners\nbut globally Japan is very important to our country as a strategic partner.\nAnd most of all, as we go back and focus on Georgia,\nwe every day see these companies and we use their products.\nThey employ Georgians.\nIt is a wonderful, wonderful partnership.\nAnd General, behalf of the Georgia,\nJapan Caucus, thank you, and I look forward\nand wishing the best for the next 50 years\nyears as we continue to grow and grow together in that partnership.\nThank everyone for coming and we really, really appreciate you celebrating this day with us.\nThank you.\n",
  "updated_at": "2026-02-12T20:06:56.981392+00:00"
}