{
  "video_id": "xE822lYvzvg",
  "url": "https://www.youtube.com/watch?v=xE822lYvzvg",
  "title": "Rules PM Meeting for Day 40 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 8,
  "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThe meeting had a cheerful atmosphere, with members dancing and singing as they arrived. The main focus was on procedural matters, including recognitions, presentations of legislation, and the approval of study committees.\n\n## Key Actions\n**SB 148**: Pilot program for development of outdoor learning spaces in schools, along with other education-related provisions.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Recognition of Erin Garland, an assistant from Elverton, who was attending the Rules Committee for the first time.\n- Presentation of a proposed rules committee substitute for SB 148, which combined several education-related bills.\n- Discussion and approval of 11 study committee requests, with the days reduced from five to three.\n- Discussion of House Resolution 887 regarding code cleanup.\n\n## Votes\n- SB 148 by Substitute LC 610264S was approved.\n- The 11 study committee requests were approved as a group.\n- A supplemental calendar was set, including several house resolutions and SB 148.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "It looked like everybody was in a good mood and they were coming in, they were dancing and skipping and singing and listening to the music back there so maybe we were going to play that more often.\nAnd we're going to recognize Chairman Leverett for a recognition and also a presentation of the legislation. Go ahead.\nThank you, Mr. Chairman.\nFirst, just point first to privilege.\nIf I could ask everybody to turn around and look in the back of the room, my assistant\nfrom Elverton, Erin Garland is sitting back there, she'll wave.\nShe's been up here before this in her first rodeo, but I just want to welcome her.\nThank you.\nThis is the first time she's been in the rules committee.\nSo appreciate her being here.\nI'm so proud to work with her back in Elverton and glad she came up here tonight.\nAnd I also wanted Mr. Chairman just to present a proposed rules committee sub to the committee.\nIt should be in front of you, it's for Senate Bill 148, it's LC610264S.\n610264S and this is a combination of some other legislation that has all been through committee.\nSome of it came back to us from the Senate attached and then the House Education Committee\nalso added another piece of legislation.\nSo the original bill, Senate Bill 148 is Section 2 on pages 2 and 3 and this is a pilot\nprogram for development study of outdoor learning spaces on elementary and secondary school\nproperty.\nThat was the original Senate bill and then it is unchanged other than being moved to Section\n2.\nSection 3 is Chairman Hawkins Hospital 629 on automated external defibrillators in elementary\nschools and we're striking a paragraph there on lines 86 through 89.\nI guess primarily because we have so many elementary schools is difficult to find enough\nmedical staff to be there and the automated machines basically instruct you on their\nuse as you use it so we don't feel that's necessary.\nAnd that's, I think, a request to Cho, I believe.\nSection four is House Bill 127.\nThat was Brent Cox's bill increasing the personal paid leave\nfrom three to five days for teachers.\nYes, thank you, I'm pro Tim.\nAnd so that's some other House legislation\nthat had passed out of House education,\nand the Senate actually added that into the Senate bill.\nAnd then the part, the new part that we are proposing\nas a rules committee is section one,\nwhich is a representative,\nTannen's House Bill 451,\nthat passed off of the House on March six.\nThat's the hunting safety instruction\nfor grade six through 12.\nSo all of this is a legislation\nthat's already been approved by appropriate committees.\nWe just trying to package up a couple of good pieces\nlegislation and the one thing, Mr. Chairman.\nOkay, you've heard the explanation, you have any questions?\nOkay, you don't see any questions.\nDo I hear a motion that we approve Senate Bill 148 by Substitute L.C.\n61, 0, 2, 6, 4, yes.\nMotion and second in opposition.\nOkay, it's approved.\nOkay, if you will look, you should have on your desk,\nWe had about 38 or 40 requests for study committees and we have before you some 11 to ask for your recommendation.\nAnd what we have done, the reason these are room substitutes, all these were changed from five days to three days.\nthe remainder of the proposition stayed the same,\nbut just changed the days from five days to three days.\nAnd then the exception to that in the Substitute House\nResolution 753 was also combined with 428 and 655.\nBut we have 11 propositions all by rule substitute.\nYou should all have copies of those\nfor the rule substitute.\nLike for you to look at those for a second,\nand then I would like to ask that we have a motion\nthat we approve all of these study committees\nwith one vote, if that meets with the approval\nof the committee.\nSecond.\nHold up, just a minute.\nWe have a motion that we accept these as a group, have a motion and a second that we accept\nthe 11 of these, they're all room substitute.\nAny opposition to that?\nOkay, we have that motion passes.\nother piece of business house resolution eight eight seven it's own you blue\nsheet chairman blackman you want to talk to us about that yes sir it's just\nI'm going to talk about it as\ntwo signers and something we could\nuse as a tool to clean up that\ncode section potentially.\nThank you.\nOkay.\nQuestions for him.\nI'm going to say to me.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay.\nOkay, let's set us a supplemental calendar for today. This would be the third one\nunder\nModified open I'm just going to read them for you house resolution 40 by substitute\nHouse resolution 72 by substitute house resolution 304 by substitute\nHouse resolution 429 by substitute house resolution 557 by substitute\nbe put on the counter, have a motion in a second, any opposition?\nAll right, there are them.\nAnd then also Senate Bill 480, excuse me, Senate Bill 148,\nroom substitute that Chairman Leverd explained to us a minute ago,\nLC-610264S, have a move in a second that it'd be placed\non the sub-mill counter at any opposition here in early its own too.\nOK, thank you very much.\nYou\nYou\n",
  "updated_at": "2026-02-12T17:02:00.543118+00:00"
}