{
  "video_id": "xE8y995sHcI",
  "url": "https://www.youtube.com/watch?v=xE8y995sHcI",
  "title": "1/12/2024 Senate Committee on State and Local Governmental Operations",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 10,
  "summary": "Here is a summary of the Georgia Senate Committee on State and Local Governmental Operations session on 1/12/2024:\n\n**Overview**:\nThe session involved discussion and a vote on a redistricting plan for Cobb County. There was debate around the source of the data and analysis used to develop the plan.\n\n**Key Actions**:\nNo specific bills were passed or referred.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- Several senators, including Senator Setsworth and Senator Estevez, provided information and context on the redistricting situation in Cobb County.\n- There was discussion around the use of legislative staff versus the Reapportionment Office to generate the redistricting data and analysis.\n- Concerns were raised that the plan may not fully address the issues identified by the court in the previous litigation.\n- Senators expressed a desire to work collaboratively to develop a redistricting plan that would be supported across Cobb County.\n\n**Votes**:\nThe committee voted 4-1 to pass the redistricting plan forward.\n\n**Attendance**:\nQuorum was present for the vote.\n\n**Adjournment**:\nThe committee adjourned, but the next session date was not specified.",
  "transcript": "You\nAnd understanding of exactly what was going on in Cobb County, because you know, some\ncomments were made the way we do things up here and all this.\nIf this were Columbus and the Muscogee County School District and all the chaos that goes\non there, I'm very familiar with that, or troop county in Lagrange.\nI'm very familiar with that.\nSo I want to thank your staff, Senator Setsworth's staff, and the best admin anybody could have\nher name is Google, for giving me the opportunity to research the history of this situation.\nNot only was I able to read the judge's order, but I was able to read the original lawsuit\nthat was filed in Cobb County, and I'm very happy and pleased to see my good friend, Eric\nAllen here today, called Representative Allen.\nWe came into the Georgia General Assembly together,\nbecame good friends, and he and I have the same feelings\nabout this as far as the politicalization of school boards.\nAnd when I read that first lawsuit,\nI was shocked at how many references\nto politics was in there, and sadly,\nhow everybody was identified by the color of their skin\nas opposed to their role or whatever they were doing.\nAnd so, but I have a very clear understanding\nof what's going on there.\nI wanna thank Senator Setsler for his hard work on this\nand providing me information.\nI know things about certain types of math now\nthat they will wake me up crying in the middle of the night,\nbut I do appreciate everybody getting me up to speed\non the history of what's going on there in Cobb County.\nAnd I do feel that by moving this legislation forward,\nwe are carrying out a responsibility\nthat is very clear under the law\nin the Georgia General Assembly.\nThank you for the worthy discussion there, Mr. Welp.\nSaid I do also want to thank Senator Estevez\nfor giving us more information to be disseminated.\nI think each of y'all received an email\nand some information in your packet on that.\nSo Senator Estevez, you have a question?\nYes sir, thank you Ms. Kermit, just a quick question about, and Senator Sessler.\nThank you for sending us some more information.\nI just had a question about where that information came from.\nYes, this is a higher staff to help me pull this together.\nAs you know, we use legislators to develop some level of expertise in these things.\nBut to make sure that we've got the kind of kind of probity\nand preparation that it takes to do this consistent\ndirector's work, I've engaged staff\nas much later to help me do that.\nA couple of things that did, as you can see,\nis the demographic layout provided\nfor a total population, a voting against population,\nto compact this ratings, to be able to look at the bench bar 2012 plan, was proposed\nunder 2022, which was litigated, and then we proposed plan on how for all those criteria\nwe've exceeded what was, we've addressed demonstrably the concerns of the court, and then\nalso for poor attention, the ability to keep the districts more similar, and specifically\naddress what you raised in our committee here today, in specific districts, specific\npopulations.\nAs you know, there's many criteria where you look at race and zone in one of them, so\nengage staff to do that.\nIn fact, a redistribute professional will not need to do that.\nhas the expertise and is the kind of expert that I think we can be proud of and would expect\nto address the judge's order and not make big mistakes.\nThank you, Senator.\nI think when my colleague asked for the science and asked for us to use resources from within\nthis building, we do have experts in this building at the legislative and congressional\nReapportionment Office that you would expect this data to come from, it concerns me that\nwe would be relying on staffer that essentially had spreadsheets where we have no source of\ntruth that is paid for and hired by the state.\nI haven't been here very long, but I do know that in the past, when these maps and the\ndata are presented, it's presented with the seal and from data using data that comes\nfrom this office.\nThese are spreadsheets, and had I known that was the standard that we were going to use,\nI would have had a staffer create some charts that I could use to argue that otherwise.\nNevertheless, I do think it's important to point out one that the judges didn't make\nspecific points that I believe are not addressed by this map.\nAnd two, that there is willingness from both parties to work together to have a map\nthat all of Cobb, regardless of party, regardless of what you look like where you're from,\nCobb County will be proud of, and I hope that despite the resistance to have those conversations,\nthat those who are open to those conversations continue to have those, and that we come\nto a resolution that is good for everyone in Cobb County.\nThank you, Senator S. Mous, just a little bit of a misunderstanding, because this is\nis important if at least the chair very briefly.\nYou're going to be very, very brief.\nThank you, Mr. Chair.\nTo the gentleman's point, these maps were,\nthat's before you were generated by a reapportionment office.\nIn fact, changes were made by a reapportionment office\nand technical review, making sure\nthat you had no anonymity issues.\nAll of those things to produce the final maps\nthat was, in fact, produced by a reapportionment office,\nas you can probably expect, some of the forensic level\nof information to comply with every element raised in the court's order is arguably beyond\nthe scope of our reapportionment office to hit every single question.\nSo I think we, I think going to the reapportionment office with something that was thoughtful\nand prepared would be what our citizens would expect.\nThank you, Senator Satner.\nAnd I think it's, we have a motion in a second.\nThank you, Mr. Jim.\nAnd then we have a motion by our majority whip,\nsecond by Senator Williams.\nAll in favor, please signify by raising your right hand favor.\nYou have one, two, three, four in favor, and all opposed,\nand one opposed.\nThe, that concludes the business of our committee today.\nThe motion was passed, and I've that reflected in our report.\nThank you, Mr. Chairman.\nMembers committee.\nThank you, Senator Sussler.\nSo, Dan, hope everybody gets out without getting too wet today.\nHave a good weekend.\nI'm going to fold count and run to get out of this.\nYou\nYou\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T19:54:45.83931+00:00"
}