{
  "video_id": "xEHr4XRHPE4",
  "url": "https://youtu.be/xEHr4XRHPE4?t=1349",
  "title": "Georgia House - Day 38 (2026-03-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": "2026-03-30",
  "duration_minutes": 104,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 38 (2026-03-30) session:\n\n**Overview**\nThe session featured routine procedures and administrative matters, with no substantive legislation detected. The highlight was the introduction of the day's chaplain, Pastor Chad Williams, who delivered an inspirational speech on the responsibilities of leadership.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\n- **HB 1609**: Act to amend chapter 7 of title 31 relating to the regulation and construction of hospitals\n- **HB 1610**: Act to amend title 36 relating to local government\n- **HR 49**: Resolution creating a House Study Committee on regulation, affordability and access to housing\n\n**Notable Moments**\n- Chaplain Chad Williams, introduced by Rep. Collins, gave a speech emphasizing that leadership is a gift from God, with temporary earthly power but eternal responsibility before God.\n- There were routine administrative procedures, including confirming the previous day's journal and establishing the order of business.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum was present, with no notes on attendance issues.\n\n**Adjournment**\nThe session adjourned, with the next session date not specified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Chaplain this morning will be introduced by the gentleman from the 68th House District, the chairman of the House Public Safety and Homeland Security Committee, Chairman J. Collins. Chairman Collins. Thank you, Mr. Speaker. What a privilege and an honor it is today to introduce the chaplain of the day, Pastor Chad Williams. Chad is the lead pastor of high-view church in my hometown, Villa Rica, Georgia. That little church has grown from just five people to several hundred people since this founding in 2013. It's one of the fastest growing community churches in the West Georgia area. High-view is extremely active in our community hosting one of the largest local outreach ministries in West Georgia and serves food and other basic necessities to hundreds of families in the West Georgia area. Chad has trained leaders in both the business community and the faith-based community. He has a master of divinity from Midwestern Baptist Theological Seminary, Chad and his wife Kayleigh, living Villa Rica and half two daughters, Lydia who is four and Reagan who is nine months. Chad is also a cousin of mine. I attended his first birthday party when he turned one, our grandmother's resistors. And our family is so very proud of Chad and the ministry that he has shown and leadership he has shown to our community. So it's a pleasure today to present Pastor Chad Smith, Chad Williams. Well, good morning. It is a high privilege and honor to stand before this legislative body of our great state this morning. I can say I am a proud Georgia citizen. I was born here. I started a family here and I lead a church here. At 16, I even got my first job at a local Chick-fil-A wearing the cow suit so you know I'm Georgia through and through. Let me say as a pastor, I have never been more thankful to be a Georgia citizen than I have over the last two years. Over the last two years we have all been reminded of the unique stewardship that leadership is. Leadership gives the power to influence. It gives the power to shape lives every day. And for many of you that is why you are here today. That's why you're away from your families or your businesses and your communities to serve to that end. And with that influence of course, the leadership gives us comes great responsibility. With the power to influence comes the power to create human flourishing or suffering. One of these truths and a light of the unique moment in human history that we are all living in. I wanted to briefly this morning share with you from the scriptures a few truths about leadership here in these next few moments. They are very simple yet they are also profound because they are from the Word of God. God appoints leaders. Leadership is temporary. Eternity is forever. In Romans 13 verse 1 the Apostle Paul says this. Let every person be subject to the governing authorities. For there is no authority except from God. And those that exist have been instituted by God. God appoints leaders. Each and every one of us in this room holds some type of leadership office only because God decreed it. Leadership is not ultimately a prize that we win. It is a gift that we receive. And it is a gift that we must steward. The good of those we have been called to lead and for the glory of God. The truth is our time to lead in this life is very short. As a pastor I am reminded of this daily. God not only raises up leaders. God also removes leaders. And this has always been true. From Adam's failure to lead in the Eden and his subsequent removal. We have been reminded of this reality. Leadership is temporary. Daniel 2 verse 21 says this. The Lord changes times and seasons. He removes kings and sets up kings.\n\nThere is quickly coming a day when you will not hold your office and I will not hold mine. If nothing else, death always wins the runoff. And one day, one day, when our time to lead is up, when this life is over, we will all stand before God. Each of us. And we will give an answer for how we stewarded the gift of leadership that he has given us. The Holy Corinthians 5, verse 10, the Apostle Paul says this, for we must all appear before the judgment seat of Christ so that each one may receive what is due for what he has done in the body, whether good or evil. And on that day, we will all stand before the only leader in the universe whose position is permanent, who never runs for reelection. That's King Jesus. And my hope on that final day is not ultimately in my righteousness, nor is it in my performance as a leader, as a pastor, as a community leader. My only hope for that day is this. By repenting in my sins and trusting in Christ, in his perfect life, sacrificial death and bodily resurrection, I will stand on that day covered by his righteousness alone. And I will hear the words that we are all aching to hear, well done, my good and faithful servant. Would you stand with me? Let us pray together. O Lord, thank you for this moment, for this opportunity and time to encourage with your work. Thank you for these civil servants, these men and women whom you have appointed for this hour. Bless them. Bless their constituents. Bless this state. For the power these men and women for the work, you have appointed them to do. For the good of our communities, for the good of the state of Georgia, and for your glory. And is the name of Jesus that we ask these things. Amen. The religion is the flag of the United States of America, and to the republic for which it stands. One nation under God, indivisible, with liberty and justice for all. Good job. Doorkeepers will unlock the doors. Members may greet the chaplain in the south any room. Chair recognizes the chairman of the committee on information and audits, chairman Hogan. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative today and found it to be correct. And furthermore, Mr. Speaker, without farmers, you would be naked, hungry, and sober. Two out of three is not bad, I guess. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read. And found to be correct. Is there any objection to the confirmation of the journal that chair hears none and the journal is confirmed? The clerk will read the resolution establishing the order of business for the day. Mr. Barnes, on 59th, whose following be established is the order of business during the first part of the period unanimous consensus, introduction of bills and resolutions, first reading and reference of house bills and resolutions. Second reading of bills and resolutions, reports of standing committees, third reading of passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day that chair hears none and the resolution is adopted? First reading of bills and resolutions, the clerk will read. Budget and fiscal affairs oversight, House Bill 1609 by Rubsan of Perkle, 150 fifth hatchet, 150th of the bill being titled act to amend chapter 7 to title 31 of the fiscal to George annotated relating the regulation and construction of hospitals, health and human services, House Bill 1610 by Rubsan of Williams, into the 115th bill be titled act to amend title 36, the fiscal to George and 10 relating to the local government, government affairs, house resolution alone 49 by Rubsan of Washburn and the 140th of the bill. The Washburn and the 140th of the bill is burned 759th, while the 32nd gunner of the 8th, Crow of the 110th, a resolution creating a House Study Committee on regulation, affordability and access to housing. Small business development, House resolution 1167 by Rubsan of Setslow 35th, resolution recognizing the mayors of aquaeth that dedicating a bridge in their honor. That completes first reading. Second reading of bills and resolutions, the clerk will read. House Bill 1603 by Rubsan of Yertia of the 150th, a bill to amend and act to create the city of Sylvester Public Facilities Authority, House Bill 1611 by Rubsan Stevens of the 164th, a bill to amend and act to create this abandoned development and renewal authority. House resolution 1127 by Rubsan of Oliver of the 82nd, a resolution creating the House Study Committee on development authorities and downtown development authorities. House resolution 1128 by Rubsan of Wales and the 80th, all over the 82nd, Shannon of the 84th canon of the 58th, Evans of the 75th, 57th, a resolution recognizing and committing Stacey Fox on her 10 years president and CEO of Clan Parenthood Southeast. House resolution 1147 by Rubsan of Dunhu, the 30th, Kelly of the 16th, Parsons of the 44th, Benton of the 31st, Washburn of the 141st and others. Resolution urging the President of the United States to consider the current geopolitical tensions and support policies to take measures to ensure America's long-term energy affordability, security leadership and progress. House resolution 1148 by Rubsan of Thomas of the 21st Carson of the 46th, Cantrell of the 22nd, a balance of the 23rd, a resolution urging Cherokee County in the cities of Woodstock, Canton, Holly Springs, Balagrond and Waleska to adopt annexation growth boundary agreements and joint land use plans. Senate Bill 636 by Rubsan, Senator Burns of the 23rd, a bill to amend and act to create constituting the Board of Education of Warren County. Senate Bill 639 by Senator Strickland of the 17th and Jones of the 10th, a bill to amend and act to provide for a new Board of Commissioners for Henry County, 3-Second Readers. Reports of Standing Committees, the Clark-Wereed. Representative Robert Dickie, the 140th District Chairman, Committee on Agriculture and Consumer Affairs submitted the following report. Representative John Spawner, the 72nd District Vice Chairman and Committee on Defensive Veteran Affairs submitted the following report. Senator Spocker, your Committee on Defensive Veteran Affairs has had an reconsideration of following resolution to the House, as the struck-to-meet-a-report same-backed, the House-Falling Recommendations, House of Resolution 89060 passed by substitute respectfully submitted Rubsan of Josh Bonn of the 72nd District Chairman. Senator John Tackers of the 160th District Chairman and Committee on Intercomal Coordination Local submitted the following report. Senator Spocker, your Committee on Intercomal Coordination Local has had an reconsideration of following bills of the House and Senate. Senator Spocker, your Committee on Defensive Veteran Affairs has had an reconsideration of following resolution to the House-Falling Recommendations, House of Resolution 104 passed, House of<|ko|> the 160th District Chairman. Representative James Perchett of the 176th District Chairman and Committee on Judiciary Nonsense, submitted the following report. And to speak to your Committee on Judiciary Nonsense as that and a consideration is following bills of the Senate. This is struck-to-meet-a-report same-backed, the House-Falling Recommendations, Senate Bill 10 new passed by Committee Substitute, Senate Bill 539, new passed, Senate Bill 591, new passed by Committee Substitute, respectfully submitted, groups of Mr. James Perchett of the 176th District Chairman. Representative Allen Powell, the 32nd District Chairman and Committee on Regulated Industries submitted the following report. And to speak to your Committee on Regulated Industries, that and consideration following bills of the Senate has struck-to-meet-a-report same-backed, the House-Falling Recommendations, Senate Bill 45 to pass by Substitute, Senate Bill 552, Committee Substitute, Senate Bill 445, new passed, respectfully submitted, representative Allen Powell, the 32nd District Chairman. That completes the reading of the report's standing committees. All right, we're going on now to the local calendar. Going on to the local calendar, third reading and passage of uncontested local bills. We're getting ready to do business and it would really be helpful to many members that like to pay attention to what goes on in the well for the noise level in here to be lowered several notches. We have two local calendars today. We have a local calendar and then we have a supplemental local calendar. Is there any objection to taking those up together? Hearing none, they will be taken up during one vote. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered and the clerk will read the local calendars. House Bill 1604, by the House, into the 170th City of Aido. House Bill 1606, by the House of the House, by the House of the County. Senate Bill 635, by the House of theeties, by 707. Senate Bill 637, by Senator Brass of the 28th City of Siod breaking the Senate Bill 635. Rockdale County, House Bill 1605, I will represent a work house of the 157th City of Cocksden, Senate Bill 638 by Senator Anderson, the 43rd, Rockdale County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bills on the local calendar and the supplemental local calendar. The eyes are 159, the nays are five. These bills having received the requisite constitutional majority are therefore passed. All right, we have some important business to take up on Tuesday, March 29th. This house failed to pass House Bill 479. The lady from the 122nd District served notice of a motion to reconsider the action of the house in failing to give House Bill 479 the requisite majority. Now is the time for the lady to pursue the motion if she so desires. She so desires. On the lady's motion that this house reconsider its action in failing to give House Bill 479 a requisite constitutional majority. All those in favor of reconsideration will vote aye. Those opposed to reconsideration will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the lady's motion for reconsideration. The eyes are 101, the nays are 62 and this house has reconsidered its action in failing to give House Bill 479 the requisite constitutional majority. That bill will go back on the general calendar subject to call at any time today or Friday or Monday. We're going on now to morning orders. Going on now to morning orders. Planning orders will be limited to one minute each. One minute each. Chair recognizes. Representative Campbell for a morning order. Thank you, Mr. Speaker. So I would like to give a quick acknowledgement and thanks to our medical station, our legislative medical station that we have here in the capital that's located on the second floor. I'm sure you all know that. Room 232. I had a medical situation a few weeks back and they handled it perfectly. They were able to get a doctor in quickly so they have access to doctors quickly. They came in and I could not have done it better. They assisted me in getting to every hospital and in there. They just did a great job so I wanted to publicly thank them and to remind all of us that they're there for our use and they're very capable, very good and so use them if you need them. Thank you. Chair recognizes. Chairman Sam Watson for a morning order. Mr. Speaker, I've got a few others that are going to join me. Today is my honor to recognize Tom Risco. Tom Risco began work here for the state of Georgia on December the 27th, 1967. He will retire August of this year. When Tom started work here, gas was 32 cents a gallon. Lending P. Johnson was president and Lester Maddicks was the governor of Georgia. Su first super bowl was also played and the tickets were $12. Andy Griffith was the most watched TV show in America. Tom has seen a lot. He served in the Vietnam War in the Air Force. He has worked for the state of Georgia for 54 years and you don't see that anymore. People are what make the state employees and the people of this state are what make our state great and they're what make our job easy and I can't thank Tom enough. He's in the back back there. He's going to be in the any room. If you would just please stand and help me honor Tom Risco. Tom Cavinsmire says hello. He's the only, Cavins only person that Tom remembers was here when he started work. So thank you Mr. Speaker, I yield the oil. Chair recognizes representative Angela Moore for a morning order. Good morning everyone. Just wanted to remind you that we're having House District 90 today in room 216. It incorporates to cab, rockdale and Henry counties and since I represent everyone in my district I have invited everyone to come in. Have a little knowledge on everyone. Introduce yourself. Pick up something. Go. Have a great day. Chair recognizes representative dukes for a morning order. Thank you Mr. Speaker. Initially when I signed up for morning order it was definitely not for this purpose but I too want to thank the medical health staff. Yesterday I had a situation and they sent me to Emory and it was a rewarding experience. I'll be going back later on. But the reason the community is that I'm going to share with you some of the unhut song he wrote over our community. This could have been done doing black history month but black history is American history. Thank you Mr. Williams. But black history is American history and I want to share with you a man by the name of Peter Dormity. You see he was born a slave in Ozak, Alabama and he dreamed and hoped and prayed to be free and then it came. And he in his cousin, Abram Cheney walked from Ozak, Alabama and they settled in the bag's fairy plantation down in southwest Mitchell County down in representative Campbell's district. And shortly after being there they established church called the Mount Zion missionary Baptist Church. He was born in a brush harbor, a secret gathering place where that freed people could practice religion and religious tradition. People came together with guidance and hope and reassurance. They came and praised and worship God and offered their confessions to Christ. Thomas time has expired. I'll allow you 30 seconds over. You may have to do the sequel tomorrow. Thank you Mr. Speaker and the benedition will continue to him. They recognize his representative Williamson for a morning order. Thank you Mr. Speaker. I just got news of a few minutes ago that Walton County lost one of his finest citizens. Roy Roberts Roy Nundley Roberts was a graduate of Atlanta high school. I can't remember exactly which one is all state football and basketball player. He turned down scholarship softwares in the University of Georgia and both of them wanted to play basketball. Football and the basketball except the college scholarship to the University of Kentucky where Adolf Rupp declared him to be the most deacious defensive player. He was husband father, grandfather, he was a leader in our community established in Walter County GOP 40 years ago after running the unsuccessful as a Democrat. He kept everything right in the middle of the road. He has one of the last great republic of barbecues and he's well respected and I appreciate a moment of silence for Roy Roberts in his family. Thank you Mr. Speaker. I'll ask all House members to please take your seats. All House members will be seated please. All House members will go to their seats. Chair recognizes Chairman Jan Tancersley for a special order. Good morning friends. To my very distinguished friends and my colleagues is really bittersweet to stand before you today to talk about my retirement. My decision to not seek re-election was not easy at all but after many prayers, thoughts and conversations with my husband and my family, God granted me this amazing piece and it's been with me every day. I'm so thankful for that because two years ago I thought I wanted to leave and then I wanted to stay and it was back and two back and two this year it's been an entirely different situation. About four years ago I bought a plaque that hangs in my bathroom so that I can see it every day and I'm reminded on a daily basis that I don't really know what tomorrow holds for me but God does and I'm claiming its promise. I've claimed it every day since I hung that verse and the verse says, for I know the plans I have for you, they are plans for good and not for evil to give you a future and I hope and I believe in that scripture and that God is in control. Even on days when we feel like hearing the house that maybe he's not, that he is. But let me tell you a little bit about my family. He couldn't be with us today because he had a group of guys coming and they've had it planned for a long time. They're going to be in a golf tournament tomorrow and so I wanted him to have his fun. But anyway we've been married for almost 56 years and he is the love of my life and my best friend. We met in high school and dated and there was never anyone else for either one of us. He just loves everything about rural Georgia. He is not a city guy. I can't bring him up here and let him sit in the condo and stare at the concrete and he's just not wanting to sit around and hang out but he loves people and he loves to talk to people. He just loves everything rural Georgia can provide and that's friendly people, hunting and fishing in the Giche River, gardening and spending time with friends and family. He takes great joy as you all know and growing vegetables. He is amazed at representative Sam Watson, chairman Watson. He always wants to know how things are going for him and Robert Dickie with the peaches. But anyway he loves to share the bounty of that garden with everybody he knows. He has a great time doing that. He retired about six years ago and after living on his own for 12 years, it's been 12 years that happened in the blink of an eye that I came up here and the next thing I know is 12 years later. I am pretty sure that he is going to need some retraining and I think I made two. I mean I have had a great roommate that has taken good care of me so anyway I will have to do some retraining too. But he stubborn and sometimes he makes decisions about my things, my things that I just don't understand. Like there was one time I asked him to bring this tall narrow chest of doors so that I could use it in the condo here in Atlanta. Well he came in on that Friday and he was just as happy as he could be with the chest of doors strapped down in the back of the truck. I helped him unload it and stand it up right on the concrete floor in the garage. But right away I noticed that it just didn't seem as tall as I remembered and worse than that. I noticed that it robbed a little bit. With my heart racing I casually shared my observations with Huey and I asked him what happened to my chest. Well confidently and pretty proudly he said well it was too long and I couldn't shut the tailgate. So I cut off part of the bottom.\n\nI really glossed my breath for a second or two and I felt, I'm honest with you all, I mean I just felt this hot rush of anger and I just wanted to take his head off. But I said, I mean I was thinking myself really here, you couldn't have given me just a little quick call to see what I thought about that. But instead like a lot of us married couples do, I just took a deep breath and said, well, okay, I don't think it'll wobble on the carpeted floor in my bedrooms and that just sounds so gracious on my part, like I'm so great, right? But the reality was, I knew I could just go buy another chest and a better one than I even had and he would not say one word, I was sure of that. So anyway, we got through that and there's just not as much time as I wish I did have to tell you about all the incredible, funny and wonderful things that Huey does for me. We just know that he is an amazing, confident man. He's got a great sense of humor and he can take care of himself and he's one who has made it very clear that he wants us to enjoy the remainder of our time together and with our family. And we did have a wonderful family. Our daughter and her husband live on Lake Lanier, our daughter Donna and now we said that. They have a son, our first grandchild Tyler and he has a beautiful wife. They were just married in September and they live in Marietta. And then our son Russell and Heather Tankers leave, both live in Warner Robins. They have a daughter of Megan and she's a nursing student at West Georgia University. And they also have a son, a 15 year old son, Landon who enjoys playing baseball as a pitcher on varsity at Houston County High School and sometimes he plays as a middle fielder on junior varsity. They've been playing in tournaments for the past week or so and I've had the opportunity to watch him on video and I have squeezed in one game in person. But it's just amazing to watch him and as a 10th grader he's pitching between 81 and 83 mile per hour balls and they say his money maker is his curve ball. So we just look forward to and we're so excited that we're going to have unlimited time to travel around and see some exciting games gather as a family at the lake and just have time with each other to enjoy our home, our friends and our community. Of course and then there's the garden and he leaves new flock of chickens. On a side note I had to share with y'all in a previous group of chickens we raised from the Bitties we ended up with a handsome rooster that we named Mr. Speaker and he knows he knows that. And the funny thing about Mr. Speaker when we got these Bitties I think he ordered about 20 and we did not want roosters you don't have to have roosters to get eggs. But anyway we raised him from Bitties and finally they got big enough two of the red Bitties or red what we thought were red hens started crowing but the black hen or we thought the black one was a hen but we thought that's a pretty big hen. Well the two red roosters fought like crazy terrorized the hens and finally he got rid of them and then the big black hen started crowing and we named him Mr. Speaker. But he was so protective of those hens that if our friends came over in a golf cart to visit he would try to fly in the cart with them and go into the attack mode. So we finally just had to give him away and because we know that once a rooster becomes mean they never become nice again. So we think he ended up. Sorry Mr. Speaker. So I'm sad to say though I think he could may have ended up at somebody's Sunday dinner but anyway as far as politics go and that's why we're all here it's hard to believe that I've served in public office for a total of 27 years. My first political experience was serving on Brooklyn City Council and I stayed there for five years and I will tell you that what got me involved with that Kent City Council was because they had an awesome peanut festival every year and I worked with the committee that put that on and so then I went for 10 years with the Bullock County Board of Commissioners followed by 12 years here as a state representative in House District 160. It's interesting to know that I had the honor of serving as the first female to be elected and all three of these seats and that I was encouraged to run by a seated member of each of these bodies and of course they were all men they were great men but they were all men. I'm proud to say I've never lost an election during the last year that I served as a county commissioner I was also elected to serve as president of the Association of County Commissioners of Georgia. The funny thing is I really never wanted to be a politician and I heard someone else say that. I never intended to but I did volunteer a good bit in the community and love doing that but when I was asked for a by City Council member to run for Brooklyn City Council I remember emphatically saying no I don't want to be a politician. I said it and I thought of it as an undesirable thing to want to do. Of course as I learned over time it is an honor and a privilege to serve and I will forever remain grateful for this journey in my life. Today I especially want to thank Speaker Ralston for his strong leadership and his friendship over the past 12 years. He is someone that I tremendously respect. I believe him to be a very gifted leader who rules with compassion and he balances it with political prowess. More than anyone else I know he understands the needs of Georgians whether they live in rules or barben or metro areas of our state. The speaker is dedicated to this house and the people we serve in our wonderful state of Georgia. He often reminds us all not to introduce legislation unless the bill will dramatically improve the lives of all Georgians. This is great council and many of us and well all of us need to remember that wise advice. The speaker has graciously allowed me to serve as chairman of Intergovernmental Coordination Committee since 2013. That is a good call to get. When you get a call I was beginning my third year I believe and it was the speaker on the phone and that was an exciting day. That is phone call you want to get. But I have had so much pleasure. I have just been given the pleasure of working with each of you, your local governments and your constituents. I just want to thank you Mr. Speaker and you my friends and colleagues for giving me the honor of trusting me with your local issues. We have had a great team working on these bills during my nine years as chair and while there are too many to mention individually I would like to personally thank the clerk's office, the reapportionment office, legislative council, my admins, interns and aides especially Connor Cheely and my two policy analysts over the years, Leo Chansey and Blake Dawes. They have been such a valuable asset to me and just an absolute joy to work with and I know that they have interacted with probably every one of you on this house floor and they just do an amazing job. You all know that this has been a particularly busy committee this year but really it is busy every year and y'all are so good to wait till the last minute and get a lot of things done. But today we have processed almost 400 bills this session. That is a lot of bills. Thank you. And I know that this year has been rough for many of us especially regarding redistricting but during much time as chair of the local committee we have strived to keep this committee civil by treating one another with respect. It is my hope that house members will endeavor to keep this attitude and remember that there is much more that unites us than divides us. Don't forget that. You can't begin to appreciate that having served with men only until I was elected to the house how much I value serving with other strong women in leadership. Leaders like Speaker Pro Tem Jan Jones she has been both a mentor and a friend. When I came in I was so encouraged by the women that were already here and the women who came in with me like but the women who were already here some of those were people like Barbara Sam's Sharon Cooper, Katie Dempsey, Darling Taylor and Lynn Smith. This list also includes Penny Hausten and Lynn Riley. These two have truly become the sisters I always wish I had. I had two brothers one older one younger. Penny has an older brother and a younger brother and we had like sisters and Lynn has just been a wonderful friend to me and continues to be. I've been here while I shared a condo for about four years with Penny and prior to that with Lynn. Together with all these women we've laughed and celebrated life events and at times I'll just admit we've done a little plotting and planning on legislative issues, campaigns and life in general. I'm so encouraged and thankful for other women that have joined us over the past few years. I'm also proud of the fine men that I've served with in the past and those I'm serving with now. I have great respect for each of them and I've been so fortunate to have majority leader Burns and Chairman Butch Parrish as my fellow delegation members. Overall we have worked very well together. Serving the people I represent under the dome in this house and in this beautiful room has been one of the greatest honors of my life. There have been a lot of defining moments for me over the years but my time with each of you will remain as a cherished memory for many years to come. Thank you for everything. I love you all. A lady of pure class. We're going to suspend two or three minutes. Let you greet Chairman Tancersley. I would ask that you do that somewhat expeditiously though because we need to get onto the rules calendar. Okay, House will come back to order. House will come back to order. Ms. Clark, you want to ring the bell? Okay, we're on the rules calendar. We're going to ask House members that wish to listen to the presentations to take your seats. Those of you who have already read all the bills, the committee reports and everything else you can go outside and take your conversations with you when you go. We're going to do some work here and then we'll take a lunch break later on. Clark will read the caption to House Resolution 1025. House Resolution 1025 by Representative Williamson of the 115th and others recognizing copper as a critical of the state of Georgia and urging for its inclusion on the official United States Geological Survey critical minerals with this resolution. I have been assigned the committee on natural resources and environment that committee recommends that this resolution be adopted. Chair recognizes Representative Williamson to present the resolution. Thank you, Mr. Speaker. And Mr. Speaker, thank you for minding all of us. It's very important we read all the bills that comes for this body and I know that this house is read House Resolution 1025. It speaks for itself and I would urge you to vote yes to add copper to the US Geological Critical Minerals list. Mr. Speaker, I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution that Chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines.\n\nhave all members voted? If so, the clerk will lock the machines on the adoption of the resolution, the eyes are 162, the nays are one. This resolution having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 553. Senate Bill 553 by Senator Roberts of the 29th brass of 28 Jones, the 25th and others being taught an act to amend Article 1 of Chapter 7, Title 52. The fish go to Georgia and Tate overlaying the general religions of registration, operation, and sales of water craft. This bill have referred to the Committee on Game Fishing Parts. That Committee recommends this bill do pass. Chair recognizes Chairman Collins to present the bill. Thank you, Mr. Speaker. I come before this body today to present Senate Bill 553. It's a very simple piece of legislation that will allow those young people 15 years of age or older to operate Class 1, Class 2, and Class 3 vessels on our state waterways as long as they have a permit or identification and accompanied by an 18 year old adult who is authorized to operate such vessels. It's a very simple piece of legislation. Mr. Speaker, I'll yield the will. I think ask for your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The chair here is none. The report of the Committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 553. The eyes are 162. The nays are six. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to Senate Bill 363. Senate Bill 363 by Senator Tillery. The 19th brass of the 28th most of the 53rd and others. We get to the act to amend part two of Article 15 in Chapter 1 of Title 10 of the official to Georgia and Tederlady in the Fair of Business. Practice is active in 1975. It shows to provide for class action suits for damages. This bill then referred to the Committee on Judiciary that committee recommends that this bill do pass. Chair recognizes Representative Wheat-Hour to present the bill. Thank you, Ms. Speaker. Colleagues, I bring you Senate Bill 363. This is a continuation of a measure that I passed last year with your support House Bill 153. It's the solicitation for filings for the state that look much like state documents but are certainly not. This actually just allows for some teeth in the legislation that we put forward last year that allows for a $200 penalty per violation which would allow for actual class action lawsuits. Should these companies continue to act in such a manner? It's a good consumer protection bill. Mr. Speaker, I think it's as simple as that. I ask for your favorable consideration. I yield the well. Is there any objection to the previous question being ordered to chair? Here's none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee which was favorable to the passage of the bill? The chair here is none the report of the committee. Is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye? Those opposed will vote no and the clerk will unlock the machines. You have all members voted. Have all members voted. If so, the clerk will lock the machines on the passage of Senate Bill 363. The eyes are 169. The nasors zero this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 404. Senate Bill 404 by Senator Albers, 56. Robertson of the 29th. Mollins of the 53rd. No, there's Util and Act 2ment Article 3 chapter 11. Util of 31 of the Fisher go to Georgia and attated relating the emergency medical services personnel. So, it's to authorize the Georgia Bureau of Investigation. The Federal Bureau of Investigation to retain certain fingerprints under certain conditions. This bill then referred to the Committee on Public Safety and Homeland Security. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Brad Thomas to present the bill. Thank you, Mr. Speaker. Today, I present Senate Bill 404. This is an agency bill for the Georgia Department of Public Health and is supported by the EMS industry. Under current law, individuals seeking licensure as an emergency services personnel must submit a fingerprint criminal history check. Under this bill, the GBI would be authorized to retain fingerprints of emergency medical services personnel so that DPH can participate in a federal program run by the FBI called RAP back, allowing for ongoing review of individual's criminal history. This bill requires the DPH to notify the individual who fingerprints were taken of the parameters of such retention and it also requires that if an individual is no longer licensed by the DPH, the fingerprint records are removed from the system. This policies widely used by several sister agencies and with that, it's a pretty straightforward bill and I yield the well and ask for your favorable consideration. Thank you. Commissioner級 assessed position anything. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. All members voted. Yes, so the clerk will lock the machine on the passage of Senate Bill 404. The eyes are 159. The nays are six. This bill, having received the requisite constitutional majority, is therefore passed. The clerk agreed to caption the Senate Bill 343. Senate Bill 343, Senator Huffstadt, with a 50 second killery, the 19th or up of 36 and others, the Natal Act to amend, the Natal 47, the official go to Georgia, and the anti-delating of retirements and pensions. So, it will remove the prohibition of granting post-retirement benefit adjustments to any individual. This bill then referred to the committee on retirement. That committee recommends this bill do pass by committee substitute. Chair recognizes Chairman Carson to present the bill. Thank you, Mr. Speaker. Present to you the Senate bill 343 substitute. What this bill does now is increases the 401K contributions. This bill is an effort to move to more of a defined contribution plan for state employees, as well as increased state employee retention in the current job market. Currently, a state employee contributes 1%, and then the state matches half a percent for every additional 1% up to 5%. So if you contribute 5%, the state would match, it's going to be 2% to our total of 7. Under this bill, it's a simple dollar for dollar up to 5%. And after a year five of service, an additional half a percent per year up to a total of 9%. Ensured after 13 years or more of service to the state, an employee has state matching contributions of 9% maximum. This bill, you might notice on the second page, this bill also ensures that 4-footed leave is accounted to the state agency in which it is earned by the employee. Language in regard to co-lows and so forth has been removed. With that, Mr. Speaker, it's a very simple bill about 401K matching, and with that, Mr. Speaker, I will yield the will. Gentlemen, as yielded the will, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute to chair here's none? The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? So the clerk will lock the machines on the passage of Senate Bill 343. The eyes are 168. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes, Chairman Sam Watson for an announcement. Thank you, Mr. Speaker. Rua Caucus will meet upon adjournment for lunch today. And two of one at part of agriculture. We've got a chick fly there as our host today. Thank you. Chair recognizes representative Becky Evans for an announcement. With the cab delegation, we'll meet in person in room 514 with the hot lunch. Thank you. We might want to listen up. The chair recognizes the chairman of the House Rules Committee, Chairman Smith for an announcement. Thank you, Mr. Speaker. The House Rules Committee will meet at 130, 130, and we'll set the supplemental calendar for this afternoon. House Rules Committee is meeting at 130 this afternoon, 130. House will be in recess until 145 for lunch.",
  "updated_at": "2026-02-13T22:34:45.27069+00:00"
}