{
  "video_id": "XEKouvzGV14",
  "url": "https://www.youtube.com/watch?v=XEKouvzGV14",
  "title": "April 1st Rules Meeting for the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "# Georgia April 1st Rules Meeting for the 2025 Session\n\n## Overview\nThis session focused primarily on advancing several Senate bills, including SB 255 regarding the legislature's investigative powers and SB 125 related to plumbing work. The meeting was generally routine, with few notable moments beyond the standard bill considerations.\n\n## Key Actions\n**SB 255**: Bill regarding the legislature's investigative powers and subpoena authority\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this meeting.\n\n## Notable Moments\n- Prayer and opening remarks by the chair\n- Brief discussions on SB 291, SB 51, and SB 36\n\n## Votes\n- SB 125: Approved a rules substitute (LC 550644S) by unanimous vote\n- SB 5 (now HB 124): Adopted a rules substitute (LC 520855S) without opposition\n\n## Attendance\nQuorum was present, with no notes on attendance issues.\n\n## Adjournment\nThe meeting was adjourned. The next session is scheduled for April 2nd.",
  "transcript": "Good morning, everybody. Thank you for coming in. Go ahead and if you be seated we'll call the meeting to order, please.\nThank you, Mr. Chairman.\nLet us pray.\nFirst of all, in everlasting\ndollar eternal God, we thank you\nfor what we have done this year.\nWe thank you for the safety and\nprotection that you have provided.\nfinal days Lord continue to protect us but most of all continue to keep our\nminds stayed on you remind us that we are here to represent the people or we\nthank you and we raise you in mighty wonder and praise for the\ninduces name we pray amen thank you sir okay here's some of our senator\nfriends here. Good morning. Good morning. I know everybody's excited in the last\nweek of session but thank you all for your hard work and your cooperation with\nthe Senate this year. We've had a successful session and hope we can finish\nstrong on Friday night. I'm here to ask for Senate Bill 291. It's on the first\npage next to the last. It's a simple license plate bill. I've asked for a couple\nweeks ago and I just wanted to come back and ask you to consider putting it on\nthe floor this week in the house. Okay. Don't see any questions. Thank you. Thank you very much.\nSenator Cowden. Thank you, Mr. Chairman. Only bottom of page three SB 255 deals with the\nlegislature's investigative powers, especially investigative committees in subpoena power.\nour last report but wanted to remind you and ask for a favorable consideration to put that on the floor.\nOkay, thank you, sir. Don't see any questions. Thanks, Senator.\nSenator Sasser.\nMr. Chairman, bring before you a Senate Bill 51 deals with qualification-based qualifications in selection for architects and engineers.\nAnd I'd like to take questions on that, Mr. Chairman.\nOkay, don't see any questions. Thank you, sir. Also, Mr. Chairman, if it could,\nSenate Bill 36 bill that takes the federal protections for people to faith and\napplies those to city and state government. Okay, thank you, sir. Don't see any\nquestions. Thank you, Mr. Chairman. Thank you, Mr. Chairman.\nfour from the top in the first page House Resolution 368, a study, it's no longer a joint\nstudy committee but a half study committee to research and toxicating cannabinoids, both\nthe Department of Ag, those in public health and those in the industry all agree that\nbased on the lack of regulation for anything other than Delta 9,\nthe lack of clarity in policy, both federally and state,\nthat it would be a good time to come up with a resolution\non where the legislature stands on these substances.\nOK, thanks, sir.\nThank you.\nOK, we've got a few little housekeeping measures\nneed to deal with before we set a calendar. On Senate bill 125, we need a motion to withdraw\nthe previous room substitute, which was LC-550639S. Have a motion and a second to withdraw\nThat substitute now will recognize we appreciate to make a motion.\nGot it. Thank you, Mr. Chairman.\nI like to make a motion that we adopt.\nThe rules substitute to send it bill 125 LC 550644S.\nOkay, you have a motion in a second.\nYou want to explain that?\nYes, Mr. Chairman, there's only one one change in line 47474 and essentially what\nthe language said was that a plumber could not work within five foot of a\nbuilding and in a building and we just clarified that a plumber needs to be\nable to work within the building as well as outside the building. It was a catch by\none of our members and we've just changed the language to clarify the plumber's\nlove to do work inside of building as well as five foot within a building.\nOkay. Any questions?\nDon't see any questions.\nAll right. We have the motion in the second to approve that. Any opposition?\nOkay. The service approved. Okay.\nAll right. Chairman Linson.\nHere. The motion.\nOn Senate bill five by substitute LC 520855s. You all should have a copy of that on your desk\nYes, or mr\nChairman, I move that we adopt through substitute for Senate bill five LC 520855s\nHave a motion in a second. Okay. You want to explain to us what what that is Senate bill five is now\nHouse Bill 124, which was a PANs and PAN to Bill that we passed out unanimously\nseveral weeks ago. So all it is doing is changing the number.\nOkay, I have a question. Leader Hugley.\nYes, Mr. Chair. Thank you.\nSo the bill that had to do with cancer screening for prostate cancer has been removed from this and we're just we're just scripting everything out and just using pandas only is that what you're doing that is correct.\nOkay, is there any opposition to adopting that substitute here? No, it's adopted. Okay, now let's\nset a rules calendar for day 39, April the 2nd under modified structure. Senate Bill\nfive the rule substitute LC 52 0 8 5 5 s have a motion in a second is there any\nopposition it's on Senate bill 100 have a move in a second any opposition it's\non Senate bill 125 by rules substitute LC 55 0 6 4 4 S motion and second is\nany opposition it's on Senate bill 173 moved and seconded any opposition it's\non okay that'll get us started for tomorrow y'all have a good afternoon I know\nThank you very much.\n",
  "updated_at": "2026-02-12T17:18:59.650829+00:00"
}