{
  "video_id": "xG-pkTNkfsA",
  "url": "https://www.youtube.com/watch?v=xG-pkTNkfsA",
  "title": "3/23/23- Committee on Regulated Industries & Utilities",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 112,
  "summary": "Overview:\nThis Georgia legislative committee session focused on House Bill 336, which dealt with refrigerants. There was discussion around the ongoing process at the Department of Community Affairs (DCA) to address the issue through amendments, potentially making the bill unnecessary. The committee ultimately decided to table the bill, allowing the DCA process to continue before potentially revisiting it in the next legislative session.\n\nKey Actions:\n- **HB 336**: Bill related to refrigerants, tabled to allow DCA process to continue\n\nBills Introduced (First Reading):\n- None mentioned\n\nNotable Moments:\n- Testimony from Deidre Leclerc, an AI member and architect, who argued the bill was unnecessary given the DCA amendment process underway\n- Discussion between legislators on communicating with the DCA and potentially revisiting the bill next session if needed\n\nVotes:\n- Motion to table HB 336 passed\n\nAttendance:\n- Quorum present, no attendance issues noted\n\nAdjournment:\n- No specific adjournment time provided, but this was noted as the committee's last meeting of the current session.",
  "transcript": "you We have a forum now. We have three things on our agenda this morning. I'm going to take them a little bit out of order. House Bill 336, Representative Cox, you have presented this and we have heard testimony on it previously deals with refrigerants. There are two people with one person that signed up to be heard. I'm going to let them speak and then let you wrap up and we'll go ahead and take action on that bill. House Bill 336, Deidre Leclerc, if you would take the podium there, introduce yourself and give us your views on the bill. All right. Thank you. Thank you, Mr. Chairman and members of the committee. My name is Deidre Leclerc and I'd like to take a final opportunity to speak to House Bill 336. I am an AI member in an architect with SSOE Group. I've been very active in the building codes and fire codes development process through the state and also at the national level. I also represent AIA's national codes and standards committee as well as representing them on the fire code actually committee work groups for the international building, the International Code Council. I just wanted to add two new points. I understand that Ari and Dyken who are early proponents for this bill have withdrawn their statements and light of the imminent passage of the amendment at DCA through the SCAC, the State Code Advisory Committee and that it is extremely likely that it will pass and there is no reason to continue this redundant legislative path. And the second is that the DCA amendment process has been moving forward on these changes for nearly 18 months. There was a pause for basically for the state and the advocates, the building officials, the industry experts to learn and be educated about these refrigerants. And upon that happening they have now passed some wording, some language for Georgia amendment that we should see past later this year. And I want to take a moment just to reiterate the oppositions to the bill that were stated previously before the committee takes final action. We feel that it is a move point that we understand that this bill is eligible for reconsideration in 2024. And between the pressure it brought and the process that has already taken place and is nearly complete at the DCA, these refrigerants will enter the code later this year. We also feel that it was a dangerous precedent that had been set. The amendment that has been word smith at the DCA level through the State Code Advisory Committee is good. However, letting this bill progress any further will undermine the building code's amendment process established by the General Assembly. And this process was established many years ago as you know. It will basically ring the dinner bell and create what we call a slippery slope for every code amendment, every maybe not as well defined or well word smith code amendment process if it bypasses that process. And then finally, it tethers Georgia to the actions of the EPA. And as we will know, not everything that's done at the national or federal level is an ideal fit for Georgia. By this amendment going through the DCA process, it's been vetted. We understand that the people who need to be educated have now been educated. It's a process that works and we would like to see it continue to run through that process. And I'd like to thank the committee. I would like to encourage the no vote on House Bill 336. And I'm happy to take any questions that you may have. Any questions by the committee? Senator Braff, you're recognized for questions. Thank you, Mr. Chairman. You mentioned that language. Can you provide that language to the committee so that we can so that it can be seen? We can do that. That's no problem. Okay. Other questions about committee members? All right. Do you have that language with you? We can get that to you shortly. Okay. Further question? Senator Gail? Thank you, Mr. Chairman. I believe you said that I'm a three. I believe you said that this bill would be alive next year if we kill it this year. And just well so you know, if we do, it won't be alive next year. But if we table it, that's maybe an opportunity. So, want to make sure you're clear where we're headed. Thank you. Other questions from committee members? All right. Representative Cox, if you'd like to make any concluding remarks. Thanks again for hearing HB336. Just for the record, I want to make sure that you all each understand. I have yet to hear what the language is that was approved. I have yet to hear from AIA in my office after several meetings. I'm in support of DCA passing the languages as they see fit. But I just want you to know that I would really strongly encourage communication on what this language looks like, not based off of what the EPA says is approved. But also if the EPA decided something wasn't approved, that we protect the past as well as the future. So, that's important to me. And if I can, I would like to let Chairman Brass at this point speak. If you completed your comments, yes sir. I recognize Senator Summers for a question. Representative Cox, did you say DCA hadn't communicated with you on this bill or anything about what you're doing here? No, sir. No communication. Zero. Any further questions at this time from committee members? Senator again? Yeah. Thank you, Mr. Chairman. The resident of Cox, I know that you and I have just spoken and I will let you know that Commissioner Nguyen has just texted me and he's telling me not just working on it. It's a done deal. There are 21 industry professionals on state code advisory. They've been working up for 18 months. I don't have that language in front of me. I'm very supportive of your legislation. I want to see the move, but I also like to make sure that we give the executive ranch opportunity to address it. So would you be in support of letting us sit on this during this next off period? And then if something's not done, I'll be the first person to work on pushing your bill forward in our next legislative session. I would, would the communication from DCA that they're keeping me in the loop on the behold that we're trying to get through. So yes, I would be okay with that. So yeah, thank you, Representative Cox. Senator Brass, you're recognized. Thank you, Mr. Chairman. I think it's important that this bill does stay active. So I would urge that we not vote it down. And the reason it needs to stay active, in my opinion, is in case the department does not act and the communication doesn't get better between the department and the legislature, it is important that we have a good work in relationship. So in order to to encourage that, I would move that we table HB336 to keep it active for the second year of the biennial. That motion would have precedents over a motion to pass. There is a second from Senator Harvison, any further discussion on the motion to table or any response from the author? No, I'm okay with that. Thank you. All right, all in favor of the motion to table. Region. Any opposed? All right, that bill is tabled. It will remain in the rest of this committee. Generally speaking, the first week of the next session, they all get recommitted to the committees they came from. And it'll be available for action if necessary. If you're not satisfied with the DCA action before then. Okay, thank you for your time. Thank you. Okay, next bill we're going to take up is House Bill 458, Representative Perkel. There is a committee sub that been on the table up here all morning. All the committee members have the sub in their folders. I've got a couple of people that have wanted to speak the last two meetings. I think I've got just enough time for them. I need to ask you to keep your comments to three to five minutes. We have this is our last committee meeting. We have two bills left to act on. Chris, I don't know how to pronounce your last name, but you had signed up to speak on the the hemp bill. All right, we'll pass you then to the next bill. Mr. Rashan Bush from Lalu in the prizes. You hear this morning? All right, so you've signed up to speak on the hemp bill. You're recognized if you'll go to the podium. We heard you once before and you were wonderful. I'd love to see you in the additional comments you may have. How you doing today? That's great. I'm Rashan Bush. I live in Rinken, Georgia. As many of you already know, I've spoken here once before on this bill. I'm for it with exceptions of page three, line 66 and 67, which was just recently added. Luckily, I'm in on a knowing side. What is that line number again? 66 and 67? Okay, stand by and let me let the committee let everybody know what we've done in this committee. So that you can be knowledgeable in what you say. All right, committee members, we're working off of our committee substitute to House Bill 458. It's LC-44-238-9S. You will also have in your file the committee substitute as past the house. This is our committee sub. Just to give a brief overview, I think, you know, the enormous amount of testimony we had of concerns about the safety and the health of our citizens that are buying these products largely unregulated other than the federal government has ruled that Delta 9, which is really a synthetic THC, is a controlled substance so that can't be sold. Delta 8's what probably brought this bill to the forefront, which is another synthetic derivative of THC that is fit into a loophole of the federal laws and is being legally sold in a largely unregulated fashion. We heard from poison control saying how many increased of overdoses and problems we heard the lady from the labs yesterday saying how much THC is in some of these products as much as 40 grams of THC and some of them far in excess of what I think the general public expects. We've heard from the industry, including we're showing Bush here that these products are safe and there's a wide variety of products with different types of CBD, CBG's, all type of different cannabinoids in them that have great health benefits. A real tough problem with the regulation of these things, many coming from out of the country, foreign other states without being properly labeled or identified what's in them and certainly many of them not being tested. So I believe that was sort of the intent of two original bills that were introduced through the Senate. One was limiting the sale of Delta 8 altogether and limiting the sale of these products to people under 21. Originally it was under 18, got modified under 21. Another bill dealt with an entire licensing scheme to find a way to test and regulate these products through the Department of Agriculture. Our folders, gentlemen, you've got the letter we discussed previously from the Georgia Sheriff's Association that expresses their opposition to this. We also have a letter from the United States Department of Justice dated February 13th of this year to North Carolina that basically says, as I'm reading this letter, that the federal government has now the federal drug enforcement administration is now aware that the Delta 8 THCO is going to be a controlled substance that it is about to be illegal nationally. It's not yet, but it's a very clear indicator from this letter that it's just another derivative that's a synthetic THC. The line that of Rashan is speaking about there is a prohibition on the sale of products containing Delta 8 THC, Delta 9 THC or any other derivative of THC. It doesn't stop CBD oils or other CBGs, all the different derivatives of CB other than the synthetic THCs or other derivatives of THC, which is still a Schedule 1 controlled substance. So that is sort of an expansion of or a clarification of the bill that Senator Kay Kirkpatrick had earlier that was considered in the Senate that did not pass the Senate. The other things that this bill does, and I'll just sort of direct the committee, the guts of it will be it sets forth testing requirements and such on page 4 and lays out how we will do testing of these hemp products. And then on page 5 is the approach that I think encompasses everybody's ideas. Starting up at line 96, it has a section dealing with labeling of these products. There's no current Georgia law requiring any kind of labeling whatsoever. And this lays out that anybody selling these products is they're going to have to have clearly visible labels on them that tell the identity, the product name has to have the display panel of the ingredients, has to tell the quantity of all the contents in there. It has to give the ingredients of the hemp product in descending orderance of predominance by weight, the name of the manufacturer, the total amount of each cannabinoid per serving of these ingestible hemp products, and suggested use instructions and directions as some people mentioned. Nobody knows what quantity they should be taking to treat certain conditions and the expiration date. So we'll just call this the labeling section. It's to alert our citizens before they buy these products. What's in them? The second there beginning at line 110 deals with testing. And it says no retailer will be able to sell these consumable hemp products unless they have within the last 12 months had a full panel certificate analysis done. Can either have been done in the state of origin wherever it came or you need to do it. We had one very interesting lady from making that testified yesterday about her lab and they do this. It is available. And then we're going to let the Department of Agriculture randomly test these products that are being sold at retail to verify that they are accurately reflecting what's in them. We also have down here starting at line 129 on page 6 the issue that Senator Brass explored in detail is the size of the packaging. If you're going to be selling any of these products you can't have an individual dose over 25 milligrams or more than 500 milligrams in an individual package. The remainder of the bill deals with under 21 sales to under 21 people that you're not allowed to do that and it's in no changes whatsoever to your original form chairman purple. I have reviewed these changes with chairman purple and I let you speak to them when we get through but I felt like it was better let people know what we're doing. What this does not include is the licensing scheme where we had the Department of Agriculture licensing retailers before they were allowed to sell. It accomplishes the same goal without that ruler regulation by just saying you can't sell it unless it's been third party tested and it has to label and tell us what's in it and it has to be in these appropriate sizes to hopefully prevent overdoses. All right, I'm showing if you want to now pick back up that might help us. Yes, Senator Brass you recognize. Can we ask you questions real quick before the song gets going? Sure. So you keep referencing the letter and the letter from US Department of Justice is clearly stating that Delta 9 THCO and Delta 8 THCO do not occur naturally in their synthetic and therefore on on schedule one or their band substance. They say they do therefore do not fall under the definition of him. Okay, got you. But then go ahead. Okay, I'm sorry. And so then in line 66 and 67 and really throughout the bill you're not referencing THCO, you're referencing Delta 8 THC and Delta 9 THC which in my understanding is naturally occurring. And so my fear is when you number one in lines 18 and line three lines 20, we're now not compliant with federal law because you're banning all THC concentration or not banning but you're you're changing the definition and then in line 66 and 67 rather than ban the controlled substance which the letter references again THCO, you're banning Delta 8 THC Delta 9 THC in any derivative of THC. And if I'm reading this correctly and I'm asking the question am I reading it correctly. If we do that aren't we now banning CBD products, hemp products and medical marijuana. I don't think so. Because I mean this bill deals with hemp and that's at lines 18 this came from K Kirk Patrick's bill verbatim basically that was Senate bill 22 originally that got merged in with Senator Summers bill. What it's trying to do is what what the industry is doing is continuing to come up with different isomers which are combinations or synthetic compounds that I mean we've got Delta 6, we've got Delta 10 Delta 7 they'll just keep finding the loophole that's why this refers to any other derivatives there the federally defined level of corn to this letter now is that because Delta 9 THCO and Delta 8 THCO are controlled substances. I mean they're calling these now controlled substances and no longer within the federal definition of hemp. But they're referencing THCO, not TH, not Delta 8 and Delta 9 THC. And our speakers can can clarify that. I bet we're trying to capture any derivatives and I'm not the chemist to know what the deal one there not. Okay thank you. Senator again. And I'm trying to just model through this because chemistry is not my subject. I need it but if on the substitute if we added and so the THC just added THCO and on Delta 9 THCO and then where it talks about the other derivatives because I you know I'm thinking if you struck that portion out would that kind of clear it up so that we know okay here we're following the federal letter that you got and says hey here's a controlled substance but would that not clear it up for us. So now you're back to line 66 or on line 66, 67 and and and and oh behind the THC on both of those and then striking that section other derivative of THC you know because I think that that would be the one that would concern me where you know some of these people that need the CDB all or now remember we're not talking about other derivatives of you know or other derivatives of THC. Maybe you know maybe something on those lines I'm not sure. Okay I'll be receptive to that. Let's assume the test can help me out. Does it all right hold tight in any other questions. I'm just going ahead and resume. Okay. Are you not enlightening us some some of those distinctions as well. So you stated earlier that Delta 9 is a synthetic and it's not just as it's naturally occurring. Yes it is and so is Delta 8 and Delta 10 and smaller quantities then Delta 9 which is why they're saying that if you enact on the way that's written right now it actually affects legal marijuana as well. It'll put me out of business in the state. You're not selling legal marijuana at retail now anyway are you? No I'm talking about for your you're you're currently working on marijuana legislature correct. It's going to affect them. It's going to affect the committee that's licensed to sell. No. There's low THC oil products up to 5%. Okay I'm just explaining to you that all of that is if you put Delta 9 in there with any CBD Delta 8 anything that occurs in hemp and marijuana. They're cousin plants so if it's illegal right definition right here it's banned. Legal growers of marijuana as soon as it starts to have trichomes on it are going to be outside of the law. No they'll be inside the law under House Bill 196 and previous legislation that we've passed concerning medical marijuana and low THC oil products. They have a separate code section that makes theirs legal. So they're highly licensed and regulated. Two licenses have been granted. Four have been awarded but not issued yet. So what happens when this goes into effect and there's nobody able to sell Delta 8 or Delta 10 and people can order it online and then it's coming from other states and being so. The same thing has been happening for the last decades while Georgia tried to make it legal. Here's so people didn't have to do that. You default to federal law. Yes Senator Brass. Well you reference previous law. Yes the class one and class two would be covered under that except for section six all laws and parts of laws and conflict with this actor repealed. If we're within your substitute, within this substitute as we ban Delta 8 and Delta 9 and in any law and conflict with it that that laws is gone and we've wiped out medical marijuana. Let me check the legislative counsel. Put the childrens. Call them. So this man's everything. So is it your belief that if we pass any type of hemp bill it's going to interfere with our decade of work on medical marijuana. Okay. Question is chairman. Yeah question from Senator Summers. This is the year. Wouldn't it if we did this ban Georgia businesses but still allow outside businesses to do what they want to? No I wouldn't do that because they couldn't sell their products in our state without the labelling and without the testing and without complot retailers can't sell it. I miss Bush could continue to have other comments to my do. Line to addition to two. We couldn't understand what line number you mentioned. 241 to 243 for state revenue commission is authorized to make reasonable rules and regulations for the administration and enforcement of this article. Also lines number that is not a change that's in the original bill. Yes but I would prefer to be agricultural department department of ag exclusively. They're more aware of the plant the situation the growing process the processing process everything to deal with it you involve a additional department they're going to have to be advised by the ag department there it's going to create an issue for them. But exclusively for ag. But if this ball passes I would like to see it amended for what I spoke on. If not then I'd prefer to be thrown out table because it's going to put thousands of businesses out of business. In other words all these CBD businesses and all your franchises are only making their living by selling Delta 8 or Delta 9 products. No they'll be making that living outside of the state of Georgia.\n\nIf this passes. Is that all products you guys are selling? I thought you had all kind of derivatives that No, we have other other types, but you have to understand that there's traces of all of these in the products The only way to not have a trace of any of this in a full CBD product is to make your products from an isolate That's going to be a next an extra process for the only processor in the state to Make isolate once he makes isolate he's not going to do it for free or they're not going to do it for free That's going to increase the cost of the product And to be quite honest Hemp plants as a whole with every cannabinoid there and present is way more beneficial than Taking bits and pieces away Way more beneficial So I don't understand the Second gen ad made a great speech day before yesterday how we can be on the forefront We're not on the forefront If you take away wheels off of a running car It's harder for them to move forward There's already been proof shown through everybody that's testified that there's a selling base market for These products You had you referenced the poison control Department that came up here and spoke he spoke about how many calls there were he spoke about a child being put in ICU for 24 hours But he never spoke on what the treatment was for it. He never spoke on what the outcome was for it I'd be interested to hear that because if I were him in 30 years of doing that job I would have come with what the outcome was and why it should be banned So I just ask for all of you all to take a consideration that there's an entire industry that's already performing Already can add to the situation that's going on if it's revenue For a long term Not for short term Not for short term. It's We're here to stay and try to do business in Georgia. I live in Georgia. I love it. I Was born in Akron, Ohio didn't live there Move to Florida came to visit my mom in Georgia. I love Georgia and decided to stay I Don't plan on going anywhere even if you pass this bill. I don't plan on personally going anywhere It just makes it very difficult for Thousands of stores who have employees who have families who Help people to continue to operate And I just ask that you take that into consideration because I'm very Aware that I'm speaking to a panel that doesn't know what's going on in this bill or doesn't understand the plant a hundred percent Like I do how we do most of the people sitting in here right now who are concerned about The moving for this industry if you look at a lot of the other states that have legalized marijuana recreational and medicinal Their farmers still prefer to farm CBD Because the marijuana side has monopolized in a lot of these states Taken over and stopped getting it from multiple farmers So the marijuana game isn't the answer totally To to to farming for hemp or marijuana in the state Thank you so much, Ben with us Greg. We're Duke Greg if you keep your comments short, please you've been heard bust previously Dr. Greg Ridicca with Georgians for responsible marijuana policy and CBD and THC are two independent cannabinoids within marijuana so CBD is not a derivative of THC There are two separate cannabinoids two of the one hundred cannabinoids that are the most known to us So this this bill would not affect CBD sales Second, there's a definition for THC oil and products which is very different from this definition of hemp products So I don't see how a definition of hemp products would affect a definition of THC oil and products which is the Medical marijuana that we've been speaking of so I don't see any effect on that either And And as far as whether it's naturally occurring delta eight or synthetic delta eight That's really not the main point the main point in trying to close the delta eight loophole Which 14 states have already done and I get phone calls and emails just about every day from parents concerned about High THC delta eight products or what they think may be high THC delta eight products the problem is the THC percentage If the THC percentage is under point three, why is there a problem the gap the loophole has to do with delta eight products is high as 40% THC That's that's the problem and So I don't I don't really see problems with with this bill because of those facts I ain't questions Thank you. Dale. Would you or will speak to us quickly? Kind of call on you unexpectedly you didn't sign up, but I didn't under Comprehend this problem at the time either Thank you, Mr. Chairman. Just to the THC Yeah, just just to clarify the the letter from the DEA specifically says THCO now you got to remember delta eight and delta nine occur naturally in hemp plants That's it's there when we grow our plants any plant after you're going to have that in there By changing the federal definition which your your substitute does you're going to put us out of compliance with our federal hemp plan and you're going to put a huge You're not going to be able to grow hemp in Georgia effectively because this is directed only towards retailers But but you're changing of the definition affects the entirety of the plant from the beginning to the end leaving the O-A'll changes the definition in the THC O needs to be reinserted I Could let my agricultural commissioner explain that I will call the O-O O was an Esther in fact in representative perkel's bill We specifically it's specifically in there that esters Are included in the definition so you're gonna you're not gonna be allowed to sell THCO or delta eight O or any of the any of the esters at all period in addition So that that's already there. It's yes, sir. It's in there in addition The the language that specifically laid out the testing guidelines for residual solvents is going to get rid of 90% of the bad stuff that's on the market anyways because those products will not be able to pass the test and we heard from miss Nichols yesterday that the stuff being sold primarily in Georgia is stuff that does not meet the criteria in California in Colorado in other states. We're getting the residual junk in Georgia so Representative perkel's bill addresses I think it addresses the concerns that you have regarding poor quality material bad stuff And we try to streamline it as best as possible you can still have a market in the state But you're getting rid of the bad stuff that I think is what you're worried about But I'm really concerned about changing that federal definition in that top line to put us out of compliance with our Hinton bill and as Farmers were that we won't be able to grow because we won't be able to meet that total THC threshold We can meet the Delta 9 threshold which is what's in code and which is what the federal government allowed in the 2018 Farm bill but we won't be allowed to do it if you change this definition So what happens if the federal government follows through on this DEA letter and Deems Delta 8th T-8CO a controlled substance. Well Delta 8th CEO doesn't naturally occur in the plant Delta 8 does is just that ester that is synthetically created in finished products You know that's that's what you're trying to get rid of and we're totally agree with that you don't want synthetic products You want naturally occurring products so by changing that definition that you're changing the entire definition of the the hint program in the state And again representative Prickles bill when you talk when it talks about the esters of Delta 8 It does away with THC Delta 9th co Delta 8th so all of that It's it's in the it's in the language that passed the house Commissioner Harper would you like to be heard Thank you mr. Chairman. Thank you Thank you mr. Chairman. I will I'll speak to Mr. Wenger was referring to and and talk to some other stuff as well And I know you you referenced the the DEA letter. I think I think first off We have to to make sure that it's clear The DEA letter does specifically talk to THCO, but it also goes to furtherly discuss synthetics And what the DEA has said is that since because those are synthetic They are not legal under the federal definition Delta 9th which is the federal definition for help Is naturally occurring as mr. Wenger just said So the underlying substitute has been brought up by Chairman Braves has been brought up by mr. Bush has been brought up by mr. Wenger and others Not only does it put it as out of compliance with federal law and also make the plan that we have at the Department of Agriculture Outer Compliance with U.S. D.A. It also would basically completely Eliminate the hemp program of the state of Georgia Because it specifically speaks to Delta 9th C and not to what the DEA letter says So I think we have to ensure that we're differentiating between what the DEA has said and what is legal the DEA has not said that Delta 9 is illegal The DE DEA said that Delta 9th C O Is illegal because it's synthetic Which is accurate under federal law in hemp plants it has to be naturally occurring for it to be legal under the federal definition And because T H C O is not naturally occurring and because it is synthetic it is considered an illegal substance As long as it is naturally occurring which is what current Georgia law allows current Georgia law which by the way In my capacity and my firm of capacity chairman Corbett from the House and myself actually wrote the original hemp law in the state of Georgia So I have dove off into this issue multiple times. So I have a deep understanding of what the federal law says So I think in regards to the letter I think we have to make sure we're clear that there's a difference between synthetic and natural occurring So the underlying substitute will capture both natural occurring and synthetics Which then would not only put us out of compliance, but also Completely would do away with the hemp program in our state Look you've got your Copy with you. Yes, sir. So if on line 66 and 67 We did as Senator brass proposes and just add an O after the THC 8 and the O after the THC 9 and then delete any other derivative I think that will help that would it that would that would definitely go a long ways and ensuring that that gets addressed yes, sir But but before you get there though, I think we have to go to line 18 first and this is the next thing So by striking out delta nine. This is what puts us out of this is mainly what puts us out of compliance with federal at all It also is in conflict with with parts of the bill Hold on The way that reads on line 18 is a let's say you didn't strike delta nine And it said a delta nine THC concentration of not more than point three percent that is the current No, the current definition of in on the federal level is I will read it. I'll read it to you real quick. I got right here. Thank you, Mr. Chairman Any part of the point including seeds derivatives extracts cannabaldoids Isomers acid salt salts of isomers whether growing or not with a total delta nine THC concentration of not more than point three percent So delta nine is specific to the federal law. It's also specific to our hip plan that we had to submit to USDA So for us to be in compliance with USDA. We have to be in compliance with federal law So if we're not we're not basing Georgia law on what the federal law says then we would be out of compliance. So by striking the words Death to nine puts us out of compliance because of what federal law says It also would in in in going further I think there's two or three places. I do know one place in line 122 and 123 Where it says equal less than the federal define THC level for help well the federally defined THC level for help is Delta nine THC 0.3 percent and then in line 18 and in line One 90 we strike delta nine so by striking delta nine in those two places We're putting ourselves in conflict with the other part of the bill that specifically references the federal definition And where the federal definition is delta nine THC. So you think we fix this About doing what you have to you have to you would have to unstrike To put us in compliance to ensure we're in compliance with USDA You would have to strike delta nine on line 18 and it unstrike and also unstrike Delta nine on line 90 At a minimum and then I think if you do the THC or like you were discussing in regards to line 67 66 and 67 I think that would address that for now without digging digging too deep You got a view on whether passage of this law would in any way preempt or override our medical marijuana legislation I think to chairman brass is point. I mean, I think chairman brass brings up a good point in the The especially the section that in every bill that we have of all laws and That are that are in conflict with this would would be a would be impacted I do think that there is some concern in that regard. I mean, I think he brings up a valid point. Yes, sir Again, I'm not a I'm not an expert. I'm not an attorney. I'm not a lawyer But I think it's something that we I think it at best we would need to get legislative counsel to look at to ensure that we're not impacting The medical cannabis side as well, Mr. Chairman I Another question you as you've been the commissioner of agriculture now For what a couple of three months too much we're on day 38 of the session and this the first day you've come to test Upon this bill and it's been through the agriculture committee. It's been through this committee three hearings Have you noticed any of these defects? I mean these were in previous version of building failed on the senate floor the striking of belt and nine Mr. Mr. Chairman that was actually that was not in the previous bill. Yeah, it was in no sir I participated in the in the senate ad committee here. I was there. I did speak I've been involved on the house side with the house bill for 58 that passed I've attended every hearing and listened in you and I have met privately to discuss this issue and I've expressed my concerns to you there I told you the issues that I think we need to address and making sure that we get guard rails rails in place I know that my policy counsel and and my policy Director has spoke on this issue multiple times before committees on my behalf Well, I'm hesitant to go forward with the bill that might undermine all the work we've done on medical marijuana. I mean this whole hemp bill started in 2018 And we've been working for literally almost a decade on medical marijuana And if there's a possibility that our Actions here today if this gets signed in the wrong order whatever either one of the two bills is void I don't know that that's worth our Effort I'm concerned here On date 38 Senator summers. I'll recognize you for questions. Thank you, Mr. Chairman. Uh, Commissioner Would not the original bill and I know this Representative Perkel chairman Perkel's got over here when it listed all the conaminoy and all the synthetics and they wouldn't that basically Stop making synthetic conaminoy. I mean that would that would solve the problem his original bill. We wouldn't have that issue I think the underlying bill the original bill that chairman Perkel has that passed the house I think is a very good Definitely a good starting point and definitely a piece of legislation that heads us in the direction of aligning us to have a hemp industry in this state That that works allowing us to have a hemp industry in this state that is successful and And I appreciate the work that chairman Perkel did. I appreciate the work that you do That you did Chairman summers. I know you worked on that underlying bill also on the Senate side so I appreciate the efforts y'all have put into that And and chairman Perkel made this comment well. I think when he introduced the bill the first time no bill is perfect But and and and there is a process And I think there is there's always room for improvement and I think working through Some of the provisions of the substitute and even some of the provisions of the underlying bill I think there's a way that we can actually really come up with a really good A piece of legislation that can help us move forward to allow the industry to be successful um And there is some still some time in the process to allow that to happen look the process can continue to work You know, there's there's always the opportunity for conference committees and other things all y'all know we we might not only have But three legislative sessions on the floor downstairs for the Senate side, but uh, but y'all know that's a lot of time to do a lot of things around here uh, but uh I think I think it's important that we we try to ensure that we're we're putting in guard rails But at the same time allowing an industry to be successful in our state and um and and making that happen So but this is something we've been working on since about 16 or 17 I know you mentioned 2018 that was when the farm bill was passed We started working on the hit law in Georgia before that because we into an anticipation of the federal The changes on the federal level which it had already changed under the 14 farm bill We were working on it Before that so this is actually we've been we've been working on helping that in Georgia for six or seven years or longer Fall one last follow yes Making sure to make ensure this subject to is I personally feel like this should be under the department of agriculture You should be able to police the industry I to mr. Bishops point. I do agree with him. I think uh, we have the knowledge when it comes to the hip industry We understand the issues we understand the plant I do agree that that we should have that authority at the department of ag and ensuring that we're we're we have the the ability to completely regulate it from start to finish Senator dole is all recognized for thank mr. Chairman good morning commissioner. Thank you for being here You had an opportunity to see this letter from the sheriff's association this interview I briefly saw it this morning That was the first time I'd saw it I want your thoughts around what at least I see is there primary concerns in the second paragraph essentially they say Under current language contained in hb 458 which we go back to I guess the version is it past the house high THC content dealt to eight and delta 10 products will continue to be Easily accessible allowing increased online retail store purchases and then they reference 30 No, they're sorry the 40% THC etc What is um you're understanding is what this what is your understanding what the bill as it past the house will do Relative the delta eight and delta 10 and what do you think if if that house bill doesn't address it as you think it should be in as may but if it doesn't What do you think should be done and how would you I guess address the sheriff's association's concern? So without fully having time to really Comprehend exactly everything that they have in their letter I will I will say in regards to what is legal and what is not legal under the federal definition As long as we have the ability on the state to do the testing that we need to do to Especially when it comes to to the levels of point three percent THC as long as it meets the federal definition of adult and i unconscious Intration of point three percent THC under federal law it is legal and and so that's what we will we will work to enforce at the department we are working to enforce and we are Enforcing at the Department of Ag and we'll continue to do that Which is part of ensuring we have those guardrails which is where some of this testing language come from and the the underlying will That said Obviously that's up to mr. Chairman. That's a policy decision of the general assembly when it comes to those particular Different different arrays and and that's something I think y'all you as a body have to make that determination But but to your point if it has a delta nine THC concentration of point three percent of less It is legal under federal law and as long as it meets that definition under federal law That's what we will allow through the department of ag. Okay, follow mr. Chairman if it's okay You're you're finally the first person to distill this down in a way that I can understand so I appreciate that So federal law is silent when it comes to delta in delta ten regardless federal law says hip is point a concentration of Delta nine point three percent THC and that's that's all it says as long as it meets that requirement and it is not a synthetic It is naturally occurring it is legal under federal law Understood okay So what this bill is doing is essentially providing what's been referred to as the guardrails relates to testing and and Manufacturing but is silent currently well, I guess this version is not silent on Delta eight THC and what you're illuminating for us is Any regulation your mind of delta eight or delta ten regardless of THC even if we put delta ten it's a 10 percent THC as a limitation Your concern is that would put us out of step with the federal guidelines Not necessarily that my concern is if we touch T delta nine it puts us out of step with with the federal guidelines That's that's what we'll put us out of out of Compliance with the federal guidelines because the federal guidelines specifically talked to delta nine And in delta nine only so as long as we're as long as we're in compliance with federal guidelines when it comes to the delta nine THC concentration We are we are in compliance, but to your point like as you said earlier federal law is silent on the other provisions other than Symphetics which the DEA later speaks to the synthetics right Chair and council perhaps a follow-up for you if you've spoken with the Georgia Sheriff's Association is there Desire than that we act on some sort of THC level is it relates to eight and ten I haven't had that in depth of discussion other than their opposition to the bill All right, thank you very much. Commissioner appreciate your being here. Thank you Uh Senator Lucas you got a question? Yeah up And in the substitute it takes out delta eight and delta nine According to what the commission just said delta nine is legal if it's less What is it three percent? Yeah, you might have missed our earlier discussion There's been some discussion of amending that to make it delta nine THC And delta eight THC which are the synthetic components and that would address that concern And I think the commissioner agree with that chairman purple would you like to make a couple of closing comments? I'm gonna start you off. I did not change your language Very little in this bill other knows two definitions. We're talking about trying to capture Delta eight because of the federal DEA's instructions This deal about the revenue commissioner that was in your original bill. It's untouched. It's on lines 241 to 243 Is What's the reason that you left that in there for the revenue commissioner make these rules and regulations? So um Mr Chairman I'm I'm in an uncomfortable position here That I would have to respectfully disagree with you that that is The revenue commissioner is not in the language in my bill That That I see of the LC that we passed It is it is through the Department of Agriculture. So that is that is the commissioner of agriculture the commissioner of agriculture The commissioner of agriculture is listed in my bill so this might have been lifted from the cigarette Stature in my bed previous version or something, but it was not in the bill that passed the house so So i do have as other speakers have mentioned of course quite naturally um i think the The bill is as it passed the house and as as i have presented uh actually addresses the concerns we have regarding um The naturally occurring The deltas that are in the plant versus the synthetically produced which is not allowed in my bill There was one spot on the that has not been mentioned that i did have concerns with about the substitute Beginning on Besides the you know the delta non struck and unstruck It is online 122 Regarding testing um in compliance it says in the event that a test sample Reveals a concentration equal to or less than the fairly defined THC level for hemp that it will be destroyed I think that probably should be more If the THC level is more um but there again i do feel like the bill as presented Addresses the concerns that we have i actually do like the additional labeling Language that you have with the substitute But i would i really like the other i think as as presented Without these other Changes that we talked about there again. I think the original bill actually addressed the concerns that we had um But uh using a baseball analogy um i feel like with the substitute prior to amended It's like a picture walking on the baseball diamond and seeing angel Hernandez behind the plate And he's over on first base and behind second and on third I think it puts us in a worse position them where we were I Question for the sponsor If if in the event that the product is When they i guess crop it or whatever And it's above the level can they Reduce the level rather than Dispose of the whole month a bunch uh So the uh the answer is while i have never um grown Or processed it it's my understanding that there is a remediation Process that they can do which actually is not allowed in my bill so it is um If you have a higher THC concentration than what the the point three percent it will it must be destroyed because it falls outside Of what is federally allowable and what the state of Georgia has said is okay But it is possible yes sir absolutely All right uh get a question consider to breathe no no so a question mr chairman but for sacred time\n\nand spirit of keeping the bill moving along we've got some good suggestions from the commissioner at the proper time I'd like to make a motion so that we can get the posture to start making some amendments. The one here ready Mr. Chairman. I'm going to have to have a little consultation with the legislative council to make sure we don't have any unintended consequences. Thank you we appreciate yes sir. We're going to hold off on this if I get some clarification from the legislative council. You may have to take a break in a few minutes but let's go ahead is Senator excuse me is Chairman Powell available that we hadn't promoted him yet is he outside will you check? Yes please start with committee members. Yes while he's passing that out I'm wondering I don't know enough about this element up I'd be dangerous at this point but in terms of the definition I'm wondering if it might make more sense just to because the letter speaks to all synthetics would it not be wise to clarify Delta 9 THC with less than a point three percent and then any variant that is a synthetic. The THCO as I understand it is a synthetic would not be better to address all synthetics because that seems to be what the DEA is nature is. The A is saying what we were trying to capture in this maybe if we just put the O back on and change that to other synthetics though but yeah right yeah. Stead of derivatives that might be a wise way to go. Okay the our committee is passing out the substitute to House Bill 196 and we'll leave some up here on the table if anybody wants to get one to follow along I'm waiting on Chairman Powell to get here to present his bill. All right let's reconvene here in about three minutes we're going to reconvene give time for everybody get back in the room and our committee members. All right let's come back to order please. Chairman Powell if you will take the podium put my gun and get a copy of this. There's one on that table right there. Let me see your copy. Hey Dale see that old man in the grey coat how about smashing him by the way he stands between me and Chairman. All right we're now moving on to House Bill 196 it's a committee steps to copies were handed out during our break there in all committee members. Folders at this time so you can take a look at him. Chairman I'm going to make a couple of comments on it then then turn it over to you you and I have talked but only briefly as this is literally hot off the press. These are the the overload we're putting on our poor folks and legislative council this time of the year. We took some of your suggestions from even the substitute that you had on Senate Bill 97 that you shared with us to summarize that bill it had significant but essentially dismantling the commission that has issued these licenses and drawn so much fire and complaints over the last few years the long time it took for the license to be awarded and then the complaints with the process and the outcome and the ultimate license is being granted ended up in litigation. You'll notice in section one I've essentially delayed those desires in your substitute to abolish the commission but this in the first section allows the commissioner of agriculture to thoroughly study these issues and problems we've had relating to the regulation production distribution and use of medical cannabis in Georgia and to give us a report to the governor the lieutenant governor and the speaker on December 1st to recommend in any changes that he might have and those changes can include the regulation following under the Department of Agriculture just like they regulate him which we've all learned in this committee is the same cannabis that he have a plant just different strains or intensity of THC essentially so he's already set up and and doing some regulation there if that report were to come back that he felt like we should dismantle the commission and him to assume or his department to assume that regulatory authority and licensing authority and that's something we can deal with next legislative session. Going on to sections two we have left intact much of your bill the House bill 196 as it passed the House particularly your concerns that the commission fall under the open records act and the administrative procedures act so I have not in any way tampered with that initiative of your bill which made a lot of sense to us on this committee because the commission even if it never does get dismantled would be following the same rules and regulations and procedures that all other state agencies do. If I may ask a question to my distinguished friend under that will that not just going forward but upon signature long way would this also open up the records for what they have done for the last four years. Yeah and we kept it that way you had that on line 277 the action will become effective opponents approval by the governor or it's becoming law without such approval if he doesn't sign so this is going to happen in the next couple of months. Okay also left intact your issuance of an additional dispensing license to the class one licensees and class two production licensees at their production facility that is untouched unchanged in here we did change for future dispensing outlets we raised the number of patients on the red street before additional ones will come do since it had been intended the existing law once we reached 25,000 went above they were going to be eligible to well we're over 25,000 now and I expect that'll go up once we get these the product finally starts hidden the shelves so we changed that to every 75,000 once you hit 75 which must most of the predictions have been we're going to have 85,000 patients here in short order we'll find out. I also really liked your idea to let these dispensaries sell from other licensees not just themselves on lines 119 and 120 is your original language intact. Captain tacked your statewide business court language throughout the bill that if they're in the future so we're not bogged down in all this litigation statewide with all the unhappy parties complaining statewide business court has the capacity to handle it personnel to handle it the expertise to handle it and it's going to expedite things one change ahead on that is you had a provision in the house version required a bond and in the event you lost the appeal you forfeited the bond that is fairly unprecedented in civil litigation to make anybody that appeals and loses have to pay a bond it didn't set the amounts etc so that has been removed otherwise no changes whatsoever and that gets us down really to the the licensing which was one of your motivations as I understand it from our conversations and bringing this this bill was the frustration of licensees not being able to get them and getting bogged down and litigation over it and feel like the scoring was unfair etc as you've explained and many other witnesses have explained to us we had those type of problems that have come up your solution was really to give all the protested testing parties licenses and make you a shell there and then very rapidly increase the eligibility for future licenses this does not go that direction and you mentioned that you had conversations with leadership in the Senate while I have to and I've got pretty expressed marching orders that we're not going to just statutorily reward the protesters that lost but we're trying to fix the system so we can get this product to the shelves and another licensees to do it so it does include the triggers for future production licenses to be granted it doesn't start it till we get the 250,000 that's based largely on the testimony we've received here from the current licensees the two class one licensees each say they can handle 300,000 patients themselves so that'd be 600,000 if we can ever get through this morass of the class B licenses class two licenses get them online we probably double that production so it looks like we have enough capacity for up to a million patients already and we only have 26 or 7,000 on the list so that's we we're tipping our hat to those that lost and to you and your desire to make sure we have enough production out there through the licensees to take care of our patients in the state I am optimistic and hopeful as you are that the testimony that we've heard that the licensees that are up and running will be having the product on the shelves by June and I hope so the commission has assured us that they're going to issue the dispensary licenses in April so here in the few weeks and then we'll be up and ready to go now we'll see what happens but I am encouraged by that I heard that directly from the said Johnson the chairman of the commission so we'll find out if that goes as planned and if so hopefully they'll be relieved for the citizens of Georgia that that have been waiting I say patiently but I\n\nit's been patiently for the last four or five years for this to come into fruition. So that's my brief overview and I'd love to have your reactions. I'm sorry, you and I hadn't been able to go through it live. That's quite all right. And I certainly do appreciate the chairman and the work has been put into this as a substitute. Being a product of the legislature, I understand that this is only a path forward. This does not solve the immediate problem that we have citizens who've been waiting for four years. And it's not a perfect fix because as you had said, a lot of people have anxiety about issuing licenses to folks because they did go through with an appeal and it's tied up in the litigation. But the issues that I had brought forth was a direct fix to move it forward. Now, I would appreciate it and I appreciate all the work into this. And hopefully the committee will move this bill forward to let it go through the process. And hopefully there'll be a conference committee appointed and then we can sit down and talk and earn us about how to move something forward to the benefit of the citizens in Georgia. I don't believe there's anybody in the building that knows the process better than you. How many years have you served now? I have learned an awful lot from my dear friend from Athens over the years. I watch and learn from you. 34 years. How about 34? 34, going on 34 years. If this does move forward, hopefully the rules chairman will let it go to the floor. And certainly it would be amenable to changes on the floor of the Senate and the conference committee process as you know. I think we're all trying to get to the same solution, the same remedy. It's just we're concerned that even by issuing these licenses, you still got the delay before they could get to market. We've got some of them that have already been awarded but not yet issued their licenses that we'll probably be able to get to market quicker even if that will clear out. And I think this gives that time. But I've got a couple of people that have asked to speak and there may be questions for you from committee members. We've got some that went to committee on assignments meeting to make sure we know what we're going to be doing on the floor today. I'm going to refer to me to stay in case you have any other questions. Please do. Please stay. Okay. Chip Collins, I had you yesterday. You wanted to speak. Thank you, Mr. Chairman. Based on the substitute bill, I've got no comment today. Thank you. Wow. Maybe one of these subsidies got it right or closer to right. You see. Chris, I can't pronounce your last name. You have been here for four consecutive meetings and we haven't gotten to you and I'm not going to vote on anything until we get to hear your views. You are a patient to understand? Yes, sir. All right. Introduce yourself and give us a little background and tell us your. Okay. So I'm Chris. I previously was working with Reverend Gregory. You know, so I've seen a lot of patients. I have neurofibretosis, which is noncanthus tumors that grow in the body. So I've been able to use the oil and I encourage you to look up, run from the care rig simmonds into type of oil that's been working and I've been able to shrink tumors that grow on my body from neurofibretosis. I've been able to maintain, because of that, I was put on all kinds of opiates in my past, you know, my addiction ran and then through the oil and through the other oil, I've been able to shrink tumors, maintain my brain tumor and stabilize it and also maintain my recovery through the oil. So I just wanted to just share an app part and, you know, I'm from Fayville. There are lots of people down there who are interested and it's very hard to, and actually, I am going to reference in my book because I'm taking those classes from North Carolina and it says, right here it says that some of them, it folks on the tumor cells of the higher, combined on high dosage is what helps shrink it and then the lower dosages help with the immune. So neurofibretosis is an unimmune disorder. So it basically produces mass tumors that grow on the body, run them much. And through the oil and through that rig simmonds, I've been able to shrink tumors and have pictures and world evidence where the tumors have literally shrunken size. So I'm working with my doctor in Emory through the Wellness Clinic. They have a low THC clinic up there and they're interested in doing a study because of what I've been able to show, working with Reverend and all that. I've been able to literally shrink my tumors and in every other state, neurofibretosis is on the list by itself. In Georgia, the way it was was through integrated pain and seizures because it causes seizures as well. So I just asked that you consider that and take that part in a consideration on the different types of oils as far as that. So thank you. Let's see if we have any questions. So are you on the registry now? Yes, yes. And how long have you been on the registry? I've been on it for about three or four years. And you're having to renew that application there? You're out of service? Yes. Well, I had one doctor who looked at it and automatically because of the condition and other states, how it's already on there. She automatically gave it. But then I transferred it to Emory because he wants to open up the study with the NF from when I'd been able to show with the tumor shrinkage. But again, that goes to the percentage and the milligram. So yeah, high doses help the tumor shrink and then the lower doses help one with the immune. It helps that my not as much as the higher doses on the tumor. So I appreciate you hanging in here with us and I apologize. I didn't call you sooner. Yes sir. Because it's so important for us to hear from a patient. Yes sir. And let the reason we're doing this legislation is to help you and people with many of these other patients. Yes. And through working with Greg, I've met lots of patients. You know, I was able to work with some of them and just the things I've seen with those patients and the phone calls I still get of how to get a card and all the frustration. I've got people calling me all the time and I was able to now this is separate, but I've been able to get on the board with Peechronormal, where's the organization and help with that. So through that, we're able to educate. And again, I really encourage you guys to look at the classes that Dr. Nolanda is doing. It's a lot of information and I just encourage you to look into it because education like Peechronormal, it's all about the education and you know, living in California and then living in Georgia, you know, I could go to California, but ultimately Georgia's better. I've been able to maintain my recovery better out here in California. Thank you so much for being with us. Thank you. Appreciate you. All right, I have been shown to drafting errors in our committee sub that I would be responsive to a motion that included or gave authority for these drafting changes. One was in the instructions online 24 to the Commissioner of Agriculture to make this study of issues. The July 1st, 2023 date should have been prior to September 1st of 2023. July is too short of a fuse to give him time to do that. And then just in the section that lists the criteria for the new issued licenses, just a not a change of any language at all just to put it, a semi-colon and list them as one, two, and three, the conditions. So I would be receptive to the lines of that. One 72 up there, one 72. Yes, sir. Mr. Senator Lucas. In the substitute, do we do anything about the remediation if at the original testing? We've kind of changed subjects now. This is just medical marijuana and it doesn't deal with the remediation because there's not, we don't have the same limits on the hemp bill that applied. We moved on to the medical marijuana bill now. Your point was noted earlier, we're trying to redraft some information on that, so we can do. Okay. So I, the Chair, be receptive to a motion to do pass by committee substitute with those scrivener's errors changes. All right. Looks like it's going to fail for lack of a motion. So we've got a motion to do pass. Is there a second? Second. Any discussion? Would you like to make any final summation if you said you please, Mr. Chairman? All in favor raise your hand. And all opposed. Okay. Passes out unanimously. Thank you and thank you for your patience over multiple years. We will continue this through the legislative process. We are, we're going to stand recess for about two more minutes to wait on the leadership to return and then we'll resume. Two minute recess, standing recess. Thank you. Okay. We gavill in today at one o'clock, so looks like I'm about to lose my core many ways. meeting will be adjourned. Thank you.",
  "updated_at": "2026-02-14T01:28:06.785745+00:00"
}