{
  "video_id": "xgHpjnu9X6o",
  "url": "https://youtu.be/xgHpjnu9X6o?t=1778",
  "title": "Georgia House - Day 29 (2026-03-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 29,
  "video_date": "2026-03-16",
  "duration_minutes": 76,
  "summary": "Here is a summary of the Georgia House session on 2026-03-16:\n\n**Overview**\nThe session focused on routine legislative procedures and did not include any notable legislative actions or substantive debates. The Speaker commended the members for their hard work the previous day in passing 60 bills, though he acknowledged that many of them would likely be ignored in the Senate.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The session began with a devotion and prayer led by Representative Dale Washburn, who shared personal reflections on God's love, the gift of life, and the hope found in Jesus Christ.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe Speaker noted that all members were present after the \"late night\" the previous day.\n\n**Adjournment**\nThe session adjourned. No information was provided on the next scheduled meeting.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe hour of convening having arrived, all members of this house will please take their seats.\nAll members of this house will please take their seats.\nReport to the floor and take your seats.\nMr. Clark, would you ring the bell, please?\nYou\nYou\nAll right. We're going to have the morning roll call. All members present will\nplease vote green to signify their presence in the chamber and the clerk will\nunlock the machines.\nAll members voted have all members voted if so the clerk will lock them\nmachines. Doorkeepers will please close the doors and keep them closed. Well good\nafternoon. After the late night we had I'm not going to ask you to do any better\nthan that okay is that fair? It seemed like we were just left here but I want to\nI think the members of this house were your hard work and the way we kind of kept it in the road yesterday.\nWe passed, I don't think we've had that busy a day since the 12 years I've been here.\nWe passed 60 bills, 60 bills yesterday.\nthat's the good news. The reality is is that probably about 95% of them will be ignored\nwhen they get to the Senate so keep that in mind and I always try to remind people of that\nwhen we get to cross over that you know unless there's some value to you and sometimes there is\nof getting a bill out of the house. You know, they're going to operate on their own time\nas we will with their bills. Just saying. All right, we will begin our day with Scripture\nreading in prayer by the chaplain, after which we will pledge allegiance to the flag of our\ncountry. A chaplain this morning, I asked him how I should, how you'd like to be introduced.\nhe says, well, I'm not a preacher, not a lay speaker. I'm just a representative. And I\nfigure if Chairman England can get up and be a chaplain, I can too. So, you start the\ndreams of many, Mr. Chairman. But I'm talking about Representative Dale Washburn from the\n141st District has become a great member of this body, great friend, and whether he were\neither of those things I would have to say he's just a good, decent man that I'm honored\nto know and honored to have his friendship without a further ado, Representative Washburn\nfrom the 141st will bring our devotion\nand lead us in prayer and the pledge.\nRepresentative Washburn.\nWell, thank you, Mr. Speaker,\nfor the privilege of being the chapter of the day.\nAnd thank you for those very kind remarks.\nLadies and gentlemen of the House\nin the interest of full disclosure and confession,\nI am not an ordained minister as the preacher, as the speaker said, what I am is a deeply\nflawed individual. I'm a sinner, forgiven by God's grace, and Mr. Speaker, on that subject,\nI am not going to yield for questions. I expected I would get one from Jason Ridley,\nAmong others in the house, I am not a preacher, I am blessed to be a follower of Christ and\nmy comments here today will be based on my experience of living life for a while, and\nso I hope you'll be blessed by my observations.\nThere are three facts I want to share with you today to start with.\nOne is, God loves us.\nHe loves every one of us, he loves every one of you, he loves me, he loves all of us.\nThe second thing is an observation of mine after years of living is that life is a great\ngift from God.\nAnd the third thing is God wants us to enjoy life and to flourish in life.\nAnd I believe he has a plan for that and that's what I wanted to share with you today.\nI chose a scripture from Jeremiah 29,\nit'll be for me, your verses to you.\n11 verse 11 says, reads,\nfor I know the plans that I have for you,\ndeclares the Lord, plans for welfare and not for calamity,\nto give you a future and a hope.\nThen you will call upon me and come and pray to me\nand I will listen to you.\nThe truth is, God does love us and He does have a plan for us and as a follower of Christ\nI tell you that I deeply believe that plan is in His Son, Jesus Christ, what He gives\nus, when He sent His Son to us, He gives us forgiveness for the past, example and teaching\nfor today and hope for the future. And I want to talk about those three things very briefly.\nThe forgiveness for the past is a basic part of us being able to flourish in life. We're\nall sinners. The Bible tells us that in Romans 3.23 for all that's sinned and comes\nout of the glory of God. And every one of us, all we have to do is look around and we\nWe see evidence of that.\nI told you to start with, I am deeply flawed.\nI have appetites and weaknesses that I have to control carefully.\nMy sweet wife who's not with us today, you all know she's sitting back there in the back\ncorner when she is here, but she's heard me say that many times that I'm deeply flawed.\nAnd she told me one day, she said, you need to quit saying that.\nPeople are going to think you've done something awful.\nWell, the fact is I am deeply fraud and we all are.\nSo God sent His Son to down the cross for us to pay the price for our sins and if we\nwill avail ourselves of that and ask for His forgiveness, He forgives us and that is a key,\nkey, key part of flourishing in life as God wants us to because when you're able to\nread yourself of the guilt of sins you know you have committed and you let your head\non the pillow at night, and know that those sins are forgiven, and that you don't have\nto carry that guilt around with you, that's a key part of flourishing in life.\nThe second thing he does for us is give us an example in teaching for the day, either\nthrough the book, through the Word of God, or the Bible tells us that Jesus was the word\nmade flesh, who dwelt among us.\nI think about what Yogi Barra said, Yogi Barra was a great bad ball hitter, some of y'all\nremember Yogi Barra with the Yankees. He was noted to be a bad ball hitter and he was\na hitting coach after he played a few years and he was standing there one day on one foot\nand then the other watching a young guy trying to tell him what to do and finally he said,\njust get out of the way and watch me do it. Well, when God sent Jesus to be our perfect example,\nwe had that opportunity to watch him do it and to read about what he did. And we know what he\nHe did, of course, besides going to the cross.\nWhen He saw hungry people, He fed them.\nWhen He saw sick people, He healed them.\nAnd when He saw injustice, He stood up against it.\nMost of what Jesus did, He exhibited kindness.\nBut when He saw injustice, He did stand up against it.\nAnd I love that story, that part of the gospel, where He was over that of the side, making\nthat whip.\nI can just see his disciples standing there looking and saying, what are you doing?\nWhat are you going to do with that will?\nAnd I expect he said, just stand up and watch, you'll see in a minute.\nThere is a time for us to stand up against things that we know that are wrong and stand\nup against injustice.\nAnd he said that example for us.\nThe third thing he does is he gives us hope for the future.\nGod never promised us that we wouldn't be sick and that we would have a lot of money and\nthat we wouldn't have trouble.\nIn any TV preacher that tells you that, it's lying to you.\nEvery one of us have faced trouble in life and we will face more of it because every\none of us is going to have that conversation with a doctor at some point.\nIt is not going to be the news we want to hear.\nEvery one of us is going to get a phone call one day.\ngoing to be horrible news we don't want to hear. God never promised us otherwise, but\nhe did promise us he would never leave us or forsake us and he never does. Every one of\nus in the room could talk about terrible situations we've been through and when we look back\non it you don't know how we got through it, but we got through it because God was with\nus and the Holy Spirit carried us through it. And then, of course, the last thing is hope for the\neternal future. Because my belief is, if we trust Christ to save you, we are secured for eternity.\nGod does give us the plan to flourish and rife. And if we avail ourselves of that plan, we will\nplease him. And when you reach the point of flourishing in life, it will be that you\nhave reached that point of doing your best every day to please God. Jesus told us to take\nit a day at the time. He said sufficient to the day is the trouble of our off. And so\nevery one of us have the opportunity to get up every day to try to do what we can to please\nGod. And when we fail, we can lay our head on the pillow at night and confess that sin and ask\nto be forgiven of that sin and get up and start over another day. So I'll leave you with that today\nand this is if you don't remember anything else today and this is again, there's no self-righteousness\nhere. This just comes from a few years of living. There are many different levels of\ntown and ability in this chamber and everywhere we go in every circle. Different levels of town and\nability. Some people are smarter, some people are better communicators, some people have different levels\nof skill. Every one of us has equal ability to please God. That occurred to me a few years ago\nthat despite our levels of talent and ability, every one of us has equal talent and equal\nability to please God. If we will avail ourselves of the plan he has for us to flourish in life,\nwould you stand with me to pray? Now Father in heaven we are deeply and sincerely grateful\nthat you love us, that you created us, and gave us life, and that you have given us a plan\nto flourish in life. Lord, I want to thank You personally for the great privilege of serving\nin this house, and for the privilege of serving with these dear people. Lord, we pray that\nYou will bless every one of us, bless our families, keep them all safe, and bless them with\ngood health and happiness. We thank You again for this opportunity to be here today, and\nWe pray as we always do in Jesus' name. Amen.\nI pledge allegiance to the Black of the United States of America\nand to the Republic of Louisiana.\nOne nation under God, indivisible,\nto liberty and justice for all.\nThe doorkeepers will unlock the doors.\nChair recognizes Chairman Hogan, the Chair of the Committee on Information and\nAudits.\nThank you, Mr. Speaker, and that was a preacher, did a great job.\nMr. Speaker, your Committee on Information and Audits has read the journal of the previous\nlegislative day and found it to be correct.\nAnd I think it's about time for an Irish blessing.\nMay your troubles be less and your blessings be more.\nnothing but the tapiness comes through your door you know you've got a good one\nof those for tomorrow don't you okay Chairman Hogan the chair of the\nCommittee on Information and Audits reports that the journal of the\nprevious legislative day has been read and found to be correct is there any\nobjection to the confirmation of the journal the chair here's none in the\nThe journal is confirmed.\nThe clerk will read the resolution, establishing the order of business for the day.\nMr. Burns, on the 59th, following me, establishes the order of business to earn the first\npart of the security and animus consents, introduction of bills and resolutions, first reading\nand reference of house bills and resolutions, second reading of bills and resolutions, reports\nof standing committees, first reading in reference of Senate bills and resolutions, morning\norders.\nIs there any objection to the adoption of the resolution, establishing the order of\nbusiness for the day?\nThe chair here is none and the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 1564 by reps and approved of the 149th building talent act to provide for\nreinforcement of the election districts for the Wheeler County Board of Education.\nIntergovernmental coordination.\nBill 1565 by reps and a baller on the 163rd, Steven's on the 64th, Gillier on the 62nd\nJackson.\nThe 165th and Hitchens on the 61st, building talent act to men, that create the\nspan of development and renewal authority.\nIntergovernmental coordination.\nHouse Bill 1566 by reps and a house into the 170th building talent act to authorize\nassessment collection of a technology fee by the probate\nfor the intergovernmental coordination.\nThat's about 1567 by Representative Cameron.\nThe first and hill of the third Bill B.\nand Todd and Act to amend the act provide for the election\nof members of the day County Board of Education.\nIntergovernmental coordination.\nThat's about 1568 by Representative Williams\nand the 115th and Kirby and the 114th Bill B.\nand Todd and Act to create the Walton County Public\nFacilities.\nIntergovernmental coordination.\n1569 by Representative Scott of the 76th Jackson 64\nBeverly, the 143rd Davis, the 87th, Skullfield,\nand 60th, building a ton of active men.\nChapter three, a total of 50,\nthe official go to Georgia,\nand tentatively, the state flag,\nseal, and all the symbols.\nState properties.\nHouse bill 1570 by reps of the demonstration.\nThe 104th, rich, the 97th,\nthe Kenner to the 102nd,\nKendrick of the 9th,\nor Holcomb of the 81st and others,\nbuilding a ton of active men.\nAnd that can to continue to recreate\nthe state court or what that can.\nIntergovernmental coordination.\nHouse of resolution,\n1 by Representative Smith of 133rd Buckner, 137th Resolution Honor in the life of Reverend\nDr. Martin Luther King Jr.\nTransportation House Resolution 2002 by Representative Parrish, 158th Resolution\nHonor in the life of Sheriff Tyson Stevens.\nTransportation House Resolution 2023 by Representative Clark of the 108th Resolution,\nurging the Federal Railroad Administration to take action.\nTransportation House Resolution 1024 by Representative Kirby, the 114th Fourcries, the 157th\nKenner, the second carpenter of the 4th, parks 101st.\nResolution grading house, study committee on indexing maximum weekly workers compensation\nbenefits.\nIndustry and labor house resolution 1025 by resident of Williamson, 115th hatchet, 150th Jones\nto the 47th black man to the 146th, Fleming on the 121st.\nResolution recognizing carpers, coppers are critical to the state of Georgia.\nNatural resources and environments.\nResolution 1026 by resident of Nielu 74th, Gamble to the 15th, carpenter of the 4th,\nFourth, Washburn, the 141st Spinery, the 135th Resolution Creating House Study Committee on Economic Development Opportunities.\nThe Economic Development Intourism House of Resolution 1027, our reps of Clark, the 100th and 8th and Smith, the 133rd Resolution Creating House Study Committee on Railroad Crossing Block.\nTransportation.\nSenate Bill 76 by Senator Albers, 56 Roberts of the 29th, Dugan of the 30th, Karpatric of the 32nd, Kennedy of the 18th and others.\nThere'll be Todd and Active Men, Article 12,\nChapter 3, Title 38, Part 4 of Article 2,\nChapter 5, Title 46,\nthe physical to Georgia and Intended,\nrelating the emergency communications.\nPublic safety and homeland security.\nSenate Bill 96 by Senator Jackson,\nthe second Harveston of 15,\nJones of the 10th,\nRahman of the Fifth,\na bill to be Todd and Active Men,\nChapter 17, Title 45,\nthe physical to Georgia and Intended,\nrelating notaries public.\nDefense and veterans affairs.\nSenate Bill, fouls.\nOne hundred and eight by the center to that before to the 44th Butler and the 55th Anderson 43rd Sims the 12th Jones the 10th and others\nBuilding Todd and act to men title 30 the fish go to Georgia and tentative relating to handicap persons\nState planning and community affairs is Senate bill 167 by senator or rocker 36\nButler the 55th Jackson the 40 first Lucas the 26 Jones the 22nd and others\nwill be taught in active men chapter two taught of forty seven the fish go to\nGeorgia attended relating employees retirement system in Georgia retirement\ncentipil one seventy one by senator roverson the twenty nine thalvers fifty six\ndogged in the thirteenth Harper the seventh mollus fifty third and others\nwill be taught in active men titled sixteen the fish go to Georgia and\nthen are relaying crimes and offences judiciary non-civil centipil two\n27th Senator Jones the 22nd Jackson the 2nd Anderson the 43rd will be taught an act to men chapter 1\nTitle 22 the Fisher go to Georgia and Tito relating to general provisions regarding eminent domain\nGovernmental affairs Senate bill 267 by Senator Romano the 5th Mullis the 53rd House that was 52nd Butler the 5th\nJones the 22nd and others will be taught an act to men chapter 3 title 47 the Fisher go to Georgia and Tito relating the teachers retirement\nSenate Bill 279 by Senator Jones of the 43rd Jones of the 22nd, Lucas of the 26th.\nHarvesting the 15 Jones of the 10th and others.\nBill being titled an act to amend Chapter 3 to title 50, the district of Georgia,\nand 10th are willing to state flag.\nState properties.\nSenate Bill 5353 by Senator Thompson of the 14th, Dugan of the 30th,\nbeats to the 21st, Alvers of the 56th, McNeil of the 3rd and others.\nBill being titled an act to amend title 17, Chapter 5 of the title 40,\nthe district of Georgia, and 10th are relating to criminal procedure.\nJudiciary non-civil.\nSenate Bill 468 by Senator Jackson, 41st Albers, 56.\nRobertson, 29th Paine, 54th Jones, 22nd and others.\nIt'll be an active men part one of our compilers,\nchapter nine, and total 45 of these fish go to Jordan,\nand Tete, we're leading the general.\nGeorgia State in demification fund.\nPublic safety and homeland security.\nSenate Bill 470 by Senator Robertson,\n29th Albers, 56th Strictland, 17th Incher,\nPatrick, 30 second.\nBill Vintado, an act of men,\nArticle 13, Chapter 1,\nand Title VII, the fiscal to Georgia,\nand it's ended relating to licensing of March ledenters.\nBanks and banking.\nSenate Bill 474 by Senator Summers,\n13th Walker, the 20th Harper,\nthe seventh, good minute of the 8th,\nand Anderson the 24th.\nBill Vintado, an act of men,\npart one of Article 2, Chapter 5,\nand Title 48, the fiscal to Georgia,\nand it's ended relating to property tax exceptions.\nWays and means.\nSenate Bill 487 by Senator McNeil,\nthird, red of the 33rd, Gucci the 51st. James the 35th, Kirkpatrick the 32nd and\nothers. Bill B. Todd, an act to amend chapter 24, title 33, the fish go to\nGeorgia and tentative relating insurance generally insurance centipil 491 by\ncenter to have a quarter of the 44th Jones the 22nd Anderson the 43rd\nButler the 55th Tade of the 38th and others. Bill B. Todd, an act to amend\ntitle 48, the fish go to Georgia and tentative relating to revenue and\ntaxation. Ways and means\nSenate Bill 498 by Senator Tipens,\nthe 37th Miller, the 49th,\nDugan, the 30th, Mellos, the 53rd,\nAlvers, the 56th and others,\nBill B. Todd, an active men article on the chapter 14,\nto title 20 of the Fiscal of Georgia,\nand Tate of Religment,\ngeneral provisions relative to education, accountability.\nEducation.\nSenate Bill 504 by Senator Roberts,\nthe 29th, Alvers, the 56th,\nand a Devarte, the 31st,\nMellos, the 53rd,\nBill B. Todd, an active men article on the chapter 6,\nand title 17 of the Fiscal of Georgia,\nand Tate of Religment,\nin general provisions regarding bonds and recongresies.\nPublic safety and homeland security.\nSenate Bill 510 by Senator again to the 47th\nHouse of the 46th, Alberts of the 56th,\nAnderson to the 24th, Dugan to the 30th and others,\nbuilding town and active end code section 4524,\nthe fish go to Georgia and Tateau relating instruction permits.\nMotor vehicles.\nSenate Bill 512 by Senator Payne to the 54th,\nAlberts of the 56th, burns the 23rd.\nStettler the 52nd Anderson the 24th will be Todd and act to men part one of our\ntwo chapter 12 of title 16 if you should go to Georgia and Tito relating the\ngambling Judiciary non-civil Senate Bill 516 by Senator Robertson to the 29th\nMullis 53rd Anderson 24th group Patrick a 32nd Jackson the second and\nothers will be Todd and act to men part one of our two chapter 8 of Title 12\nwith the fiscal Georgia and Tito relating the general provisions of solid waste\nThe second place managed.\nWays and Main.\nSenate Bill 537 by Senator Jones, the 22nd.\nGooman in the 8th Jackson 2nd.\nSims in the 12th, red of the 33rd and others.\nBill M. Tonne, an active man.\nTitle 2 of the Fischkot of Georgia.\nAntieta relaying the Aggregulture.\nAggregulture and consumer affairs.\nSenate Bill 539 by Senator Hatcher.\n50th Mulles, the 53rd.\nKennedy in the 18th.\nAlvers in the 56th.\nWatson in the 1st and others.\nBill M. Tonne, an active man.\nPart 1 of Arc 3, Chapter 11.\nTitle 16 in the Fischkot of Georgia.\nAntieta relaying the wiretapping.\nJudiciary non-civil.\nSenate Bill 543 by Senator Alperon of the 39th parent of the 42nd\nJones of the 10th Jordan in 6th.\nStrictly the 17th bill be taught in active men.\nChapter 4 title 51 of the physical to Jordan Antony.\nWe're relating a wrongful death.\nJudiciary.\nSenate Bill 545 by Senator Alperon of the 39th Alvers of 56.\nRobertson the 29th.\nAntony DeVarte of the 31st Jones of the 10th and others.\nBill be taught in active men.\npart two of Article 6, Chapter 2, Title 20\nwith the official go to Georgia and Tate\nrelating to competencies and core curriculum.\nEducation.\nSenate Bill 553 by Senator Robertson,\n29th grass, the 28th Jones, the 25th Iowa, the 48th.\nAlvers, the 56th and others,\nwill be titled an act of men article in Chapter 7,\nTitle 52 with the official go to Georgia and Tate\nrelating to general provisions of registration.\nGame finishing, parks.\nSenate Bill 556 by Senator Thompson,\nthe 14th Alvers, the 56th, Dugan, the 30th.\nGoods to the 51st, Robertson 29th and others,\nbuilding title and act to men are two chapter five,\ntitle 40, the fish go to Georgia,\nthey're relating issues,\nexpiration and renewal of driver's licenses.\nMotor vehicles.\nSenate Bill 558 by Senator Goods to the 51st,\nagain to the 47th, Dugan in the 30th,\nDixon in the 45th, Watson in the 1st and others,\nbuilding title and act to men, chapter two,\na title 32, the fish go to Georgia,\nthey're relating department of transportation.\nTransportation.\nSenate Bill 565 by Senator Strickland in 17th,\nKirk, Kirk Patrick of 32nd Jones at 22nd Alvers at 56.\nRed of the 33rd.\nBill Nitton and active men are going to chapter 10 of Title 17\nin the physical to Georgia and TITTER relating\nthe procedure for sentencing and imposition\nof punishment.\nJudiciary non-civil.\nSenate Bill 566 by Senator Burke of the 11th\nHuffstint, letter of the 52nd Watson\nof the 1st, Kirk Patrick of the 32nd.\nDugan of the 30th and others,\nBill Nitton and active men, Title 33.\nThe physical to Georgia and TITTER relating\nthe issuance insurance.\nInsurance.\nSenate Bill 572 by Senator Mulles, 53rd Kennedy, 18th,\nHarvester, 15th, brass, 28th,\nBill B. Tyler, an act to amend.\nChapter 11 of the Title 40, 80th,\nfish go to Georgia,\nAntietta, relating to taxes on tobacco.\nWays and Mains.\nSenate Bill 573 by Senator brass,\n28th, walk to the 20th,\nRobertson, 29th,\nBill B. Tyler, an act to amend,\nchapter 7 of the Title 31 of the fish go to Georgia,\nand Antietta, relating to regulation\nand construction of hospitals.\nHealth and human services.\nSenate Bill 575 by Senate.\nTiffins at 37th,\nBill B. Todd and active men chapter two,\na title 20, the Fisher go to Georgia,\nand Tate, really an elementary and secondary education.\nEducation.\nSenate Bill 576 by Senate.\nStrickland of the 17th,\nBill B. Todd and active men code section 1973,\nthe Fisher go to Georgia,\nand Tate, really an actions by grandparents\nor other family members.\nJudiciary.\nSenate Bill 581 by Senate,\nwill walk her the 20th,\nget into the 47th,\ngo to the 51st,\ndo it in the 30th,\nmilling the 49th,\nBill B. Todd and active men chapter four,\nTitle 44, the fiscal to Georgia and Teddy Reliegnet,\ndetermination of boundaries.\nSmall business development.\nSenate Bill 588, by Senator Miller,\nthe 49th, Albrecht, the 56th,\nand a part day, the 31st,\nsix in the 45th, and Harvard in the 16th.\nBill Mintata, an act of NARC,\nthree, chapter two, title 20,\nthe fiscal to Georgia and Teddy Reliegnet,\nthe local boards of education.\nEducation.\nSenate Bill 591, by Senator Hatches,\nthe 50th, again in the 47th.\nBill Mintata, an act of NARC,\n14, chapter one, title 10 of the fish go to Georgia and\ntentative relating to secondary metal recyclers.\nJudiciary non civil Senate bill 603,\nbut Senator ramen of the fifth and hatched in the 50th\nbuilding, Todd and act to men are going to chapter two,\ntitle 20, the fish go to Georgia and it did it relating to\npublic school, property and facilities.\nEducation,\nso five by Senator Burke with the 11th,\nbuilding, Todd and act to men are five chapter eight,\na total 34 of the fish go to Georgia and tentative relating\nto contributions,\npayments in lieu of contributions relative to employment security industry and\nlabor. Senate Bill 609 by Senator Mulles the 53rd Anderson 24th Sims the\n12th again in the 47th Jones the 22nd and others will be taught an act to\namend articles 9 of chapter 12 title 16 the fish go to Georgia annotated\nrelaying access to medical cannabis. Regulated industry\nSenate Bill 6th and by Senator Harold the 40th birthday of the 11th duke in\nthe 30th but with the 55th Watson the first and others will be taught an act of\nmen aren't in the 7th chapter 4, title 49, the EFIS go to Georgia Antietta, relating medical\nassistance generally.\nHuman relations and aging.\nSenate Resolution 463 by Senator Gucci 51st, cows into the 46th, Kennedy the 18th,\nagain to the 47th, Miller to the 49th and others, a resolution creating the Joint Study\nCommittee on the Electrification and Transportation.\nSenate Resolution 596 by Senator again to the 47th, Dugan to the 30th, cows to the 46th,\nwith 49th. Good to the 51st and others. Resolution honoring the life and memory of Mr. Isaiah Berry.\nTransportation. Resolution 623 by Senate. Tiffins the 37th resolution proposing a member\nof the Constitution so to provide for staggered four year terms of office for veterans of Senate.\nSpecial committee on election integrity.\nThat completes first readers. Second reading of bills and resolutions, the clerical read.\nHouse Bill 1555, by reps of Gailer to the 160 second.\nWilenski of the 79th, Bowdie of the 62nd, Scott of the 76th.\nBeverly of the 143rd and others that bill relating to general provisions regarding the Department of Community Affairs.\nHouse Bill 1556, by reps of Martin of the 49th Jones of the 47th Jones of the 25th Cantrell of the 22nd Rubber Show of the 48th.\nI'm built to provide for a new home set exemption from Colton County, School District, Edward Lorm Taxes for educational purposes.\nHouse Bill 1558 by reps of Smirav 135th Smith of the 134th.\nHughley of the 136th Buckner of the 137th Smith of the 133rd.\nA bill to amend an act providing a new charter for the countywide government of Columbus.\nHouse Bill 1559 by reps of Stevens of the 164th, Newton of the 123rd.\nGamble of the 15th, Cousher of the 50th, Kelly of the 16th, the bill relating to pharmacists and pharmacies.\nHouse Bill 1560 by reps of Hughley of the 136th, the Smirav 135th.\nThe bill to create a new judicial circuit for the state of Georgia, House Bill 1561 by\nrepresent Bentley of the 139th, a bill to a midnight providing a new board of education\nfor the Macon County School District, House Bill 1562, by Representative Ralston of\nthe 7th, the bill to authorize the assessment and collection of a technology fee by the\nprobate court of Gilmer County, House Bill 1563 by Representative Blackman of the 146,\nHolcomb of the 81st, Burns of the 159th, Buckner of the 137th, Stevens of the 164th and\nothers, a bill relating to the imposition rate, computation,\nexemptions, and credit relative to state income taxes, House\nResolution 998, my reps of Cooper of the 43rd, Hawkins of the\n27th lot of the 120 second Hutchinson of the 107th, House of\nthe 170th, Resolution recognizing the benefits of biomarker\ntesting, it's a necessary part of precision medicine, House\nResolution 999, by reps of Torby of the 114th, Smired of the\n135th, Jasper's of the 11th, Weed Hour of the 119th, Dickey of\nthe 140th and others, Resolution urging the Georgia Department\ntransportation to study truck safety and to consider permitting such vehicles to use\nthe far left lane of travel. House resolution 1,000 by representatives of the\n154th Lewis Board of the 109th Thomas of the 65th, Holly of the 111th McLean of the 51st,\nresolution creating joint study committee for promotion and assistance of small farmers.\nSenate Bill 54 by Senator Harbson of the 15th, Jordan of the 6th, Miller of the 49th\nButler of the 55th Brahmin of the 5th and others, a bill relating to general provisions regarding\nchild custody proceedings. Senate Bill 339 by Senator Kirkpatrick of the 32nd\nAlbers of the 56th Dougan of the 30th Kennedy of the 18th Harborson of the 15th\nand others. A bill relating to the Georgia Bureau of Investigation. Senate\nbill 357 by Senator Kirkpatrick of the 32nd. Chillary of the 19th\nwalk of the 3rd of the 20th Harborson of the 15th Pratt of the 33rd\nand others. A bill relating to military student transfers. Senate Bill 359 by\nSenator Albers of the 56th Robertson of the 29th Miller of the 49th Dougan of\nof the 30th perpetrator of the 32nd and others,\na bill relating to general provisions concerning courts,\nSenate Bill 377 by Senator Hatcher\nof the 50th Duggan of the 30th,\nMullis of the 53rd Miller of the 49th,\nGugia of the 51st and others,\na bill relating to education and state government,\nSenate Bill 378,\nSenator Albers of the 56th,\nMullis of the 53rd Kennedy of the 18th,\nGugia of the 51st,\nBeach of the 21st and others,\na bill relating to reckless conduct,\nSenate Bill 519 by Senator Tipton,\nof the 37th Robinson of the 29th,\nGugia of the 51st Duggan of the 30th Kennedy\nof the 18th and others,\nbill relating to solicitors, general of state courts, Senate bill 3534 by\nSenator Kennedy of the 18th Miller of the 49th talking of the 30th\nGoods of the 51st Mellers of the 53rd and others, a bill relating to state\ngovernment, Senate bill 586 by Senator Goods of the 51st talking of the 30th\nWatson of the 1st Anniversary of the 31st again in the 47th and others, a bill\nrelating to exercise, exercise by counties of power of contracts for road\nprojects. Senate bill 612 by Senator Jones of the 10th and\nStrickland of the 17th, a bill to amend the next to provide a new charter for the city of Stockbridge through second readers\nReports of standing committees\nClarke worried\n49 district chairman committee on higher education submit to the following report was speaking committee on higher education\nis done on a consideration following resolution of the House and struck the meeting reports the same back to the House of following recommendation\nHouse resolution 898 to pass by committee substitute\nrespectively submitted represent Mark and 49th district\nChairman that completes the report the reading the reports standing committees\ncommittee. Okay, we're going on now to morning orders, going on to morning orders.\nof 10 minutes. One and a half minutes per order. Chair recognizes representative Ken\nTrail for a morning order. afternoon colleagues. Apparently spring and\nforward this past weekend knock some sense into the US Senate and you may have\nnoticed yesterday they passed permanent daylight saving time out of the US\nSenate. So now it goes on to the House of Representatives. Now I would venture to\nsay that all of us in this room know at least one or two Congress people that\nwe could reach out to and urge them to strike while the fires hot. Let's get\nthis thing done and let's put it to bed once and for all. Now that it wouldn't\ntake effect until November of next year. So we'd have about a year and a half\nrun up. So we've got one more fall back and one more spring forward between now\nand then but we could get this ridiculous ridiculousness done with and move\nforward and lock the clock once and for all. So I appreciate your help with\nthat. Thank you Mr. Speaker. Chair recognizes representative Wynn for a\nGood morning, order.\nThank you, Mr. Speaker.\nA year ago today, eight people were brutally murdered\nby a lone gunman.\nSix of the lives lost were Asian women.\nAnd in the following days, we would learn more\nhorrific details about the tragedy.\nHow the accused drove from Cherokee County to Atlanta,\ntargeting three Asian owned businesses,\nand inflicting unapologetic violence\non Asian women who are working in a vulnerable industry\nduring the height of the pandemic.\nAnd it would take days for us to learn anything\nmeaningful about the victims, including their names.\nLater, we would learn the victims for grandmothers,\nmothers, sisters, many of whom came to our country\nto escape poverty and to build American dreams.\nBut their dreams were never fulfilled.\nThey were robbed of their lives,\nleaving behind their parents, children, and grandchildren.\nAnd for one victim, six days passed\nbefore her family members abroad,\neven learned that she was among those who were killed.\nAnd her body laid unclaimed in that county morgue\nfor 19 days.\nHer funeral was attended by strangers,\nno family members, no friends, no colleagues.\nA year has passed and hate crimes against Asian people\nin our country has increased by 336%.\nSo today, on this one-year anniversary,\nlet us reaffirm our commitment to this fight\nagainst hate, racism, xenophobia, gender-based violence,\nand not just for the Asian community,\nbut for the black community, the undocumented,\nthe LGBTQ community, the Jewish community,\nthe Muslim community, and for all those who have been impacted\nby the same system of oppression\nthat took away eight lives last year.\nThank you, Mr. Speaker, I yield the well.\nChair recognizes Representative Paris\nfor a morning order.\nThank you Mr. Speaker. I don't really have a morning order. This is more like a moment\nof personal privilege. I've got two birthdays and one is my daughter that's out in California.\nLeah, happy birthday, happy birthday. I love you. And the other is I have a visitor back\nback her name is Emma she's my granddaughter and her birthday is on Sunday so\ny'all wish your happy birthday right quick for me please happy birthday honey I\nlove you thank you mr. Speaker chair recognizes representative Hutchinson\nfor a morning order thank you mr. Speaker and good afternoon colleagues today\nToday I bring to you Ilyana. Ilyana is a 16 year old girl who enjoys spending time with\nher family, dancing, playing cards, watching football, and enjoys reading, cheerleading,\nromantic movies, the Bulldogs, and a show named Degrossi. I googled it, it's a Canadian\nshow. But I did want to say we have to connect what we do in this body to who we work for.\nAnd yesterday, my good friend, Representative Weed Hour,\nRepresentative Thomas introduced a bill that talked about\nindependent limbic programs.\nAt 16, Ilyana would be in one of those programs.\nAnd God forbid, we don't find her a forever family.\nShe will learn how to be an adult in one of those programs.\nSo thank you to this body.\nThank you to my good friend, Mr. Weed Hour,\nRepresentative Weed Hour.\nAnd thank you for doing this for the adopted children\nin the state of Georgia.\nThank you, Mr. Speaker, here they are.\nChair recognizes Representative Nelson\nfor a morning order.\nThank you, Mr. Speaker.\nGood afternoon, colleagues.\nWe come today to talk about our high school\nteams from Augusta.\nOn last week in class 2A, we had two local teams,\nButler High School, and West Side\nthat competed for the state championship in basketball.\nAnd of course, West Side was the winners.\nWe were proud of both of our teams.\nAnd on Friday, Cross Creek, Razorbacks\nwas also a back-to-back winner in the high school.\nWe commend our students, our staff,\nour administrators, and our coaches.\nAnd we really, really, really continue\nto pray for all of our athletes\nthat this is their ticket to the next level in competition.\nThank you, and we yield the well.\nChair recognizes the Dean of this House, Dean Smirey, representative of Nullowitz and\nChairman Knight for a morning order.\nGood afternoon, everyone.\nThank you, Mr. Speaker.\nWe are here today on behalf of the Georgia Japan Caucus to share that we're getting news\nout of Japan that a powerful magnitude 7.3 earthquake struck there earlier today, almost\nclose to midnight in Japan.\nThis is near Fukushima, Japan, which is where almost to the day, 11 years ago, a devastating\nnine magnitude earthquake, tsunami, and ultimately 19,000 people were killed, followed by also\na devastating nuclear disaster. We don't have a indication yet of how many deaths there\nmight be of what's happened. This was a 7.3 magnitude earthquake. Thankfully, the news\ndoes indicate we shouldn't expect any devastated tsunamis, but we do want to stand here united\nwith our friends from Japan who are here across Georgia and our friends who are in Japan.\nThank you.\nThat is all of our morning orders for today.\nThe clerk will read the caption to a group of privileged resolutions honoring the life\nand memory of Jonathan Grant, recognizing coach Greg Chinute and the EC Bullets' Faths\npitch softball organization recognized in June 6, 2022 as women's golf day,\nrecognizing commending in southwest Guinet Chamber of Commerce. Congratulations and\nlove joy high schools girls basketball team for winning the 2021-2022 GHSA\nclass 6A State Basketball Championship, commending feeding the Valley\nFood Bank and recognizing May 4, 2022 as maternal mental health day in\nGeorgia and for other purposes that completes the reading of privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here is none and the resolutions are adopted.\nWe only have one announcement.\nOne announcement.\nWe're going on to announcements.\nNow, if you have signed up, then make you\naway to the front of the chamber.\nChair recognizes representative Gullet\nfor an announcement.\nHey, just a reminder for Governor LaFaire's\nwill be meeting today and meeting upon adjournment.\nI don't know what room it is, I think it's 406.\nSo, thank you.\nThat completes our announcements.\nChair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move to this House stand adjourned until 10 a.m. Thursday, March 17, 2022.\nThe party leader has moved that this house be adjourned until Thursday, March 17, which\nhappens to be St. Patrick's Day, 2022.\nAll those in favor of the motion will say aye.\nAll those opposed will say no.\nThe eyes have it, this house will be adjourned until Thursday, March 17 at 10 a.m.\n",
  "updated_at": "2026-02-12T13:44:05.399198+00:00"
}