{
  "video_id": "XMc9Ge_2STI",
  "url": "https://youtu.be/XMc9Ge_2STI?t=1426",
  "title": "Georgia House - Day 3 (2026-01-15)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": "2026-01-15",
  "duration_minutes": 98,
  "summary": "Here is a summary of the Georgia House session transcript from 2026-01-15:\n\n**Overview**\nThe session featured a prayer and scripture reading by Representative Carmen Rice's brother, Pastor Jerry Aiken. Pastor Aiken gave a sermon emphasizing the responsibility that comes with leadership and power, drawing from the teachings of Jesus.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Representative Carmen Rice introduced her brother, Pastor Jerry Aiken, as the guest chaplain for the day. She spoke about his background and her close relationship with him.\n- Pastor Aiken gave a sermon about servant leadership, quoting and drawing lessons from the teachings of Jesus. He emphasized the responsibility that comes with power and leadership.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nA quorum was present, as all members voted on the morning roll call.\n\n**Adjournment**\nThe session was adjourned, with no specific note of the next scheduled session date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you We're going to have the morning row call all members present will please vote green to signify your presence in the chamber. Mr. Clerk, will you unlock the machines? Proceed. have all members voted, all members. All members voted, this so. Demetrious you in yet? Now you will be. I was waiting on Representative Douglas and he's here so we can get started. All members voted if so, Mr. Clerk, will you lock the machines? Doorkeepers will you please close the doors and keep them closed. As is our custom today, we will begin our day with scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. That was special chaplain today, but I'll let the, let our member tell you about that special, how special he is to her and his family. But our chaplain they will be introduced by Representative from Overing Columbus, from the 139th House District, Representative Carmen Rice. Representative Rice. Thank you, Mr. Speaker. Good morning all. This is a day that the Lord has made. We will rejoice and be glad in it. I'm so honored to be here with you today and the privilege of introducing you to my pastor. And my pastor, he graduated from University of Alabama with his bachelors. He went to Emory for his masters and he recently got his doctorate at Duke University. And it is my honor and privilege to introduce him as my pastor because he's also...\n\nmy brother. And so just and and the irony of having my younger brother as the pastor of my church, so he preaches to me every week, which I'm sure gives him some distinct pleasure. But anyway, I'm honored to have him here today. It's been a journey as his older sister watching God bring him to this point of sharing and he has such a good heart and and care for people and such a discerning spirit and I'm honored to have him here today and I'm also honored to have my mom, my mom Donna Aiken is here. So I'm very blessed with the family. I have three siblings and we're all very close and I'm very thankful for that and don't type that for granted. So without further ado, I'd like to introduce you to my brother Jerry Aiken. Thank you representative rice. I'll call you that here. Good morning servant leaders. I love that term servant leaders because any of us who are blessed with the privilege and the responsibility to lead must always be ready to temper that power with a willingness to serve. As a pastor, one of my favorite things is to be able to share with people that Jesus said that first we have idioms and phrases and proverbs that are so ingrained in our culture and in our vernacular that we often say these things in passing and we don't always realize where they come from. So I love it when someone says something in passing and I get to say hey, did you know Jesus said that first? There's many examples of this treat others as you would have them treat yourself. That's a good one. I heard that one in elementary school growing up. But guess what? Jesus said it first. Judge not lest you be judged. That's another one. Guess what? Jesus said it first and I could be here all day with this and I'm sure you don't want that but a lot of these sayings go the extra mile. Love your neighbor as yourself. The truth will set you free. You get the point. Jesus said all of these things first and there's one that I want to unpack just a little bit today. It may sound familiar to some of you because maybe you remember Uncle Ben saying it to Peter Parker, a.k.a. Spider-Man. And that wise saying is with great power comes great responsibility. And of course Uncle Ben didn't coin that phrase. He was quoting the French writer of Voltaire. But Voltaire wasn't even the first to say something like that because guess what? Jesus said it first. Maybe not in those exact words but in Luke 1248, Jesus does say from everyone who has been given much much will be required. And from the one who has been entrusted with much even more will be expected. With his actions and with these words Jesus was setting for us the example of servant leadership. If you've been given the opportunity to lead, if you've been given any sort of power to wield then there is a certain level of responsibility attached. And this is not a new thing for us. It wasn't even new back in Jesus' time. In fact, if you go all the way to the beginning of the Bible and the book of Genesis you will see that humans were placed in the garden with the expectation that they would take care of what God had created. To this day we still have a responsibility to care for the world God created from an ecological standpoint, from an economical standpoint, from a societal standpoint. And that's why we have to remind ourselves of this often. To hear these words and repeat these words of Christ often that those of us who are privileged with power or with leadership, we are also expected to take great care of all those we lead. And of course Jesus himself was the perfect example of this. Not only did he lead a movement that is still continuing to shape and transform the world today, but he did so with humility and compassion and a willingness to sacrifice, ultimately making the greatest sacrifice by giving himself up on the cross. And while Christ does not physically walk the earth in the year 2025, we now bear the responsibility to live out that compassion and that humility and that selfless type of service through our leadership. In the words of St. Teresa of Ovala, Christ has no body now, but yours. No hands, no feet on earth, but yours. Yours are the eyes with which he looks compassion on this world. Yours are the feet with which he walks to do good. Yours are the hands with which he blesses all the world. So as each of you answer the call to lead in this extraordinary way, may you always remember the responsibility that you bear to lead with humility, compassion, and sacrifice. Each and every person here has been entrusted with much. So let's please remember that as we lead much love, much care, and much servanthood is expected. Please pray with me. If you would stand if you were able, we will pray and then we will do the pledge of allegiance. Gracious God, we praise you and thank you for the call you have placed on all the lives here. We also thank you for the many more lives that each person here represents. Create in each of us a desire to be your hands and your feet in this world. Let our eyes look upon our colleagues and constituents with compassion that flows from your heart. By your grace help us to lay aside any selfish desires and ambitions and instead pursue truth and justice with selfless humility. Thank you for the awesome privilege to lead others even as we look to you to lead us in Christ's holy name we pray. Amen. If you will join me in the pledge. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands one nation under God in the visible with liberty and justice for all. Stay right there. Doorkeepers you may unlock the doors. Members you can join our chaplain of the day in the South that he room for some photos. Pastor Jerry you're doing a good job with your sister. She's a working progress. I'm so doubt about that but thank you for your words today. It was meaningful and making impact on all of us here. Thank you and come back again. The day is brought to us by Chairman Josh Bonner of the 73rd House District. Dr. Chris Walsh is downstairs in the aid station. Dr. Chris Walsh thank you Dr. Walsh for being here and serving us today. I remind you all you may go by and meet Jerry Aiken our pastor of the day. Carmen's brother excuse me representative rice's brother in the South any room so hope you'll go by and say hello. I'm trying to be respectful. Chairman Tarvin the chair of the Committee on Information and Audits is recognized. Chairman Tarvin thank you miss speaker. Mr. Speaker your committee on information audits has read. Chairman has an important report to give us so give him your attention please. Go ahead Chairman. Mr. Speaker your committee on information audits has read the journals and the previous legislature they have found it to be correct and if you would I've got a couple of little tidbits I want to share if you'll indulge me. I guess we will. I want to brag on this group and tell you first of all I'm a very much a small government type person who doesn't want government interfering in my life but I want you to know that this is a very good well-run state and a very good body. We've ranked 45th to 48 49 in cost per capita of state government for years and while that may be like me bragging about having the most hair to bold headed man's contest we're very well run state and appreciate you very much and I appreciate the speakers give me the opportunity to do this every day and this week I wanted to talk about we're a product of the choices we make in life and I wish we'd think about teaching your grandchildren and children and nieces and nephews that because I believe it being it very strongly and sometimes we need to look at our direction where we're going and make sure we're going in the direction we can know where is if you if you like the sun at your face you need the head toward the sun and every day you need to make sure you're going in that direction and an example is that the North Pole I was studying some geometry I try to do those things to keep what a little bit of brain I've got working and the question was I got it right believe it or not if you were at the North Pole and you walk one mouth south and then you chose to walk directly west for six miles how far away from the North Pole would you be and the answer is one mile and if you walked six point two eight miles little six and quarter miles you'd be exactly back where you started so that is a fact and so you need to make sure the area you're in every day where you need to be headed and make sure you're in that right direction and as I told you we have a very well-run state and you then we'll go from North Pole to the Serengeti and I'll end with this it every morning I analog like the and they would they got to be faster than the fastest line and the lines wake up and know they got to be faster than the slowest gazelle or analog so no matter what you do get up every morning and hit the ground around it for the great state of Georgia thank you very much sir thank you mr. chairman you have been a lion for this body and we appreciate your input in your service here and as you head into the sun we hope my words of wisdom with for you is that you'll always wear a cap to protect that head so chairman tarver the chair of the committee on information and audits reports that the journal the previous legislative day has been read and found to be correct is there any objection to dispense with the reading of the journal to chair here's none the reading the journal is dispensed with is any objection to the confirmation of the journal chair here's none and the journalist confirmed mr. Clark will you read read the resolution establishing the order of business for the day represent an association of the 104th news column be established as the order of business during the first part of the period unanimous consensus introduction bills and resolutions first reading a reference of house bills and resolutions second reading of bills resolutions morning orders you he is there any objection to the adoption of the resolution establishing the order of business for the day chair here's none and the resolutions adopted first reading of bills and resolutions the clerk will read house bill 34 by representative washburn 144th bill being tied on act to a men's chapter one in title 43 the fish go to Georgia and it's it ruling the general provisions regarding professions and businesses regulated industries house bill 35 by representative ridley of the 22nd pile of 33rd honor of the third target of the second ridley the sixth and others will be taught on act to amend code section 15 18 5 with the fish go to Georgia annotated ruling the appointment of substitute for absent or disqualify district attorneys judiciary non-civil house bill 36 by representative lever to the 123rd scoggins the 14th kelly the 16th out over the 84th pile of 33rd and others will be tied on act to amend title 29 in the fish go to Georgia annotated relating the guardian and award judiciary house bill 37 by resident of lever to the 123rd ballot to the 147th and hilton the 48th bill be tied on act to amend some part two part six particle six to chapter two title 20 in the fish go to Georgia annotated relating conditions of employment and elementary and secondary education education house bill 38 by resident of martin of the 49th threes and 99 Jones to the 47th hilton of the 48th and silcox to the 53rd will be tauted act to amend some some part two way of our three of article seven to chapter three the title 20 the fish go to Georgia annotated ruling the needs based financial aid program higher education house bill 39 by resident of Anderson to the 10th and Irwin to the 30 bill be tauted act to authorize the assessment collection and distribution of a technology fee by the magistrate court of haversham county enter governmental coordination house bill 40 by resident of griffin of the 149th draper of the 9th mentally 88th miles and the 126th park of the 107th bill be tauted act to amend chapter two a title 21 of the fish go to Georgia annotated ruling elections and primaries generally governmental affairs house bill 41 by resident of davis the 87th sky to the 76th scoffield with 63rd he'll be tauted act to amend code section 1613 to the fish go to Georgia annotated relating the conditional discharge for possession of controlled substances judiciary non-civil house bill 42 by resident of davis the 87th sky to the 76th scoffield the 63rd bill be tauted act to amend part five of article 60 chapter two title 20 the fish go to Georgia annotated relating to program weights and funding requirements on the quality basic education education house bill 43 by resident davis the 87th scoffield the 63rd tailor the 92nd and scoffed the 76th bill be tauted act to amend part one of our three chapter five a title 12 of the fish go to Georgia annotated ruling the general provisions of wells and drinking water natural resources and environment house bill 44 by resident davis the 87th sky to the 76th scoffield the 63rd bill be tauted act to amend chapter four title 10 of the fish go to Georgia annotated ruling the warehouse man agriculture and consumer affairs house bill 45 by resident davis the 87th scoffield the 63rd sky to the 76th bill be tauted act to amend our four chapter 12 of title 15 of the fish go to Georgia annotated relating to grand juries judiciary non civil house bill 46 by resident davis the 87th scoffield the 63rd and scoffed the 76th bill be tauted act to amend our one of chapter two a title 31 of the fish go to Georgia annotated ruling the general provisions relative to the department of public health public and community health house bill 47 by resident davis the 87th scoffield the 63rd bill be tauted act to amend part five of our six chapter two title 20 of the fish go to Georgia annotated relating to program weights and funding requirements under the quality basic education act education house bill 48 by resident davis the 87th scoffield the 63rd bill be tauted act to amend our six chapter two title 20 of the fish go to Georgia annotated the quality basic education act education house bill 49 by resident davis the 87th scoffield the 63rd sky to the 76th bill be tauted act to amend chapter one of title 45 of the fish go to Georgia annotated ruling the general provisions regarding public officers and employees judiciary house bill 50 by resident davis the 87th coming to 39 jacks in the 165th for now the 77th Jones the 60th and others bill be tauted act to amend code section 42 86th the fish go to Georgia annotated relating the license plates promoting a supporting certain agencies motor vehicles house bill 51 by resident per chat of the 176th corber to the 174th green to 150th osteen to the 169th and 4 to the 170th bill be tauted act to amend chapter 23 a total 50 the fish go to Georgia annotated relating the Georgia environmental finance authority natural resources and environment house bill 52 by resident of rice to the 139th osteen to the 169th leaves the 99th can into the 170 second and bond are the 73rd bill be tauted act to amend code section 48 5 48 fish go to Georgia annotated relating to homestead exemptions ways and means house 53 by resident bond of the 73rd can into the 170th clerk of the 100th baller to the 147th prince the 130 second and others bill be tauted act to amend part 3 of art to chapter 4 title 38 with the fish go to Georgia annotated relating the Georgia veteran cemeteries defense and veterans affairs house 54 by resident of park of the 100th Jones the 47th ball of 33rd bear to the 24th maithiac the 82nd and others bill be tauted act to amend title 1631 and 43 of the fish go to Georgia annotated relating crimes and offenses health house 55 by resident of 4 to the 170th per cent of the 176th corber to the 174th abstration of 104th gunner the 8th and others bill be tauted act to amend code section 1562 of the fish go to Georgia annotated relating the number of judges is superior courts judiciary house will 56 by reps on p3 the 166c ball 34th itch and 161st saints of the 180th lumpston the 12th bill be tauted act to amend subpart 7 of part 3 of article 7 of chapter 3 title 20 with the fish go to Georgia annotated relating to grants to children law enforcement officers higher education house 57 by reps of camera the first Jones the 47th camp of the 135th maithiac of the 82nd hagan and the 156 and others bill be tauted act to amend code section 166 22 with the fish go to Georgia annotated relating the incest judiciary noncivil house bill 58 by resident Richardson the 125th lever to the 123rd Thomas the 21st clift into the 131st and crow with 118th bill be tauted act to amend chapter 1 and title 60 fish go to Georgia annotated relating the general provisions relative to aviation technology and infrastructure innovation that completes first readers best first millers Wang R missing house bill 1 by manuscripts out the 50th the bill relating to carrying and possession of firearms house bill 2 by regulations House Bill 4, by Representative Aula, the 50th of Bill relating to Brady Law regulations. House Bill 5, by Representative Campbell, the 171st Bill to amend an act relating to the Board of Education Commissioners for Decatur County, House Bill 6, by Representative Campbell, the 171st Bill to amend an act providing for board of commissioners of Mitchell County. House Bill 7, by Representative Kendrick of the 95th of Bill relating to imposition rate computation exemptions and credits relative to income taxes. House Bill 8, by Representative Kendrick of the 95th of Bill relating to income taxes, House Bill 9, by Representative Campbell, the 63rd, Drener of the 85th Scott of the 76th Davis of the 87th Jackson of the 68th. Abil relating to other safety inspections and regulations. House Bill 10, by Representative Campbell, the 63rd Davis of the 87th Scott of the 76th and Jackson of the 68. Abil relating to the prohibition of disclosure of a rest-looking photographs. House Bill 11, by Representative Campbell, the 63rd Scott of the 76th Davis of the 87th Jackson of the 68th. Abil relating to regulation and construction of hospitals and other healthcare facilities. House Bill 12, by Representative Kendrick of the 172nd Erwin of the 32nd lever of the 123rd Corb of the 174th. Kelly of the 16th and others, abil relating to equalization grants, annual circulations and allocation. House Bill 13, by Representative Corb of the 174th, abil to provide compensation for the Equal County Board of Education. House Bill 14, by Representative Carpenter of the 4th, the 2nd Proctor of the 89th of Fleming of the 114th. Abil relating to other state symbols. House Bill 15, by Representative Williams, the 112th Williams of the 148th. Douglas of the 78th, the key of the 134th, Ridley of the 6th and others. Abil relating to banking and finance. House Bill 16, by Representative Gofield of the 63rd, reclaimed the 109th Scott of the 76th. Davis of the 87th plays of the 67th Abil relating to labor and industrial relations. House Bill 17, by Representative Gofield of the 63rd. Davis of the 87th Scott of the 76th, Mitchell of the 88th Jackson of the 68th. Abil relating to general provisions regarding health. House Bill 18, by Representative Sains of the 180th, Petrie of the 166th, Richard's in the 125th, Jasper's of the 11th, Gollum of the 19th. Abil relating to dual enrollment act, purpose, dual credit courses, eligibility for participation, eligibility for payment. House Bill 19, by Representative Scott of the 76th. Scott Field of the 63rd, Davis of the 87th Abil relating to general provisions, related to examination and treatment for mental illness. House Bill 20, by Representative Scott of the 76th, Gofield of the 63rd, Davis of the 87th Abil relating to health of students generally. House Bill 21, by Representative Scott of the 76th, Davis of the 87th, Gofield of the 63rd. Abil relating to imposition rate, computation, exemption, credits from income tax. House Bill 22, by Representative Scott of the 76th, Davis of the 87th, Gofield of the 63rd. Abil relating to labor and industrial relations, revenue, and taxation. House Bill 23, by Representative Scott of the 76th, Gofield of the 63rd. Davis of the 87th, Abil relating to educational programs under the Quality Basic Education Act. House Bill 24, by Representative Scott of the 76th, Gofield of the 63rd. Davis of the 87th, Abil relating to the powers and duties of the Department of Behavioral Health and Developmental Disabilities. House Bill 25, by Representative Scott of the 76th, Davis of the 87th, Gofield of the 63rd. Abil relating to public assistance. House Bill 26, by Representative Scott of the 76th, Gofield of the 63rd. Davis of the 87th, Abil relating to the powers and duties of the Department of Behavioral Health and Developmental Disabilities. House Bill 27, by Representative Scott of the 76th, Gofield of the 63rd. Davis of the 87th, Abil relating to program weights and funding requirements under the Quality Basic Education Act. House Bill 28, by Representative Cannon of the 172nd. Abil to provide a home set exemption from Colbert County, add Valorant taxes for county purposes. House Bill 29, by Representative Cannon of the 172nd. Abil to provide a home set exemption from Colbert County, school district, add Valorant taxes. House Bill 30, by Representative Horner of the 3rd. Abil to provide a home set exemption from Coutusa County, school district, add Valorant taxes. House Bill 31, by Representative Horner of the 3rd Abil to Amended Act to reconstitute the Board of Education of Coutusa County. House Bill 32, by Representative Cannon of the 172nd. Abil to authorize the assessment and collection of a technology fee by the private court of Coutusa County. House Bill 33, by Representative Cannon of the 172nd. Abil to authorize the assessment and collection of a technology fee by the magistrate court of Coutusa County. House Resolution Number 6, by Representative Kendrick of the 95th. Resolution proposing amendment to the Constitution. So, it's to authorize the General Assembly to provide law for more than one seat capital fund. House Resolution 7, by Representative Campbell of the 171st. Resolution honoring the life of Mr. George C. Trulock Jr. dedicating a road into his memory. House Resolution 8, by Representative Gofield of the 63rd. Davis of the 87th. Coutusa 76, Mitchell of the 88th. Jackson of the 68th. Resolution supporting the creation of a state work group to increase chronic disease information and screenings in communities of color.\n\nHouse Resolution 9 by Representative Moore of the 91st. A resolution proposing an amendment to the Constitution to the State of Georgia, so as to provide for that revenue derived from the regulation of safe drinking water and toxic enforcement, maybe dedicated for certain purposes and not deposited into the General Fund. House Resolution 10 by Representative Davis of the 87th. Condric of the 95th Taylor of the 92nd, of the 94th, the Mitchell of the 88th. Resolution urging the Metropolitan Atlanta Rapid Transit Authority to reaffirm its commitment to an extension of the rail system along the east side of Interstate 20 in South to Cat County. House Resolution 11 by Representative Davis of the 87th. The resolution urging the Georgia Environmental Protection Division, the Environmental Protection Agency and the DeCat County Government to resolve sewage, pollution, and spills. House Resolution 12 by Representative Davis of the 87th. Scott of the 76th. Gofield of the 63rd and Canon of the 58th. The resolution does in the 80th and month of April as community activist month. House Resolution 13 by Representative Davis of the 87th. Scott of the 76th. Gofield of the 63rd and Canon of the 58th. The resolution recognizing April 8th, 2025 as community activist day through second readers. Thank you, Mr. Clerk. All right, members, if you will, I'll ask you to please take your seats. We have several morning orders. I'll ask you to be respectful of your colleague in the well. I thought it was make or a burden. Good morning. Thank you, members. Representative Lim, you're recognized for a morning order. Give the member your attention, please. Thank you, Mr. Speaker. Good morning, colleagues. Working with the Department of Natural Resources and Senator Halpern across the hall, we can see the idea of creating an art contest to showcase our state parks and historic sites. If you didn't know, we have 45 state parks and 17 historic sites. Representative, if you also spend just for a moment, you'll write the on how many state parks we have. Members, this is a board, see your conversations or take them to that any room is empty. We're going to recognize some Georgians who are important to us. Continue, Representative. Thank you, Mr. Speaker. As I was saying, we have 45 state parks and 17 historic sites. I get well, good use of my parking pass. And a couple years ago, was looking at some works, progress posters, and thinking we should have that for Georgia and why not invite the talented youth of our state to render them. Fast forward to today, and we received well over 100 submissions across the state for our 2024 edition of the new Georgia state parks and historic sites art contest. We are proud to welcome our top 15 here today. If they're here, I ask them to rise. They may be in the Senate or downstairs. The top three are actually featured right now downstairs as part of keeping Georgia well day. I also think the organizers of that. And later on this afternoon around 1 to 230, we'll have all the top artwork featured in the South Wing. I will close by saying there's no shortage of beautiful parks and historic sites in our state. There's no shortage of artistic talent among youth in Georgia. And I'm very happy we can bring both together. Thank you again to Deanna, Senator Hoppern, and we congratulate the winners and all participants once again. And I yield the well. If you're here and you're one of those folks into gallery, would you stand? They may have been hijacked by the Senate. Congratulations to you and thank Representative Lim for that recognition to them. And remember Georgia, while day downstairs, DNR is down there. So visit with our folks from DNR and many of the officers are down there and certainly some good information. We all need to be aware of. Leader, illustration represented Donna Tucci and representing Martinez. Mr. Leader, I mean, you're already getting close to your limit here where you've been to the well twice. Oh, no, you're not doing it. That was okay. As long as representing Donna Tucci's up there. Ladies recognize. Thank you, Mr. Speaker, colleagues. We're so excited today to have Hebron Christian volleyball along with their athletic director, Taylor Davis. They're sitting up on the left side of the gallery. They are the state champions. If you would please stand the team. And if you would all recognize and stand for them. Thank you so much and congratulations. If you see the girls today, be sure to say hi to them. Thank you, Mr. Speaker. Thank you to all the will. Thank you members. Congratulations. That's pretty special. State champions, you'll be that for the rest of your lives. So good stuff. Congratulations. Thanks for being here with us as well. Chairman Dickie. You have a morning order, Mr. Chairman, Chairman Dickie. You have a morning order. You're in the house this morning. You just want to make sure you know where you are. I was trying to get my colleague Beth Camp. I have the, we have the Ups and County, Thomas Leighership Group in the gallery, and the Chamber of Commerce, Ups and County Chamber of Commerce, and they're over there. Y'all wanna stand? Thank y'all very much. Great group of young people in their leadership. And Madison Rudringer leading that with the Chamber. Thanks, Chairman Dickian, Chairman, Chair Lady Camp. Welcome, we're glad y'all here. Congratulations. We're, hey, this first class, thanks for recognizing them and having me here. Appreciate y'all being into people's house. I think that completes our morning orders. We do have an invite resolution this morning. I think you'll be interested in. So if you'll get an invite, Chairman Marcus Wheat-Hour and friends to come up. Mr. Clerk. Chairman Wheat-Hour, Mr. Clerk, would you read the resolution? House resolution 22 by Representative Wheat-Hour, the 121st Burns 159 Jones, 47, Hugely of the 141st, hatched to the 155th and others. A resolution commending the Atlanta Football Host Committee for hosting the 2025 College Football Playoff National Championship and for other purposes. Colleagues, good morning. Slightly bittersweet day for me as somebody who bleeds red and black to bring this trophy here to this wonderful chamber. But I can promise you, it's not lost on me what this trophy means for our state and what it has done across the state as this game will be played Monday night in Mercedes-Benz. CFP will have an economic impact before reaching every county in this state. CFP Foundation has poured money into education in every county in our state. We'll bring in estimated over $75 million from the state of Georgia and as much as I would love to see the dogs. Okay, the two teams being from out of state actually will have a greater economic impact on our state with the folks that will travel to see this game on Monday night. I want to first, I have to thank Arthur Blank and his vision of Mercedes and the entire facility. What they built down there to attract these types of events. You guys know I'm a big proponent for it. But first, the former is Dan Corso who, the Lannis Sports Council, the work that they do to attract these events that are coming up like FIFA World Cup and a host of other events. But this, right now, we get to celebrate the CFP. If everybody's gonna be able to go to the game, it's gonna be a, I'm sure it'll be epic in a great facility. Also with us today, Tim Zewolski with the Atlanta Fowell because he has been instrumental also in negotiating and attracting these businesses. They've been a great partner for us, making incredible economic impacts across the state of Georgia. Thank you guys for your efforts and everything you do and thank you for being with us today. Chairman, we'd our Mr. Speaker, members of the House. Thank you for this opportunity. This is a special day. The state of Georgia is used to winning. The state of Georgia is number one in a lot of things. The state of Georgia is also now recognized as the first statement country to be the two time host of the College of Ball Playup National Championship. So congratulations to all of you. And as Mr. Chairman said, Tim and I are in the business of recruiting these big sporting events to our state. And we've got a lot of great things coming. Just days away from the College of Ball Playup National Championship, the World Cup in 2026, another Super Bowl in 2028, and another Men's Final Four in 2031. And we've got more in the pipeline. There's a reason why these events keep coming back to the state of Georgia. And that's because of the complete engagement and support that this body gives to the effort to bring them and organize them here. So thank you on behalf of all of us involved in this event. Thank you on behalf of partners in the community, for what you do and for your support in helping us do what we do. Thank you again. Thank you. Applause. Good morning ladies and gentlemen, speaker. Thank you for your support continuously. Chairman, sir, thank you. On behalf of Arthur Blank, I'm on Arthur Blank Sports Entertainment. As Dan said, we can't bring the world's greatest events to Georgia and to Atlanta without your help. And you've been there. And we will need you to continue to be there as we have many great events. Final Four, 2031, Super Bowl, 2028. And obviously all roads right now lead to Georgia and lead to Atlanta, Pearl, Ohio, state, and Notre Dame. So if you are ever since been state in this Monday, we will be ready. It is the number one place for fan experience, regardless of what goes through there. As rated by the NFL, Major League Soccer and others. So the piece I want you to know, our models welcome home. We're going to welcome those folks to the state of Georgia, the city of Atlanta, and Mercedes Ben Stadium. And we couldn't do it without you. Thank you all for your support. Applause. It's good. Yeah, it's good. Dan and Tim, thank you. Thank you to the Atlanta Sports Council. Tim, to your boss, pretty special guy. To the members of this house, thank you for always being supportive of ensuring that we maintain Georgia's number one status. And whatever endeavor that is, not just in athletics, but in economic development and quality of life. Now we'll take one step further. Thanks for what you do. You'll take a message back. I don't know if any other Georgians have been more impactful than Arthur Blank when it comes to health care and his contributions to health care in our state. And, certainly, his continued support and health care, but especially mental health. So thank you for us. We appreciate him and wish him the very best. And we also, number said, he's a pretty cool dome too. We enjoy being there quite often. Let's give them another round of applause. What a beautiful trophy. I hope it's in Athens again real soon. Well, maybe right across the street and Georgia Tech. That'd be pretty cool too. So either one works. Thank y'all members. Thank you, Chairman Wittar, as well. Thanks, Charlie. Good work. Mr. Clark, will you read the caption to a group of privileged resolutions? Recognizing, commanding the Georgia Cancer Control Consortium as part of the Georgia Department of Public Health, HPV Cancer Free Georgia Cancer Pathways, the Susan Jolly Awareness Program for their exceptional contribution to cervical cancer education and awareness in Georgia. Recognizing January 21st, 2025 as a addiction recovery awareness day, and recognizing and commending, Captain Matthew T. Brown upon his retirement. And for other purposes, that completes the reading of the privileged resolutions. Here's their any objection to adopting the privileged resolutions. Chair, here's doing the resolutions are adopted. I'm not going to put a time limit on y'all, but I'm going to ask you to be respectful of those that come right after you, and there's some other business of the day to be taken care of outside of this chamber. So let's recognize, represent, and Nissa Jones, represent Jones. And Nissa, represent, you're recognized for and afternoon order and friends. Yes, it's always good to have friends. Thank you, Mr. Speaker and colleagues. If I could get all members of Alpha Kappa Alpha Sorority and corporate it to come and stand with me at this time. As a proud 33-year member of Alpha Kappa Alpha Sorority and corporate it, I stand with great pride with my sorority sisters in celebrating our 117th Founders Day to Day, January 15, 2025. Our organization continues to leave an indelible mark on society through its unwavering commitment to service, education, and advocacy. Founded in 1908 at Howard University by a group of visionary women, Alpha Kappa Alpha remains the first Greek letter sorority established by African American women and has grown into a global force for positive change. Over the past 117 years, Alpha Kappa Alpha has remained steadfast in its mission to uplift communities, particularly through expansive programs that address critical issues such as health disparities, economic empowerment, education, and social justice. Through initiatives focused on improving access to health care, raising awareness about mental health, combating chronic diseases like heart disease and cancer, and providing scholarships to empower the next generation of leaders. Alpha Kappa Alpha has built a legacy of transformation. In addition, the sorority's strong advocacy for educational equity has helped countless students, especially from underserved communities, pursue higher education through mentorship and financial support. Again, let's rally together to thank Alpha Kappa Alpha for its historic monumental achievements over 117 years. I yield the well. Congratulations. A great celebration. Thank you. Representative Barry Holly and Bell, you gentlemen. Representative Rice Barry, you're going to take care of this group. Absolutely. We're glad to see you up. And those friends and some other friends joining you. Representative Barry is recognized for an afternoon order. Thank you, Mr. Speaker. We rise today to honor one of Georgia's favorite sons, a prolific preacher of the social gospel, a heroic humanitarian, and champion of all people, and one that we are all particularly proud of, a more-house man. We rise today to honor the life and legacy of the Reverend Dr. Martin Luther King Jr. on what would have been his 96th birthday. There is no need to retell the story of Dr. King. We know his story. But what is even more pertinent is to know his message. His dream extended beyond just racial harmony, but also to economic opportunity and empowerment, social ability, and what he called that more beloved community, where non-violence was not only practiced, but was the mantra of the Lamb. We honor the legacy left and carried out by his children, Martin Luther King III and Dr. Bernice King, initiatives that were started by his loving wife, Correta. So as we rise today to honor this man's great son, and as we start the new session, let us be committed to work together and take up the challenge of Dr. King to build that beloved community for the people of this state. So will you join me in a moment of silence to remember the life of Reverend Dr. Martin Luther King Jr. Dr. King, thank you for your service, thank you for your teaching. More house will forever be proud of you and honor you. Maybe we worthy of a sacrifice instead of fast and caring for his mission. Thank you, and I you're the well. Thank you, Representative. That's a pretty cool photo. I've never seen that one. Appreciate y'all finding that one. That's a nice photo. I appreciate y'all doing that, and thanks for honoring Dr. King. Representative Carter, boy, this is a good one. It is afternoon. In the morning though, we could wait about six minutes and you'd be in the afternoon. No, no, no, no. You'd rather me do that. Give it a shot. Good morning. Happy new year. And those of you who have been with us a while, you absolutely know why I'm here. So on the first Friday in February, we will be asking you all to wear red, because that is the American Heart Association advocacy day to bring awareness to heart disease with women. As we continue to say, and I hope one day that we won't have to say this, that a heart disease is the number one cause of death in women and in black women in particular. So I hope you all would join me on the first Friday. I'm sorry, the first Thursday for the caucus. I mean, for the chamber. And the first Friday, we'll have a event here at the Capitol. Thank you. You're the winner. Thank you, ma'am. All right, y'all. Probably want to listen to this one. One of the most important reasons we're here. Chairman of Appropriations, Chairman Matt Hatchett, has an afternoon order. Thank you, Mr. Speaker. Budget. That's why we're here. Yay. Since tomorrow is kind of crazy with the state of state. Just want to go ahead, everybody know that the budget books will be available in Sweet 412 and the CLOB after the state of state tomorrow. You get one book per member and somebody, either you or somebody in your office, has to sign for that for you. All set. The second edition of the 25 or 2025, 2026 fact book that if you were here last year or two years ago, you found out about it. And it has all the facts you need to know about our state. And it's very helpful with the many references you need to make the different things, especially when you go and you talk the groups in your community. So you can pick that up. It will be ready tomorrow also. Last thing. Budget hearings. Joint House and Senate budget hearings will be next week. It will be Tuesday, Wednesday and Thursday. Members, we hope you are there. Even if you are not a member of Appropriations, you learn a lot at these hearings. So hope to see you there. Thank you. A man of great wisdom and patience. So I encourage you to heed the chairman's suggestions. If you are doing your job here, you need to know how the process works. So make sure you join him. Thank you, Mr. Chairman. Chairman Parsons. Recognize for an afternoon order. Thank you, Speaker. When you were, when a gentleman stepping for the well, and you said, you said a gentleman with a great wisdom and patience. I thought you were introducing me, but it was actually the appropriations chairman leaving. Well, I got a couple of words for you, but I'm not with it. I wanted to come up and just say a few words to acknowledge the great work. He-he-he-he-ro is, in my opinion, of the-of our utility workers doing these storms that we had just not last week, but the snowstorm and the snowbreak, or icebreak, as we call it. But those huge tornadoes, especially Helene, and we had coming through back in 2024. Now, to me, these people are heroes. We have a lot of other heroes. I'm not taking anything away from them. In particular, Helene, but all of these, even the snow, and the icebreak last week. You know, you have the people like the Salvation Army, National Guard, law enforcement, EMTs, churches, the faith community, neighbors, strangers, and just so many people that have stepped up voluntarily to help their-help their neighbors. But I do want to acknowledge the work that Georgia Power, the EMCs, the municipal providers, have done in response to these emergencies, has been overwhelming, in particular regarding Helene. And Helene, Georgia Power, had over one and a half million customers that they had to attend to to get power back. They had over 8,300 broken poles, 20,700 spans between poles that they had to replace. They had 3200 trees down that they had to address. They had 20,000 personnel that were involved in the whole thing, and 35 assisting partners. For the EMCs, they had 17, over 17 and a half miles of lines that were damaged down. They had 12,500 poles they had to replace or repair, and $535 million in total damages, and of course, our municipal providers had to address the same issues. And what they had to address was just astronomical and enormous. I do want to say this, well, I'm up here, I know we have things to do, but my appreciation for it, in particular, I mean, it was all the people who worked with those companies, and I certainly don't want to acknowledge the planning that these EMCs, the local municipal providers, and Georgia Power has to put into it, a lot of planning before these things ever happen, otherwise they wouldn't be able to respond to what they do. But I do want to say that, you know, my appreciation especially these guys have to go out and do the work. I mean, they all do the work, but the work out in the elements in the snow, the ice, and during the, even while these winds and hurricanes are coming through in the aftermath of those, I have a, of course, I was a telephone man with Chester Beacon, Potemite Telephone company, so I worked the lines, and I worked some ice cuts myself, but when I was ten, my mother, a single mother, she was having a hard time between jobs, we lived in a big old apartment building. I actually was a big old Victorian, a huge Victorian house, been subdivided into apartments, and there was a little family, a young family, who lived in one of the apartments below us, and one of the, the guy there, the father, who was in his 20s still, I believe, he was a lineman for Appalachian Power, and he would go, he loved to fish, and he fished us where any time he got a chance to, and he would bring catfish up to us, and our food for a good while, subsisted a lot on catfish that that lineman would bring to us, just a great guy. And I was ten years old, and then one day I got the news that he had, in some kind of a terrible accident on a pole, something had happened, and it literally blew off one of his legs. And this man who had been a provider for his family, and basically a provider for us to a large degree, you know, he couldn't even get out and get around, much less go to work. And that was because of the nature of the work that he did, and that's the nature of the work these guys do every day when they're out there, and we're anticipating when we're going to get a power back, and I'm one of them, and sometimes I've had to wait a few days myself, and I keep going to why I was taking so long. I know intellectually why it is, but you still wonder why I was taking so long to get back up. But these people out there doing really hard work out outside in the elements, working so hard on these dangerous, very dangerous jobs. While at the same time, there were people with those companies and the EMCs working other places within the company, very hard too, but in particular, I think about those lineman and the people out there working on the poles and in the bucket trucks, and Mr. Speaker, I just want to come down and acknowledge, I hope I've adequately acknowledged our thanks to them and appreciation for all that they do for all of us in the state of Georgia. Thank you, Mr. Speaker. Now, you did a good job, Mr. Chairman. And you are a man of wisdom and patience as well. I'll give you that credit. Certainly, as we all do in this chamber, we appreciate when folks risk their safety for our well-being and certainly the lineman, lineman and lineman and women of this state on a daily basis, risk their safety, provide electrical service for the utilities that service all well. So, we're...\n\nstated and we're very proud of them and appreciative of their service. Thanks to them all. Representative Chaz Cannon, Representative Tray Rouge, y'all got something to talk to us about? Hope you do. You're both recognized at least one of you. Thank you, Mr. Speaker. Just one again, recognize the Department of Natural Resources in particularly the Wildlife Division, law enforcement division, state parks division, guys and guys that are down at the South Steps today, recognize them for their efforts and all the other organizations and the partners that help preserve our wildlife in our state. Last thing I'll mention on your desk is a sign-up form for the Legislative Sportsman's Caucus, no dues, but please fill it out. Give it to me or Coach Air, Matt Dupnick. Appreciate your participation, that just handed me your final, your final, my, my, Matt, once you fill it out. Mr. Speaker, I just want to add, if you don't mind and thank Commissioner Raven for what he does and what our department does over there for our natural resources. If you don't know, 1.6 billion is the economic impact that that hunting and fishing and tourism brings to our great state and I just want to thank them for all they do to preserve those natural resources. So our kids, our grandkids and future generations can enjoy what we do now in the state of Georgia. Thank you. Thanks for what y'all doing, game fishing parts. It's important to us and certainly the opportunity to hunt and fish, but also to enjoy our state parks. Boy, we're a lucky bunch of folks in this state to have the great resources we have and out of doors to enjoy and Commissioner Raven and his team do a great job there. So here we're going on to announce with that completes our afternoon orders in the morning. So let me give you a heads up. We're going to call on Chairman Corbett first, but next will be Representative Alexander, Representative Basemore, Representative Paris, Chairman Williamson and Chair Kent will be in order now to call y'all each but be prepared to come up. Chairman Corbett is recognized for announcement. Thank you, Mr. Speaker. I tell you all yesterday the rule caucus will be meeting today at 12 o'clock. We have a new location. That's what I want to tell you about today over between the CLOB and the parking deck. If you'll walk down to Trinity, make a ride. First doors on your right. The easiest way to get there. 12 o'clock today. Look forward to seeing you there. Thank you. Those some bread crumbs out and we'll find it. I bet you that's the case. Representative Alexander is recognized for announcement. Thank you, Mr. Speaker. There will be there will be a women caucus meeting at 1130 room 216 of the capital. Thank you. Women's caucus 1132 16 in the capital. Representative Basemore is recognized for announcement. Representative Paris, your own deck. Thank you, Mr. Speaker. This is a reminder to the members of the City of South Folkton delegation. There will be a meeting today virtually so it will be on zoom at 1230. If you have not received information, please notify me and I will forward it to you. Thank you. Representative Paris, recognize for announcement. Thank you, Mr. Speaker. Ladies and gentlemen of the Georgia Chamber. Yesterday I came in and took off my coat and put it back on the hangar on the coat rack back there. Yesterday when I went back to get it, it wasn't there. So I'm sure somebody mistakenly took it. If you would, please return it because it was my coat. And in the 463 years that I've been down here, this has never happened. So thank you all. I appreciate your return and thank you. I'm sure it was an accident. Let's make sure it comes back on purpose. Chairman Williamson, you have an announcement. Let's do it. Let's see what you got. Thank you, Mr. Speaker. I've got a couple of announcements for the good of the entire House of Representatives. If I could have your attention, please. This is for the entire House. I want to make every reminder, everybody that our friends and the Georgia Beverage Association led by Kevin Perry will be having a reception down at the Great Depot this afternoon for 430-6. And our other good friends, Lee Limpke has his trade associations. He's got 16 different associations that will be meeting at the 191-191-PStree at the Commerce Club about the same time. I believe it's 530-7. So let's do our best. All members of the General Assembly to try to go by and see all these constituents from all over Georgia that are doing business in state of Georgia. And my final message will be for the House of Majority Caucus. We'll be meeting immediately upon adjournment in the preparations room, which is room 341, immediately upon adjournment. Thank you, Mr. Speaker. Thank you, Mr. Chairman. Chair Lady Kemp is recognized for an announcement. Thank you, Mr. Speaker. This is for all of our incoming freshmen. And I believe we have a couple of sophomores who came in mid-year last year. We're going to be having a meeting today, and it's going to explain how to do local legislation. There's a lunch and learn. It's for freshmen and then for two invited sophomores. It's going to be in room 403 following our caucus meeting. Thank you. Okay. Okay, members, I have one announcement, and we will conclude this day's work. Tomorrow is the State of the State. Mr. Leader, I think we'll come in at 10. You'll confirm that in a minute. So I would encourage you all to be here and hear what Governor Kemp has to talk just about on the State of the State. Another reason I would encourage you to sit here, be here, and be in your seats because if you don't, the center can make it in your seat. That's not a good photo op. So be here. There's a bad tension in this be here. We'll get started on time. So we'll be ready before the Senate gets in here and the Governor gets here. So look forward to having them here and as I were invited guests for the State of the State, we have no birthdays. That may be a good thing. Mr. Leader, Majority Leader has recognized for a motion. Thank you, Mr. Speaker. I move that this House stand adjourned until Thursday, January 16, 2025 at 10 a.m. On the motion of the Majority Leader at this House stand adjourned until 10 a.m. Thursday, January the 16th, 2025. All those in favor of say aye. All those opposed will say no. Oh, this thing around for a while. I hadn't got anything to do with it. Hey, the eyes have there, we'll adjourn.",
  "updated_at": "2026-02-13T03:12:41.86968+00:00"
}