{
  "video_id": "xOHGMjL6eRo",
  "url": "https://www.youtube.com/watch?v=xOHGMjL6eRo",
  "title": "Rules PM Meeting 3 for Day 28 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "Here is a summary of the Georgia Rules PM Meeting 3 for Day 28 of the 2025 Session:\n\n**Overview:** This session focused on passing various rule substitutes and resolutions, with no major legislation introduced or passed.\n\n**Key Actions:**\n- **HR 128:** Resolution to address compensation\n- **HB 397:** Rule Substitute to address election issues before 2026 election\n- **HB 529:** Rule Substitute to clarify automatic subscription renewal disclosures\n- **HB 270, HB 471, HB 266, HB 328:** Bills referred to supplemental calendar\n\n**Bills Introduced (First Reading):** None detected\n\n**Notable Moments:** The committee worked to find consensus on HB 397 before sending it to the Senate. Various rule substitutes and resolutions were explained and passed without opposition.\n\n**Votes:** All rule substitutes and resolutions passed without objection.\n\n**Attendance:** Quorum present, no notes on attendance.\n\n**Adjournment:** No explicit adjournment noted, but session appears to have concluded.",
  "transcript": "For your patients, we had to get some things printed for you and the clerk's office printed\nthem as quickly as they could but it just took a little while so thank you for your\npatients and your understanding.\nYou're going to be passed out three substitutes for your consideration and we'll go ahead\nand get started on this.\nFirst of all, House Bill 397, Rule Substitute, LC 473558S, and Chairman Anderson is going\nto explain that to us.\nThank you, Mr. Chairman, and thanks to the committee for accommodating us here.\nHouse Bill 397 passed out of committee as a combination of three separate bills, trying\nto address some issues that we felt were necessary to be addressed before the 26 election.\nThere are some components of a couple of those provisions or a couple of those sections\nin the original bill that pass out a committee that are controversial.\nSo what we're trying to do at this point is to find a consensus bill that we can get\nto the Senate.\nSo the author and I and leadership can continue working with the Senate Ethics Committee\nand their chairman to make sure that we address the concerns and issues that need to be addressed\nbefore the 26th election and are not put in a pinch and a bind next year trying to push things through.\nOkay, you've heard the explanation, any questions?\nOkay, don't you need?\nI have a motion and a second House Bill 397 Rule Substitute, LC 473558S do pass.\nIs there any objections?\nOkay, it's passed. Okay next House Bill 529 Rule Substitute\nLC-55-05-89S and\nLeader registration is going to explain that to us\nI'm sorry. Thank you, Mr. Chairman\nSo what we have here is just a cleanup measure for representative Barrett's bill\nwith respect to the changes, I'll draw your attention to line 62, 63 of the\nsubstitute. There previously had been additional language there related to the\nnature of the automatic renewal. This just makes clear it's for a period of one\nyear on the following page. There's some additional cleanup language just to\nensure that this legislation meets with the authors intent which is to address\ncircumstances of automatic renewal of subscriptions where there's not\ndisclosure to or opportunity for the consumer to opt out and this chairman\nrules committee I'd ask for the favorable consideration of the\nexpert.\nExplanation, you have any questions?\nNo questions?\nHear a motion?\nMotion in second.\nAny opposition?\nIt passes.\nOkay.\nNext, we have House Resolution 128 LC-60-0129S.\nSo Chair, Lady Dempsey is going to explain that to us.\nYes, thank you.\nThis again has the five compensation resolutions together that we are trying to pass this\nyear.\nThere was simply a little bit of language that needed to be tightened up before we moved\nforward with it on the floor.\nOkay.\nYou've heard that explanation.\nAre there any questions?\nNo questions?\nWe hear motion.\nMotion do pass.\nOkay, no opposition. It passes. Okay. Now what we will do is set our next supplemental calendar\nHouse resolution 128 LC 60 0129. Yes\nHave a motion in the second any opposition it's on\nHouse bill 270 motion in second any opposition it's on\nHouse Bill 397, Room Substitute, L.C. 47, 355, 8S.\nMotion in second in the opposition, it's on.\nHouse Bill 471, motion in second in the opposition, it's on.\nHouse Bill 529, by rule of substitute, LC 55, 05, 899, S. In the opposition, it's on.\nUnder structured, House Bill 266, motion in second, in the opposition, it's on.\nbill 328 in the opposition. It's on. Thank y'all for most. Thank you for your patience.\nI hope we don't come back in here again.\n",
  "updated_at": "2026-02-12T18:10:11.476859+00:00"
}