{
  "video_id": "XQ9HEtaf79o",
  "url": "https://www.youtube.com/watch?v=XQ9HEtaf79o",
  "title": "Two Senate leaders. Two parties. One session ahead.  | Lawmakers 2026",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 8,
  "summary": "Here is a structured markdown summary of the key points from the Georgia Senate leaders discussion:\n\n### Overview\nThe Senate leaders from both the Republican and Democratic parties discussed their priorities and legislative agenda for the upcoming 2026 session, with a focus on addressing the rising cost of living, improving quality of life, and investing in the next generation.\n\n### Key Actions\n**SB 390**: Bill to limit the ability of the National Guard from other states to enter Georgia without the governor's permission.\n\n### Bills Introduced (First Reading)\nNone mentioned.\n\n### Notable Moments\n- Republican Senate President Pro Tempore Larry Walker outlined GOP priorities around eliminating state income tax on lower incomes, capping property tax increases, and protecting land for outdoor recreation.\n- Democratic Senate Minority Leader Harold Jones highlighted Democratic priorities like Medicaid expansion, health insurance premium tax credits, and limiting private equity firms from purchasing too many homes.\n- Both leaders emphasized a focus on affordability and improving the quality of life for Georgians.\n\n### Votes\nNone recorded.\n\n### Attendance\nNo quorum notes provided.\n\n### Adjournment\nNo adjournment details given.",
  "transcript": "We're going to get deeper insight into what to expect during this 2026 legislative session\nfrom two leaders in the Senate. Here in the studio is the newly elected Senate President\nProto-Town, Republican Senator Larry Walker, the third of Perry. He has served in the Senate\nsince 2015 and is former chair of the Insurance and Labor Committee. So we're so glad he's here\nalso joining us is the Senate Minority Leader, Democratic Senator Harold Jones, the second\nof Augusta. He's been in the Senate since 2014 and his committees include Judiciary.\nWelcome to lawmakers, both of you, with your end of your names. The second, third.\nOkay, all righty. Pro-Tim Walker, you led the Senate Caucus press conference today,\nand the caucus calls for a focus that is says, re-ignite the American dream. You broke down\npriorities into three areas, the cost of living, quality of life, and the next generation.\nSo let's start with cost of living, which looks at taxes.\nTell us a little bit about that.\nSure, Donna.\nSo everywhere we, all the constituents we hear from,\nwhether it's Blue Ridge, down to Bainbridge,\nthey're straining under the rising cost of living.\nAnd we hear that, and we're going to focus on that.\nIt's cost of housing, cost of groceries, cost of childcare.\nIn the American dream, this is the 250th anniversary\nof America and Georgia.\nAnd sadly, the American dream seems\nout of reach for too many people.\nAnd so our focus is going to be on affordability.\nYeah, so I know one of them has to do\nwith the state income tax rate.\nYou mentioned that.\nAnd then it says stop skyrocketing local property tax bills\nby capping home valuations.\nSo I have the press, have your little flyer here.\nTell us about that.\nSo under Lieutenant Governor Jones' leadership,\nwe had a study committee over the interim\nto look at our income tax situation.\nAnd we have a plan to eliminate state income tax\non the first 50,000 of earnings for a single filer\nor 100,000 for a married filing jointly.\nSo that will eliminate the state income tax\non two thirds of Georgians.\nAnd we're very excited about that.\nWe also hear from our constituents on a regular basis\nthat they're skyrocketing property tax.\nAnd we've already dropped a bill to address that,\nwhich would be a floating homestead exemption\nthat would limit the increase on property tax\nto the rate of, on your home, to the rate of inflation.\nOkay, thank you.\nAny comment on any of that?\nI know you, the income tax, you've spoken out about that.\nHe's spoken out about the income tax,\nbut I think one of the things is affordability, of course,\nis the buzzword of the year.\nAnd one of the ways we're going to be attacking\nthat particular issue is through Medicaid expansion,\nand also actually having tax credits\nwhen people actually bring their premiums down\nas far as the health insurance is concerned,\nbecause that is a major crisis within Georgia,\nhealth insurance.\nAnd so number one, we'd have Medicaid expansion,\nwhich can actually help get more people insured,\nand over a million Georgians right now,\nwe're depending on those federal tax credits.\nSo at some states have done,\neven before what's recently happened\nis they created their own tax credits\nso their people could actually afford\nthose premiums or deductibles.\nAnd so what we've been proposing\nwe actually started it last year with SB192\nand it will continue this year\nto actually have our own tax credits\nto address that particular issue.\nSo when we talk about affordability,\nthe question really becomes\nwhat issues are you looking at?\nAnd then secondly,\nhow do you actually make those things affordable?\nThe thing is you're both talking affordability.\nThat's the main thing.\nI want to focus on you for a little bit\nbecause I want to make sure we get,\nYou spoke at the press conference today about ICE and Democrats present three bills.\nYou have one that is SB 390 and it is to put limits on the National Guard.\nTell us about it.\nRight.\nWhat it basically says is out of a state on National Guard cannot come in unless it has\na permission of the governor.\nAnd so other states have actually done this to South Carolina being one, Kansas being\nanother Washington, just to actually pass a similar law.\nSo it's not anything particularly unusual.\nSo what the press conference was day about was the one we were focusing on, I think we\nsaw that.\nBut then secondly, it's actually a larger issue.\nAnd that issue is the fact that a lot of people are actually concerned and scared about\nthe overreach that this administration is doing.\nAnd quite frankly, after the last event that we had in Minnesota, it almost seems like\ndeath was actually normalized to some extent by this president, the way the callus where\nthey kind of looked at what it had taken place.\nAnd so people are nervous and they're scared about what's going on and we wanted to address\nthose particular issues.\nOkay.\nI didn't know whether you want to comment on that or we can move on to quality of life.\nLet's talk about quality.\nGod tell us what the quality of life, what you're talking about in terms of that.\nWell we know we have to have safe communities and so we're going to continue to invest in\nsafe communities.\nWe also know that part of your quality of life is having opportunities to enjoy the\nThe Great Outdoors, George is a beautiful state and we're going to look at ways to further\nprotect lands.\nOur state is growing because we've had strong leadership and our economy is attracting\na lot of industry and a lot of manufacturing which we're proud of, but we want to make\nsure we do protect opportunities to protect lands and let people enjoy the Great Outdoors.\nI was real proud to have carried, sponsored,\nand carried the George Outdoor Stewardship Act\nseveral years ago under Governor Deal.\nAnd I hope we can maybe expand that.\nAnd that's where a portion of the sales tax revenue\non outdoor recreation equipment goes to a acquiring land\nto protect for the public use.\nOkay.\nAnything else you want to mention\nin terms of democratic priorities in your caucus?\nAbsolutely, another issue you're gonna be housing,\nwhich was also mentioned,\nbut the way you actually approach it is gonna be key.\nSo some of those issues you can deal with\nfrom kind of like a regulatory level, such as zoning,\nbut also you wanna look at the fact\nthat private equity judges one of the worst offenders\nas far as private equity buying so many homes.\nHere's the problem with that.\nWhat happens is they're not buying those homes\nfor people to live in as a home.\nThey're buying those homes that actually jack up\nthe rent store to speak,\nand that becomes problematic.\nAnd so we actually gonna have a bill to talk about\ntrying to limit private equity\nbuying up all of these homes in Georgia.\nAnd as I said, in Atlanta,\nactually is a victim of this quite frankly,\nand other parts of Georgia are too.\nSo number one, we'll look at regulatory features,\nand then number two, we'll look at private equity\nto try to get people into their homes.\nOkay, let's get to your next generation,\nbecause part of it deals with something\nwe're gonna talk about later,\nand that's protecting children when it comes to AI.\nBut you're really focusing on things\nwhen it comes to schools and those kinds of things.\nYeah, so AI certainly has a lot of benefits to it.\nWe just want to make sure they're guardrails around it.\nSo that, for example, you don't want AI to be\nimitating a child and be on social media\nthat would damage that child.\nThere just needs to be guardrails around it.\nAnd I'm sure your next guest will know a lot more about it\nthan I do.\nBut it's an interesting topic, but it is a little,\nAs you said in the intro, a little scary to me\nin my generation anyway.\nYeah, so you also absenteeism, you guys looked at\nand literacy rates, so those are two things\nyou're gonna look at.\nYeah, we have a chronic absenteeism problem\nand we're gonna address that this year.\nI will say that I do agree with the leader,\nminority leader on the private equity,\nbuying up and driving up the cost of housing.\nThat's something I think we can work together on\nAnd I look forward to that.\nAbsolutely.\nSo one of the things I wanted to ask before you go is what we're hearing is that you,\nfrom both sides, as you guys are agreeing on a lot, do you agree that that's true?\nWe're agreeing on a lot.\nWe just have to see the details.\nOkay.\nThat's always going to be the key.\nBut I think one of the good things is that Senate approach and walker myself, I should\nhave great relationships.\nSo I think that would add to the possibility of getting things done.\nSo you agree that we may not see things as contentious as we see in this?\nI hope we're going to just focus on putting Georgians first and look focus on kitchen table\nissues that really matter not get caught up in all the political grandstanding this is\nan election year and all the political posturing I think I hope we can keep the main thing\nthe main thing.\nOkay.\nWell I want to thank you both for coming on the show and maybe we'll have you on a little\nbit later.\nThank you.\nAlrighty.\nThank you so much.\nThank you.\n",
  "updated_at": "2026-02-12T01:23:53.893035+00:00"
}