{
  "video_id": "xrDkLo5MwPA",
  "url": "https://www.youtube.com/watch?v=xrDkLo5MwPA",
  "title": "6/13/23- Senate Study Committee on Certificate of Need Reform",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 177,
  "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Certificate of Need Reform session transcript:\n\n## Overview\nThe Senate Study Committee on Certificate of Need (CON) Reform held its first of four planned meetings, with the goal of examining the CON program in Georgia and considering potential reforms. The committee heard from industry experts and members of the public, with a focus on learning about the history and impact of CON laws in various states.\n\n## Key Actions\nNo specific bills were mentioned as being passed, referred, or introduced.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The committee chair, Senator Jesse Westmoreland, set the tone for the meetings, noting that members would likely have their views changed through the process as they heard from diverse perspectives.\n- The committee members introduced themselves, providing background on their roles and experience related to healthcare policy.\n- The committee heard a presentation from Jocelyn Hill of the Senate Research Office providing an overview of CON laws and the experiences of states that have reformed or repealed their CON programs.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nThe committee chair noted the presence of both committee members and non-elected experts, stating that their participation would help educate the committee and guide them towards better healthcare outcomes for Georgia.\n\n## Adjournment\nThe transcript does not mention when the meeting was adjourned or the date of the next scheduled meeting, but the chair stated the next meeting would be held in August in Columbus, Georgia.",
  "transcript": "you you you you you you you you you you you you you you the senate study committee has meeting to order and the Dean of the Senate is going to open us an order prayer, Senator Harvison. Of this day, thank you for safe travel. Give us clear minds to do the best job for the people of Georgia on Jesus' name, Amen. Amen. Thank you, Mr. Chairman. Like I mentioned, this is the first of what will be four meetings of the study committee. Thank you all for being here. I know that it is a lot of effort for those of you that are not local to Atlanta to be here. Thank you for the non elected officials for raising the average IQ of this committee and certainly raising the industry knowledge and helping us navigate this process. We will have four meetings. This next meeting will be in August. It will be in Columbus, Georgia. We will then meet in October and Savannah. Then we'll be back here at the Capitol in November to complete our work. And just to kind of level set the tone of what what I think and what I hope will happen here, I think that probably all of us walk into the room with certain preconceived notions on what should happen with CON. I think we're all going to walk out after the fourth meeting with different ideas than we walked in the room with. And that would for me would define success is we learn through the process, both from advocates who want to see full repeal and advocates who want to keep everything as it is or maybe even go more stringent in their rules. So to those of you that are in the room, not sitting around this table, thank you all for being here. You're going to lend expertise to us as well. And hopefully educate us on the process and lead us towards what I know that we all want, which is better healthcare outcomes for everyone in the state of Georgia. As people present, I want to encourage the committee to ask questions. For those legislators, don't be intimidated that you may not be in healthcare. I certainly do not work full time in healthcare. I will probably ask them what to y'all would seem like elementary questions, but that's going to be part of the process for us to work our way through our four meetings together. Thought will be very helpful to do would be to go around the table and I'll try to keep up with your mics as we go. But for each member of the committee to introduce yourself, let us know where you're from and let us know what you do in the real world as to why you're here. So we'll start this end. Thank you, Mr. Chairman. My name is Jesse Wellington. I'm a little president. So you know, we were just association elephants. I live in Atlanta right down the street here in Rand Park, the from Carrollton originally. The company this issue from the 2005 Blue Ribbon Commission to being the committee aid on the 2013 special committee on CON. So I just happy to be here this morning part of the committee. Thank you. Dr. Wallace. Thanks, Chairman. Appreciate being here. Thank you, everybody for being here. State Senator Ben Watson. I've been in the Senate now for nine years and I was in the house before that for four years. I represent Savannah Metro area. Savannah Islands area around to Bloomingdale, all of Brian County, all of Liberty County, which is Richmond Hill and Hansville respectively. My day job is I practice medicine and Tarle Madison primary care been doing that since 88. And I do mostly geriatrics. So I'm in a group. So thank you. Thank you, Dr. Watson, Senator Sims. Good morning. Thank you, Mr. Chairman. State Senator Freddie Powell Sims district 12 Southwest, Georgia 13 counties that I represent the largest metropolitan area. I guess we can call it that would be Albany, Georgia. Very rural, very isolated and probably the poorest part of Georgia, but we we're improving. We're getting better. So thank you so much, Mr. Chairman, for allowing me to serve on this committee. Pleasure to have you as always, Senator, Senator Karpatrick. I'm Senator K Karpatrick. I represent district 32, which is Cobb and Cherokee counties here in the Metro area. And I am a retired orthopaedic hand surgeon starting in 1986. And I've been in the Senate now for seven years. Thank you, Dr. and for those of you that want to get anything done on this committee, you get to go through Kai. So Kai, go ahead and introduce yourself. Hey, I'm Kai Gallagher and I work for Senator Dolezal. Brief a throw. My name is Greg Dolezal and the state senator representing about two thirds of Forsyth County, North of Atlanta. In the real world, I work in technology that have been doing that in Georgia for about 20 years. Mr. Chairman, my name is Senator Ed Harbisson. I represent the 15th senatorial district. That is seven counties making Marion Taylor, Tobitsch, Sly, Chad Hootcher and the Southern portion of Muscovue County. And when I'm not working, I have four grandkids and a grand dog. And that's about the size of it. Thank you. Thank you, Chairman. Mark. Sure, Mark Baker, Columbus, Georgia, represent the Houston Clinic CEO. Hopefully bring a unique perspective. We're from North Tennessee to Melbourne, Florida throughout Alabama and of course, Georgia. So we also for the ones in the room. We own an acute care hospital in Russ County, Alabama. So glad to serve and look forward to it. Thank you. Good morning. Thank you, Mr. Chairman. My name is Steve Worth. I'm a practicing orthopedic surgeon for 35 years. I practice sports medicine. I've had the opportunity to run a large medical practice. And I also have done some teaching at Grady. I have served on the board of a not for profit hospital and not for profit hospital. Burleigh system. And I've also served on the boards of and the committees of several health plans. Treat. Thank you. You're right. It's live. All right. My name is Matt Hasbrook. I'm the CEO at Memorial Health Meadows Hospital by daily. Thank you for the opportunity, Mr. Chairman, to be a part of this committee and look forward to be being here. My background is 18 years in health care. My stemming in the services sector with payers. I've been over the last 13 years. I've been associated in the acute hospital world. I've worked with five different hospitals and five different states ranging from anywhere from CLN states to non-CLN states. I've worked in communities, 15,000 people all the way up to over 500,000 people. So feel we have a good ass regard for health care policy. Certainly operations and look forward to sharing and learning. Fantastic. Thank you. We were happy to have all three of you here. Actually, all four of you here that are not legislators. Just so you guys know, the push button in front of you on the microphone will alert me that you've just asked to have the floor essentially. So if you have questions, please do that. And I can turn your mics on and off from here. So as you have quite as you have questions, please let me know. The plan for the today is to hear from three industry level experts. We're going to give each of them 10 minutes and then we'll have unlimited time for questions. And then we're going to open the floor. It looks like we have about eight people who have signed up to speak. If you've signed up to speak, you'll have five minutes and then a limited time for questions from the committee. So without further ado, we'd like to introduce Jocelyn Hill from Senate Research Office. I asked Jocelyn just to give us a 50,000 foot view if you will of CON law. Some of the history of CON law and then specifically asked her to look at the data that she had available around states that have changed CON laws and what the impact and results of that have been. So Jocelyn, thank you for your thorough work. To members of the committee, you have a copy of her. Of her white paper, if you will, and your folders that you can take home and relate her. But for now, if you don't mind walking us through that, that'd be fantastic. Sure. As you said, you asked me to look at the states and analyze states that had CON programs and then either reformed or changed them and what that impact was within the states. Unfortunately, it doesn't seem to be a lot of research out there on states as far as tracking the impact after they've repealed or reformed. As far as their health outcomes, however, there is a lot of research that's done that compare states that have CON programs to states that don't. Obviously, this puts in some limitations as far as how you're comparing a little bit of Apple oranges as far as states and their whole health care industry. The researchers accounted for these and various different methods. But the history of CON programs in general dates back to around the 1940s a bit before that. After World War II, the US government got involved and encouraged states to start implementing these programs just trying to get hospitals going and bring in up with the health care industry among the states. And that program was in place for a while and quite a few every state at some point has had a CON program. But as time went on about the 1980s, they realized that maybe the objectives of CON programs weren't necessarily being meant. So the federal government stepped out and quit funding it and subsidizing those programs and so states decide to modify and do their own thing is moving forward after that. Some states repealed it. Some states modified some states changed it a little bit. So I'm just going forward. At this point, there's 34 states that do have CON programs and there are 12 states that fully have repealed their CON programs and about four states that have not CON programs or something similar to those type of infrastructures within them. So with that idea in mind, you kind of move into the now data that is doing comparison of these states as time has gone on because about the mid 80s. Moving forward, they have the 12 states have really repealed though recently, South Carolina, governor signed Senate bill 164, which establishes a three year sunset for their CON requirement program there. The only immediate effect of that bill is the counties that don't have any hospitals or health care infrastructure. They are automatically repealed and they can start moving forward to try to build clinics, hospitals, whatever they need to. But we'll start with the not the first study, but the literature review that was done in 2020 that kind of covered the history of CON like research that has been done. They did a thorough literature review, which resulted in them finding 90 articles that were really relevant to the effects. Certificate of need laws had on health care expenditures, regulatory costs, health care outcomes and access to care. And so they did a cost effective analysis based on their literature review of other people's studies. And the results provided mixed results with average finding that certificate and need increases health expenditures and overall elderly mortality while reducing heart surgery mortality. So they had mixed results among their different outcomes and different categories that they were looking at. Their conclusion was that based on their reviews and what they looked at that CON laws aren't necessarily meeting the objectives that they weren't put in place for. So to them, that means that they suggest state legislators look at their CON laws to see if they really are effective or if there's other means that they could go about reaching the same results. I'm not 100% sure if anyone has any questions on those. But it kind of goes through different categories. They're looking at they ask questions of what are the regulatory cost of CON programs, including federal and state government cost industry cost for compliance. They looked at the health expenditures outcomes, access to care. So among those they. Resulted in. So the impact on things like health expenditures. They found that. Based on what they were calculating for reduction and like coronary already bypass grafting facilities. The study calculated the number of these programs per 1000 patients as they did. And they applied it. They applied this to the estimate number of the surgeries that were being done among the distribution of a time period for people 18 and 18 and older. And they found that over a 15 year period. The prevailing rate was that iting like increased cost a little bit. Not all of their findings were like statistically significant, but just generally they found that maybe not all of their. When you're looking at specific procedures that some of them were more positive, some of them were negative as far as that goes. And then looking at the third study. Some of their certificate of need laws and hospital quality. There the. They tested the hypothesis that hospitals and states with commas provide lower quality services than hospitals with commas. Their results were that they couldn't outright just reject this hypothesis saying that states with comma without comma programs were just better at providing care. Because they too also had mixed results, but overall comma regulations did lead to lower quality care for some measures of quality. And have little to no effect on other measures of quality. So they did a variety of different categories of care that they analyzed statistically across the states from 2011 to 2015. Looking at what the impact was per hospital and area among the states. And they did a categories of con states and noncon states. And you can see on table six a little bit of the different measures they're looking at like death among surgical impatience with serious serious treatable complications. And you can see that con states had a median of 1.113.2. Well, con states had 116. So the difference between them is not substantial when you're looking at the numbers, but I mean you're looking at it per 1000. So it is. Has some impact as far as that goes. And then the final study. Looked at the difference in markers of hospital activity and quality by state of certificate of needs status. These markers included hospital procedure volumes hospital market shares county level procedures per 10,000 persons and patient level post operative outcomes. So they did a cross sectional study involving Medicare beneficiaries age 65 and older wonder when one of the following 10 procedures from January 2016 through November 30th 2018. For things like total knee and hip replacement coronary artery bypass grafting. Ventricular hernia repair. Long resections, pancreatic resections and other medical procedures just to see what the outcomes were. They may now comes. The results which are really number heavy actually, but if you look at their on page three of the memo, you'll see the groups that they analyze and the hospitals. So the number of hospitals they had were. For no certificate in need was about 1000. 300 and five and then for certificate of need was 2,226. But this kind of gives you an outline of the demographics of the groups that they were analyzing with their outcomes. But if you look at table two that provides information regarding the median hospital procedure volume and market share. So you can see their overall procedures between certificate of need, non certificate of need and what the difference between those two worth. With their conclusion being that considering the objectives of. Comma programs they are. Which is to limit spending and limit over expansion to avoid excess capacity and improve quality. They found that they may not be reaching these objectives when you're looking at the comparison among the states with those with or without in these different categories that they looked at. And that's kind of it. I know it's pretty data heavy. All of the study so if you have specific questions that may be a better avenue to answer. Thank you. So, Chairman Kappaschard. Yeah, thank you very much for all the detail. But and you may have said this and I may have missed it. But I know that some states that have repealed so in have made some exceptions for nursing homes. Yes. Did you run across that? Yes. So even among the states that have repealed. There is not like they completely get rid of the licensing scheme process for hospitals in different areas. There is a couple of states that do have exceptions even among the states that have con programs. So you are even among states that have con programs. You're comparing different things because we cover a lot of categories here in Georgia and other states only have. You know nursing homes or they have emergency surgical care or different or just hospitals. They don't cover all of those. So if you look like just the straight up analysis of what kind of programs are covered among the states. You'll see that some of them do have exceptions for nursing homes and different types of care units depending on what they have. I believe the South Carolina law that was just signed actually the only car about they have through keeps the ICU and for nursing homes. Sure, Chairman Harbs. Yeah, right. I'm interested to know and I may have missed it and trying to follow you not only the quality of care but really the access to care. How was that if I was that significant difference one with other than that category and how was that defined and the 34 states you mentioned. So it depended on the study on how they defined access to care. Because you're looking at states that have bigger metropolitan areas and so like Georgia we have Atlanta it has quite a big city area. But then you get out into the rural areas and so when you're comparing the access to care and how they define that it varies a little bit on how that's measured among the studies themselves. But overall it seemed to appear that even access to care. It wasn't statistically significant but it was there was a difference. So as far as the availability as far as some of the studies that like travel time that they would have to do in order to get to access to care would it be two hours versus four hours depending on where you live. So if you're comparing Montana to New York that's going to be a very different of how they define access to care in their studies and how they even look at it there. I asked that because for instance making county they don't have hospital it closed and that's kind of the way things have been happening throughout some parts of rural Georgia. No access or they have to go to Sumter County or Columbus or something like that and over to get care. And you know better than I do doctors in a minute counts. So that's why would you know what what you're saying it was not significant you're saying no it had make results based on how they defined access to care among the states. Yeah, okay. So that's kind of the problem with the research is that it's a telemedicine involved in that as well. In some of the newer studies it is but in some of the older studies that you're looking at so with the literature review you that goes back quite a few years before telemedicine was a thing. So some of their studies aren't don't account for things like that and as far as with COVID and everything how that happened a lot of states during that time did suspend their certificate of need programs as part of their emergency protocols. And so a lot of states did have slightly different rules different things were available they were able to increase their bed sizes and things like that in nursing homes and hospitals emergency care units and. Even though quite a few of those protocols have ended that has kind of brought the idea of certificate of need back into a popular topic of research again is people are looking at whether. Post COVID this shows any sort of significance as whether they want to keep going with these programs because it did help with the access to care but now you have things like telemedicine and rules and states are making those changes to make those things available for people. Thank you. Thank you. Chairman. Any other questions from us Hill. Senator says. Thank you so much. And you know, telehealth medicine, telemedicine cannot be used for every issue and especially in you know we use it a lot in rural parts of the state but. It cannot be used for every situation medical situation that arises. I would like for you to also go back and give me a little more details or if you can about Medicaid and how it. How the con laws were impacted or were not or could you give me a little bit more information. Yeah, so that last study they looked at Medicare beneficiaries. So that is mostly that's looking at that group in particular and how was impacted and the results were a little bit of a mixed as far as. What you're looking at for different outcomes, certain procedures that you would get of someone 65 and older like a knee replacement versus getting like all. Artary, Artie, real, Artie bypass or I'm not even sure what that's called anymore things like that would be different as far as the outcomes for those procedures so some of those were better in con states because they did have things more centralized and specialized and some of them were not for other simple surgeries or procedures that you would go in for like pneumonia or something like getting access to care that way. So it is a little bit. Center, I think your question is to Medicaid correct not Medicare or are you asking for Medicaid Medicaid. Oh, okay, sorry about that. The I don't really I don't think that they looked at that. No, none of them really booked that Medicaid itself. There was a couple of studies that were that discussed. Not necessarily Medicaid, but the impact on children and their ability to get access to care. And that one was found to be a little bit harder. It states that have con. Yeah, just because of how, but I think that maybe just a little bit of an industry thing there may be less people who work in those fields all across the United States, it might be a shortage. Thank you. Thank you. Thank you. I think that's great anytime you bring research to the table. But I want to go down that research rabbit. Oh, one, one second. So when you're looking at all of your, your reviews, you mentioned statistical differences. So in all your reviews of each study, did you get an average of the data points that actually were reviewing for each study? Yeah, so they do have those numbers in there. I didn't want to get to data heavy and I'm not to go there, but I. Yeah, yeah, so I mean, I did try to provide like the general outline of the groups that they were looking at, but they do have like the actual numbers. If you, yeah, if we can circle back, that'd be great. Okay. Thank you. You just use circle back in your first government meeting that we're having. That's pretty good. Any questions? Maybe on number two. All right. Thank you, Mr. Chairman. So South Carolina most recently revisited this, but I believe our neighbors in Florida and North Carolina have looked at this issue recently as well. Could you comment a little bit about what you found in those states? Um, as far as what they're, I think they're still in the process of looking at them. They weren't successful in doing like full reform or getting things through. South Carolina was really the only big highlight recently as far as that goes. But if I remember correctly, I think Florida was looking at not necessarily a full repeal, but doing an overhaul of it and changing the categories that it applied to like who actually had to get these. Get certificate of needs. But I'm not 100% sure I might have to get back to you on that for more information. Other questions from the committee. Thank you, Miss Hill. Appreciate it. And if anybody wants to reach out to Miss Hill, you can contact high. If you have any specific questions and she'd be more than happy to fall up on that day. Thank you so much. We had a couple of members. Join us just a few minutes ago. You guys missed where we started chairman, casers and brass of just introducing yourself with the committee. What you do in the real world. So we have a lawyer.\n\nan entrepreneur and then maybe chairman Brassu you give us a highlight in your handicap as well. I know that most people are wondering how the golf game's going. So we'll start with chairman Couser. I'm chairman of the Senate regulated industries and we have handled some of the CON issues, but in real day job, I'm a mitigation attorney out of the Calcert Heath Farm and Athens. We've got eight attorneys and cases in about 30 counties throughout northeast George in the metro area. It was chairman. How's your handicap down? I wasn't good enough to make first cut for the governor's cut this weekend. Love it here at when. Chair for Brassu. Yeah, I don't know what you're talking about, but Matt Brass, I'm a little old senator from New New Georgia and in my day job, I want to start up commercial reefing company and that's about it. Handicap is not good. It's going the wrong direction. That's a, which you're making more money than you were a couple years ago. So that's going the right direction. I don't know. Not hourly. We have join us by Zoom, Dr. Thomas Stratman with George Mason University. If we could ring Dr. Stratman in. Ask Dr. Stratman to take part in this first hearing because he was part of a group that looks specifically at Georgia and ran some modeling and did some statistical analysis and really predicted what would happen around CON repeal in the state of Georgia. And Dr. Stratman, thank you for joining us this morning and I'll give you the floor for about 10 minutes and we'll return to the committee to answer questions. Third, ask questions. Thank you very much. Thank you for the opportunity to share my work on certificate of need as it applies to health care in Georgia. My name is Thomas Stratman. I'm a distinguished university professor of economics and raw at George Mason University in Virginia and the senior research fellow at the Mercator Center at George Mason University. Certificate of need laws require healthcare providers to obtain permission by proving need for their services in the community before they open or before they expand practices or purchase certain devices or new technologies. Certificate of need laws exists and as we just heard 34 states, I will refer to my studies often to 35 states because the studies I did include the time when South Carolina still had a certificate of need law which brings the number of states with CON laws to 35. New York in 1964, the state of New York was the first state to pass a CON law and the goal was to contain costs. And in 1974, the federal government passed a CON law applicable to all states. Again, the justification was to maintain medical costs. However, studies showed that CON laws were not successful in containing costs and so the federal government repealed its CON law in the early 80s. And also by the 1980s, the rationale really for CON laws was gone. This is because before the federal repeal in the 80s Medicare and other insurance providers used a retrospective reimbursement system. So hospitals and providers were reimbursed for whatever services they provided. And there was a concern about excessively high cost because providers had some incentive to provide unnecessary services because after all, they got reimbursed for all services provided. However, by the 1980s, Medicare and many other insurance providers switched through the prospective or diagnosis related group or DRG system, which is based on the patient's diagnosis. So medical providers no longer had an incentive to over-provide services if they did this really in the first place. And the prospective reimbursement system is used today so the original rationale for CON is gone. However, keeping CON laws on the books without a negative consequences for patients. In several data-driven studies, my co-authors and I document these harmful effects. In these studies, you compare states with CON law to states without CON law. So comparing the 35 states with CON laws to 15 states without CON laws. And these studies show that CON laws reduce healthcare quality, reduce access to healthcare and harms patients by reducing the availability of medical equipment, such as MRI machines that can help to diagnose illnesses and prevent premature deaths. And it's also important to note that these findings are consistent with the positions, positions by the Federal Trade Commission and the US Department of Justice under both democratic and Republican administrations. These agencies argue that CON laws fail to meet their state of goals and that they are harmful to patients from over the American Medical Association also favors the repeal of CON laws. CON laws in Georgia require that an already licensed licensed healthcare provider obtains government permission to compete in the marketplace for 22 medical services. Among the states with the highest number of CON laws, Georgia rank seventh. And examples of these medical services that regulated our hospitals needing permission to add a new bed or providing this permission to open a new hospital. Permission is required to purchase an MRI machine or a CT scanner. Permissions also required to open up an ambulatory surgery center. So certificate of need laws were well-intentioned when they were first introduced in the 1960s. As I mentioned, one of the goals for the reduced costs and advocates also arguing that advocates of CON will argue that they increase access and increase quality. However, the effectiveness of CON laws should be really measured by their outcomes not by their intended goals. Even the best intended laws might not lead to the desired desired result and might yield unintended consequences. So my colleagues and I examined data to test whether CON delivered on the goals and we find that CON laws do not. In fact, they're backfired. It turns out that states with CON laws have less patient access to medical care and lower quality of medical services. Also in this context, it's important to notice that to note that CON laws do not have any public health justification. That is, CON requirements have nothing to do with public health or safety. So the data show fewer hospitals in CON states than states without CON. So in about in around 2017, Georgia had 175 hospitals. The comparable state with Georgia without CON has 227 hospitals. So state without CON has more than 30% more hospitals. So this shows us also that CON reduces access to medical care because there are few hospitals available. Also the findings show that states without CON have more hospital beds per patient. Why is it this important? Well, it means patients have more patients, have more choices. They're less likely to turn away from a hospital and it might mean that hospitals are closer to patients. So all these estimates actually make apples to apples comparisons or as good as they can and comparing CON states to non-CON states. That is because these estimates, they're adjusted for the age distribution in the states, the healthiness of the population and the penicential population or Medicare and Medicaid. Georgia also has a CON law for ambulatory surgery centers. The data show that currently, Georgia has about 360 ambulatory surgery centers without CON, Georgia's ambulatory surgery centers would increase to 500. An important issue of mentioned is the effect of CON on medical services in rural areas. Proponents argue that CON increases access in rural areas. But the data analysis we did shows that this is not the case. Georgia has fewer ambulatory surgery centers and fewer hospitals in rural areas. For example, if we show that if Georgia, but to repeal its CON law, there would be seven additional rural hospitals in Georgia. The negative effect of CON is not just restricted to facilities, but also to medical inputs, such as MRI scans, CT scans or PET scans. So currently, Georgians receive about 90,000 MRI scans per year. If there were no CON laws, the number of scans would increase to 120,000. And this gives us a glimpse how healthcare would be if Georgia were to repeal its CON law. Most scans are helpful because they can show illnesses and prevent premature deaths. And again, going back to the prospective reimbursement systems incentives are not there for physicians to over prescribe MRI scans because if they're not necessarily would actually cost the money because they're only reimbursed based on the diagnosis. The data also show that CON laws reduces the quality of hospital care in CON laws. So the quality reduction is due to because of a lack of competition in states with CON laws because CON laws prevent entry. And so incumbents face less competition. This manifests itself in lower quality of medical services measured as higher pneumonia mortality rates, higher heart failure mortality rates, more deaths of our surgery patients and serious complications. Finally, supporters of CON laws often say it increases indigent care, but the data we looked at show that states with CON and without CON have roughly the same amounts of indigent care. So there's no difference over here, no benefit of CON laws in this dimension. So as we heard, some states have action to reverse the harmful effects of CON laws by repealing these laws. And so what happened is when states experience increased population growth, the harmful effects of CON laws became more apparent. So South Carolina repealed the CON law last this year in 2023. And the largely rural state of Montana also experienced population growth, repealed the CON law in 2021. And in 2019 Florida repealed the significant portion of its certificate of need to grow. So the takeaway from these findings is CON laws are bad for Georgia residents because they reduce the quality of medical care, they reduce access and they reduce opportunities to obtain medical services such as MI, scans or CT scans. So based on this research, the research shows that Georgians would be better off the peach state would join the states that do not have CON laws. Thank you. Thank you, Dr. Trum. I want to ask you the initial question if that's okay. Can you walk us through the methodology that you used to come to the seven additional rural hospital conclusion that you came to? What's the process that you used and what's your level of confidence in that number? I compared, I looked at only rural areas in CON states and states without CON. And specifically CON states that regulate entry into the hospital market when you need a CON to open hospital. And I compared these states and computed the averages for each state and adjusted for the population that is on Medicare, Medicaid, the age distribution and the socioeconomic characteristics. And then I found a statistically significant difference. In terms of the number of hospitals in rural areas between the two types of states with and without CON laws. And there was a certain percentage and I applied that percentage to the situation in Georgia and came up and the result showed that there would be about 7%. So by standards of specific significance, I'd be 95% sure that this would be the case. Thank you, Matt. Along those lines, I appreciate that question. When you think about those seven hospitals, what type of hospitals taken into account? I mean, a hospital is not a hospital, there's different types of hospitals. And so as you think about that, are these post-acute hospitals, are these acute hospitals, are these specialty hospitals? Any thought process on that? So these were the hospitals we used in the study were sort of general hospitals. There were not specialized hospitals. So I think it's fair to say that this applies to general hospitals. Moreover, if you think about it, or of course, if you think about it in a rural area, in a hospital open, it probably would not be a specialty because in the population density, it would be probably a general hospital. So the best to my recollection, these use general hospitals, not some specialty areas, but I have to go back to that exactly. Chairman Harvester. Thank you, Mr. Chairman. In that same vein, the idea, I think you said in 1960 was an idea that was well-intentioned, but when it arrived. So if a hospital is serving a purpose, the profit motive, I guess, was not only the only thing considered, but there was kind of protection for that hospital to thrive and grow, even in downturn times, or time when times are down. And how do you counter the fact that people are leaving rural areas and relocating to urban areas, and how do that whole mix come about when they share a pick and then follow the money kind of thing exists when people are trying to hospital to try to survive? Well, some people argue that, one rationale again is for having a CON law for ambulatory surgery centers. Some people argue that, well, these ambulatory surgeries transfer to their cherry picking along the lines, which you just said. And so this harms the general hospitals in the rural area. However, this is just not absolutely not the case. If you look at the data, you see that states with CON laws, they have both fewer hospitals and few ambulatory surgery centers. So in states without CON laws, you see ambulatory surgery centers and hospitals, the center hospitals being more plentiful, and they are able to survive and compete with each other. And it's just not the case that hospitals are going to die when a competitor is opening up, at least not on average in terms of what the data show. Hello. And I have a question and maybe Jocelyn can answer this too. One of the issues that I noticed when I was looking through all this is everything talks about facilities. And is there any data on number of physicians per capita in CON versus non-CON states? And what if you have a facility, you don't have any physicians to provide the care that doesn't do any good? And I've done some back of the napkin look at that. But is there anything that talks about number of physicians per capita in CON versus CON states? I have not seen any work on the number of physicians per capita. I mean, given that physicians are putting mobile in terms of, they can, you know, if there's a higher wage in South Dakota than in North Dakota or something like that, people might move to the higher paying state. So I am not sure. I have to think about some more how informative that number is because clearly the number of doctors per state or populations also going to be depending on the employment opportunities and that depends on the number of hospitals out there. It's important thing to look ahead, of course. Thank you. Until then. Thank you, Mr. Chairman. Dr. Stratman, certificate of need can be a lengthy and expensive process to obtain four providers that are required to get them. Are you aware of any research or attempts to quantify opportunity costs or deadweight losses related to the application process and the appeals and legal processes that could be associated with certificate of need? No, I have, I mean, I have not looked at, I personally have not looked at deadweight losses. I know of many agonetic goals. I know some people, you know, depending on the project application might be 1000 pages long in some states that was an extreme example from Virginia. I know that, you know, the regulatory process can take many, many months or sometimes even years that the opponents of the would be competitors of the applicant. That is, the hospitals that exist, they have often a voice in opposing this application. So this also then involves lots of lawyers fees. So applications can easily run into the hundreds of thousands of dollars if you include all of the inputs that are required to make the case at various stages of this application process. Senator Stras. Thank you, Mr. Chairman. Because I represent a rural area of the state, my concern really focuses on the rural hospital. So how would it eliminate the CON law, the certificate of need, lead to more hospitals in rural areas of the state and talk about the workforce? I think we just mentioned something about the medical personnel doctors. How would we supply if we were, if we had additional hospitals or we're able to do that in the rural parts of the state? We lost hospitals over the past few years in the rural parts of the state and a lot of it had to do with population, people leaving those rural areas. They could not sustain them. So give me your opinion about that. Yeah, I think it's, of course, I mean, if the population is going down, there's going to be a, you know, there's going to be less demand that I can see that some hospitals might be closed. I, first, my, my first response is that if I look at, again, this goes back to the data. If I look at data in rural areas, compare states with CON and without, I see more hospitals in rural areas when the state does not have a CON. Why is this the case? Oh, I would sort of, let's take some speculation if you ask me about my opinion. Well, you know, maybe they're going to have, it's maybe a smaller scale. Maybe these hospitals that are closing right now in some areas, their scale is just, they have hundreds of, hundreds of beds and they just cannot maintain that size anymore. And so it might be, you know, when the CON laws repeal, I could imagine that the hospitals coming in, you know, maybe it just has 50 beds or 100 beds. So not these enormous sizes that might exist currently that are no longer profitable given the decline in population. Chairman Brassion. Yeah. Thank you, Mr. Chairman. Dr. You'd mention that there's, in your studies, there's more hospitals in rural areas, but I guess according to Senate Research study, there's actually less. So I'm trying to figure out what's the disconnect in these two studies. And then second, are y'all looking at, are we looking at hospitals in these rural areas, or are there other facilities like a ASC or a LNR? You know, we keep, you know, to, to Senator Powell Sim's point, she keeps mentioning a hospital in rural areas, but, you know, hospitals just not going to be sustainable in every single county in Georgia, but, but other medical facilities are, and CON does prevent that. And so, you know, can you maybe touch on number one, where's that disconnect? And then two, are the studies looking at other facilities in CON states versus non-CON states? So let me actually pick up the second, second point first. So I consider both ambulatory surgery centers and hospitals. So, so my findings extend to ambulatory surgery centers. So it's quite possible that a county, you know, as an ambulatory surgery center, or this is sort of something I alluded to earlier in my previous answer, you know, new providers are going to, I like it to pop up, I would think, just at the smallest scale. And that is going to be much of an improvement for individuals living in the rural areas. With respect to the disconnect of the studies, I am, I need to, to give you a brilliant answer, I would need to know exactly the study that finds a different result than I do. I'm confident in my results, or in our results, meaning out by core authors and mine, but I'm not familiar with that study that was referenced. So I cannot give you a successful answer, but no. The thank you, Mr. Chairman, quick follow up, Mr. Peter Jocelyn, did you all, in your study, did you all look at where ASCs included as hospitals when you looked at that rule? And maybe that is the disconnect. Which study, if you're looking at? Well, I'm looking at your Senate research paper. And if you go to page three on the chart there, when you go down to no CON versus CON, and you look specifically at rural, and these are, I guess that's talking about number of, I don't even know what that number is, but anyway, there's less in rural hospitals than there is in, in, or I'm sorry, there's less in non CON states versus more in CON states. So maybe, maybe I'm misreading the chart. What is that, what is that data point there? It's the second to last line on your chart on page three. So this is actually a study that was published by the Journal of the American Medical Association. It was a 2020 study. I don't know if you probably did look at this. But those were just the your base numbers, more of like demographics of what their study, when they were looking at the different states, what they found as raw data as far as like how many were in each area. So so, um, certificate of need for the role they had a 13.26, um, but that's just like on the number of comparison of how much they based on like the quantity and total numbers of what they were looking at as far as the different hospitals among the states. I don't know if that makes any sense. Not really. Is there is this saying there's less hospitals in rural Georgia than they're in a non CON state than there is enough CON state? Is that what that data point is telling me? Yeah. Okay. Yeah. So, um, so I guess my question, and I don't know that anybody's going to have this answer, but did that study include ASCs? Because if it did not, then that may be the disconnect and what we're talking about. That's what I'm just trying to figure out. But again, I go back to my earlier point is we keep talking about hospitals in rural Georgia, but we forget to talk about health care in rural Georgia. And you don't have to have a hospital to have health care. And that's to me that one of the biggest issues of CON is it is preventing health care in rural Georgia. Thank you. Senator, Senator Sons. Thank you so very much. And you're absolutely right, my colleague. But we also understand that even if you have ambulatory services in these rural areas, there's financial, there's a bottom line even for those ambulatory services. So, we look at how do we balance?\n\nthat. It's difficult even now to get medical personnel to come into the rural parts of the state. And we want to make sure even if the laws or repealed or tweaked or whatever that there remains a balanced way of treating patients in rural Georgia. And as we've we continue to say quality care. We just don't want it to be here's a corner store or place you can go and get a some medicine medical help, but it's not quality. And that's that to me is the most important part of health care and access. So you're absolutely correct. Senator Watson. Thanks, Chairman. And thanks, Senator Sons. You had certainly heard me say in this chair of HHS I started out every year by saying how the scenario is changing for reimbursement. And if you look at quality, you'll drive price. Because if you do the things relating to especially outpatient care, primary care and that he's even being driven towards specialty care. CMS has done experiments of over a dozen or so. When I say experiments, these are billions of dollars. And it has been shown unequivocally that that as you drive primary care, quality care, no matter whether it's urban or rural, you drive down price. And you get reimbursed better. So I agree with you 100% we the federal government is doing that driving quality, driving care and driving price. That is one of the few things that the federal government has done to save money. And that is unequivocal and no one is refuting that. Because you can't really argue if you're driving quality care. That's not the right thing to do. Having said that, if you look at the minutia of all these, I mean, if you go back up in that chart, there were more hospitals in the less than 100. And that's how we define rural health care in Georgia and CMS does that too. It's a county less than 50,000 and a hospital less than 100. I mean, I think what Miss Hills done is does show mixed results. So I mean, listen, it is not showing unequivocal results for keeping more regulation than it's hard to justify a monopoly and be an anti-competitive. If you look at the Mercatus Institute, looking at different aspects of that relating to Amatory Surgery Centers and other health care quality issues and CON versus non-CON, I think you can go back to the quality metrics. I think that's right. I may take a little issue with the estimation relating to Amatory Surgery Centers because there are a lot in Georgia, whether they'll be an increase or not, there may be, but there also may be some joint ventures, I would think relating to that because some are struggling getting back. Because reimbursements relating to Amatory Surgery Centers are reduced. So I think that's something to consider. But again, that sort of goes back to quality again, doesn't it? Because if you're delivering quality and delivering a significant amount of volume and a quality metric than you are doing it, and nobody's talked about cost relating to that. Certainly outpatient treatment, whether it's in primary care physicians office, whether it's an Amatory Surgery Center, unaffiliated with the hospital, not only is the quality as good, in some studies, do show that it is better. The cost is about a third to a half, same with the imaging centers and things like that that we also present and prevent. I don't know, there's just some thoughts. I didn't bring in DPP, directed payment plan. Nobody's brought that up. That's sort of the bear in the room or the that's something that is a benefit to the rural hospitals, all 61 rural hospitals, both indigent care hospitals here in Grady and at Talmadj, Urem, CG, and 21 teaching hospitals here in the state of Georgia. So that's something positive that CMS has done for over a dozen states starting in Arizona. We use the Kentucky moda. But I think that's important and that does play a role when it comes to rural hospitals and indigent care. So just some thoughts. Thank you. Thank you, Chair and Watson. While we have Dr. Strattman, does anybody have any final questions for him? Dr. Thank you for joining us, your work as it relates to Georgia is very helpful because not your studies, the only one that I could find that was specific to our state in terms of predicting outcomes. And so thank you for your time today. And thank you for the work that you've done that would allow you to be here. And we'll thank you very much for this more questions. Thank you very much. Thank you. All right, I want to move on to our third and final industry expert that we're going to hear from this morning, which is Anna Adams from the Georgia Hospital Association, Miss Adams. If you'll come forward, I believe you have somebody who's going to join you. But while you're stepping up to the podium, I believe the Christine McEwen is on Zoom. Yeah, that's perfect. And I neglected to call on you, Christine, earlier to introduce yourself as a member of this committee. So if we could bring Ms. McEwen on screen, unmute her and allow her to introduce herself, that would be fantastic. Hi, good morning. I'm Christine McEwen. I am so sorry. I wasn't able to be there this morning. But thank you for allowing me to participate. I do work for Piedmont Health Care. I've been with Piedmont for 16 years. So it has been a part of great part of their growth on the legal council now and have oversight of the CON program within Piedmont. So I hope to bring a little bit of day-to-day expertise of just how it works for hospitals and physicians within the state of Georgia. So thank you for allowing me to participate. Thank you, Christine. I can't see you while other people are testifying. So if you do have a question, don't be bashful. Just go ahead and unmute your microphone. Get my attention. And we'll call on you. Okay, perfect. Thank you. Thanks for joining us. More than Anna. I'm going to turn on a witness to you want to pull witness three. Up next to you, I'll unmute both of those and you all can have the floor for about 10 minutes. I'll have a time for questions. Thank you so much. We very much appreciate being here with you today. I am Anna Adams with the Georgia Hospital Association. For those of you that I do not know, we are the largest hospital association in the state representing more than 140 member hospitals ranging in size from small rural critical access all the way up to very large urban metropolitan systems. We also have specialty hospitals and behavioral health facilities within our membership. So we have a pretty broad understanding of the challenges that hospitals face. Again, I want to thank you for giving us the opportunity to talk with you today. We have been very busy since the end of session working with our members on certificate of need and trying to come up with some areas in which we think there could be some meaningful changes without creating harm without making it more difficult for patients to have access. And so one of the things that I do think we want to kind of kind of highlight is just that access in general. And I would ask each of you when we talk about certificate of need, what is that problem that we're trying to solve for? Is it that patients don't have access to all services? Is it that they don't have access to certain services? Is it about affordability? What is the issue that we're truly trying to get at? And so we for the last several weeks have been meeting with a group of members at the direction of our board. We created a CON workforce and we have had multiple meetings to talk about the different aspects of certificate of need. You'll see today that you have a binder that we created for you and each section has a little tab attached to it with all kinds of information. So I'm very encouraged to hear some of the questions that you've asked today because I think all of the answers are here in your binder. So if you need a little light reading, this is something that you can look at over the next several weeks. I want to start by just talking about the fact that we as an industry are trying to be at the table, be a part of that solution, work together with you on some of these healthcare issues, but we don't want to consider certificate of need in a vacuum. So while our work group at the appropriate time will offer some recommendations to change the CON program, we recognize that any changes to the program can't happen on their own and cause meaningful change in healthcare. We have issues across the state with access to trauma care. We have issues with maternal mortality. Each of those things is a really large substantial issue that I think all of you want to address and have been trying to address and they're not necessarily linked to certificate of need. So what we would ask is that you sort of take a holistic approach to looking at healthcare, trying to figure out where we can make some changes that will be helpful for hospitals, physician practices, nurses, etc. So Carrie Conley, our general counsel is here with me today. She has been our CON expert for more than 12 years at GHA. And we are just going to kind of go over some of the things that are in your workbook and talk a little bit about what we perceive as some of the biggest challenges in healthcare and how we think we can get there with some meaningful changes. First, just go through your notebook and we won't review these individually. I want you to, if you can, please flip to just that first tab, the second page. There is a timeline there after the blue sheet of all of the changes to certificate of need in Georgia over the last several years. So while we do continue to hear that the program is introduced in 1975, you can see that there have been multiple changes, both at the statutory and regulatory level. Everything you see in red is a legislative change. And there are some details there, but we can of course get you additional details if you would like. The last substantial change that we had to this certificate in need statute in Georgia was in 2019. Many of you here in this room were a part of that change. And it was again a meaningful change. Those rules and regs went into effect during the 2022 legislative session. So very new to Georgia. We also have included in this book some comparisons of Georgia to other states so that you can see how we compare. There have been a lot of points made today about what Georgia regulates according to CON and what they do not. It's not quite so black and white. There are a lot of exemptions in place for many of these things, MRI, CTs, single specialty surgery centers that are not just you can never have an MRI. And so I would also encourage you to think of CON not as the barrier to injury, but the gateway so that we can protect quality, we can protect patients, make sure that we have access to all services, not just a proliferation of one service, because I don't think that anybody is interested in seeing us have 500 surgery centers in the state, but no access to emergency services. So we're trying to make sure that we have that holistic approach. And a kind make one comment on that, expand on that a little bit. Good morning, everyone. I think that that is really a key in terms of how that we think about this. We've talked in just this morning a lot about access, but it's important to drill down on what the speaker or the article that you're reading or the research paper means by access. Do they mean that every citizen and every part of the state has access to emergency services, EMS, trauma care, maternity care, prenatal care, or do they mean that there are more hospital beds or more facilities, just because you have a facility in place or you have a licensed hospital bed or ASC available, doesn't necessarily mean that citizens all across the state are accessing that particular care or the other care that I mentioned, because as Anna said at the beginning, all of this is linked together. If we pull a trigger over here, we're inevitably going to impact things down the line across the state. And so we need to be looking at this from a real holistic perspective. That's a great point, Carrie. In many of the studies that we have heard about too, I want to add that these are not apples to apples comparison. So one CON state to another does not consider the state scope of practice laws. It doesn't consider their Medicaid program. It doesn't consider how they reimburse the age of population. So many factors can go into outcomes and what your quality looks like. So please also consider that. And the studies that we've heard about this morning, including the ones that Dr. Shremmon talked about talk about correlations between CON states and non-CON states. They do not talk about causation in terms of why there are more facilities in one state and another. And that's pretty clear when you lay out the state. They're candid about that or when they lay out the paper. And so that's another thing when we're looking at this research, what we need to drill down on. Quality is a really great example here. And some of the studies we've seen about quality, where they compare CON and non-CON states. Some of the quality metrics that metrics they're talking about can most directly be improved by access to primary care. Not necessarily access to more hospital beds or even to the temporary surgery centers. Same thing for prenatal care. Many of the areas at the state where we talk about the worst maternal mortality rates. It is not because there is not a hospital with labor and delivery close by. It's that the county does not have an OBGYN that there are no prenatal services available to those women in those areas. And so the question then becomes, how do we incentivize recruitment of those physicians, those specialty physicians, down to those rural areas, and ensure that they have a way to practice, that they have a way to be reimbursed, and that those women have access. And you don't need a CON for an urgent care for primary care physician for an OBGYN. So that is something that I think would be easy to address or could be easy to address that would have a really big impact at a statewide level. Some of the other areas that we would like to just discuss today that are not necessarily CON, but do have a huge impact on access to care. Carrie mentioned trauma funding, something that we have been working with the Georgia trauma commission and others on access to EMS services is a really big deal in Georgia right now. Many hospitals are struggling to be able to transfer patients. Many patients in rural areas are having difficulty getting access to those EMS services when they need them. So that's an area where we would like to see some investment that again is not necessarily CON related, but has a huge impact. I want to re-emphasize that we are not here today to say no, to change us to CON. We had our work group meetings and, pardon me? No, we had our work group meetings. You just said no. I did say no. Sorry. If you'll flip to tab six in your binder, you can see the agendas for the various CON meetings that we had. And each agenda kind of highlights the different areas that we discussed as a group. We did have our final meeting yesterday and we have recommendations that are in the close to final stage from the work group. Our GHI board will be meeting on June 26th for final adoption of these. And then we will take them to the membership as a whole. But at that point, afterward, we would love the opportunity to come back to this group and share those with you at the appropriate time. Just to kind of talk about what conversations went into where we landed, why we think the recommendations would be helpful and not harmful and what areas we feel like could really use some attention and would like to continue our partnership with you on working towards some of these solutions. And we are happy to answer any questions that you may have. We hope you have a lot because we've been in it. I have a question. I want to clarify something. You said that the studies don't consider age, indigit care, etc. I thought the end the answer to my question, Dr. Sharpman said he specifically did try to realize that. No, and if I said that, I misspoke. It's not that they aren't considering the type of population or patient population from state to state. It's that they're not looking specifically at all of the other factors in the state, some of which analysts had earlier about how we reimburse for care. The frankly, the financial status of the various rural areas in our community and whether it's financially feasible to put a hospital or an ASC in those communities, the workforce questions. It's those sort of things that aren't considered from state to state when they're making the comparison because as everyone in this room, both up here and in the audience is aware, healthcare is overly complicated. And so it's really hard, particularly in a subject like CON, where even the CON regulations are different from state to state, to make an apples to apples comparison because there are so many other factors that go into access to care. So what's your best assessment as to what would happen as it relates to the seven hospitals or ASC centers that he believes would come into play looking at other states? Is your thesis that George is an outlier because of all the things just mentioned and that would happen? Or do you believe we said we would see an increase in investment in the state? No, I don't think the outlier is necessarily the right word. I will say that I am skeptical. In part because that is not a Georgia specific assessment. That assessment came from, I think you heard Dr. Stratman use the word average a couple of times. He looked at all CON states that regulate hospitals versus all CON states that don't regulate hospitals and came up with this average number of facilities and then applied that to the number of hospitals in Georgia. And so there hasn't been a specific Georgia related analysis in terms of where in the state might those hospitals pop up? Are they financially feasible and not just in the short term but in the long term and how it impacts other access to care around the state? So do you think that there will be more hospitals that would open in a repeal scenario or ASCs and rule George specifically? No. Then what are you afraid of? Well, that's a good question. There are, we have some maps in our, I don't know what tab it is, Ana. We have some maps of where there are ASCs currently located in the state and you can see, and this is true in both Georgia and in other states regardless of whether they have CONs. ASCs are typically located near hospitals. They're typically concentrated in metro areas. So to your point, I think it's accurate to say that is it likely that an ASC is going to open right next door to a tiny hospital, critical access hospital in rural county? Probably not, but where we start to run into the risk is on the the outlier kind of rural counties that are getting close to the metro areas where you've got exerbs. And as the population starts to increase as industry starts to come into Georgia as we've been so lucky lately to have many new manufacturing plants coming in. As those things start to change, there is certainly a risk that if a specialty provider opens up on the metro exerb inside of one of those smaller rural hospitals, that that's going to have a significant negative impact on that hospital's ability to serve the other side of that rural population. What if it wasn't an ASC? And it was say hypothetically acute care hospitals? Well, I think you have the same concern there. I mean, you are further limiting access in to that rural side of the population of that hospital because it's sitting on the edge. Most of our hospitals are working very closely with their communities and trying to make investments that make sense to address some of these growing populations and things like that. But it's hard for them to make those types of investments. If they have this lingering kind of threat over their head that if they are investing all of this money, what's going to happen if that new hospital opens up on the other side? I'll start with Dr. Karpachary. Thank you for your remarks. I just something that has been bothering me is I've got two big hospital systems in my district and some others that are around the edges. And they're constantly fighting each other about approval for a project which benefits no one except maybe the lawyers and the consultants. It certainly doesn't improve patient access for the big hospital systems to fight each other. And I suspect they're both members of your organization. But have you guys addressed that at your whatever you call it, we are workforce, sewing, task force or whatever it is? We have. And there is actually some information in here I'm trying to find the tab that has data on the number of applications, the number of oppositions and the number that have ultimately been approved or denied that you can look through. I think four looks like. Yeah. So that might be interesting for you to look at. I do think that it's been a recurring theme in our conversations, not about the back and forth between the hospitals, but about what things should be opposable and how can we potentially modify some of those metrics. I think that there are some things that could be done even at the department level to help with some of that. And so we're hopeful that you'll be able to see that in our recommendations. Chair Watson. Thanks, Chairman. The scenario that you played out that that would be a bad thing. To me, can you not look at that though as if you do a joint venture with the hospital and the ASC and physicians that does engender those physicians stay in that community and genders that hospital for a profit center also certainly quality is there if not maybe better. And vice is better and access is better. I mean, so I just take a little bit of thoughts. I guess that's really not necessarily a question, but I do have a question for for Miss Adams. So just just for my education and I didn't see it in your in your booklet here. So you said you represent 140 hospitals, but you include behavior hospitals too. Is that part of the 140 number? Yes. How many hospitals or hospital systems are do you have not including behaviors or others? I'm not sure. I understand. You represent how many hospitals? It's 142 exactly I think. And that includes hospitals with behaviors or behavior centers or that includes behavioral and so how many stand along behaviors behavior centers to you know. I would have to get you the exact number. Are we talking about 10 or we talking about 100 where we roughly? I would say 10 to 15. 10 or 15 behaviors. So it's maybe 130 or so hospitals at hospital systems or is that hospitals? Hospitals that are a part of a system individually. So if I think we had well care in here, I think they had hospitals around the metro area. It wouldn't be their five or six hospitals. It would they would count as one is what you're saying. No, we would count as individual hospitals. Individual hospitals. So that's 140. How many hospitals are there in Georgia? I think including specialty behavioral health 175. So around that number. Okay. So if we took out behavioral health say that there were 15 that's down to 160 right? And that was what it was the other number? I think it's 142. 142. So you just you don't represent about 20 or so. Okay. That's okay. I'll just just curious here. So that's individual hospitals. 160. Great. Thank you. Chairman brass. I got a couple questions. Mr. Chairman, I feel dolds me. So I know you'll probably haven't seen this what Senate research put out. And so there's there's a couple numbers that are a really one number that's concerning to me, but we're going to see if y'all could help me understand it. So on non-CON states, the readmission rate is higher than in CON states. But the mortality rate is lower in CON states versus I'm sorry, non-CON states versus CON states. So if you track that data or you know that kind of tells me if you come back you've got a better chance at living. Is there something in a CON state, some kind of law requirement that you know that hurt shall hurts a CON state or hurts a provider if they do if there is a readmission is that that wouldn't necessarily hurt a non-CON provider. No, no. The penalties so to speak for readmissions are Medicare re-imper-front based. But you know, readmissions in particular are one of the areas related to quality where I think if you're you're talking about what's causing the readmissions, it's not CON. It's whether they have access to primary care or affordable health insurance. Right, and that wasn't a leading question by any means. I was just kind of trying to dig into that data because it does seem to be a correlation there. All right, so you mentioned earlier and about you know these studies don't look at all these different factors. Well, I'm looking in in tab 10 where y'all it looks like y'all did look at a lot of different factors. Is there any of this what three four five five six pages of data or are there any one of these that kind of jump out that would be an issue and we're getting a little off CON topic but more into just healthcare in general for this state because I think that's kind of the point of looking at CON. We're looking at all aspects where can we be better as a state? You know, are there anything in here? You know, of course scope of practice stuff is always going to be near and dear to my heart. But are there any other number anything's in here that jump out to y'all that we as a state can do better in your mind for better outcomes? Yeah, so the first in this tab is the most recent report and it shows there are three reports here that are chronological in order shows a market improvement to Georgia's access openness and access ranking since the 2019 CON change. So the scores there are much much better. The places where this report is showing lower scores unrelated to CON are in areas like scope of practice and several of them are scope of practice licensure. There is some prescribing there's some prescribing metrics in here that also appear to be on the lower end of the scale. So I think this does show some opportunity. And I would say too, we've improved in these rankings over the last few years significantly improved.\n\nIn large part due to some of the reforms we've made to the telemedicine regulations, but there are some opportunities there to make access and make sure that we're really using that type of access to its full benefit. Okay, thank you. I asked Chairman Kowler a question. I was asked, what was your position on the 2019 bill? Okay, which one? Oh, sorry 2019. Yeah, ultimately we were supportive. Okay. Yes. Thank you. Any other questions for Senator Sims? Thank you so much. I guess I have a lot of questions because I'm not really familiar with health care. But anyway, how does indigent health care, how is it impacted by CIOAN? That's number one. And the other question would be we're talking about health care costs and decreasing, talk about competition and health care costs, CIOAN versus non-CIOAN. So, I'll start with the second question first because I think that kind of sets the stage for yours. So we've had a lot of conversation about health care being a free market and I think we can all agree health care is not a free market. It's not up to the patient where they get to have their care. A lot of that is dictated by the insurers. In an emergency situation, you're just happy to be able to access an emergency department. But from a payer perspective, we have had a lot of conversations about what happens when patients don't have access to those emergency services, especially in those rural areas. And I have lost my nose on this. Hey, good. Yeah. So, you know, there are, we spend a lot of time both in the CIOAN context, but also in the health plan context, talking about, you know, pulling patients out of hospitals to receive care at other types of facilities. And the reason that health plans justify removing the patients from the hospitals to be somewhere else is cost. The flip side of that, though, is that it may be less costly for that one particular service, but it ends up increasing cost on the back end to maintain access to all of the other services like emergency care. There is a tab in your notebook related to the types of services, including emergency care, and what we refer to as the 24-7 standby role of a hospital that hospitals are not directly reimbursed for. So, hospitals are ready 24-7 to see emergency patients, and that requires resources. Historically, from a reimbursement perspective, both private and public payers have not directly reimbursed for that. It's the reason that hospitals are reimbursed more for the same type of services that are provided in a non-hospital setting to cover those costs. So, the more patients that we draw out of the hospital, then the higher level of cost we're going to have to figure out how to fund on the back end to keep those other services available. It's tab 8, and I remembered I found my note. I wanted to point out one particular item, and that hospitals don't have the ability to increase their pricing. So, when our workforce costs go up, when our overhead goes up, we have to find a way to make up that margin. We can't just bake it into our costs or price for those services. Thank you. Chair Wilson. So, part of the keeping your doors open is emergency room 24-7. So, I presume with that thought process, GHA is for free standing ERs? I think we have members who have applied for certificates and need for free standing ERs. And have been blocked by other members. The department has a print in some instances. Yes, not in all instances. Okay, thank you. Jesse, you have two. Yes, thank you, Mr. Chairman. You reference access to emergency care. You guys are aware of any evidence or studies around comparisons to access to emergency care and non-see-it-win states is at a crisis level as any of the other states that have recently taken action on that experience, issues with access to ER departments. I think the recent states like Florida, South Carolina, we don't have data for yet, so we wouldn't know. We do have a close working relationship with our counterparts in Texas, and they have described to us and presented at the last Senate CON study committee, and a very big concern about the ability to continue to offer those ER services, especially in their measuring hospitals. And so they have seen some fallout. I haven't seen any study specific to emergency room visits or access to emergency care, but there are some recent studies related to NICU care and in access to quality NICU services being decreased in non-see-it-win states. Chair, I go back to NICU beds near Nail Intensicure. Yes, thank you. clarification, and yet some of those beds have been challenged also in the CON process by other hospitals. That's sort of sad. Thank you for your presentation. When you mentioned this, I don't want to use the word subsidy that private payers do to help you provide your other services, at the end of the day, it does affect patients, because if they whether they have private insurance or Medicare, they have copays and high deductibles, and many of my patients every day choose their care based on, okay, I can't afford to have that procedure now and stuff. So, I mean, how do you justify to a patient that, okay, there's no ambulatory surgery center, there's no freestanding MRI, you have to go to the hospital where your out of pocket is double what it is for a freestanding center. I mean, the subsidies that you get, I understand you want to subsidize the other services, but at the end of the day, it's the patients that are paying that, whether they're paying that through their health plans, there's copays, there deductibles, or there are taxes. Yeah, no, you're right. And, you know, I don't think that we're here to try to justify the the historical premise that hospitals and that care in the United States has been the methods that we've used to reimburse those services. I think the question for us and the issue for us is given that that's how we are reimbursing the services, what can we do to make sure that we continue to have access to those services because it would be wonderful if we could all go to an outpatient center and spend less money, whether it's at a hospital or a freestanding center, I think on an individual basis, as patients ourselves, we would we would all be in favor of that. But collectively, as a state, we also have to make sure that when those patients are in emergency situation, that an emergency department is staffed and available to see them. And right now, we don't have any other way to pay for that. Any other questions from the committee? All right, seeing none, thank you both for being here. And I want to publicly thank you. You've kept an open line of communication with me throughout this process as your committee has been working. Hopefully, that can continue and appreciate the work that you've done here as well. Well, we are going to take, we're just going to stand at these for five minutes, we'll be back in five minutes. And when we return, we have six people who have signed the testifying my goal is to have us done by noon. And I think that we're trending well in that direction, so we'll be back in five minutes. All right, so we have six folks signed up the testifying. If you are wanting to test a five, but if not yet signed up, feel free to walk up here and put your name on the list. I'm going to wait for just one or two more members to return to their seats because I don't want them to miss Miss Kavanaugh's testimony. And we will go ahead and get started in just a second. All right. Senator Sins, do you mind closing that door when you come in? We're going to go ahead and reconvene here. We're going to call a first person. I think it'd probably be easiest if you all want to come present. It's actually come up and sit down and make yourself comfortable because you may be there for a minute with some questions. First up is going to be Jamie Kavanaugh with the Institute for Justice. Believe it, with your packet, you should have each received a copy of her testimony. And with that, Miss Kavanaugh, I'll go ahead and give you the floor for about five minutes, and then we'll have questions. Thank you, Chair Dolezal. My name's Jamie Kavanaugh. I'm an attorney with the Institute for Justice. For over a decade, institute for justice has been working to try and increase access to health care by reforming the certificate of new laws around the country. I have litigated certificate of need cases and federal court. I have worked on reform in many different states. And I talked to a lot of people who go through the con process on the ground. So I become kind of a policy expert. And I wrote the report that I think most of you have received a copy of that compares every single con law and every state around the country. One thing that this report has allowed a lot of researchers to do is make their research a lot more granular. I've talked to a lot of the economists, health care economists that do the type of research Dr. Stratman does. And they've actually been able to rely on this report now to make their comparisons even more granular to say exactly what type of con law that's each state have and how how to those work on the ground. So I want to make a couple comments about how we're feeling con increase access to rule health care. And then I want to address some of the questions I heard earlier. So first out of all the con states, there are nine states that do not prevent rule or sorry that either exclude rural areas from their con programs or don't regulate any type of hospital with con laws. So we already heard from Dr. Stratman that con laws might exacerbate the problem with rural hospital closures. His evidence shows that there are 30% fewer rural hospitals per capita. And so that's why I think we see this trend with several states that have certificate of need lot programs, purposely excluding rule areas from those programs. And then on top of that we know that many other rule states don't have con law programs at all. States like Idaho, Kansas, the Dakota states that are very rural don't maintain any types of con laws. And then the university. And I pause you for just a second. Of course. So as I'm sure I'm understanding what you're saying. So there's the 15 states that essentially have done a full repeal. You're saying in addition to those 15 states, there's nine states that do not apply certificate of need laws either to hospitals at all or to rural areas at all. Exactly. So about half of the states in the union would fall into that category. Exactly. So a state like Montana has a con law still for nursing homes, but it doesn't have a con law for hospitals. Okay. Thank you. Yeah. And so the University of North Carolina, the Shubb Center keeps track of rural hospital closures. And by their estimates since 2005, Georgia has had 10 rural hospital closures. And that's with con laws in place. Now there are only five states that have had zero rural hospital closures since 2005. Those are Colorado, Montana, Oregon, Utah, and Wyoming. And none of those states has a con law for rural hospitals. Three of those states don't have any con laws at all. That's Colorado, Utah, and Wyoming. So, you know, of course, we know there's never a single reason that a rural hospital closes, but it can't be that con is the saving grace here. The available evidence shows it's probably the opposite and using con laws to suppress the supply of health care just decreases access to care. And makes it possible that Georgia's going to start losing patients to more competitive states now that Georgia's neighboring states, South Carolina and Florida have done such significant reforms. And I wanted to clarify a little bit about those reforms because I and Institute for Justice have worked a lot on those reforms. So, Florida, for instance, in 2019, I think there was some confusion about the reforms got rid of all of its hospital certificate of needs. The only thing that Florida still regulates with con is nursing homes, hospice, and intermediate care facilities for the just developmentally disabled. And North Carolina, this session, passed several reforms, including repealing con for psychiatric and rehabilitation facilities. It increased and doubled some of its cost thresholds for a variety of facilities and equipment. It got rid of con for ASCs and MRIs and counties of a certain size. And I think they're still considering other reforms in their budget bill right now. So they had some sizeable changes. And in South Carolina, shared goals, I'll mention that the only thing that's left in South Carolina is the certificate of need for nursing homes. And it was mentioned that the hospital con won't sunset for another three years. That's all correct. But South Carolina had a very, very robust con program, significant program, just like Georgia. So it got rid of all the other cons. So this was a very significant reform in South Carolina this session. So a couple other questions that came up. One or a point that was made earlier was about how ASCs in Georgia tend to be located near hospitals. If you take a look at the regs for Georgia in this report, that's because there's an exception for single specialty ASCs as long as they're located near a hospital and can transfer their patients to a hospital that's located nearby. So that's why they're located close to hospitals and not necessarily in rural areas creating greater access to care. Let's see. Another another point I want to make that's in the research is that safety net hospitals actually have higher margins and non-certificative need states. So we've talked a lot about different metrics with costs today. There are studies that show, of course, patient costs are higher in certificate of need states, government payer costs are higher. But from the flip side, from the hospital standpoint, it's interesting to note that in states without certificate of need, safety net hospitals are doing better. They have higher margins and that's probably one of the reasons why there are more hospitals per capita in states without certificate of need laws. I want to mention also that in the state of North Carolina Institute for Justice is litigating a lawsuit there right now challenging one of the certificate of need laws and the state treasurer actually filed a brief in support of our position saying that the certificate of need laws should be repealed because they end up costing the taxpayers so much more money. And in his position as state treasurer, he said, you know, this is something that should be gotten rid of entirely so that we can be saving millions of dollars every year. Let's see. And I mean, we've heard other things about the how mortality rates are higher, unfortunately, in states with certificate of need laws that has proven true over multiple studies and multiple, you know, different metrics. And I think it was suggested earlier that it might not be statistically significant. First of all, it is when it's reported in a study, but, you know, for the further one study that said, there's three extra deaths per 1,000 patients. I think if you're a family member of any of those three people, you certainly think that's significant. And I've spent some time with the healthcare economists who work on this information and all economists, if you know any are very, very cautious. They do not want to say that they think something's going to happen unless they're very convinced that that the evidence is on one side or the other. So they would never flippantly say that this is what they think the evidence shows unless they're very confident in what their data shows. So I hope to keep working with the committee and I'm happy to stand for questions now. Thank you, Ms. Kavanaugh. I think Dr. Karpagic has a question. Thank you. My question goes to what you said about taxpayer cost. Yeah. Can you break that down and set the cost litigation by nonprofits or is that administrative, just administration of the program by the agency? So what is that? So the state treasurer in that case was talking about the cost that the state pays for teacher and state employee healthcare plans. He's saying that those costs would decrease significantly, but you're right. There's also the cost to administer the program. And yes, there's cost to defend lawsuits right now. There's a lawsuit here in Georgia. It's not from the Institute for Justice, but there's a challenge from someone who has denied a certificate of need for a birth center. And we've heard about how bad the maternal morbidity rate is here in Georgia. And so it's very sad that someone who wanted to open a birth center was denied a certificate of need here. Thank you. Senator Simms, did I see you reaching for your button there? Thank you, Mr. Chairman. One question. I'm not sure if I heard you say that the ambulatory centers are usually located very close to the hospitals because and I didn't get the tail end of that. Yeah, sorry, because there is an exception where a single specialty ambulatory surgical center can open without going through the con process, as long as it's located close enough to an existing hospital that it can have a transfer agreement with that hospital. So if something goes wrong during the surgery, they can transfer the patient to the hospital. Thank you. Matt, I saw you raise your head over there as well. Yeah, thank you very much. You spoke a bit about the South Carolina recent bill and obviously it's very fresh and still trying to get worked out, but I would be interested to if you could maybe explain.\n\nWayne a little bit with regards to what was included in that and then maybe some of the learnings from that process. Sure. So one thing that was considered and ultimately rejected, but at one point there was an amendment in the bill to limit ASEs, ambulatory surgical centers to only being able to open facilities with eight beds or fewer. So, you know, while the legislature was pretty committed to wanting to get rid of most categories of con there was some very serious debate about whether ambulatory surgical centers should be limited in size. Because there was a lot of concern from hospitals, but ultimately that specific amendment was rejected. And the bill, as we know now, was passed just with leaving con in place for nursing homes and the three year hospital sunset was added in at the very end that amendment wasn't part of the original draft of the bill. Senator Harrison. Thank you. I'm in your written comments here. I was trying to find you were making the point about how repealing the CON will benefit rural hospitals and fulfill this committed goal of sporting survival and grow. I was trying to I missed that perhaps somewhere in your explanation. Can you capsize that for me? Yeah, in a synopsis for me. Yeah, I wanted to show that the policy. The policies that are in place in many states show that certificate of need is not supporting rural hospitals. That's why so many states that have certificate of need laws are exempting rural areas. That's why the, you know, the data as we heard from Dr. Stratman shows that there are more rural hospitals and states without certificate of need laws. They've been able to, you know, open and then they've been able to survive in these states without certificate of need laws. It's not just opening, you know, once a hospital opens, that's important, but certificate of need laws. We have to remember also keep hospitals from growing if they want to add services in Georgia. If you want to add obstetrics or gynecology services, you have to get a certificate of need. If you want to add equipment, you have to get a certificate of need. Okay. Thank you. Thank you. Thank you, Mr. Chairman. And some of the other jurisdictions you've talked about typically is multi year process of a legislature looks at it certainly in the case when we've looked at it here over the last 20 years. There's typically like a grand bargain, so to speak. We talked about like cross subsidization, tackles and community benefits. And in the states that you've looked at recently, is it usually that they're the parties are able to come to some sort of raw agreement about the way to get to the parties at least neutrality or these typically passed, you know, just in the team of opposition to incumbents who benefit from having see when it's happened both ways. I think I think when you're looking at the large scale reforms, though, in Florida and in South Carolina, the hospital associations weren't in support of the bills that ultimately passed. They did offer suggestions, I think, for things that they would have supported, but the reform went further than what they would have liked to see. And I have a question about South Carolina, because as I understand it, it passed with unanimous support in both the House and the Senate, does that accurate. So the Senate, the first version through the Senate was not unanimous, but it was. There wasn't a ton of opposition and then it passed unanimously through the House with an amendment and when it went back to the Senate for concurrence that was unanimous. So once you read on what was driving such a large scale reform in that state and how did it cross or how did it pass, excuse me, with support from from both parties. I think it's South Carolina, the momentum had shifted enough where there was there were voices from the community saying that we need to see this change. And I was going to talk about the time when we talk about certificate of need, it's at a much higher policy level, and it's not an issue like a lot of other issues where we get to hear from the community, the patients, the people who are affected by it. And I think that was something that was different in South Carolina. Thank you. Any other questions, Chairman Watson. I understand the grassroots effort relating to that in South Carolina and other states. Well, certificate of need is something that takes a little bit longer to explain to people, of course, you know, no one knows about this unless they have a reason to have heard about it. And I think that's a great way to have an effort from organizations who care about this issue to go out into communities, do mailers, do flyers, go to health fairs and talk to people. Set up at other places like that and ask people if they're happy with the care they're getting, if they, you know, feel like it's close enough to them. And I think that's a great way to have events with legislators, especially legislators in rural districts where they would hold town hall meetings about health care and talk to their constituents that way and bring up this issue and get people more interested in supporting reform that way. Thank you. I mean, we talked about earlier about the benefits of being, you know, nonprofit and not paying corporate taxes like the full profits are or, or not paying property taxes. Is that the piece of the puzzle when it comes to the discussion. So I don't know a lot about that. It's obviously something that comes up. The state treasurer in North Carolina, I was mentioning he filed that brief in support of IJ case in North Carolina. And that briefing mentions that he thinks the nonprofit hospitals are abusing their status and not providing any extra charity care and not doing what they're promising to do with that nonprofit status. And I've seen a lot of other sources suggesting that recently, but I don't know the exact data on that. And one other thing I'll mention quickly about your questions, previous question is that in Kentucky right now they also have a study committee for the summer. There are a lot of local communities that are unhappy with their available health care services that have been passing local referendums or local resolutions to support certificate of need repeal so counties and cities going, going to hadn't doing that at the local level to show support for this issue. That's that our sins. Thank you, Mr. Chairman quickly and our assessment of the sealion laws and making the comparison. Right now we seem to be comparing Georgia. South Carolina. Is that a fair assessment. You think so. Well, South Carolina tends to be much smaller. Stay not as progressive. I hope I'm not insulting anybody in here from South Carolina. Not as progressive. Would you is that is that a fair assessment? I think that one thing I would say about the data that Dr. Stratman was talking about is that from the economist standpoint, they're not as convinced by a study that would only concentrate on one state and what happened in one state. So when they look at the data, sure they're controlling for geography and age and Medicare and Medicaid and stuff like that, but they think it's much more convincing to say across all these states, all the data still trends in one direction. So the fact that it's happening the same way in multiple places to them, that's actually much more convincing for what we could expect to happen. Than just saying if I only look at, you know, one state or one county or something like that, what could be expect to happen. So I thought that was an interesting perspective. I just learned that from them recently. I think Texas does not have CON California. Does not have CON either California. Certainly different diversity in states relating to that. I don't think George is out here on that much different than California in Texas, but. But we're a little different. There's no doubt about that. Yeah. Interesting. All right. Thank you, Miss Cavanaugh in order to try to keep a keep my commitment to being done by lunchtime. We're going to go ahead and move on to Vicki Johnson from the Council of Aging, Chris Denson with George Public Policy Foundation, you'll be on deck. And Miss Johnson, you can step up to the same seat that Miss Cavanaugh was using. That microphone is live. You have about five minutes and we'll take time for questions. Thank you, Mr. Chairman. And thank you committee members. I appreciate the opportunity for the Georgia Council on Aging to be part of this discussion today. The Georgia Council on Aging has continued to advocate for expanded opportunities for quality long term care to serve Georgia's at risk older adults. And I believe you have in your packet a print copy of the material that I'm going to be going through this morning. And so as part of that advocacy effort, we're asking that you consider nursing home CON reform as part of this study opportunity. We want to talk about demand and supply. The Department of Community Health calculates nursing home bed demand and they do that on the basis of population projections by age cohort and consideration for health, the QT and health needs. So the department shows a 2025 projection of need for nursing home beds. And they divide the state into 12 service regions in six of the service regions. The projection is showing a deficit of nursing home beds when compared to the need of the older population. Right now in Georgia, 82% of the nursing home beds are set up and staffed as of their year end 2022 report. And in addition, only 68% are occupied. And so the occupancy rate in Georgia right now for nursing home beds is 68%. And yet, if you want to provide a new nursing home in a community, you must be able to show that that community has a 95% occupancy rate of nursing home beds. And if you look at the map, you'll see that the service areas that show the bed deficiencies are concentrated in north Georgia service areas one through five and also area 12 in the Savannah area. And we looked at the situation that Georgia would face in terms of demand and supply projecting ahead five and 10 years. If we do not add nursing home beds, these bed deficits of unmet needs will continue to grow. We were looking at deficits that are very substantial in Georgia over the next five and 10 years because the older population is going to grow. We know that an OPB shows it in their population projections. And we feel that the problem with nursing home CONs is that they limit supply of care. And they benefit existing homes without encouraging some of the changes that we would like to see in nursing home care in Georgia, such as facility renovations, innovative care models, consumer options, workforce attraction and retention, improved care quality, infection control best practices, and affordable new provider entry. There are new models of nursing homes that are in use elsewhere in this country. And a few have arrived in Georgia. These modernized care models are yielding solutions to some of the problems that lead to the low occupancy rates in our nursing homes. Now these new models feature private rooms for residents with private baths that sounds extravagant, but really it's a very effective way to control spread of infectious disease. They also have a shared living room area and shared dining and shared open kitchen in a household model with 12 to 16 residents in a household unit. And this could be a separate building. It could be a separate floor within a vertically stacked nursing home. And the two models in Georgia that we know of each are one of those two models in rock, the cottages at rock, our separate buildings and in Cobb County, a G roads is going to be bringing a stacked vertical model to their new legacy of care operation to the tune of a 37 million dollar investment in this new care model. And we know that based on what's happened in other states, these new care models have higher occupancy rates. They have a better revenue mix because they attract more private pay residents. And they have improved health outcomes such as hospital admissions and infectious disease control, all of which help keep down Medicaid cost. We also know that these new models provide better job satisfaction and lower turnover for workforce. Georgia could increase its care supply by making existing alternative long term care providers more accessible to underserved populations. Medicaid services are not allowed in 40% of available beds when you consider all the care beds in nursing homes and assisted living communities and personal care homes. Additionally, 13,000 people now are receiving Medicaid services at home through CCSP. We think that we can reduce nursing home demand and lower state Medicaid costs by using Medicaid more effectively in alternative care operations in the state. And we have a list on the slide that indicates assisted living, Medicaid at home, increased provider rates for these suppliers of ad home care, and so on. So in conclusion, we would ask that you consider CON reforms, which can help control cost, widen access to underserved populations and improve care quality. These reforms would focus on regional care need, they would lower cost through competition, reward care quality improvements, encourage care model innovation and facility renovation, recognize consumer preferences and enhance workforce job satisfaction. So as you proceed with your study, we ask that you remember to think about possible reforms in nursing home, CON. So I thank you for this opportunity to speak with you today. Kevin Kepasic. Yeah, thank you so much for your presentation. I had an experience with one of the animated models that you're talking about with my father and Kentucky, which happened to be a VA facility, which was really amazingly different from what you standardly see in the nursing home world. So I guess my question for you would be that under our current CON law, are these innovative models limited under CON? The models are not limited, but the access to entering the market is limited by CON. Because if the region does not meet two criteria, which is a bed deficit need and a 95% occupancy rate, then a new CON application would not be considered. And the application process is done on a batching basis every six months. And for the last three batches of application opportunities, the state has not accepted any new nursing home that applications. Mr. Shablin, follow up. And then the only other question I had is about the usage of Medicaid and assisted living facilities. Aren't there some federal regulations that limit that some degree? The federal regulations have to do with settings. And so if the setting meets certain criteria by CMS guidelines, such as having a private room, having the ability to have meals when you want them have access to food, when you want it, they have a list of home-like settings that would be required in order to provide the Medicaid services. But facilities could meet that. Thank you. Thank you. Thank you for your question. Thank you, Mr. Chairman. Thank you for your presentation. And as representative of a tertiary, acute, base hospital, appreciate the partnerships. And certainly what do you do? Nursing, nursing services is super important as we think about discharge strategies and making sure that we're taking care of the continuum of care about patient from an acute basis. And so ensuring that we have adequate amount of beds is critical. We hold up patients in acute based services because we don't necessarily have the resources downstream to discharge and make sure they have those next post-acute services. And so I think that my question is more specific, again, not to go back to South Carolina, but I am if I understand the bill correctly that was passed. Nursing home services was not reformed or was continued to stay within certificate need. Could you clarify that? And then maybe if you could add some insight into why that was. And I'm not familiar with the situation in South Carolina. So I would have to defer that answer to someone who has studied it more closely. But there is a lot of money that's been invested in nursing homes in Georgia. And that that money. And there's less competition. All right. Thank you, Ms. Johnson. I see another questions. Thank you for being here today. Appreciate your testimony and presentation. I'm going to call on Chris Denson. Please step forward. George Public Policy Foundation and John Gleason. You will be on deck. Thank you. Mr. Chairman, members of the committee. Good morning. My name is Chris Denson. I am the director of policy and research for the Georgia Public Policy Foundation. We are a 501 C3 nonprofit think tank located in Atlanta. We focus on state economic issues, including health care. I'd like to thank the committee for taking the time not only today, but the rest of the year to study this issue. And each of you should have a copy in front of you right now of an economic report that we published in April this year. If anyone does not currently have one, I have some additional copies with me. I can pass it again. The frame was to include a comprehensive history of the legislative efforts regarding CON here in Georgia, along with the summary of the academic research on the topic. You've heard from enough economists today. So I won't bore you with any of that at this point, but I would recommend taking a look at your convenience as we summarize the existing academic research on the issue regarding access quality cost and the ability to serve underserved population. We also in the study, we looked at the states with similar geographic profiles to Georgia blue that's on page 17 population. We compared the rural population. We took account for their CON regarding hospitals and ambulatory surgery centers since that is where most of the political debate seems to revolve around. And we also looked at the number of hospital closures, those states have experienced since the ship center, I believe was referenced earlier, started counting that data in 2005. One other thing I like to point out in the study is that we did look at Florida. As you've heard, Florida repealed most of their certificate of need laws in 2019 with the exception of long term care and specialty hospitals. Since that time, 64 ambulatory surgery centers have announced their opening in the state of Florida. 63 of those were in counties that are deemed urban by the Florida Office of rural health. Notably, the one ambulatory surgery center that has announced their opening in Florida since then was a joint venture by the by the hospital. And I thought that was such a great idea, a physician group out of telehazzy decided they went open a facility on there as well. So it did actually bring additional providers and competition into this one rural community in Florida that we studied. Lastly, I will say this, you know, in 1991, our founder Hank McKay-Mish established the foundation with the mission to improve the lives of Georgians by promoting public policies that enhance economic opportunity and freedom. And here into that mission is the idea that the small business owner entrepreneur that cannot afford to spend his own time at the capital or money on lobbyists and lawyers to compete with the special interests would have a say. Since we've been working on this issue, we've had a lot of folks reach out to us that wanted to pursue either a new service or a rope in a practice. And last year I was introduced to the manager of a physician office that wanted to offer a $250 cash pay MRI service to their patients. And they knew point blank they had no chance of getting a CON for that because the hospital down the street from them offers their cash pay rate at seven times that. So what's the point of even going through process we know we're going to get turned down for a CON so it's the two things I want to highlight in that story one is that whenever we talk about. We know cross-substitiation at a hospital has to serve ever when it comes to the door regardless of their ability to pay that there was actually a lawyer from the department of justice that testified before the journalist simply in 2007 and mentioned certificate of need was not supposed to protect cross-substitiation of patient services they should not be trying to make a profit off of. You know either insurers or folks that are paying with their own money. And so that being said, you know it's important to think about that. And the other thing too is when you hear someone say that that provider or that facility didn't go through the process for a certificate of need so many health care providers across the state that are trying to be innovative. They're trying to invest in their community. They just realize it's an uphill battle as the system currently stands. So with that I'll close my remarks and we'll take any questions the committee might have. Any questions from members of the committee. All right. Seeing none. Thank you, Mr. Denson for being here. Thank you for this. Some light reading that will all take home and read on the beach. John Gleason with Georgia Society of ASEs if you would come forward then Barry Herron you are going to be on deck. I won't give you any light reading to take home. So Mr. Chairman, thank you and the committee members for taking on the subject matter. Thank you for allowing me to speak on this matter. I'm Dr. John Gleason. I'm a current partner at resurgence orthopedics and the past co president of practice in the metro Atlanta area for over 30 years. The surgeon was founded in 1986 as a single specialty orthopedic group. And we currently serve all the metro Atlanta area with 24 locations, 95 physicians, 58 APPs, eight surgery centers, 12 MRIs, physical therapy and about a thousand employees. We annually have over 430,000 visits. We perform over 40,000 surgeries per year. And of those 40,000, 37,000 of them are outpatient procedures. Our patients are all performed at our facilities and we are a tax paying Georgia corporation. The solution is to provide excellent innovative patient focused orthopedic care to the greater Atlanta community, regardless of their ability to pay. Our ASEs are central to this mission. They're all licensed Medicare certified and they're either AAA to your JCO certified and provide charity care. Patients safely have simple surgeries or complex surgeries at our ASEs. Safety quality outcomes and satisfaction are all as good or better than inpatient facilities. Our ASEs served patients safely during the pandemic with a facility to do procedures where hospitals were not able to accommodate those. Ideally, CON rules could be abolished, but we're not opposed to reasonable regulations. Medicare certification, AAAH modification of the rules for a license or but as you'll see and as you've seen already during this committee meetings, this currently is not the case. We won't go over the goals of the purpose of CON as you've heard. Those are written that they have not improved the quality of care, have not improved the access and basically the cost has gone up because of that. ASEs are more economical and can be used to reduce the cost of care in the state. As you'll see in your endeavors, also the federal government, the Department of Justice and multiple studies have shown that CON doesn't meet the goals of the desired needs. We do support modernization of these rules, maintaining some form of charity care, but realizing our charity care is not just in the surgery or the surgical facilities. We provide the medical care and clinical and staffing, physical therapy, MRIs and DMEs for all of these patients though. Limiting or eliminating who can appeal an application.\n\nDCH should be the deciding factor, not the incumbents who delay cost and increase the monopolies. The current rules apply a spending cap to ASCs. A single specialty ASC has a cap of 2.5 million. A joint venture cap has a cap of 5 million. There should be no difference. There should be equal. The cost of a facility, the cost of a procedure is the same whether I'm doing it in an ASC or whether I'm doing it at a facility. Shared centers should be considered having multiple parties involved in a single facility to be able to share it temporarily. Medicare allows licensing of that as far as multiple providers in a single facility. This helps the rural communities by having multiple providers be able to support a single facility and not have to have individual facilities through that. And thank you for your time and consideration and open the questions. Thank you. Thank you, Chairman. From an ASC standpoint, the climate that you're experiencing as in like legal challenges and things like that. Is that different than what it was, you know, two years ago, five years ago, 20 years ago? Different than it was 20 years ago, but for the last five years now, I mean the same litigation costs the delays of applying for not just ASCs, but MRIs. Is an ongoing burden and we're fortunately large enough to kind of fight that battle, but smaller groups cannot and definitely in rural areas, they're not going to be able to fight that battle. So, let's help me understand the logic of challenging updating an MOR scan or getting a better MOR scan. There is no logic. We, I mean, our MRI scanner, obviously it has to do with the revenue, MRI scanner that is in our facility is owned by the practice itself and not owned by the hospital. Whether it's an independent imaging facility or a physician's practice, it does limit that they say you can get one, but the cost limitations that they have on MRIs below a C.o.n. is going to get you a magnet that's not going to perform very well or very long. It's out of date. Thank you, Mr. Chairman, just clarity, clarity. And you, as you talked about your services, do you provide services to Medicaid patients? Yes, sir. Okay. And then the second question from an agent care perspective, is there a specific percentage of your revenue that is or services provided to Indian care? The facilities themselves or the practice itself? Well, I would guess all together. I mean, the facilities currently abide by the C.o.n. regulations for indigent care, and we meet or exceed that on a regular basis, the practice itself has indigent care, but that's not calculated in any of the. The C.o.n. regulation. So the practice side of the charity care goes on account for. But those patients are coming through your practices first before they go to the facilities is correct. Thank you. Thank you, Mr. Chairman. So with those percentages or whatever you got to hit as a A.C. You know, y'all are often accused of cherry picking the, you know, the good paying. So with those percentages and with any kickback laws, how would you, how would one go about cherry picking a patient? I don't know because we see all comers and our preferences to do those patients in our facility, because if we're not going to get paid, the efficiency of being able to do it in an A.C. Where I can finish the procedure and move on to the next is going to be much more appealing than sitting around a hospital waiting on a procedure to be done. So that patient is already committed to being cared for. And I would like to care for them in the most efficient and the best quality facility that I can have. Thank you. Chair. Yeah. Thank you, Dr. Glacin. I'm having to dig through some cobwebs of my head right now to think back to where there used to be a separate category in the C.o.n. law. So single specialty, Eleanor facilities, there's a full C.o.n. And then there was something that was in between that did allow outside providers are multiple different providers to participate in A.C. Isn't that accurate? And then that went away at some point. The limited purpose, C.o.n. was one where a single specialty and multiple different practices could participate. But that went away in the 90s. It was originally in the 1980s. Come to Jesse next. Thank you, Mr. Chairman. I think that's one of the workforce impacts that was identified when the General Assembly was looking at this in 2008 time period. It's related also to the establishment of the Toronto Commission was a derth of general surgeons in the state that was sort of directly attributed to our unique treatment of them as not being able to get a multi specialty or single specialty exemption. Has that situation improved recently? Yes, they're still struggling with being able to be broken out as a single specialty. So would you say it's fair then to say that Georgia has a workforce issue, a general surgery that's exacerbated by our certificate need laws. Yes, sir. Any questions from the committee? Thank you. Thanks for being here. Appreciate it. Next up is going to be Barry Heron. And you are second to last sir and Victor Moldovan. You are on deck. Lunches between you two and the committee. So being mindful of that, Mr. Chairman, I'll plate Mark Twain. So I will adhere to the time limits allowed. Therefore, my remarks will only seem to be longer than they are. Remember when we took civics classes in high school and we were told about the ridiculous way that the Soviet Union did central planning. You can only build tractors. You could only build cars. We don't need any more of this. And we laughed because we thought, how can a serious country be run this way? Well, welcome to the last of the Soviet five year plans, ladies and gentlemen, this certificate of need program. So we have a state in its wisdom decides how many cancer treatment centers with radiation therapy we can have, how many hospital beds we can have, whether you can have a multi specialty surgery center, whether you can have a free standing emergency department, whether you can add beds to a nursing home. These are all decisions made by unelected administrative bureaucratic people who develop data. So many of the benefits of times from the very people that they are regulating and who therefore have no incentive to be honest about their utilization and their production. So it's rationing care by deciding whether you need something or not. And that benefits the existing provider until the state through a batching cycle or enlightenment decides that more care is needed. And that's what we're going to do is to get a new certificate of service services. I want to show you what a certificate in the radiation therapy center looks like. This is missing the one hundred and nineteen letters of support. And it's missing all the appendices from the original filing. It's still 419 pages. To date is cost 65,000 dollars in attorney and consulting phase. This is in an area where there is no non hospital provider of radiation therapy service. And the state that have one. This one does not. And it's opposed by surprise surprise, both of the hospitals that have radiation therapy services. When hospitals enjoy this monopoly, as been said before, everybody pays more. The RAN Corporation in 2019 developed data that shows that commercial insurance companies and self-insured employers pay on the average in the state of Georgia. And there's a 75% more than Medicare does for inpatient services. And 325% more than Medicare does for outpatient services. And there's one hospital in this state that's paid 450% of the Medicare reimbursement rate. Now there's just no excuse for that regardless of what philosophy you're trying to propose or what balance you're trying to strike or what care you're trying to subsidize. And I mentioned earlier that a nonprofit hospital, a tax exempt hospital or a government hospital that's run by a hospital party doesn't pay any taxes. And so that's a 30% benefit over a for profit provider like the physician's practice or freestanding emergent, ambulatory surgery center. The other thing is payers of health care because the state is paying for 25% of the citizens of this state's health care, either through Medicaid or what I still call state merit plan, because that's what my parents called it when they were both on the plan. You're paying a facility fee every time somebody crosses the threshold of a hospital or a hospital owned outpatient department. You're paying a facility fee to receive exactly the same care that you get in Dr. Gleason's surgery center, except he can't charge the same facility fee that a hospital can. If it was in a private practice, not a surgery center, you're paying, you're paying more for that care. This project, just this one, just this one with one linear accelerator and just serving 200 people would save the state you all $2 million a year in the difference between what this center would charge for radiation therapy and what the hospitals down the street with charge for radiation therapy. That's $2 million you can do something else with. You can hire nurses with that, you can hire general surgeons with that, you can expand Medicaid with that without having to raise taxes on people. Your voters know this, they know this when we got the letters of support for this project, let me read you what some of these people said. I have also found that if I have something simple done at the hospital, my bill and copay are much greater than they would be if I had the same thing done off the hospital's campus because they charge things out differently at a much higher rate. This is just one example of the extremely high and confusing financial problems that come along with seeing a doctor having a treatment at the hospital. But I don't have an option to go to a private office because the only place that offers some medical treatments as a hospital. As a patient, I'd like to reserve the right to choose where I want to receive my medical care. Here's another person, your wait times or less in private practicing you don't have to circle the entire hospital multiple times just to find some place to park. Here's another one, one comment that my sister made was she felt confined and she was already dying because of the hospital settings. She wanted to be able to relax more, I'm sorry somebody recording me without my permission. She wanted to be able to relax more like she did when she did came in a smaller more community setting. But ultimately, ladies and gentlemen, the general assembly who represents me and everybody else really needs to listen to what this fellow said. And it's an amazing statement. Local cancer facilities should be able to have access to the same resources that a hospital does. There is no reason that a patient cannot choose to get the treatment they want at the facility they want medicine can not and should not be a monopoly. This gives the few companies that have access to exclusive medicine and machines and unfair advantage and artificially drives up the cost of health care for the people who depend on it to live. You don't need to be an expert or as my friend and Valdosta where I grew up, just to say, it isn't rocket surgery. Everybody that you ask that has to pay for health care knows it costs more to go to a hospital letting the hospitals keep a monopoly on service is a great way to cause citizens to pay more. You're paying for 25% of those citizens and you're paying more to. So you need to really examine why on this hand the Department of Community Health prevents people from having services offered and on this hand complains to you in the general assembly that they need more money pay for health care. That's a crazy land if you're letting them do both at the same time. And so, certificate of need being something that doesn't get us anywhere that we want to be subsidizes a monopoly does not cost less for citizens out of pocket needs to go sooner rather than later. In my opinion and I'm happy to discuss it with you. Thank you very much. Thank you, Mr. Heron. Any questions? Senator Sims. I think all of us are trying to get to a reasonable and I don't want to use the word compromise because it's not real cute anymore. But my concern for being here is that my constituents in rural Georgia have access to quality health care. I think that's the reason why we're looking at that. But I'm not to surmise that the data that we've heard is definitely going to drive down the cost of health care. And let me tell you why I'm asking is because we sort of in an inflationary stage in our economies. And I think that there's a decrease in the size of the packaging of things. But the cost is still there or even higher. So can you or can the state. And I'm not being combative here. I just want to know, is this actually going to drive down the cost of health care? So we're just looking for a place to allow competition. Yes. And for people to make money and to cherry pick as we often say it. Senator, I'm sorry. Did you say you represented Dardi County? I say I represent 13 counties among them being among them being dirty count and some county as well. Yes, some to ask. Well, I will give you a great example of the Proofs your Proofs your statement. And I had the state allowed some to regional to open in mobile facilities and provide surgical care after it was destroyed by tornado. It would not have had to have been sold to Phoebe Putty where Phoebe Putty downsize the size of the hospital and transferred all the lucrative cases to Albany. And thereby depriving the citizens of America's with a full scale acute care general hospital that had all the surgeons that it had. I'm not familiar with that at all, but I am familiar with the fact that the populations in southwest Georgia. And the size of the hospital definitely matters. If you go to most of the rule hospitals that closed, they closed because they were unsustainable. So some to count it was no different. It was definitely unsustainable with the size of hospital. I said, I couldn't agree with you anymore if I could try any harder. We do not enjoy the ability to have a hospital in this state that has less than 50 beds. And if you wanted to have a hospital that had less than 50 beds, you couldn't do that. As far as I'm aware and I'd have to go back and look at the rules. So we might need to redefine what we call a hospital in order to have a hospital. What we're doing here is just that we're sitting at the table trying to make decisions about we know that the only is going to be tweaked changed abandoned. We don't know. Okay. But we are here to make sure that there's access and quality care for my district. That's that's my biggest concern. Metropolitan areas don't suffer nearly as much as the rule parts of the state, a clay county, equipment county. Any of those. So, you know, we could sit here and debate it all day, but at the end of the day, my concern when I vote for whatever changes that are going to take place quality and access for the people that I represent in my district. I would offer this to you, Senator, I practiced law and Florida as well. And I was involved in the decisions or the lobbying for the change of the CO and law and Florida. And what the Florida legislature decided to do rather than constrain access was to constrain quality by increasing licensure requirements. And that's something that the general assembly easily could do here. You can open a surgery center by all means you can open a hospital by all means you want to have a radiation therapy center. You can also ask for moral support to be in terms of charms, oral support, and process. You're not the one who gives a friendly package, but you just want to go around that. So, you know, this is mainly sanctioned. I mean, that's where behind the list is just. The instruction of about granularness. That's the main question is, do I have battery charge left there? environment where there are people that want to provide more. And I think more is the answer to the population in Georgia. We need more of whatever it is. As long as it marks, what my folks in district 13, that's what I care about. Totally understand that. Thank you. I'm I'm Greg miss Senator Dulles, all's my senator and I want him to be concerned about me. So I appreciate everybody's time and attention today. And it's been a long day because you've had two more quick questions from Dr. Watson and from Dr. Karpatrick. Yes, sir. Yeah, I'll just pile on here with I mean the quality aspect is what drives price and. And shearing primary care is the essence of all of that. And primary care includes your. Surgeons OBGYN, pediatric family medicine, intermotic and that's what is defined by the state of Georgia. And that's what's defined by a merger. There's some variations in there which specialties. But having said that, if you drive primary care and drive qualities, which is what you're talking about. And that unfortunately hospitals have not been able to do that because they're not as nimble. They're more bureaucratic. But with competition, that's going to drive quality because they'll be forced to do that. And that's going to drive price and that's going to drive access. And that's going to make a comment on top of the center that I totally agree with you. The client that I'm working with in East Georgia, they're having to hire their own general surgeons. To do breast reconstruction for their cancer patients because the general surgeons in their town only want to take breasts off. They don't want to put breast back. And so there's an access to quality care in that community simply because the hospitals don't employ those doctors and the doctors that are freelance in the community won't provide the service. And so they're not just recruiting them to provide that service. Now, guess what? They can't have a surgery center because they're multi-specialty practiced and they need to see a win. And the hospitals would fight them on it, even though they refuse to offer the service that my clients will into higher doctors to provide. So I'm totally lined up with your comments. Yeah, you may not know the answer to this, but I remember that we did pass a law allowing micro hospitals back in 2018. I don't think we have any information so far as a committee as to has anybody done that what's the status of that did it do is sending good. The answer to that as far as I can remember, Senator is nobody has done it because you have to be a certain type of hospital to convert. And when you convert you lose the way you get paid from Medicare, you lose your advantageous reimbursement methodology from Medicare because you go from being a critical access hospital to a different kind of hospital. And so you can't get paid on a per-dem rate the way that critical access hospitals get paid. And so if you were to say you could open a micro hospital from scratch as an acute care general hospital rather than convert an existing hospital license. That might be different, but because of the way that the statute's written and the way the conversion happens, nobody will do that because they would lose too much money. We actually represented a hospital who was thinking about that and they ultimately were sold to a large hospital system because it made more sense. Mr. Chair, if it's okay with you, I'd really like to get some more information about what we did with micro hospitals and where the conflict is with CMS and what we might be able to do on that. Great. Charleston, that's the New York enforce. Thank you. Thank you, Mr. Harris. Always good to see a constituent come to the Capitol. I'm going to leave this with your assistant. This is the material that I have as well as a written copy of my remarks. If you want to circulate that to the members of the committee, we will do that. Thank you, sir. Thank you all very much. Thank you. Last but certainly not least, Victor Moldovan. If you would step up. Chairman. And the floor is yours. Thank you, sir. So I, I'm going to defer most of my comments to a later meeting and we're going to prepare a written submission to sort of address a lot of the issues that were pointed out today. Maybe raised by the other speakers. I do want to point out that if, and everyone I think needs to remind themselves of this that there's a certificate of need law was adopted in Georgia as a mandate from the federal government. It was adopted because everything was cost-based back then there were some prior comments about that, meaning that it was retrospective. How much did it cost to build a facility? So if I wanted to build a hospital in Georgia in 1980, I could build in the federal government would effectively reimburse me for it. Well, that changed the perspective pay, meaning I have to make money act to cover my cost. Doesn't matter what I spend. I'm not going to get that back from the government. That was the whole point of the ceiling program. That has totally changed the point of the program was never to be anti competitive in that in the sense of allow competitors to fight each other. The whole point of the program was to effectively keep costs down. Don't have a proliferation of facilities where the government effectively is paying for it. Because we've gone to perspective pay, the whole underlying reason reason the whole program existed to start with is gone and it's been gone for 30 years. And in fact, today we know and I think that people on the panel probably know better than I do some of you that our patient surgery our patient procedures that's being forced on the health care community whether we like it or not, whether hospitals like it or not. In fact, that's why we still out of hospitals buying physician practices opening up their own surgery centers opening up free standing facilities. Because they recognize that not just Medicare but commercial pairs as well, want to reduce costs and a way to reduce costs is to push it to our patient. So as we as you guys progress and look at this and I you know, I know we talk about is being complicated and how care is complicated. If you're looking at everything right, you're saying cost access barrier to care. But see when not complicated the whole point of the program back 30 years ago was to reduce building because the government was paying for it. Not the case any longer we need to open up access whatever that looks like at the end of the day. Open up access allow you know, I say seed the field right. If you see the field you'll get more primary care doctors you'll get more answer and for the surgery centers you get more imaging centers whatever it might be. So I think that's a good way to move barrier move barriers to access. I represent a lot of surgery centers. The state has a batching cycle. The state has not allowed any surgery center applications in the past I think year to half or two years. None not even under the exceptions. Why does that make sense if I have a reason to say I can justify a surgery center in a specific county or a specific city. Why? Why does the state say no we're not going to accept it. So again, the idea that somehow yes, we need to address cost and access in rural rural counties no doubt. C and when is not never was and is not the answer to any of those questions are lots of other things that have to happen. To make sure that people have access to care. We know that someone hasn't protected rural health care hospitals are closing anyway. So I would just say again, I'm going to do more full some reporter submission later on at one of the later meetings. I do want to point out today that just to remind everybody where we started in 1978, 79 where we are today, you know, 40, 50 years later, two totally different places. And we really need to think about whether or not something that we adopted, you know, 30, 40, 50 years ago really doesn't make sense today when health care itself is so dramatic. So that those are my comments. Thank you for listening to me. Thank you so much for being here. I'm going to allow the committee to ask you questions to the next meeting when you do present your more robust presentation. We're going to land this plan at 1201. We were close. But before we do that is going to remind the committee will be back for three more meetings our next two meetings. We're going to go specifically into communities that have been impacted by CON to hear from boots on the ground, if you will, as to what happened in those committees. We're going to be back here for a final conversation at the Capitol after that will wrap up our work by the end of the year. If there's any departments, people, experts that you would like the community here from please like Kai and myself know. There's any documents that we will get you some of the documents that we received today. If there's any other documents that we need or that you need, please let us know. And then, um, Jocelyn, you're going to work on the question that Dr. Karpathich had will circulate that to the committee. And then we get that back as well. For members of the committee, there's lunch in our office, which is right outside here. Say again. It's in the little, so it's going to be down. Yeah. So you're going to down these stairs halfway down the stairs and you'll see on the right. To those of you that presented today, thank you so much. This conversation will continue. And with this committee meeting is adjourned. Thank you.",
  "updated_at": "2026-02-14T01:18:50.756008+00:00"
}