{
  "video_id": "xShGxKPnmso",
  "url": "https://youtu.be/xShGxKPnmso?t=1004",
  "title": "Georgia House - Day 8 (2026-01-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": "2026-01-29",
  "duration_minutes": 79,
  "summary": "Overview:\nThe Georgia House session on January 29, 2026 focused on routine procedural matters, with no notable legislation or votes taking place. The highlights of the session included the introduction of the day's chaplain, Pastor Julian Pace, and a brief speech by the chaplain emphasizing the importance of humility and wisdom in leadership.\n\nKey Actions: None\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Pastor Julian Pace was introduced by Chairman Hitchens and delivered a speech on the value of humility and wisdom in leadership.\n- The speech referenced historical figures like George Washington and Jesus as examples of leaders who embodied these qualities.\n\nVotes: No recorded votes\n\nAttendance: Quorum was present, with the doors locked to keep members in the chamber.\n\nAdjournment: The session adjourned after the chaplain's remarks and recitation of the Pledge of Allegiance. The next session date was not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n.\n.\n.\n.\nYou\nThe hour for convening having arrived, all members will please take their seats.\nThe clerk will please ring the bell.\nWe're going to have the morning roll call, all members present will please vote green\nto signify their presence in the chamber and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nWell good morning.\nHere Burns and some of our members, including Chairman Petrie and Vice Chair Houston Gaines,\nthose who were and others who were instrumental in the passage of House Bill 1105 last year,\nwere invited to join President Trump today as he signs the Lake and Riley Act into law.\nIt will be the first bill President Trump signs during his second term and we're honored\nto have Speaker Burns and other representatives from our state join him for this important\nmoment for Georgia and our nation.\nOur chaplain this morning will be Pastor Julian Pace and Chairman Hitchens will introduce\nour pastor.\nThank you very much, Madam Speaker.\nI've been up here a lot of times to introduce preachers before in my career here, but this\nis the first time I've ever done it to somebody I really didn't know.\nThis was Speaker Jones, Speaker Burns pastor of the day, and he called me this morning and\nsaid, I'm going to Washington, you going to introduce my speaking name?\ngrew up in Effingham County and I immediately recognized his mother when I saw her because\nher offices didn't rink in but I really didn't know him and now he's the faster central\nalliance church into coalfalls with really amount of area address but he's well known\nacross the state he's done a lot of things he he previously served churches and rinking\nand blooming down he loves to read theology books play guitar singing and walk out doors\nHill's a bachelor's degree in music for arms\nfrom the Atlanta State University,\nwhich is now part of Dordes Southern.\nThe Old's a master's degree in physical studies\nfrom Carolina University.\nHe's currently pursuing a doctorate in theology\nfrom Evangelical Theology Seminary\nand Myers-Town, Pennsylvania.\nHis wife is Allison, and they have two children,\nGabriel and Joshua, if you stand up, please.\nAnd his mother is also with us here today, Tracy Pace, and something of interest is both\nhis wife and his mother are licensed professional counselors.\nAnd his mother, Tracy, is the incoming president of the Georgia Licensed Professional Counselors\nAssociation.\nAnd something I know about him that he didn't know that I know is he went to\nhe went to elementary school at Springfield Elementary School and the assistant\nprincipal at that time was Dale Burns and I think he came in to preach\nand naturally because Dale told me that he was sent to the office at least on\none occasion for talking too much and he said he said that gift all\nHe's much like Al Wim.\nHe said that gift most of his life.\nBut I asked her if she paddled him.\nAnd she said, no, she may have a few years earlier.\nBut that had been outlawed by then.\nSo it gives me great pleasure to do this bastard Julian\npace.\nGood morning legislators, as well as everyone else gathered\nhere today. Let me begin by saying that I feel truly honored and privileged to speak in\nminister to you this morning in this truly hallowed place. Furthermore, thank you Speaker\nBurns for the invitation to minister here today. Again, I am truly honored. According\nto the prominent American philosopher and futurist Buckminster Fuller, humanity's knowledge doubled\nroughly every century prior to the year 1900. By the conclusion of World War II, humanity's\nknowledge was doubling approximately every 25 years. By the early 1980s, Fuller estimated\nthat humanity's knowledge was doubling roughly every 12 to 13 months. Remarkably by 2020,\nSome futurists were already speculating that humanity's knowledge would soon double\nevery single day.\nIt is no wonder that our era is routinely referred to as the information age.\nBut perhaps our era should also be referred to as the age of irony.\nFor although we live in an era that is soaked with information and knowledge, we oftentimes\nfind ourselves thirsty for wisdom.\nIf wisdom is defined as knowledge skillfully applied, then the circumstances of our present\nage strongly suggest that it has become more difficult than ever to skillfully apply\nthe knowledge that we possess.\nThe sheer vastness of humanity's knowledge is quite capable of intimidating and overwhelming\nus.\nConversely, humanity's vast knowledge can also fill us with a spirit of unbridled hubris.\nAfter more as humanity's knowledge base grows, so does our ability to craft powerful\nnew technologies, some of which threaten to warp our perspective on reality.\nHow do we effectively respond to these challenges?\nWell perhaps we should look to the ancients for help, as many of them thought deeply about\nthe nature of wisdom and how to acquire it.\nKing Solomon, reputed by some to be the wisest person to ever live, wrote under divine\ninspiration and now bequeathed to us the Book of Proverbs.\nIn Proverbs 9, wisdom is vividly personified as a noble woman who is right in the middle\nof preparing a great banquet that all the peoples of the earth are invited to.\nBut here at this banquet, it is not literal food and drink that is on the offer.\nInstead, Wisdom offers to all of her guests wise counsel and insight that is far superior\nto any worldly pleasure.\nThus, King Solomon bequeaths to us the hopeful message that wisdom is available to all of\nus, regardless of who we are.\nBut how might we take Wisdom up on her offer?\nHow do we even begin to acquire the wisdom we so desperately need to live and lead effectively\nin our increasingly complex world. Fortunately, Proverbs chapter 9 gives us a clear answer.\nThe fear of the Lord is the beginning of wisdom. Thus, it is through humility. The clear recognition\nof our limited knowledge and our shortcomings that we begin to acquire wisdom.\nFurthermore, another portion of Scripture promises that, if we lack wisdom,\nwisdom. God will give us all the wisdom we need, and then some, if we will but ask with\na humble heart, truly wisdom can be ours if we will but earnestly and humbly pursue\nit. The historical record also gives us several examples of how humility leads to wisdom\nand in turn true greatness. Several historians have noted that when George Washington was\nstill a young and inexperienced soldier, he could oftentimes be intemperant and arrogant.\nIt was said that he knew a little too well just how good he looked in uniform.\nSuch a disposition sometimes got him into trouble on the battlefield,\nbut fortunately for us all, Washington eventually learned his lesson and embraced the way of humility\nover the way of hubris. When he could have been king of the United States, he\nchose the limited powers of the presidency for a limited time, ultimately\ndistinguishing himself in that role. But no historical figure has better modeled\nhumility and a life wisely lived than Jesus of Nazareth, who though enduring the\nhumiliation of the cross also experienced the glories of resurrection. To all\nthose listening today, I implore you to embrace humility which leads to wisdom\nand ultimately authentic greatness. And now let us set aside the next few moments\nfor a time of prayer. Please stand and join me for prayer and the recitation of\npledge of allegiance. Holy Triune God, empower us all to live humbly and wisely so that we may\nhonor you and bless our neighbors. Give us the wisdom we so desperately need to live and lead well\nin the complex world in which we live. In Christ's name I pray, amen. Let us say the pledge together.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands, one nation under God, indivisible with liberty and justice for all.\nThe doorkeepers will unlock the doors, members may meet the chaplain in the South\nany room in just a moment.\nOkay.\nOur Doctor of the Day is brought by Representative Martin Newton of the 127th, Dr. Brian Stansfield\nwill be down in the nurse's station if you have need for her.\nChair recognizes Chairman Hilton, the chair of the Committee on Information and Audits.\nThank you, Madam Speaker.\nGood morning, ladies and gentlemen,\nyour committee on information and audience\nhas read the journal the previous day\nand found it to be correct.\nIs there any objection to dispense\nwith the reading of the journal?\nThe chair here is none.\nThe reading of the journal is dispensed with.\nIs there any objection to the confirmation\nof the journal?\nThe chair here is none of the journal is confirmed.\nThe clerk will read the resolution establishing\nthe order of business for the day.\nReps in an illustration of the 104th loose file and be established as the order of business in the first part of the period unanimous concerns\nIntroduction of bills and resolutions first reading in reference of House bills and resolutions second reading of bills and resolutions reports of standing committees\nMorning orders\nIs there any objection to\ndispensed with the\nIs there any objection to the adoption of the resolution establishing the order of the business for the day the chair here's none and the resolution is adopted\nFirst reading of bills and resolutions the clerk will read\nHouse will in 40 by represent the golden in the 19 check is the 136th part of the 5th lumps into the 12th and tariff into the second\nThey'll be taught an act to amend article on chapter 81 in total 36 of the official go to Georgia and it's ended relating the local government budgets and audits\nIt's governmental affairs Houseville 141 by reps at a mob town of the 17th Kelly the 16th calendar the 23rd cannon of the\n172nd cocks of the 28th and others\nBill Vittado an act to amend code section 48 13 14 of the official go to Georgia, Antietta really an 11 on business or\npractitioners within location\nWays and means\nHouseville 142 by reps and a newton the 127th tiki the 134th Williams and 112 4 to the 170th\nBuckner the hundred and thirty-seven of the bill be tied on act to amend article on chapter five of title forty-eight\nThe official go to Georgia and attend it relating the general provisions relative to add below on taxation\nWays and means House will one forty-three by reps and a tiki the hundred thirty-four Smith the seventh year to the hundred fifty-second green and the hundred fifty-fourth\nCanon and the hundred seventy-second and others\nBill be tied on act to amend chapter five of title twelve of the official go to Georgia and attended relating to water resources\nfor a number of cases.\nNatural resources.\nHouse Bill 144 by reps of Newt Known in 27th Hawkins in 27th.\nTaylor 173rd, Stevens on 64th, Westbrook on 63rd, and others.\nBill B. Todd on active in chapter 7 and Todd of 48th, the physical to Georgia and\nit's a related income taxes.\nWays and means.\nHouse Bill 145 by reps of still Cox on the 53rd, Hilton on the 48th, Jones on the 47th,\nStevens on 64th, Reeves on the 99th.\nBill B. Todd and active men are three chapter three, a title 50 in the fish go to Georgia\nantenna relating to other state symbols.\nSpecial rules.\nHouse bill 148, six by reps of Taylor, the 90 second.\nHugly, the 141st Jackson, 165th McLean, the 109th Glaze, the 67th and others.\nBill B. Todd and active men chapter four, title one in the fish go to Georgia antenna relating\nto holidays and observances.\nSpecial rules.\nHouse bill 147 by reps.\nThomas, the 21st Jones, the 25th.\nGrow the 118th, gollum in the 19th,\nflipped into the 111st and others.\nBill B. Todd, an act to a menchapter.\n25, a title 50.\nWell, the official go to Georgia,\nand it's heading to Georgia,\ntechnology authority.\nTechnology and infrastructure innovation.\nHouse for 148, progress of Carson to the 46.\nWilkinson to the 38th, Williamson to the 112th,\nPowell to the 33rd, and Blackman to the 146.\nBill B. Todd, an act to a menchapter.\nthree to title 43, the Fischer go to Georgia and tentative relating to\naccountants.\nRegulated industries.\nHouse for one forty nine by reps of Barnes, the eighty six,\nhugely the hundred forty first all over the 84th hour of the 50th\nBuckner, the hundred thirty seventh and others.\nIt'll be titled an act of men chapter two, a title thirty one of the\nFischer go to Georgia and tentative relating to apartment of public health.\nPublic and community health House for one fifty five reps and a\nFleming of the hundred and 14th gates of the hundred and 20th by air to the 24th scoggins of the 14th\nCarpenter the fourth and others\nBill B. Todd and act to win part two of Article two chapter three, a total 20\nI leave Fisher put a Georgia annotator relating the university system\nHigher education hospital 151 by represent is mop to hound of the 17th can in the hundred and seventy second\nHagen a hundred and fifty six quarter to the hundred and seventy-fourth\nboth esteem to the 169th and others,\nBill B. Todd and Active,\nbench after seven,\na total 4080.\nThe fish go to Georgia,\nannotated relating to income taxes.\nWays and means house,\nbut 152 by reps and a reuse\nthe 99th Anderson in the 10th Thomas\nof the 21st of Coyay,\nthe 102nd Williams on 68th and others,\nBill B. Todd and Active,\nbench after four,\ntitle 32 of the fish go to Georgia,\nannotated relating to State County,\nmunicipal road systems.\nGovernmental affairs House for 153 by reps\nof camp of the 135th Kelly the 16th, Williams the 148th, Smith the 138th, Clifton the 131st and\nothers.\nBill B. Todd will act to amend code section 488, 3.2, the official code of Georgia annotator\nwill link the sales and use tax exemptions.\nWays and means.\nHouse for 154 by reps and a Richardson the 125th, Clifton the 131st, Mathis the 133rd, Anderson\nthe 10th, Gunner the 8th and others.\nBill B. Todd will act to amend chapter 11, a title 31 of the official code of Georgia\nannotated relating to emergency medical services help hospital 155\nprograms of Anderson to the 10th of who to the 175th canon and 172nd\ntime was the 21st Cox the 28th and others will be titled act to\namend article 7 of chapter 36 of title 36 in the district of Georgia\nannotated relating the procedure for resolving annexation disputes\ngovernmental affairs House bill 156 by resident Jones the 25th Thomas the\n21st Hilton in the 48th will hood of the 175th and pro of the 118th.\nBill B. Todd on that to a men chapter one of title six of the fish Dakota\nGeorge annotated relating the general provisions relative to aviation.\nTechnology and infrastructure innovation House for 157 by reps on a done who the\n31st person over the 119th gains the 120th and Erwin of the 32nd.\nBill B. Todd on that to a man that provide a new charter for the town of\nBrassleton Intergovernmental\nCoordination House for 158.\nArrows and a Franklin in the 160th\nWestbrook of the 163rd Smith of the 18th\nChokus the 151st Stevens on 164th.\nBill B. Todd on active and part three\nof Article 16 in chapter one.\nA title 10 of the Fisher go to\nGeorgia and attended relating to\nthe registration of businesses.\nAgriculture and consumer affairs.\nHouse for 159.\nArrows and a Crow with 118.\nThree is the 99th camp on 135th.\nthe new of the 40th.\nBill B. Todd, an act to amend chapter 26,\na title 50 of the Fishercoated Georgia antenna relaying\nthe Georgia housing and finance authority.\nBudget and fiscal affairs.\nHouse for 160 by reps and Smith, the E.T.\nHullson, the 72nd Howard, the 71st.\nBill B. Todd, an act to amend Article,\nthe men enact establishing the city court\nand the city of Carrollton.\nIntergovernmental coordination.\nHouse for 161 by reps and a Crow,\n183 in the 99 there were the 40th camp in the 135th and Smith in the 18th.\nBill B. Todd, an active man, article 1 of chapter 3, title 35, the fish go to\nGeorgia and it ended relating the general provisions relative to the Georgia\nBureau of Investigation.\nJudiciary non-subbell.\nHouse Bill 162 by resident of Hagen in the 156th work,izer of the 157th,\nlever of the 123rd, Reeves of the 99th, M.C. the 13th and others.\nBill B. Toddl, an act to amend chapter three, a title 35 of the Fisher go to George annotated relating the Georgia Bureau of Investigation.\nJudiciary non-stable House for 163 by reps and a Ridley the 22nd Ridley the 6th Hagen and the 156 Carpenter the 4th Cox the 28th and others.\nBill B. Toddl, an act to amend our 13th chapter due to title 26 of the Fisher go to George annotated relating to food service establishments.\nAgriculture.\nHouse Resolution 70 by Representative Dunhu,\nthe 31st, earned in the 32nd,\nearned 759th person, earned in the 119th,\nSebald 34th, and others.\nResolution honoring the life of Officer Christopher Lee Ruze\nand dedicating an intersection in his memory.\nTransportation House Resolution 71 by Representative Griffin\nof the 149th Resolution honoring the life and memory\nof Ms. Latasha R. Buds,\nand dedicating a road in her memory.\nTransportation House of Resolution 72 by resident Hawkins, the 27th grade in the\n154th May the act of the 82nd silk ox, the 53rd Dempsey, the 13th resolution\ncreating a house study committee on cancer care access.\nHelp.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read House bill 119 by\nrepresent bird of the 20th head of the 81st of bill relating to a Brady law\nRegulations House bill 120 by representative bird of the 20th and K and of the 81st a bill relating to preemption of local regulation and\nlawsuit relative to firearms ammunition and other weapons House bill 121 by representative bird of the 20th and K and of the 81st\nBill relating to dangers and some mentalities and practices\nHouse bill 122 by representative bird of the 20th corner of the third done who the 31st clerk of the 100th\nK and of the 81st and others a bill relating to persons and their rights House bill 123 by representative workhies are the\n157th Reaves of the 99th South Cox of the 53rd Hulkman,\nthe 101st Smith of the 18th and others,\na bill relating to criminal procedure.\nHouse Bill 124 by Rep. Skoggins of the 14th,\nHawkins of the 27th hatchet of the 155th.\nClark of the 100th, Newton of the 127th and others,\na bill relating to general provisions,\nrelative to insurance and state employees,\nhealth insurance plan, and post and health benefit fund.\nHouse Bill 125 by Rep. Dameron of the 1st Crow of the 118th,\nReaves of the 99th and Gollett of the 19th,\nbill relating to crimes and offenses House Bill 126 by Representative Carpenter of the 4th\nand bill relating to alcoholic beverages House Bill 127 by Representative Cox of the 28th\nlever to the 123rd price of the 139th Barrett of the 24th Urban of the 32nd and bill relating\nto sick personal maternity leave for teachers and other school personnel House Bill 128\nby Representative Carpenter of the 4th and mom to head of the 17th and bill relating to\nthe Fair Business Practices Act of 1975 House Bill 129 by Representative Cannon of the\n174th Corp. 174th Huttleston, the 72nd and others.\nA bill relating to preferential assessment and\nbedified conservation use property and\nbedified residential transitional property.\nHouse bill 130 by Representative Jasper's with the 11th\nEvans of the 57th Powell, 33rd Wilkinson, the 38th Carpenter,\nthe 4th and others.\nA bill relating to the Georgia Student Finance Authority,\nHouse bill 131 by Representative Reeves of the 99th,\nGunter of the 8th, leveraged to the 123rd,\nall over the 84th.\nFolk them in the 101st and others.\nBill relating to self-service storage facilities, House Bill 132 by Representative Reeves of the 99th Oliver of the 84th Gallauder of the 19th Lever to the 123rd Smith and the 18th Annathers Bill relating to the Council of Municipal Court Judges, House Bill 133 by Representative Clark of the 100th Hilton of the 48th,\nPershed of the 176, Jackson of the 128th, Gamble of the 15th, and others of bill relating to compulsory attendance.\nHouse bill 134, by bremson camp of the 135th, Jasper of the 11th.\nPershed of the 176, corporate of the 174th, Williams of the 148th, and others of bill relating to revenue and taxation.\nHouse bill 135, by bremson, Scuffield of the 63rd.\nHe will leave the 141st, but now the 77th, Davis of the 87th, Bell of the 75th, and others of bill relating to definitions relative to fair housing, general provisions regarding education, general provisions regarding labor and industrial relations.\nfair employment practices House Bill 136 by Representative Newton of the 120's\nhaving black one of the 146 roads of the 124th cox of the 28th Prince of the\n132nd and others a bill relating to income taxes House Bill 137 by\nRepresentative Anderson of the 10th Lums of the 12th Hawkins of the 27th\nYear to the 150th Lever to the 123rd and others a bill relating to contracts\nfor public work House Bill 138 by Representative Neil of the 79th\nCrow the 118th and Kitchens of the 161st to Bill relating to the powers\nand duties of the Georgia Peace Officer Standards and Training\nCouncil. House bill 139 by Representative Judge of the 25th, Hawkins of the 27th, hatched\nof the 155th, candidate of the 102nd, Jackson of the 128th, and others, a bill relating\nto pharmacies. House Resolution 66 by Representative Smith of the 18th, Huddleston of the 72nd. Resolution\nrecognizing Mr. Mason, Mace Aubrey, McIntyre of the 2nd, dedicating a bridge in his memory.\nHouse Resolution 67, by Representative Copfield of the 63rd, Stevens of the 164th, Davis of\nthe 87th, Drener of the 85th, McLean of the 109th, and others. A resolution supporting\nGeorgia's Clean Energy Transition Workforce Development and Green Job Creation Act by 1950.\nHouse Resolution 68.\nBy Representative Ladies of the 60s,\nhaving Dawson of the 65th Jackson of the 68th,\nWillis of the 55th and Scofield of the 63rd.\nA Resolution supporting the revision of the quality basic education and\nfull-time equivalent funding formulas.\nHouse Resolution 69 by Representative Barnes of the 86.\nScofield of the 63rd Clark of the 108th,\nHouse of the 72nd,\nCanada of the 58th and others.\nA resolution recognizing every third Thursday in April as Biomedical Research Day,\n3-Second Readers.\nReport to standing committees, the clerk will read.\nProfessor Gunnar, the eight district chairman of the committee on judiciary submitted the following report.\nAnd to speak your committee on judiciary,\nas senator, it's consideration following bills in the house as instructed by the report.\nThe same back to last following recommendations.\nThat was about 36 do pass, House Bill 55 do pass respectfully submitted.\nRepresentative Gunnar, the eight district chairman.\nRepresentative Cooper, the 45th District Chairman of the Committee on Public and Community Health submitted the following report.\nMs. Speaker, your Committee on Public and Community Health has had an Earth's consideration following Bill of the House.\nIt's a truck committee report, same back to the House and the following recommendations.\nHouse Bill 8090 passed by Committee Substitute, respectfully submitted.\nRepresentative Cooper, the 45th District Chairman.\nRepresentative Shaw Blackman, the 146th District Chairman of the Committee on Ways and Means submitted the following report.\nTo speak to your committee on ways it means it's at an Earth's consideration of following Bill the House.\nIt's struck to me to report the same back to the House and following recommendations.\nHouse Bill 92, due passed by Substitute, respectfully submitted.\nSenator Shaw Blackman in the 146th District, Chairman, that completes the reading of the report's standing committees.\nChair asks that members take their conversations to the\nany room we're moving on to morning orders and there are some important guests\nin the gallery that members would like to introduce so please take your seats\nor take your conversations to the any room. The chair recognizes representative\nIf you have a morning order, if you'll make your way to the front place,\nRepresentative Wade and Representative Chastain.\nGood morning, everybody.\nColleagues, I'd like to just give a great shout out\nto some friends from Dawson County, Georgia\nthat are in the gallery.\nDawson County Chamber of Commerce sponsors,\nyouth leadership programs and adult leadership programs\nthat we've got both.\nThe class of 2026 here, some fantastic.\nYou guys will stand up and be recognized.\nWe'd like to welcome you to the People's House.\nAnd I want to give a special shout out.\nMs. Mandy jumped through some hurdles to get here today\nwith the adults.\nShe survived Atlanta traffic and also wanted to just tell her\nin this group that the class of 2026 has an opportunity\nto break records and potentially have the highest\ngraduation rate in our school's history crossing over 97,\n98%.\nSo we're looking forward to the things\nthat that class is going to do.\nThank you very much.\nThank you Madam Speaker, today I want to recognize some incredible advocates joining us in the gallery. Many of them are students in Georgia's inclusive post office.\nThank you Madam Speaker, today I want to recognize some incredible advocates joining us in the gallery. Many of them are students in Georgia's inclusive post-secondary education programs, which give people with intellectual and developmental disabilities the chance to learn, go to college, do job skills and are active members of their communities.\nWe have students here today from Georgia State, Georgia Tech,\nUGA, Kennesaw State, and Barry College.\nThese advocates are here to speak up for people with disabilities\nwho are in workshops and earning less than minimum wage.\nPlease join me in recognizing these incredible advocates\nup in the gallery. Thank you.\nThank you, Madam Speaker.\nChair recognizes Chairman Stevens for morning order.\nLet me invite the Chattam Beligation here as well as they make their way down.\nToday, as you might know, you got to tick it in your packet today, today is Savannah Day.\nEvery year, it's a big year, it's a big day and a lot of these folks are in the gallery.\nWhy don't you all stand up so that we can give you an applause.\nThey're trying to make their way through.\nSome of them are waiting.\nThank you.\nNobody's left in Chattam County.\nThey're all down here at the Capitol Day.\nI hope you'll make your way from 5 to 7 today for some of the best seafood that you'll\never have and some barbecue and lots and lots of people to come down from Savannah and\nof course we've got coastal delegation coming up as well so I hope you'll join us 5\nto 7 if you don't have a ticket use your badge that's your ticket to get in but for\nyour spouse significant other come see one of us and we'll make sure you're taking care\nThank you Madam Speaker\nChair recognizes representative Owl for a morning order\nThank you, Madam Speaker the morning everyone\nThe API\nLegislative caucus is pleased to honor the lady will suspend let me just get some order\nLet's give the lady your attention, please\nPlease, thank you.\nPlease do honor a constituent of mind\nwho is in the gallery right now.\nMary D'Souza Sikwara is an Indian Olympian\nand was one of the first woman athletes\nto represent India in the Olympics.\nMary competed in the 1952 Olympics in Helsinki in both the 100 meter and 200 meter races.\nIn 1954, Mary competed in the 4x100 meter relay of the 1954 Asia Games and became one\nof the first Indian women to win a gold medal,\nalong with her relay teammates.\nShe also set some Indian national records in 1951 and 1957\nin the 100 meter and 200 meter races, as well as in the 800 meter hurdles.\nIn 2013, Mary was awarded the Diane Chand Award\nby the Government of India for her lifetime achievements in that sport.\nmy honor to represent Mary and her family in House District 50.\nSo let's please give them a warm welcome to the people's house.\nChair recognizes Chairman Matheak for morning order.\nGood morning, Madam Speaker, and thank you so much.\nToday it is my pleasure to welcome State Court Judge Jason Thompson from Fayetteville, Georgia.\nAnd I'm kind of sad that Representative Bonner's not here today because I know he would\nwelcome you and your five interns.\nAnd what a great day to have young people in the house to learn how the laws are made.\nThank you.\nChair recognizes Whip Per Shet and others from morning order.\nThank you, Madam Speaker.\nWe've got a distinguished group in the gallery and we want to recognize the League of\nSoutheastern Credit Union is a Georgia Credit Union Association. Where are you guys that we stand up and be recognized?\nThat's the middle there. We'll recognize these these credit unions who represent 2.2 million credit union members in the state of Georgia. Thank you very much.\nWe're honored this morning to have an invite resolution and the chair, the clerk will read the resolution.\nHouse resolution 59 by Representative Park of the hundred and seven hung on the hundred\nand third hour of the 50th trend of the 80th Williams 168th and others, a resolution\nrecognizing and celebrating the 20th anniversary of Korean American Day at the State Capitol\nand for other purposes.\nrecognizes WIP Park to introduce our invited guests.\nThank you, Madam Speaker.\nGood morning, colleagues.\nHappy Lunar New Year.\nAs a longest-serving Asian American in Georgia's history,\nit is my honor to recognize the 20th anniversary of the federal\ndesignation of Korean American Day here in the people's house.\nWe have some special guests with us this morning.\nFirst, we have the Korean Consulate General Sub that represents the bilateral relationship\nbetween the Republic of Korea and our great state that's resulted in billions of dollars\nin foreign direct investment here in the great state of Georgia.\nAs this is the 20th anniversary, we also have with us the children and grandchildren of\nKorean-American leaders who passed away last year, each of these leaders dedicated more\nthan 20 years of their lives serving their community. First, we have Danny Un,\nson of Mr. Jay Un, former president of the Korean American Association of Greater Atlanta.\nNext, we have Kim Yee, the daughter-in-law of Dr. Sam Chung, former president of the Korean\nAmerican Scholarship Foundation. And last we have Jeffrey Kim, grandson of Dr.\nYoung Kun Kim, founding member of the Korean American Scholarship Fund. We also\nhave with us in the gallery a lot of special guests who are here with us. And\nlast but not least we have our special speaker, Missou Ann Hong, President and\nCEO of the Center for Asian Pacific American Women to provide us some special\nremarks. So please join me in welcoming our special guests here in the\npeople's house. Thank you, Madam Speaker. Please give your attention, please.\nThank you so much, Madam Speaker. First of all, it is such an honor to be with all\nof you today, I want to thank, start by thanking Representative Park, Representative\nHong, Representative Long and Representative Ao on creating this Korean American Day\nresolution for Georgia. It's really a special day for us to recognize the contributions\nof our leaders and our community. I myself this year is my 50th anniversary being in the\nthe United States.\nThank you.\nI flew to this country by myself at the age of eight and I was adopted by my aunt and she\nknew that I would have a better life and the American dream in the United States.\nAnd believe it or not, going from Seoul, Korea to Hurley, Wisconsin, which is the upper\npeninsula of Michigan, I was a little shell shocked culturally when I came here.\nBut I met my aunt in Chicago and we flew together and that started a whole new life and a whole\nnew trajectory for this little girl from Korea.\nNow one of the things that I was really impressed with these amazing sons and daughters and\ngrandchildren of the honorees. Let me share a little a few things about the contributions\nand by the way Madam Speaker, your office was roaring with laughter and connection while\nyou're here. And we had a wonderful opportunity to learn more. Danny Un, the eldest of three\nboys, he talked about how he learned discipline from his father, Mr. Jay Un, and the fact\nthat he really cared deeply about making sure that the Korean American community is uplifted\nand making sure that we all prospered. Also, Kim Yee, we were talking and laughing about\nthe fact that Danny's principal was actually her mother. So we were making all kinds of\nwonderful connections. Jeffrey's the grandson and he talked about how he loved making fire\nin the woods with this grandfather, and the fact that these are people personalized and\nthey're very much wonderful human beings.\nAnd Sun Kim of Mr. Na Sung Ho, every day, every week shared food with seniors who were\n50 to 70 years old and created his own programs.\nAnd after putting my mom in memory care this past weekend, this would have meant so much\nfor her as she keeps going back to her first language, which is Korean.\nSo with that, I want to honor and thank our leaders of our community, the fact that we\nhave all these unsung heroes who are making a difference, and I honor all of you today.\nThank you so much, Madam Speaker.\nYou\nWe have one last morning order that the group was not here and they have now arrived, Chair\nrecognizes Chairman Meeks for a last morning order.\nThank you, Madam Speaker, joined by Chairman Buddy Deloche here.\nLadies and gentlemen, we have great leaders from all around our state today.\nWe are pleased to have the 2025 class leadership wane with us.\nIf y'all will, please stand be recognized.\nThank y'all for spending the day here at the Capitol\nand your great leadership back in Jespin Wayne County.\nWe're moving on to morning orders, or I'm sorry, afternoon orders.\nThe chair recognizes Chairman Dickie and Meeks for an afternoon order.\nThank you, Madam Chair.\nI'd also like to thank the members of a great delegation if they would come up.\nIt's well. I wanted to do a little thing about a friend of mine, a friend of ours for agriculture who passed away last week.\nEveryone would stand, please.\nSo, I stand the well this morning on the passing of Charles Hall of Lagrange.\nCharles was a devoted husband, father grandfather, and a friend of agriculture who passed away last week.\nHe's a proud alumnus at UGA, a lifelong bulldog served on many committees there as President\nof UGA, UGA, C-A-E, Alumni Association, Board of Directors.\nCharles founded his company Association Services Group in 1995, which was recognized many\ntimes as one of the fastest growing companies in Georgia.\nto train recognized Charles as well.\nThe company has helped many small and large associations be very successful throughout\nour state and thrive.\nBut Charles really had a heart and loved agriculture.\nHe was known all over the state and the southeast for bringing ag groups together.\nAnd he was Charles's idea to bring a bunch of peach growers, blueberry growers, by day\nyou onion growers together on the one umbrella, the Southeast Fruit and Vestible Association,\nthe Georgia Fruit and Vestible Association to a large trade show every year in Savannah.\nAnd Charles had that brainstorm for that, worked to put it together, planned it for so\nmany years.\nAnd but Charles was such a leader for ag issues all over our state in Washington.\nAnd you know, he's someone who was, they said at his funeral, he was, he worked seven days\na week, but he was always at his church in the grains, the first baptist on the square\nat the grain, he was a deacon and a grater.\nSo if you'd pause just a moment to recognize the life and the accomplishments of Charles\nHall.\nThank you very much, ma'am.\nChair recognizes representative Al Williams\nfor an afternoon order.\nI'm speaking on you.\nThank you Madam Speaker.\nMembers of the House,\nlast year when I stood to go with some matters\nhistory and protocol. Several of you mentioned that when you were a freshman you\nwere never told and I've learned this that those that did not listen they won't\nlisten so it doesn't bother me at all but Jacob should not lose his reward if\nIsrael does not hear so we'll just tell it again when speaking from this\nwell. One must be invited to the well by the speaker and not enter the well until the\nspeaker gives permission. The lights are here for a reason. Green means let it run. Yellow\nmeans start to coast. Red means goodbye. That's as simple as I can put it. When someone\nis speaking from this well. It is never acceptable to walk in front of them. Never\nacceptable. That is a courtesy of this house. Never. When you're invited and others\ndecide to accompany you, first you should be approved by the speaker to accompany\nthe person who can give the consent from their podium. Once here, no one should ever stand\nin front of the speaker who is in the well, never beside only. If you're late, that means\nyou're in the back. It doesn't mean continue to move forward. To the sides and to the\nprayer. It looks bad. There are 180 of us here and I understand some of us could care less\nbecause all of us bring here egos. If you didn't have an ego, you wouldn't have run.\nAnd sometimes these egos get in the way of the rules. One thing about rules and I is talking\nthe best of this morning, 55 miles per hour on some highways. If you ignore it so be it,\nbut don't fix the ticket after you get it, because you knew the rules. If you disagree\nwith the rules, this is a democracy, but you must observe the rules without rules chaos.\nthe rules of a reason, try later to change the rules. There is a procedure. And in the\nminority, that means gain the majority and you'll make the rules. Keep that in mind,\nMr. Leader. But it is so important that we demonstrate to this state that because they\nhave sent us here to represent them. Let's represent them in an outstanding fashion. Lastly,\nyou've heard me for 10 years, more than 10 years, represented Kathy Ash, taught me how to\nsave the pledge properly. Properly, if you read the plans of allegiance, the karma comes\nAfter God, not after nation, it's one nation under God, then you pause.\nHey, don't worry about it. They do it wrong at the Super Bowl, but at least let's do it right\nin the Georgia House. Let's set an example. Let's say the pledge correctly. That's just like\nmaking sure the American flag is to the right of the speaker. Do it right. Now I'll be listening.\nI know most of you could care less, but I will be listening.\nThank you Madam Speaker.\nThis is to be continued next year.\nSee you then.\nThank you.\nThe hard act to follow, the chair recognizes representative Tran for a morning or afternoon\norder.\nThank you, Madam Speaker.\nNot sure if I want to follow representative out volumes.\nBut happy new years, happy lunar new years, everyone.\nToday, we will be celebrating lunar new year here\nat the Capitol.\nThere'll be a lion dance at noon.\nThere'll be lunch in 514 COOB.\nBut it is the year of the snake.\nAnd so with this year, the snake brings us vision.\nSo may our chambers see all the problems in Georgia\nand use the intelligence of the snake\nto find the solutions to those problems.\nMadam Speaker, if you will indulge me\nfor just another minute, two years ago,\nI came into this chamber and about 20,000 Ohio State fans\ndescended upon Atlanta,\nand I didn't know what I was going to do\nif Ohio State had won and beat UGA.\nThat didn't happen in UGA one,\nBut this past Monday, 20,000 Ohio State fans came once again\nto feel the great Southern Hospitality of Georgia\nand leave Mercedes-Benz Stadium\nwith a national championship.\nSo I'd like to extend our congratulations\nto the Ohio State University,\nbut guys, the world's deadliest nut\nand congratulate them on a national championship.\nAnd I know my colleagues will say,\ngo dogs coming up in 2025,\nBut for today, I'm going to say go box.\nCongratulations.\nOh, H.\nThank you, Madam Speaker.\nThat concludes afternoon orders.\nThe clerk will read the caption\nto a group of privileged resolutions.\nRecognizing and commending, Carol H. Barrell.\nRecognizing and commending, Wana P. Alzaga.\nRecognizing January 28, 2025 with Georgia Lim Lawson,\nLimbed Difference Awareness Day at the State Capitol,\nrecognizing commending the Georgia Asian American\nand Pacific Islander hub,\nrecognizing commending Darren McCoy on his\noutstanding public service,\nrecognizing commending Sheriff Ron Freeman,\nrecognizing February 4th, 2025,\nit's a flexia day at the State Capitol,\nhonoring commending American heritage girls,\ncommending and, and congratulating Colton Asargent,\nCommending and congratulating Melvin and G.\nDie the third, congratulating the Hebron Christian Academy\nfootball team for winning the 2024 G.H.S.A.\nclass private A3A State football championship,\ncommending the Georgia Association of Broadcasters\nand their radio television station members,\nrecognizing January 23rd, 2025 as dual day at the state\ncapital, recognizing commending the interfaith organizations\nand volunteers involved in disaster cleanup efforts\nand recognizing and commanding Captain Coleman A. Landers.\nAnd for other purposes,\nI'll complete the reading with privilege resolutions.\nIs there any objection to adopting the privilege resolution?\nThe chair here is none and the resolutions are adopted.\nWe have a special birthday today.\nThe chair would like to recognize Chairman Darling Taylor.\nIt is her birthday today.\nHappy birthday.\nWe can't think of a better way than for you to spend it with us.\nThere are announcements.\nWe have a few announcements.\nThe chair recognizes leader of station for an announcement.\nThank you Madam Speaker. Just a reminder that the committee chairman's lunch is\nthis afternoon committee chairman please be at the lunch this afternoon. Thank\nyou. Chair recognizes Chairman Corbett for an announcement if you have an\nannouncement make your way to the front.\nThank you Madam Speaker. The rule caucus will be meeting at 12 o'clock over\nin the Ag Building. We will launch, we'll be served. We've got Georgia Forest\nAssociation and Farm Bureau is our host today. So you're there. Thank you.\nChair recognizes Chairman Camp for an announcement.\nThank you. I know we've got a lot of activity going on right now but if your\ndelegation rules have not been submitted as of yet. They are due tomorrow by\nclose a business to either myself or my policy analyst Michael Satterfield.\nHe's floating around here now, waving in the back. One important detail I\njust want to mention if I may is that when we look at delegation rules you can\nhave a lot of different rules in there. What our committee looks at is the\nnumber of house signatures required. So please make sure that is in your your\nmessaging and clearly states how many House members we are not concerned how\nmany Senate members because we are not the Senate. Thank you. Chair recognizes\nRepresentative Henderson for an announcement. Thank you Madam Speaker. Tuesday\nFebruary 4th, World Cancer Prevention Day at the Capitol. In recognition of\nbreast cancer survivors and those that are going through treatment and prostate\ncancer survivors and those that are going through treatment. Women please wear\npink, men please wear blue. We're raising awareness and encouraging women to\nget their mammograms and men get your PSA test done. No one should face cancer\nalone were all in this together and we create a support system of love and prayer. Remember\nthere's no cure for cancer but early detection saved lives. Early detection saved my life.\nAgain, Tuesday, February 4th, World Cancer Prevention Day at the Capitol. Thank you,\nMadam Speaker. Chair recognizes Chairman Lynn Smith for an announcement.\nThank you, Madam Speaker. Good morning, everyone. So it's time again for the House\nNatural Resource and Environment Committee to have its first meeting. We'll meet\ntomorrow morning 8 o'clock in room 606 CLOB and it'll be an overview of all the\nagencies that report to our committee. Thank you. See you there. Chair recognizes\nChairman Hawkins for an announcement. Thank you Madam Speaker. I want to remind\nthe group that tomorrow is the Georgia Dental Association Law Day here. They will\nbe here at eight o'clock probably to about ten or ten thirty and they'll be in\nroom two thirty. They've got your ties and scarfs. So if you want one show up\nto say hello to your dentist thank you ma'am. Chair recognizes chairman Brad\nThomas for an announcement. Thank you madam speaker. The special committee on\nresource management will be meeting tomorrow at 9 a.m. and 406 C.L.O.B. to do some\nhousekeeping and approve of rules. Thank you madam speaker. Chair recognizes\nChairman Anderson for announcing.\nThank you, Madam Speaker.\nThe Governor Affairs' full committee will meet today at 3 o'clock and CLOB 606.\nThis is an organizational meeting. We'll be voting on our committee rules.\nI know there are some appropriations of committee meetings going on at the same time.\nSo if you can make our meeting great, if not, spend that money.\nThank you.\nthat concludes our announcements. I'll take photos with our our sole page today. If you\nhave the page today, if you will make your way to the front with your page, we'll we'll\ntake a picture. The chair recognizes the majority leader from motion.\nThank you Madam Speaker. I move that this house stand adjourned until 9 30 9 30 on Thursday\nJanuary 30th, 2025.\nOn the motion of the majority leader that this house stand adjourned until 930, tomorrow,\nJanuary 30th, all those in favor will say aye.\nAll those opposed will say no.\nThe aye is clearly habit in the house as adjourned.\n",
  "updated_at": "2026-02-12T16:03:37.456891+00:00"
}