{
  "video_id": "xsYlXkTVx9o",
  "url": "https://youtu.be/xsYlXkTVx9o",
  "title": "Georgia House - Day 19 (2026-02-22)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 19,
  "video_date": "2026-02-22",
  "duration_minutes": 102,
  "summary": "Overview:\nThe Georgia House session on 2026-02-22 included discussion of several bills, notable speeches, and a focus on the role of chaplains in supporting law enforcement and public servants.\n\nKey Actions:\n**HB 1096**: Bill referred to committee\n**HB 1146**: Bill referred to committee\n**HB 826**: Bill referred to committee\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- Representative Katie Dempsey and Representative Eddie Lommons recognized Chaplain David Thornton for his decades of service as a chaplain supporting law enforcement and first responders.\n- Chaplain Thornton gave an inspirational speech on the role of chaplains as \"peacemakers\" and the importance of prayer for lawmakers, law enforcement, and the nation.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nQuorum present.\n\nAdjournment:\nThe House adjourned. The next session is scheduled for 2026-02-23.",
  "transcript": "you you and most of my adult life as has representative Katie Dempsey. David is part of a very large family that's been in our community for many generations. They have a history of service and community involvement that spans more than a century. The reason I didn't know David in high school besides him being a few years younger in me was that his father answered the call to military service during the early days of World War II and made a career of the Army. David's father was a highly decorated army officer who stormed the Utah Beach on D-Day and went on to serve in Korea and Vietnam. David is a military kid who went to 17 different schools before his family returned home to settle down. May explain some things. He graduated from West Rome High School in 1976 and shortly after graduation followed in his father's footsteps and joined the Army serving in the 82nd Airborne from 1977 to 81. David I've always wondered about people who willingly jump out of a perfectly good airplane. After service David felt a call to Christian ministry and attended Covington Seminary where he received his pastoral training. He went on to serve a number of smaller churches in the Floyd County area as a bivocational pastor until he found his true calling which is that of Chaplin to our law enforcement community. He has served as Chaplin for the Floyd County Sheriff's Office for the past 34 years. He also serves our E-9-1 personnel, our Metro drug task force and our SWAT teams. He's a member of our critical incident stress management team and teaches emotional survival for our law enforcement community. He is also a senior chaplain emeritus with the Georgia Sheriff's Association and was appointed by Governor Sonny Perdue as Chaplin for the Homeland Security. He also was a pastor to the Central Church which is a church that ministers primarily to our law enforcement community. David is always there to give counsel and comfort when an officer is involved in an accident, a shooting, a high speed pursuit or a stressful incident that is part of the realities of law enforcement. On a personal note, David and particularly his daughter Amy were there for us when my wife and I lost our teenage daughter in an auto accident in her sophomore year of high school. You see Amy and Rebecca were best friends from kindergarten onward. So right before the funeral, Amy asked me if she could sing a song and in the midst of our grief, we knew she was hurting too. She sang a beautiful tribute to our daughter, friends or friends forever. I did not know at that time how well she could sing but Amy and her husband Josh now have a dynamic music ministry and they are currently serving at First Bab just Brunswick and I think you're watching online. Did I mention that service seems to run in this family? I had the unfortunate privilege however to return the love and comfort when David's older daughter Ashley was severely injured in an auto accident with a drunk driver and passed away some years later from complications caused by the accident. You see David knows how to minister and he knows what it's like to be ministered to. David is married to Teresa Thornton. They have five children and 13 grandchildren. Teresa and our Floyd County Sheriff David Robertson are here at the Capitol today accompanying David and watching online from my office. It is now my privilege to introduce our pastor for today, my friend Chaplin David Thornton. Thank you. It's a great honor to be here today in the House of Representatives. Thank you to Speaker House David Rolston from Blue Ridge. I have the honor of having a river house up in McCaysville so I'm one of his good taxpayers along with that. Thank you the honorable Eddie Lomston is a dear friend. One thing that Eddie mentioned in our family is cross pass with his daughter when she passed the name of my daughter when we had our first, when I had our first grandchild. She was named Rebecca after 80s daughter and she now tends very college as a electronic aeronautical engineer and going to Auburn afterwards but thank you Eddie. And to Miss Katie Demptsy district 13, a true heart of a servant to our community and I'm thankful for both of you. I'm thankful for the House of Representatives. It's a great state of Georgia. I'll be with you, lead you always. We're truly blessed by your leadership. Matthew 5.9 said, blessed are the peacemakers for they should be called the children of God. The definition of blessed is invoke divine favor upon asking God to look favorably on or express or feel gratitude or thankful. A peacemaker is a person who brings about peace especially by reconciling an adversaries. The question is what is your calling? And as Eddie told you my calling is to be a chaplain that ministers the law enforcement public safety and the public servants. I also teach a class on emotional survival that I've shared and a lot of your counties and 21 different counties when we go in with our system teams and debrief and help out when officers are killed in a lot of duty. There was 542 officer destination wide last year including 375 to COVID and nationally and there was 110 deaths by gunfire or violent crime. Georgia had 49 officers that were killed in a lot of duty and then the tragic part is to add to all that total. We lost 171 deputies and officers to suicide. So you see that the job I have is a chaplain that I take seriously. I travel many areas of this state and community to do that because I believe in what the column is when it said blessed are the peacemakers for they should be called the children of God. George Washington had a motto that he said deeds not words and I try to do that in my ministry and what we do in the community and I'm sure you do here in the House of Representatives. Three things that another thing that he mentioned three things that prompt man to regularly discharge your duty in time of action. No bravery, hope of reward and third as fear of punishment. The bless the peacemakers they call the children of God. In Titus chapter 3 verse 1 my brother was one of the sheriffs that I served under for five sheriffs and he had this hanging in his office and he said this is what you need to know to be a sheriff or being public service and it says in Titus chapter 3 reminds them to be subject to rulers to authorities to be obedient to be ready for every good deed. We are blessed as peacemakers and call the children of God when we honor pray and lift up lawmakers to God each and every day. That is my duty as a Christian, that's my duty as a chaplain, that's my duty in law enforcement and one another to pray for you, for you to pray for me and we pray for our country. Romans 131 another scripture that says let every person be subject to govern authorities for there's no authority except from God. And those that exist have been instituted by God. My closing thoughts are this I need to pray for myself, I need to pray for my family, I need to pray for my community, I need to pray for the deputies and officers I serve, I need to pray for the House of Representatives of the great state of Georgia, I need to pray for our nation, I need to pray for unity of fellowship through Christ my Savior, Isaiah 41 10 says this, it said fear not, he said I am with you, fear not I am with you, be not this made for I am your God, I will strengthen you, I will help you, I will uphold you with the right hand of righteousness. So thank you to the Speaker of the House David Ralston, my representative and friend Eddie Lomston and the representative and friend Katie Dempsey to the House of Representatives, I pray God strength, God speed and guidance to us all. And if you would I would have you join us in our prayer. As we pray it says God, we come before you are thrown to grace and mercy. We thank you for your son and our Savior Jesus Christ. We acknowledge you in every aspect of our life and our government throughout the history of our great state and nation. I pray with the heart of love and mercy for each representative in this legislative house. I pray for the Democrats, the Republicans, the men and women alike. Lord we pray for the work and the people of the great state of Georgia. In praying we ask for a hedge of protection for all our public servants, military and all our front nine personnel. God your grace is sufficient for every need. Pray for our governor, the Senate, the House of Representatives and all the agencies that represent this great state. We thank you Jesus, our Savior and Lord and in his grace we say amen. Would you join me in the pledge? I pledge allegiance to the flag of the United States of America and to the Republic which stands one nation for God, indivisible with liberty and justice for all. Our keepers will unlock the doors. Chair recognizes before I go there members may greet the chaplain in the south any room. Chair recognizes the chairman, chairman Hogan, the chair of the committee on information and audits. Thank you Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and found it to be correct. And furthermore Mr. Speaker we are reminded how short life really is and how we are just passing through. So all the people you have told us you love lately tell them and live your days like you mean it. Chairman Hogan the chair of the committee on information and audits reports that the journal the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns on the 59th move the following will be established as the order of business and the first part of the period unanimous consents introduction of bills and resolutions first reading and reference files bills and resolutions second reading of bills and resolutions reports of standing committees third reading and passage of uncontested local bills and resolutions first reading and reference of Senate bills and resolutions morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day. The chair here is none and the resolution is adopted first reading of bills and resolutions the clerk will read House bill 1375 by reps and a more than 95th Wilson of the 80th Oliver the 82nd country and 93rd dryer the 59th and others will be titled act to amend chapter 9 and title 34 the fiscal to Georgia annotated relating workers compensate the industry and labor House bill 1376 by reps and a more than 95th Cooper the 43rd Carpenter the 4th rich of the 97th gull of the 19th bill be titled act to amend article 13 chapter 2 titled 26th the fiscal to Georgia annotated relating to food service establishments agriculture and community affairs House bill 1377 by reps and a perchedal the 176th Corp. of the 174th road to the 120th Smith of the 18th gunner of the 8th bill be titled act to amend article 1 of chapter 7 to title 48th the fiscal to Georgia annotated relating the general provisions relative to income tax judiciary House bill 1378 by reps and a jaspers the 11th Apollo 30 second balance through the 23rd read the 6th Harvard the 2nd and others will be titled act to amend part 3 of article 4 chapter 11 to title 16 the fiscal to Georgia annotated relating to carrying and possession of firearms public safety and homeland security House bill 1379 by reps and a quarter to the 174th riddley the 6th perchedal the 176 hogan and 179th roads the 120th bill be titled act to amend title 35 the fiscal to Georgia annotated relating to law enforcement officers and agencies motor vehicles House bill 1380 by reps and a quarter to the 174th housed into the 170th Smith the 133rd perchedal the 176th in England and the 116th bill be titled act to amend chapter 7 to title 48th the fiscal to Georgia annotated relating to income ways and means House bill 1381 by reps and a Stevens 164th England 116th corporate alone 74th Watson and 172nd jaspers the 11th and others bill be titled act to amend chapter 80 title 36th the fiscal to Georgia annotated relating to general provisions applicable to counties and municipal government affairs House bill 1382 by reps and a Stevens 164th England 116th corporate alone 74th Watson and 172nd jaspers the 11th and others bill be titled act to amend code section 3662A 21 of the fiscal to Georgia annotated relating to wild training on development redevelopment programs. Governmental affairs House bill 1383 by reps and a will linsky the 79th abstraction 100 fourth all over the 82nd rich of the 97th ho come of the 81st and others bill be titled act to amend article 2 chapter 19 to title 45 the fiscal to Georgia annotated relating to fair employment practices act of 1970 jibissary House bill 1384 by reps and a Jenkins the 130 second camp alone 31st green in the 151st jaspers the 11th night of the 130th bill be titled act to amend code section 8223 of the fiscal to Georgia annotated relating to amendment and revision of codes generally agriculture and consumer affairs House bill 1385 by reps and a vanderson to the 10th Taylor the 173rd rich of the 97th gains to the 117th lumpston to the 12th and others bill be titled act to amend chapter 36 and title 36 the official to Georgia annotated relating annexation of territory. Governmental affairs House bill 1386 by reps and a Carson the 46 Smith the 133rd corporate of the 174th Sebal the 34th and all over what's the 42nd bill be titled act to amend chapter 8 to title 48 the fiscal to Georgia annotated relating to sales and use taxes. Ways and means bill 1387 by reps and a column is the 68th green in the 151st bottle of 30 second corporate of the 174th bottom of the 72nd bill be titled act to amend title 40 the fiscal to Georgia annotated relating to motor vehicles and traffic motor vehicles House bill 1388 by reps and a perchedal the 176th corporate of the 174th the hood of the 175th Watson 170 second and go to the 19th bill be titled act to amend code section 913 142 with the fiscal to Georgia annotated relating to requirements of an official legal organ judiciary House bill 1389 by reps and a null of us the 42nd one of the 89th boatty the 62nd Allen the 40th Oliver the 82nd and others bill be titled act to amend chapter 5 a title 34 the fiscal to Georgia annotated relating to sex discrimination in employ industry and labor House bill 1390 by reps and a null of us the 42nd Smith the 18th boatty the 62nd Evans the 57th tankers lead the 160th and others bill be titled act to amend chapter 5 a title 34 the fiscal to Georgia annotated relating the sex discrimination in employment industry and labor House bill 1391 by reps and a gunner the 8th lever the 33rd perchedal the 176th myth of the 18th boatty the 62nd and others and bill be titled act to amend article 2 chapter 12 a title 17 the fiscal to Georgia annotated relating to public defenders judiciary non-civil House bill 1392 by reps and a gunner the 8th Smith of the 18th mom to handle the 17th plumbing the 121st Jones the 47th and others bill be titled act to amend article 1 of chapter 3 title 35 of the fiscal to Georgia annotated relating to general provisions regarding the Georgia Bureau of Investigation special committee on election integrity House bill 1393 by reps and a bonner the 72nd wasporn of the 144th followed the 32nd curl the 110th wheat hour the 119th bill be titled act to amend part 2 of article 3 chapter 3 title 38 the fiscal to Georgia annotated relating to judicial emergency judiciary House bill 1394 by reps and a bird the 20th Gilligan the 24th Carpenter the 4th gamble of 15 squadrons the 14th and others bill be titled act to amend chapter 12 of title 31 of the fiscal to Georgia annotated relating to control of hazardous conditions health and human services House bill 1395 by reps and McLaren of the 51st go the to the 19th mom to handle the 17th and gravely the 67th bill be titled act to amend code section 43 21 of the fiscal to Georgia annotated relating to application for first certificate title for motor vehicles House bill 1396 by reps and a year to the 150nd gull of the 19th gone through the 8th part of the 5th Collins the 68th and others bill be titled act to amend chapter 32 title 36 of the fiscal to Georgia annotated relating to municipal courts Judiciary House bill 1401 by reps and a bar of the 103rd gamble of 15 Smith to the 18th see file of 34th and waited the 9th and others bill be titled act to amend chapter 2 title 21 of the fiscal to Georgia annotated relating to primaries and elections generally special committee on election integrity House bill 1402 by reps and a bar of the 103rd on who the 30th math is the 144th Smith of the 18th way to the 9th and others bill be titled act to amend chapter 2 title 21 of the fiscal to Georgia annotated relating elections in primaries generally special committee on election integrity House bill 1403 by reps and a crowd of the 110th hatchet of the 150th newton of the 123rd ridley the 6th math is the 144th bill be titled act to amend code section 31 647 the fiscal to Georgia annotated relating to exemptions from certificate of need requirements special committee on access to quality health care House bill 1404 by reps and a crew of the 149th hatchet of the 150th coop of the 43rd lots of the 170th second jasperous to the 11th and others bill be titled act to amend article 7 chapter 4 title 49 in the fiscal to Georgia annotated relating medical assistance generally health and human services House bill 1405 by reps and a Roberts the 52nd washroom of the 141st crowd of the 110th dryer the 59th in Paris and the 42nd bill be titled act to amend title 36 to the fiscal to Georgia annotated relating to local governments governmental affairs House bill 1406 by reps and a martin of the 49th and Jones of the 47th bill be titled act to amend code section 36 66 4 of the fiscal to Georgia annotated relating hearings on proposed zoning decisions governmental affairs House resolution 818 by reps and a lumpston to the 12th empty the 13th part of the 5th tariff into the 2nd camera to the 1st a resolution honoring the life of memory Mr. Bobby Lee Cook and dedicating an intersection in his memory transportation House resolution 819 by reps and a pile of 30 second of resolution honoring the life of memory Mr. Fred Pullham in dedicating a bridge in his memory transportation Senate bill 331 by senator albert 56 molos to the 53rd duvon to the 30th krapatric of the 32nd Miller the 49th and others bill be titled act to amend chapter 4 title 34 the fiscal to Georgia annotated relating a minimum wage law industry and labor Senate bill 346 by senator molos to the 53rd hatchet of the 50th Anderson the 24th Hickman and the 4th Walker the 20th and others bill be titled act to amend part 1 of article 3 chapter 5 and title 50 the fiscal to Georgia annotated relating the general 30 duties and procedure the Department of Administrative Services governmental affairs Senate bill 360 by senator McNeil the 3rd Kennedy the 18th Beach of the 21st Miller the 49th Hickman and the 4th and others bill be titled act to amend code section 16 5 102 the fiscal to Georgia annotated relating exploitation and intimidation of disabled adults judiciary non-civil Senate bill 404 by senator albert the 56th Robertson to the 29th molos to the 53rd Guget to the 51st Beach to the 21st and others bill to be entitled to act to amend article 3 chapter 11 of title 31 of the fiscal to Georgia annotated relating the emergency medical services personnel public safety and homeland security that completes first readers second reading of bills and resolutions the clerk will read House bill 1371 by represent jaspers of the 11th pots of 170 second corporate of the 144th England of the 116th Campbell the 111st bill relating to general provisions regarding health 1372 by reps of Smith of the 133rd Parsons of the 44th Burns of the 159th phrase of the 126th the bill relating to protection fire protection and safety House bill 1373 by represent about the 62nd Carpenter of the 4th Douglas of the 78th a bill relating to general provisions applicable to counties municipal corporations other governmental entities House bill 1374 by reps of the Stevens of the 164th the belts provide for the creation of one or more community improvement districts in the city of Bloomingdale House bill 1397 by reps of Williams of the 168th Stevens of the 164th the bill to amend and act creating a board of education of liberty county House bill 1398 by reps of the 111st floor the 109th grove the 110th Henderson the 113th the bill to provide a homestead exemption from city of coming to an advalorem taxes House bill 1399 by reps of Hollian of the 111th night of the 130th the bill to provide a homestead exemption from city of locust grove advalorem taxes House bill 1400 by reps of pal 30 second Wilkinson of the 38th Jackson of the 128th Tarvan of the second Carpenter the 4th and others the bill relating to access to medical cannabis House resolution 798 by rep. the remainder of the 56th gravely of the 67th Powell 30th second limb of the 99th Jackson of the 128th resolution creating joint study committee where cannabis waste disposable and recycling Senate bill 374 by senator telly of the 19th House that learned the 52nd Burke of the 11th Kennedy of the 18th a bill relating to the Georgia data analytic center Senate bill 3 438 by senator Tipens of the 37th dogged of the 30th Miller the 49th Strickland of the 17th Hickman of the 4th and others a bill relating to retention of contextual payments and creation of escrow accounts Senate bill 445 by senator Burns of the 23rd pain of the 54th Hickman of the 4th Gute of the 51st Mallace of the 53rd and others a bill relating to civil and criminal penalty for violation of section 610 of the national manufactured housing construction safety standards active 1974 Senate bill 454 by senator Kennedy of the 18th a bill to amend an act establishing the board of public education for bib county senate bill 461 by senator jixon of the 45th Strickland of the 17th Kennedy of the 18th Dougan of the 30th Roberts of the 29th and others a bill relating to when offense is bailable procedures schedule bail and appeal bonds Senate bill 466 by senator Jones of the 10th a bill to amend an act establishing to cab county districts from which members of the de cab county board of education shall be elected Senate bill 503 by senator Kennedy of the 18th a bill to amend an act to provide for the restructuring of the city of makin the city of pain city and bib county through second readers report the standing committees the clerk will read the report to the committee and intercom of coignament coordination local submitted to following report Mr. Speaker committee on intercom of coordination local is that on consideration following bills of the house instruct a meter report to same back to the house and following recommendation house bill 1340 do pass house bill 1341 do pass house bill 1367 do pass house bill 1668 do pass house bill 1370 do pass respectfully submitted represent jane tankers to the 160th district chairman that completes the reading the report to standing committees\n\nyou you we're going on now to the local calendar going on to the local calendar third reading and passage of uncontested local bills if there is no objection we will vote in the local calendar as a whole with a recorded vote hearing none it is so ordered the clerk will read the local calendar House Bill 1340 by Representative Workhies in the 157th City Glenville House Bill 1341 by Representative Camp of the 131st Pike County House Bill 1367 by Representative Tarvon in the 2nd Walker County House Bill 1368 by Representative Duke of the 54th Miller County House Bill 1370 by Representative Williams the 168th Liberty County is there any objection to the previous question being ordered on the local calendar the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills the chair here's none the report of the committee is agreed to shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote aye those opposed will vote no and the clerk will unlock the machine you have all members voted have all members voted if so the clerk will lock the machines on the passage of the bills on the local calendar the eyes are 143 the nays are five these bills having received the requisite constitutional authority are therefore passed what purpose does chairman tanker slew rise I rise to make a motion Mr. Speaker state your motion I move that we immediately transmit the local calendar to the Senate chairman tanker slew is moved that the local bills on the local calendar which were just passed be immediately transmitted to the Senate is there objection is there objection chair here's none and it is so ordered we're now going on to morning orders morning orders members will please give attention to the members speaking in the well morning orders we're going to go for one minute each one minute chair recognizes representative Taylor chairman Taylor for a morning order thank you Mr. Speaker members of the house it is with a heavy heart that I shared that Thomasville and south Georgia lost a legend this weekend Lloyd Eckburn Lloyd began his Thomasville chamber of commerce career in 1963 and served for over 25 years he was a visionary community development under his leadership our chamber contributed immensely to the external ordinary growth and technology and industry in Thomas County we enjoyed unprecedented growth from his in the chamber strategy he started many new programs built an industrial park did our leadership programs wonderful wonderful visionary over the years he served on numerous boards both statewide and local and even in his retirement he continued to service a community news article writer and also on a weekly program he will be missed please join me in a moment of prayer thank you chair recognizes chairman Ron Stevens for a morning order thank you Mr. Speaker it is also with a heavy heart today that we mourn the loss of one of our great savanna people one of our great Georgians in Georgia and Joel Cash Williams Joel was born in December 19th and 1942 as a wee 14 pound baby boy in the family kitchen table and Dakota Georgia he was valedictorian of his class in 1950 in the club Dakota High School and he went on to graduate and magnum Laudie from shorter college bachelor of arts and history while at shorter he was the parliamentarian of course a saying course of course there in intended Walter F. George School of Law at Mercy University where he was the first undergraduate in 1967 Joel left Washington DC after he was serving under the attorney general first for the state of Georgia and then home for Richard B. Russell as chairman of the Appropriations Committee 74 to 85 he acted as a lobbyist for the federal legislative branches of government for the industry serving for the sugar industry and the treaties for all the countries there ladies and gentlemen do you take just a moment to of silence for as we remember Joel Cash Williams thank you chair recognizes representative Kelly thank you mr. Speaker yesterday the cedar town in Polk County community experience the loss of one of our greatest citizens with the passing of Dr. Mark Wall for over 35 years Dr. Wall provided compassionate care to the residents of the northwest Georgia community and will just have a great loss of him not being with us anymore I'll say personally I consider Dr. Wall a great friend I got to see as he mentored his grandson Caleb who he called his partner in crime and taught him the importance of being active in government while he served as our chairman of our Republican party for a number of years again we will all miss Dr. Wall and I'll ask for a moment of silence in his honor thank you mr. Speaker chair recognizes chairman Hogan representative deloche and representative sains for a morning order thank you mr. Speaker senator Sheila McNeill myself represented buddy deloche representative sains invite you to the depot tonight for a coastal Georgia while srimp in low country ball it starts at 530 to 630 cocktail hour 630 to 8 o'clock the dinner at the depot so you all of everybody is welcome to have some of Georgia while srimp in a low country ball so please come on down thank you chair recognizes chairman carpenter for a morning order thank you speaker just want to give everybody a heads up tomorrow is re Georgia restaurant day at the state capital so hopefully if you're around tomorrow night at 5 p.m. we're going to have the taste of Georgia which is probably one of the biggest events we have down here so if you're in town we'd love to have you there 5 p.m. at the freight depot and just keep your mind on your restaurant s guys labor shortages and supply shortages have been real rough in 2021 and 22 so be thinking about those guys and eat out as much as you can thank you speaker chair recognizes representative can trail for a morning order morning colleagues today is Tuesday 22 22 it was eight years ago to the day that i first was asked about running to represent house district 22 but 36 years ago to the day i made one of the best decisions of my life and that was to marry Jane can trail we've been married 36 years today and i was told by chairman Watson that i would earn a lot of brownie points by making this statement today so happy happy anniversary to my the love of my life Jane can trail please join with me in congratulating Jane for living with me for 36 years chair recognizes representative Carter for a morning order thank you speaker roston good morning colleagues for my moment in black history i want to share with you about mr. herity more and his wife heriot sims they married december 25 19 26 in florida heri was an educator his wife was a teacher he was promoted to a principal in a local tightens field school and she taught when he taught up until ninth grade and then the school was closed after six months due to some segregation issues but what i want to bring to your attention is his home was bombed christmas night and christmas was also their anniversary he died in hospital in nine days later his wife passed they are considered the first martyrs and the martin civil rights movement and the first of a couple to be assassinated for civil rights thank you from my moment in history i yield the well chair recognizes representative base more for a morning order good morning colleagues and thank you speaker roston and i rise for a moment of black history the creation of the powerful black community known as black wall street was intentional in 1906 old w girlie a wealthy african american from arcusoah moved to tolsa and purchased over 40 acres of land that he made sure was only sold to african americans this modern majestic sophisticated and unapologetic black community boasted of banks hotels cafes closures movie thirties and contemporary homes tosses rapid change and racial demographics made the city right for a riot motivated by black animosity against black economic progress whites of the era equated improvements and wages and working conditions as communist threats in essence whites were resentful that blacks no longer passively accepted second-class citizenship and their own homeland don't fret we will bill back better that completes morning orders we're now going on to the rules calendar we're going on to the rules calendar we have a rules calendar that was fixed by the rules committee last week and they have added two more measures this morning as a supplemental rules calendar for today clerk agreed to caption to house bill ten ninety two house bill ten ninety two by resident cooper the forty third to be entitled act to amend article two of chapter four title seventeen of the fiscal to Georgia and tether relating to a rest by law enforcement officers generally so to revise provisions relating to the arrests of pregnant women this bill i've referred to the committee on health and human services that committee recommends that this bill do pass chair recognizes chairman Cooper to present the bill thank you mr. speaker good morning till a's in gentlemen the house today i bring you house bill ten ninety two this bill is about pregnant women and the babies they carry and for the future citizens those babies are going to become but these are women and really strut in a really difficult situation the bill says that if a woman is fixing to be sentenced to a prison term and she is pregnant that the judge the judge has the discretion to pause her sin and sing not change it not make it smaller just pause when she has to go into the prison system just aren't serving her term it allows that the judge can say that the woman can stay out of prison until six weeks postpartum now this does not come without certain stipulations the woman has to check in with the court they have to get prenatal care there if they have a problem like with drugs the judge can put an ankle bracket uh... bracelet on them they actually have one now that somehow or other detects drug use if the woman violates any other stipulations by the judge they are immediately then to start their sentence this is not a get out of jail free card it takes no time off the sentence like accountability courts can and drug courts can they can actually earn some time off their sentence this is not the way this one works it just delays the time that the woman is going to have to be in our panel system and i will tell you now the despite how hard they're trying there are a panel system for pregnant women is below standard women do not see the physicians or care that they need they do not get the medications that they need and the vitamins and they are not given an adequate diet and we still have women that are being shackled when they are pregnant so this bill will also say the state money although that is not the purpose for it because we will not have all the extra cost of having these prison women in our prison system that's the bill and if there's any questions if there are no questions mr. speaker i'll yield well and ask for a favorable vote from the house members you have a couple of questions if you care to yield i'll take one or two mr. speaker do you deal for some questions yes sir yes sir chair recognizes chairman Lynn Smith to your right for a question thank you mr. speaker lady yield i will is it not true that you have brought us a very difficult situation to try and come to a fair decision it is true is it not true also that by doing so we are not taking also taking care of the mother of the child but the unborn child as well that's exactly right we are doing that and trying to give that unborn child the best start on life that we possibly can despite the situation that the mother has found herself in uh in our prison system there is a huge instance of fetal death and premature and infant deaths it is very high in our Georgia system so that's one of the things that this would hopefully would help correct that we would not have those deaths do you further yield one more mr. speaker uh chair recognizes representative mech Lauren to your right for a question thank you mr. speaker does the chair woman yield yes i do madam chair i really want to sincerely thank you for bringing this bill it's such an important measure and i also want to thank you so much uh for speaking the truth about what's happening in department of correction facilities for pregnant women unfortunately and for so many people i guess my question for you is you know since the design of this bill is sort of to grant a temporary reprieve from some of the conditions inside the department of corrections uh do you think it would be appropriate for this body to take up a sustained effort not just to address some of the conditions are talking about generally but also specifically with regard to pregnant women the impunity with which some officers have refused to comply with this body's shackling legislation madam chair in my years in the legislature i have found that it's probably always healthy to look at our institutions and the bureaucracy that we find all across state government we appreciate it thank you madam chair thank you mr. speaker and to the members i hope i ask for your favorable vote and mr. speaker i yield the well lady yields the well we have another member that wishes to be heard on the bill chair recognizes representative scothield to speak to the bill thank you mr. speaker and good evening colleagues i rise in support of hb ten ninety this bill and i'm you heard a number of great things or things that it does but this bill is an avenue for pregnant women to receive the prenatal care throughout their pregnancy and for that i'm because for over three years i've worked with pamela win the founder of restore her hearing testimonies and diverse experiences of incarcerated women current and post incarceration i'm happy that this bill is before the body i proudly and publicly acknowledge the countless hours of work that pamela win of restore her and contributions made by my colleagues representative park canon and representative david drier in addressing important issues such as the anti shackling incarcerated women and today's piece of legislation for pregnant incarcerated women surely teamwork speaks volumes and finally to chairman kupert for i acknowledge her addressing this issue of incarcerated women and being a leader taking the lead and honoring her commitment to pam and taking i mean bringing the good bill to the house floor so i ask you to support this great work by voting by the work of many for voting on this voting yes on this bill mr. speak our year the well lady is yielded the well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no in the clerk will unlock the machines what purpose is representative kenner dris mr. speakers at night a parliamentary inquiry state your inquiry mr. speakers at not true that it is against the law in george at the shackle of pregnant woman in our correctional facility and therefore the department of corrections is out of compliance with our law i think the gentleman is correct have all members voted have all members voted if so the clerk will lock the machines on the passage of house bill 1092 the eyes are 161 the nasors zero this bill having received the requisite constitutional majority is therefore passed the clerk agreed the caption to house bill 1195 house bill 1195 are represented in lunch in the 12th and others to be entitled to an act to amend chapter 85 and title 36 if it should go to george anted overlay to interlock interlocal risk management agencies in local government let's bill i've referred to the committee on insurance i committee recommends that this bill do pass chair recognizes representative lumston to present the bill madam speaker members of the house i bring to you house bill 1195 this is a bill that comes as a request from accg and gma by definition they are the only two interlocal agencies in state government all insurance carriers by code are required to file an annual audit using generally accepted accounting principles with the insurance commissioner's office accg and gma are not insurance carriers but they do manage some insurance programs for their members and because of that they're required to file annual audits with the insurance commissioner's office as well accg uses and has used statutory accounting for decades it's very similar to the generally accepted accounting but is slightly more conservative approach than the generally accepted accounting is house bill 1195 adds statutory accounting as an acceptable form of reporting for accg and gma the insurance commissioner's office fully supports this change that is the bill madam speaker i would greatly appreciate your favorable consideration you have a question do you yield yes the chair recognizes representative Carter in the gallery for a question good morning this is gentleman yield i do my question refers to the statutory principles in which you've added in this piece of legislation with this only be for the audits as it relates to the insurances of what this be for audits for the entire organization and does it trickle down to the municipalities it's my understanding that this only applies if you look at the language of the bill it only applies to interlocal government agencies and the only two defined in law as interlocal government agencies are accg and gma this does not have a triple down effect to anyone it only applies to those two entities and it simply provides them with the ability to continue doing what they've been doing for decades there's a little section in the law that requires generally accepted accounting principles statutory is very similar to generally accepted accounting just slightly more conservative this just provides them with the opportunity to continue to file based on how they are currently filing and it has the full support of the insurance commissioner's office whom they have to file reports with okay do you further you for a friendly question yes i just want to be really really clear because the addition that you're adding to the bill stipulates it is for insurance agency insurance type companies only and i just want to be clear that as we're voting that we're only get we're only adding that and not removing no gap no we're not we're not removing gap it simply adds that caveat only for accg and gma which in this particular section that we're dealing with in the law only applies to interlocal government agencies and acc and gma are the only two interlocal government agencies defined in law thank you the chair how you'll the well johnman is yielded the well for what purpose gentleman's way is there an objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill chair here's none the report of the committee has agreed to show this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no in the clerk will unlock the machine have all members voted have all members voted if so the clerk will lock the machine on the passage of the bill the a's were 157 the nays were zero the bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 1148 chair recognizes representative roads to present the bill thank you madam speaker ladies and gentlemen house bill 1148 cwd also known as chronic wasting diseases a major problem amongst our deer herd in certain portions of the united states there have been some detected in in the corner north-west corner of alabama up around\n\nCIPI and Tennessee. All this is, this is a measure by our department to take proactive steps. Alabama, Florida, North Carolina, and Tennessee have done the same thing. These steps just will not allow dear carxes to be brought in to Georgia from other states. If they are, the meat just has to be deboned. And that's all this legislation does. It's a proactive measure to try to protect our dear herd here in Georgia. I'll be glad to answer any questions, Madam Speaker. There are no questions. Thank you. I ask for your favorable vote. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the Board of Committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Will this bill now pass? All in favor, the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yes were 156. The yes were 0. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1086. House Bill 1086. House Bill 1086 by Representative Dempsey, the 13th and others will be in the title of an act to amend Code Section 317-18. Is the bill fiscal to Georgia and Tederley in the influence of vaccinations for discharge patients, a 65 and a 60-year-old. This bill I refer to the committee on Health and Human Services. Secondary recommends that this bill do pass. Chair recognizes Representative Dempsey to present the bill. Thank you, Madam Speaker. HB 1096 is a very friendly measure. Not everyone in the room here is 50 years old. But if you're not, you probably have a loved one or a family member who is. That's what this is focused on. Currently state law requires hospitals to offer influenza vaccine during influenza season to patients age 65 and older prior to their discharge. The word is offer. Not to mandate. Not to tell them they must do it. But to offer it. Today individuals that are age 50 and older have been found to be an increased risk for severe illness and more than 50% of the population has been vaccinated and they are currently being taken away from the patients from the flu. As we age our immune system is weakened and we are more likely to have underlying conditions such as diabetes, asthma, or cardiovascular disease. Without in mind this legislation simply lowers the existing age from 65 to 50. That inpatient may still accept or decline the vaccine. mandates that commercial payers must cover the full cost of vaccine having a recommendation from the CDC. The Department of Public Health has a vaccine assistance program. It is covered through a CDC grant for those who are uninsured or underinsured and all health departments have access to these vaccines but this is the time when you're in the hospital possibly in a weakened condition during the flu season to say if you would like to have it while you're here we can help you do that. If there are any questions I'll be able to take them if not I will ask for your favorable consideration. The lady has a question the chair recognizes representative Clark for a question. Thank you Madam Speaker does it General Lady yield? I do. So I love this legislation thank you so much for bringing it. I'm just curious why stop at age 50 when we also know that children especially children under the age of five are also at really high risk for complications due to flu. Yeah I also agree with you but this is targeted and focused for that capture while in the hospital particularly of our aging population and I had to say that 50 is aging because it's not really you know we've forgotten a little bit too how perilous the flu can be for some people in recent years the numbers have trended down but they're starting to take back up again right now and over the last five years the lowest number of those hospitalized were 1500 but it did go up to about 3100 and deaths were 151 at one point so it's something we need to pay attention to. Thank you thank you. There are no more questions. Thank you I yield the well and ask for your favorable support. The lady is yielded the well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage to the bill the chair here is none the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so the clerk will lock the machine on the passage of the bill the a's were 153 the a's were 3 the bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House bill 1192 House bill 1192 House bill 1192 members of Cooper the 43rd and others to be entitled an act to amend Article 7 chapter 4 Title 49 in the fiscal to Georgia and to relay new medical assistance generally so as to require the Department of Community Health to submit a section 1115 waiver requests the federal centers for Medicare and Medicaid services this bill I'm referring to the committee on Health and Human Services a committee recommends that this bill do pass by committee substitute chair recognizes representative Cooper to present the bill. Thank you Madame Speaker to my house colleagues thank you very much for the last vote on 1092 and somehow or other I got another bill at 1192 so they are different so I bring you House bill 1192 and it is a direction to the public health and our department to ask Medicare and Medicaid the Department of Medicaid and Medicare for a waiver so that we can move Georgia citizens that are HIV positive and 138 percent below the poverty level on to our Medicaid program now let me explain this to you this is not about gay people it's not about white people or African-American people or pink or purple HIV and AIDS affects everyone it doesn't not it does not respect anybody as far as being a possible carrier and since representing the Cantrails not coming back anymore I'm gonna give him a little present I hope he's here but mother group that it affects are our elderly and assisted living who still like to get a little whoopie is he here so and they're not they don't discriminate sometimes where they get that little bit of whoopie and so we have actually had runs of HIV positive people showing up in our assisted living facilities and nursing homes here's how HIV works and this is a Department of Public Health bill if a person is HIV positive there's sort of two stages their HIV positive and then they move on into full blown AIDS if they are not treated when a person is in full blown AIDS it costs the state three times what it will cost to have an HIV person treated three times and when a person is in full blown AIDS we are required by law to put them on our Medicaid program because they become classified as disabled so what this will do when people are treated when they are HIV positive that will keep their viral load that load down and to get it to zero if a person with HIV has a zero viral load which occurs all the time when they are on their medicine then they cannot in fact another person with AIDS and we begin the process of eradication of this illness so what this would allow us to do is put about 7,500 people that are infected with HIV onto our Medicaid roles so that they get the treatment they need to keep their viral load down to zero so they cannot affect other people and to keep them from moving into the AIDS category where it will cost the state three times the amount that to treat them then it did when they were HIV positive that is how this works public health asked for it right now we cover people that are 138 percent of the poverty level that have no insurance or any other means to pay for their treatment by the Ryan White Act but there is a limit to that money and continually public health is having to come and ask us to put more money into the budget to cover the people who are at that poverty level and not covered by Ryan White this year I think there's about ten million dollars in the post supplemental budget and I think another ten million are going to be asked because there's not enough money in the Ryan White in the long run public health thinks that this will save them about fifty eight million dollars in cost while it only cost about 18 million to cover the people that is how the bill works and I would ask for your favorable vote and madam speaker if there are no questions I'll yield well there are thankfully no questions and the lady has yielded well is there any objection to the previous question being ordered the chair here's none of the previous questions ordered is there any objection to adopting the Committee formulates temperature is none the Committee substitute is adopted the bill is there an objection to green to the report to the committee what was favorable to the passage of the bill the chair here is none the report of the committee is agreed to is how this bill now pass all in favor of the the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yays were 136. The nays were 14. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House bill 1146. 1146. House bill 1146 by Representative a lot of 120 second to know the bill is to be titled back to amend Title 40 of the Fishboot of Georgia. An updated related motor vehicles and traffic. So it's to provide for vehicles operated by certain law enforcement to be equipped with flashing or revolving lights, which are primarily blue in color. This bill have referred to the Committee on Public Safety and Homeland Security. That committee recommends that this bill do pass. Chair recognizes Representative Lot to present the bill. Thank you, Madam Speaker. Colleagues, I am presenting HB 1146, which is an agency initiative for the Department of Public Safety. This bill allows for Georgia State Patrol vehicles assigned to traffic law enforcement to no long time. For uniformity purposes and with the newer lighting technology available within the vehicle itself, Front, Rear and Side blue lights, including word identifier bars that read state patrol. HB 1146 deletes the outdated language on lines 27 to 29 in the bill. The bill was unanimous out of the public safety committee with no person speaking in opposition. There has been one significant question worth addressing concerning safety. Some in Georgia have used the bar light on the roof of the vehicle as their confirmation that the vehicle attempting to stop them is for certain. But with the newer technology, Georgia State Patrol vehicles are equipped with a messaging bar that reads state patrol. This is significant and definitive label for improved safety. All other marking requirements on the traffic enforcement vehicles are available in the vehicle. The vehicle is available in the vehicle. The vehicle is available in the vehicle. This is significant and definitive label for improved safety. All other marking requirements on the traffic enforcement vehicles remain the same. That is the bill and I will answer any questions if there are any. You have a couple questions. The chair recognizes representative Clark of the 108th district for a question. You mentioned the striking out of line 28 and 29. Does this by removing those lines, does this now allow the Georgia State Patrol to basically have speed traps where none of the cars have the blue light bars so that vehicles know that they are approaching police officers? Your question is regarding speed traps. This legislation has nothing to do with that. All that this line removes is prior to this legislation or with this, prior to this legislation, they were required to have a blue bar on top. They were given the opportunity to have two vehicles that were slick tops. Not because of the increased technology, because of the bar light that is within the vehicle that reads state patrol, they are now able to just use the blue lighting system that they have within the grills, the sides of the vehicles, the rear of the vehicles and the bar lighting. That is within the vehicle, not on the rooftop. That's a general lady for the yield. I would think we can all agree that most people when they think they see law enforcement, they are usually using that light bar at the top to know that they are approaching a law enforcement vehicle. So this would allow for them to not have that so that vehicles would not know necessarily until they get right up on it or once it is behind them flashing their indoor lights. That car is actually a police car. Is that correct? That's correct. If what the person is using is the bar and that is somehow a judgment of what they are coming up on, then there would be no bar so you are accurate in that. Thank you. Chair Rick. Yes ma'am. Everyone has waved. There are no more questions. Thank you. I ask for your favourable consideration of this bill. The lady is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all in favour of the passage of the bill will vote yes? All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The a's were 105. The a's were 55. The bill having received the requisite constitutional majority is therefore. The clerk will read the caption to House Bill 1361. House Bill 1361. I would like to have the letter to the 33rd to be entitled an act to amend the act of amend of the fiscal day of Georgia and it will be related to civil practice. So it is a clarify that the attorney general is to be served and heard and all the defense of all acts of the general assembly when challenged in any court action. The bill had referred to the committee on judiciary. That committee recommends that this bill do pass. Chair recognizes the chief deputy whip of the majority caucus representative lever it to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House. I'm presenting you today House Bill 1361 which is you know has sort of become my passion to take on and revise little known non-descript sections of the Georgia code. This is part of that campaign. But unlike others this actually has a little personal story for me. My father told me of when this statute was actually adopted when he was at the attorney general's office. Alfred Evans who was with the attorney general's office for many many years would get just custom mad whenever they would get notice of a lawsuit that had been filed some time ago and properly served on an agency or department but hadn't made its way through the system to the attorney general's office until long after the answer was due. So this this statute currently just requires that the attorney general be notified these amendments simply clarify that the attorney general has the right to be heard and defense of the statute but it is not mandated the language at the very end which says as a party has right appearing as a party of right as he or she determines is appropriate. So this simply claims up the statute a little bit it makes it clear that the attorney general he or she has discretion as their resources allow and they deemed as appropriate to be heard and appear in the case. So I would ask your favorable consideration of the bill Mr. Speaker Speaker I will yield for questions. You did not have any questions. Thank you. I'll yield the well Mr. Speaker and ask your favorable consideration of the bill. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. Chair here's none the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines. The members voted. Have all members voted. If so the clerk will lock the machine on the passage of House Bill 1361 the eyes are 163 the nasors zero this bill having received the requisite constitutional majority is therefore passed. Opposed as representative leverage rise make a motion state your motion. Ms. Speaker I would move immediate transmittal House Bill 1361 to the senate representative leverage has moved for immediate transmittal of House Bill 1361 to the other chamber is the objection is the objection. Here here's none and it's on its way over there. Clerk will read the caption to House Bill 500. House Bill 500 by Representative Perchette of the 176th to be titled an act to amend Code Section 33-1, 25 of the fiscal to Georgia, and attended really in the Georgia agribusiness and rural's job act. So it's a divide for a second round of funding and period for applications. This bill ever referred to the committee on ways and means that committee recommends this bill do pass by committee substitute. Chair recognizes Chairman Perchette to present House Bill 500. Thank you, Mr. Speaker. Good afternoon, colleagues. I've got a bill here. It's a very simple bill. This is the Gargent Bill. We passed this bill out in 2017 and also last session. What this bill does is it gives rural agricultural businesses the opportunity to have another avenue to borrow money. What happens, I'll give you just a for example, I have a small business in my district that was a beneficiary of this program. The program says that you must be turned down by a traditional lender first before you can take advantage of this type of lending. And in my case and in my district, Katie Bag is a longstanding family business that the proprietors were aging out and they had no succession plan. And like many businesses, they had borrowed money and were turned down by a traditional lender. And without this program, this Gargent Bill program, Katie Bag would have ceased to exist. But because of this program, they were able to borrow money and continue the business along with capital investors. This is a very simple bill. It's a program that has worked very well for rural Georgia. And I'm asking that you once again go with me and send it over to the Senate and hopefully the Senate puts it out instead of holding us up. So with that, I'll yield for questions, Mr. Speaker. You have a couple of questions if you care to yield. Yes, sir, I'll yield. Chair recognizes representative Meeks, do you write for a question? Thank you, Mr. Speaker, does it on the yield? Yes, thank you. Why are we going from my $5,000 to a $25,000 application fee? We're increasing the fee for these lenders so that they have to pay more into the program. All that money comes back to the state. The money that they're investing and getting a return on, we're asking they pay us that money back. So it's more beneficial for the state. Mr. Chairman, for the yield? Sure, yes, sir. Just to make sure I'm clear, so that $25,000 is paid by the lender, not by the applicant. That's correct. Thank you. Chair, you yield for another question. How are you? Chair recognizes representative Bennett to your left for a question. Thank you, Mr. Speaker, with the gentleman yield. Yes, ma'am. Can you tell me how this bill will encourage food inequities, being eliminated in our rural area in Georgia? How will this bill incentivize the receivers of this money to provide increased food opportunity of fresh fruits and vegetables to people in rural counties who now currently live in food deserts? Well, I don't know that I can speak exactly to that point, but I can say this. This lending provision only goes to Georgia businesses and their mom and pop businesses. So a business such as a farm would qualify for the Georgia program, so you could lend, they could borrow money from this program to continue their operations of if they're a fruit and vegetable grower, then they can continue to do that or for their packer of those vegetables that can also continue to do that. So they would be able to take advantage of this lending program. Do you, brother yield or not? How many likes you got? Mr. Speaker, I'm going to, this is a bill that we've had many times. And if you have any other questions offline, please come to me, but I'm going to yield the well if you don't mind. Gentlemen, is yielded the well? Thank you. We have another speaker that was to be heard. Chair recognizes representative Dukes to speak to the bill. Thank you, Mr. Speaker. Thank you, Mr. Speaker. To the members of this August body, I rise in full support of this legislation. It provides people in rural Georgia, particular those that are engaged in the agricultural industry, another opportunity to obtain financing such that they can be sustainable. As you know, in this state, small and mid-sized family farmers, and people that are engaged in this industry throughout rural Georgia are having to overcome obstacles that are vastly different from those that we grew up with. This bill, this legislation, becomes another tool in the toolkit, the toolbox that will help us to be able to sustain businesses and business opportunities from the part of the state that I represent. As a result, I come here in full support of this legislation. Thank you, Mr. Speaker. And the gentleman from Darty yields the well. Gentlemen, he yields the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection?\n\nThe objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representatives of Wade rise pursuant to rule 133, may I be excused from this vote? Gentlemen, has that right? Journal will so reflect what purpose does representatives of Wilson rise? Parliamentary inquiry. Mr. Speaker, is it not true that there is no provision in this bill to even evaluate the effectiveness of this tax credit? I think you should have taken that up with the author of the bill prior to him getting in the will. Have all members voted? Have all members voted? So the clerk will unlock the machines. On the passage of House Bill 500, the eyes are 153. The nays are 11. This bill having received the requisite constitutional majority is therefore passed. House Bill 961 will be postponed until the next legislative day. What purpose does Chairman Collins rise to make a motion? State your motion. I'd like to ask that House Bill or Senate Bill 84 be moved from the Public Safety Homeland Security Committee to the Retirement Committee. Both Chairman agree. Clerk will read the caption. The bill 84 by Senator Albert is the 56th Harper of the 7th. The Robertson of the 29th will be entitled to amend chapter 17. The title 47 of the fiscal to Georgia is annotated relating the peace authors annuity and benefit fund. On the motion of Chairman Collins, Senate Bill 84 be recommitted from the Public Safety and Homeland Security Committee to the Retirement Committee. Is there objection? Is there objection? The chair hears none and it is so ordered. The chair recognizes representative Earhart for a motion. Thank you, Mr. Speaker. I move to agree to the Senate substitute to HB 826. Representative Earhart moves that the House agree to the Senate substitute to House Bill 826, the clerk will read the caption. House Bill 826 to be entitled to amend to incorporate the City of Lost Mountain. Chair recognizes representative Earhart to explain the Senate substitute. Thank you, folks. You recall we passed HB 826 out of the spot last week. Small change was made in the Senate. Essentially what it does is it takes the mayor from being one of a six member city council and creates that position separately so that we now have a six member city council structure. With a separate mayor who shall be elected by all the eligible voters of the city. I ask for your favorable consideration and Mr. Speaker, I yield the well. The lady is yielded the well. On the lady's motion that the House agree to the Senate substitute to House Bill 826, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Anola would rise? Parliamentary inquiry. Statue inquiry. Yes, Mr. Speaker. Thank you. Is it not true that one of the other changes addressed by the Senate, and actually I would say perhaps tweaked by the Senate, addresses the issue that myself and many of my colleagues tried to point out when this bill was in the House that the current version of the bill now does require clearly that all members must live within their city council districts. If the lady so states what purpose does chairman Sence will arise? Parliamentary inquiry. Mr. Speaker. Statue inquiry. I was going to state with the lady so articulately said that many of the questions raised here earlier have been addressed by the Senate and I would ask for overwhelming bipartisan support of this bill. If all members voted, if so, the clerk will unlock the machines on the passage of House Bill 826 or on the lady's motion that the House agreed to the Senate substitute House Bill 826. The eyes are 98. The nasor 64 in this House has agreed to the Senate substitute. What purpose does Representative Earhart rise? To me. I waive. Chew waves. Clerk will read the caption to a group of privileged resolutions. Honoring the life of memory. Lieutenant Commander David Calvin built in senior United States Navy. Honoring the life of memory of Dr. Tandy Walter Treadwell Jr. Honoring the life of memory of Mary Alice Day. Honoring the life of memory of Manning Thomas Tom Geter. Honoring the punchline comedy club on its 40th anniversary. Recognizing Commending Tom and Risco. Commending and congratulating Newdale Williams. Recognizing Commending Reverend Dr. Clyde Hill. Recognizing Commending Sheree Hopson Matthews on our outstanding public service. As Henry County's County manager. Commending Reverend Eric George Vickers senior. Recognizing Commending the Georgia State University Panther Band. Recognizing Commending Thomas Harrison. Congratulating Commending Jerry Conter. Congratulating Commending Carolyn Helene Cook for receiving the 2022 Yellow Rose Niki T Randall Service Leader Award. Recognizing Commending Coach Ray Land. And for other purposes that completes the reading of privileged resolutions. Is there any objection to adopting the privileged resolutions? The chair here's none in the resolutions are adopted. Okay, we're going on now to announcements. If you have signed up for an announcement, make your way to the front of the chamber. Chair recognizes Chairman Dickie for an announcement. Commissioner Speaker members, we have our culture and the similar affairs committee meeting in the morning at 8 o'clock, 4 o'clock, 6 o'clock, CLOB. We have several bills. Thank you. Chair recognizes Chairman Matthews for an announcement. Thank you, Mr. Speaker. Tomorrow's state planning and community affairs is canceled. We will postpone. Thank you. Chair recognizes representative Becky Evans for an announcement. I'm sure it's appropriate. Thank you, Mr. Speaker. The women's legislative caucus will meet on upon an adjournment. You can pick up your lunch in room 216 cap and then we'll meet virtually. Thank you. Chair recognizes Chairman Watson for an announcement. Thank you, Mr. Speaker. Preparations subcommittee of general government will meet at 9 tomorrow morning and room 415, CLOB. And also we've got rule caucus tomorrow at 12 o'clock. Department of Ag, look forward to seeing everybody there. Thank you. Chair recognizes representative Gullet for an announcement. Thank you, Mr. Speaker. Three quick announcements. One is for Governor LaFaire's today at 1 o'clock. It's the redistricting elections special subcommittee 341 capital. Governor LaFaire's state and local government subcommittee 133, 41 capital and the EV charging subcommittee of EUT is 4.3 today at 3 o'clock. Thank you so much. Chair recognizes Chairman Carpenter for an announcement. We've arts and entertainment will be meeting in 406 at 1 o'clock today, 406 at 1 o'clock. We have some local bills that the chair proposes to handle as the others we've been handling. I would ask unanimous consent that the rules of the House be temporarily suspended to allow these bills to be read for the first time and assigned a committee. They will all be assigned to intergovernmental coordination. Is there any objection? Is there any objection? The chair here is none. And they will all be assigned to intergovernmental coordination. We have one more announcement that the chair recognizes Chairman Rich for an announcement. The majority caucus will be meeting in room 403 upon adjournment and lunch will be served. That completes our announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. I move that this House adjourn until 10 a.m. Thursday, February the 24th, 2022. The majority leader has moved that this House stand adjourned until Thursday, February 24th at 10 a.m. all those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be adjourned until Thursday at 10 a.m.",
  "updated_at": "2026-02-13T08:26:50.788028+00:00"
}