{
  "video_id": "Xt7ptRjZFj4",
  "url": "https://www.youtube.com/watch?v=Xt7ptRjZFj4",
  "title": "3/14/2024 Press Conference | Sen. Gloria Butler | Senate Dems on Medicaid Expansion and CON Reform",
  "chamber": "senate",
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "Overview: This press conference features Georgia Senate Democrats, led by Senator Gloria Butler, discussing their stance on Medicaid expansion and Certificate of Need (CON) reform legislation. They emphasize the need to pass both measures together as a package deal.\n\nKey Actions: \n**None detected**\n\nBills Introduced (First Reading):\n**None detected**\n\nNotable Moments:\n- Senator Butler states that Democrats will only support CON reform if it is paired with Medicaid expansion, similar to the approach taken in North Carolina.\n- She argues that CON reform alone is not enough to solve Georgia's healthcare access problems and that Medicaid expansion is a necessary component.\n- The Democrats express support for a new teaching hospital in South Fulton County, to be run by Morehouse School of Medicine, as a way to improve healthcare access in underserved areas.\n\nVotes:\n**None detected**\n\nAttendance:\n**Not specified**\n\nAdjournment:\n**Not specified**",
  "transcript": "Oh, so happy to meet you. Good afternoon, everyone.\nNow, thank you for joining us this afternoon.\nWe are here to discuss one thing.\nOne thing only this afternoon.\nToday's vote on the certificate of need reform legislation.\nProud to voting yes on the legislation this afternoon.\nI'll discuss my reasons for supporting this field.\nI want to clarify our exact position.\nNo one on this stage behind me disagrees that a new\nmore-house teaching hospital would be a great thing.\nNo one disagrees that we need more rural hospitals and no one disagrees that we need the\nof all the measures in this field to help combat our maternal mortality rates.\nWe all agree that these are worthwhile priorities, but we disagree that these measures along\nthe same Georgia health care access problems.\nexpansion is the only answer to that problem. My vote today was to show my\ncommitment to the area offered months ago. If we pass Medicaid expansion,\nDemocrats will support the certificate of need reform. Just like we saw last\nyear in North Carolina. Let me be clear. COA and Medicaid expansion must be done\ntogether. If we choose another path or continue pursuing on a certificate of\nneed reform, I will not support these efforts. We must pass both. Period. That's our\noffer. Certificate of need reform is a where they go, but certificate of need\nreform alone will not save our rural hospice. It will not improve Georgia's\naccess to health care. We must have Medicaid expansion and certificate of\nneed reform together in order to solve these problems. Thank you all for\nthis thing to us. And if you have questions, any one of us can answer those questions\nbecause we are on this state together. We are in this fight together.\nDo you see the proposed commission as a real path towards potential metically\nexpansion? Or do you think that this is really, this year is really the only real\ntrial and expansion because you had the, the certificate of deep leverage, so does me.\nWell, the commission itself would have moved along without us. It was the amendment that\nI offered that made it more inclusive. Not to talk about some people, but all people\nthat need Medicaid scratch.\nWhat is the status of the conversations with more house about taking over at the end of\nthe center?\nAny computer call?\nWhat is the status of conversations of more house taking over at the end of the medical\ncenter?\nThank you very much for a big year and thank you for the question.\nYou've made a great leap there and stated something as fact that is not fact.\nWe'll start leaving Atlanta because we have two hospitals here left the health care\nthe desert in the southern third of Fulton County so it's not about a site of the hospital\nabandoned in Atlanta. It's about providing access to health care to one-third of our county\nthat was left behind when the well-star made its move. And so a hospital in South Fulton County\nwould be run by a hospital corporation.\nMore house school of medicine would be able to train doctors there,\ntrain health providers there, and have it as a hospital where\nas a teaching hospital where doctors come and get trained and have\npresidency and provide services.\nSo that is the vision that we need to see fulfilled for all those people in South\nFulton that right now don't even have an emergency room to go to.\nSo it's easy to confuse that with the Boulevard location that was posed down, but it's\na different part of the county.\nThat answers your question.\nYeah.\nThank you so much for being here.\n",
  "updated_at": "2026-02-12T19:16:17.491417+00:00"
}