{
  "video_id": "y6Ut8sb7H2c",
  "url": "https://www.youtube.com/watch?v=y6Ut8sb7H2c",
  "title": "Opening Day at the Capitol | Georgia Senate 2026 - Day 1 AM Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": null,
  "duration_minutes": 100,
  "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 1 AM Session:\n\n**Overview**\nThe opening day of the 2026 Georgia legislative session featured a stirring invocational speech by Senator Benny Hinn, emphasizing the importance of encouragement and praising the legislators for their service to the state.\n\n**Key Actions**\n- **HR 998**: Resolution\n- **SB 204**: Bill\n- **SR 557**: Resolution\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Senator Benny Hinn delivered a heartfelt speech on the importance of encouragement, drawing from biblical passages and personal anecdotes.\n- Senator Hinn recognized the sacrifices made by the legislators' families in serving the state.\n- The session included a recognition of a distinguished physician in attendance.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present.\n\n**Adjournment**\nThe session adjourned. The next session date was not specified.",
  "transcript": "for it. And then I said, God, forgive brother Bert for over praising me. And then I prayed\nfor myself. And I said, and God, forgive me for enjoying it so much. Amen. No, I do, I\ndo greatly appreciate, I do appreciate our lieutenant governor and Miss Jan and their\nfamily, their family means much to me and I've been coming here, I've been coming here\nfor over three decades and it's a wonderful privilege to be able to share with you men\nand women today. I want to take just a few moments. Is there anybody in the group that would\nsay, Brother Benny, I've not heard you speak. I've not heard you speak. Every person has\nHe's heard me speak this one right here.\nWell, this one right here.\nWell, I say to you two men,\nwhat Elizabeth Taylor said to her eighth husband,\nI'm not gonna keep you long, man, man.\nAll right, I'm gonna keep you long.\nI wanna talk to you from 2 Timothy, chapter 1, verse 16.\nThis is what the Bible says.\nIt says, the Lord give mercy\nunto the house of Onesiferus.\nfor he often refresh me and was not ashamed of my chains.\nThe Lord give mercy unto the house of my own Cyprus,\nfor he often refresh me and was not ashamed of my chains.\nI wanna talk to you this morning on the first day of session\nabout what every person needs.\nI'm not an anthropologist,\nwhat I do know what every person needs.\nI remember on one occasion, I was with Mr. Truitt Cathy.\nAnd Mr. Truitt Cathy said to me, he said,\npreacher Benny, do you know how you determine\nwhether or not a person needs encouragement?\nI said, no, Mr. Truitt, how do you know?\nHe said, if they're breathing, he said,\nif they're breathing, they need encouragement.\nIn serving in the Georgia Senate, I would assume you need encouragement.\nI heard about a man that was running for office and he was speaking.\nAnd while he was speaking, a heckler stood up and said, I wouldn't vote for you if you\nwas St. Peter.\nAnd the politician said, if I was St. Peter, you wouldn't be in my district, amen?\nWe all need encouragement.\nA teacher was teaching a little boy about encouragement.\nThis little boy was in school\nand he was making these ugly faces.\nAnd Mrs. Johnson said to him, she said,\nJohnny, when I was a little girl,\nI was taught that if you make ugly faces,\nyour face will, your face will literally freeze that way.\nHe said, well, Mrs. Johnson,\nyou can't say he wasn't warned, amen?\nOkay. How can we encourage other people? Four quick points. How can we encourage other\npeople? First of all, we can encourage other people with praise. We can encourage other\npeople with praise. The Bible says in Proverbs 18 and 21, Death and Lives in the Power of\ntone. How was this world created? We believe that God spoke this world into existence. We don't\nbelieve that once it was a tadpole beginning to begin and then it was a frog with my tail\ntucked in and then it was a monkey in a banana tree and now I'm a professor with a PhD. We don't\nbelieve that. We believe that God spoke this world into existence and folks if words spoke this\nworld into existence. Your words make a difference in somebody else's world. Your words make a\ndifference in somebody else's life. I learned this very young. I participated in sports.\nI love sports. I played baseball, played basketball, played even football. I played tailback. Every\ntime I ran on the field, the coach said you get your tail back here. But I remember playing baseball\nAnd a baseball coach saying to me, good play, little man, good play, little man, and it\nmade an impact on me.\nYou want to encourage people?\nYou encourage them with your words, a book that I wrote.\nIt's entitled, yes, she can, yes, she can.\nBecause I believe people need to hear, yes, she can.\nBecause people need to be encouraged, and we encourage people with our praise.\nLet me tell you a second way we encourage people.\nWe encourage people with our presence.\nWe encourage people simply being there for them.\nSomebody said a free and walks in when everybody walks out.\nI said, no, no, a free and never leaves.\nA friend stays with you.\nYou won't encourage somebody today.\nYou encourage them with your praise.\nBut you encourage them with your presence\nbecause the Bible says a friend love it at all times\nand a brother is born for adversity.\nAnd most of us don't have near as many friends\nas we think we have.\nSo we encourage people with our praise.\nWe encourage people with our presence.\nSome of you've got the third point in your hand right now.\nYou encourage people with your pen.\nI know we're in the day of instant communication.\nWe can text, we can tweet.\nBut I still believe there's power in a handwritten note.\nI still believe Martin Luther said, if you want to change the world, pick up your pen.\nToday you want to encourage somebody.\nYou do it with your praise.\nToday you want to encourage somebody.\nYou do it with your presence.\nYou just be there for them in the low times, in the good times.\nYou want to encourage somebody you do it with your pen.\nThen there's the last way.\nYou knew you would get this one. I'm a preacher. You encourage people where you're prayers.\nYou say I'm praying for people. We'll let them know you're praying for them.\nYou know what I've learned, folks?\nTrue and Kathy was correct.\nWe all need encouragement.\nWe all need encouragement.\nAnd if you don't need it now,\nby the end of 40 days you will.\nSo I just came today to say, I appreciate you, I just came today to say thank you for\nwhat you do.\nI wish I could speak to your mates, I really wish I could speak to your mates, I wish\nI could speak to your children because I'd like to say to your mates and children, thank\nyou for the sacrifice, thank you for sacrificing your daddy, thank you for sacrificing\nyour husband. Thank you for sacrificing your wife, for the people of Georgia, people just\nlike me, so I just came today to say thank you. When Abraham Lincoln was killed, they started\nlooking through his, what was on him when he was killed. And they looked when he was\nwas killed, much like me, had a pair of glasses on him. When he was killed, they noticed\nin his pocket, he had a pocket knife. They noticed that he had a handkerchief. He had\na confederate, $5 meal. But then they noticed something else that he had on him. He had some\nnewspaper clippings. Newspaper clippings. And it was a few newspaper clippings where these\nfew newspapers had said complimentary things about Abraham Lincoln. And it was obvious that\nhe pulled them out and read from time to time the complimentary things that somebody had\nset a body, even Abraham Lincoln needed encouragement. So today, you be that\nencourager. Let's pray.\nOur most kind gracious Heavenly Father, I thank you for every man or woman\nthat's serving today. God, we refer to him many times as politicians, but in\nRomans chapter 13, you refer to them as ministers and servants. And Lord Jesus said,\nlet the greatest among you be your servant. And Martin Luther King Jr. said, any man or\nwoman can be great because any man or woman can serve. Thank you for the service of these wonderful\npeople under this go-dome. I pray that you would give them a great year. I pray that you would\nwould give them a great year of accomplishment.\nBut Lord also, I pray for their families.\nI pray for those that are not here today\nthat you would be with them,\nthat you would make up the time that's lost,\nthat you would restore the time that the locust have eaten.\nSo God, would you bless this body and keep them,\nmake your face to shine upon them, be gracious and to them,\nlift your countenance upon them,\nand may they experience your peace\nfor I pray this prayer in Jesus' name, amen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nDonnie Kerr-Patrick, Donnie Kerr-Patrick, come on.\nWe have, if I get everybody sent you real quick, obviously we always like to recognize\nour doctors of the day and we've got a very special physician here with us and to introduce\nhim I'll call on one of our distinguished members who is a doctor as well, the center\nfrom the 31st, center?\nGood morning, colleagues.\nI want to introduce you to an old friend of mine.\nNot as old as I am, but he's going to look very familiar to some of you.\nThis is Dr. Bobby Kaufman, and Dr. Kaufman has been coming here as the doctor of the\nday for 35 years, and we're so happy to have him.\nDr. Kaufman is a Georgia Bulldog.\nHe went to more house for medical school and then did his internal medicine training at\nEmory. And he's been in practice here in the Atlanta area since 1989. So you may not\nknow this, his father or Dr. James Kaufman actually started the Doctor of the Day program\nmany years ago. And we're so appreciative of the Kaufman family. So with that, please\nwelcome Dr. Bobby Kaufman.\n35 years, that sure makes me sound really old. I guess because I am. But yeah, I did\nin Toronto medicine for 35 years and kind of on the downward slide, but still working\na little. It's an honor to be here and it's honor to be here in my legacy of my father\nwho is a very special friend to all the legislators back in the day. And hopefully I've continued\nthat legacy. I feel it's such an honor to be here, and in 35 years, I finally got one\nof my family members come. This is my daughter who's a grad school at Emory, so she's going\ninto public health, so I'm very proud of her. But truly, you know, it's great having\na physician here, but the most important person here is Julia, the nurse, hiding over in\nthe corner. You got to make sure you know Julia. She's much\nimportant than all of us. But again it's an honor and a\npleasure and if I can do anything for anybody please let me\nknow and thank you for allowing me to talk.\nAll right, so you're ready for the protein thing?\nAll right.\nAll right.\nThe next order business is going to be the seeding of our protein, our new protein, and\nalso majority later.\nBefore we do that, I would like to recognize, there's a number of spouses in here of senate\nmembers and everything, but there's one special lady right behind me right here that I'd\nlike to recognize, and that's my wife, Jan, we stand up real quick, Jan, my wife's\nI can remember the first time I told her I was going to run for political office, she was\neight months pregnant with our son, Banks now, and she thought I was out of my mind,\nAnd I said, yeah, I probably am, but she said, well, if that's what you want to do, that's\nwhat you do.\nAnd she's always been very supportive, she's always been the rock in our household, and\nI just greatly appreciate all the support and love and help that she's given me through\nthe years.\nAnd I think we got one more run left in us though, Jan, don't you think?\nYeah, we got one more run here, but anyways.\nBut as y'all know, you can't do this without supportive spouses, and so, and she's been,\nshe's been my rock there, I'm so appreciative and love her so much for everything that she\ndoes.\nSo I greatly appreciate you and I appreciate that and we've got another, another couple\nguys we want to introduce and they've got some very strong women in their households\nas well.\nThis time, I'd like to recognize the Senator from the 31st of the nomination.\nGood morning, Mr. President.\nGreat to see you as always.\nMr. President, I nominate the Senator from the 20th Larry Walker, the 3rd for President Protum.\nThe Majority Leader has moved on the nomination of the Senator from the 20th Office of the President Protum.\nIs there a second?\nI recognize them, I'm already later, hey, how are you doing, but I'm doing well, Mr. President.\nI second the nomination of Senator from the 20th Larry Walker III for President Pro Tem.\nAll right, thank you, Senator.\nSenator from the 31st, you're welcome to speak to your nomination.\nThese microphones need a little bit of adjusting since we're back in here.\nGood morning colleagues, in the heart of Georgia,\nwhere hard work and Southern values define us,\nstands a leader in bodies the spirit of our great state.\nSenator Larry Walker III, born and raised in Perry, Georgia,\nis a third generation Georgian, works in insurance,\nand a devoted family man to his wife, Adrian.\nI know Adrian's in the room, and let's give a round of applause\nto the First Lady of Houston County.\nHis roots run deep in our soil, representing the resilience of faith in the community pride\nthat makes Georgia shine.\nAs a senator since 2015, Larry has championed bold reforms, laden the charts, mature agricultural\ngrowth in our history, slashing red tape for small businesses, and ensuring families\nThese are equipped to be successful in grow our economy.\nHe fought for rural communities like Blakely, in Houston, in Lawrence, in Blaski counties,\nensuring their voices are heard here in Atlanta.\nLarry Walker is the right leader at the right time, guiding Georgia through economic growth and\nchallenges with unwavering integrity.\nIt is my honor to nominate him as President and Pro Tem of this Georgia Senate.\nThank you, Mr. President.\nSo now we have a motion and a second motion by the majority of the leader, a seconded by the minority leader, I recognize Senator from the 31st.\nMr. President, I ask you now to consent that the nomination is closed and the Secretary of the Senate be instructed to cast the vote for the entire body for Senator Larry Walker of the 3rd of the 20th.\nIs there objection?\nHearing none, nominations are closed, all ballots are cast and I hereby declare the senator from the 20th, the duly elected President Pro Tem of the Georgia Senate.\nAt this time, I'd like to recognize again the following members of the serve as the\nCommittee of the Escort, to escort the President Pro Tem, Senator from the 15th, Senator\nSenator from the 31st, Senator from the 22nd.\nIf you'll go join the pro-TM in the back.\nRecognize the sergeant at arms.\nMr. President, the honorable Larry Walker,\nSenator from the 20th District and newly elected President\nBrotin of the Georgia Senate awaits entrance to the chamber.\nThank you so much.\nCould you call it a day?\nCome on up, Larry.\nThere's a zone wrong.\nIt's at the bottom.\nIt is a minor to introduce my good friend.\nMr. Larry LeWalker, not only has he been a fine senator for many, many years from\nHouse in County, but he's just, he's been a good friend to each and every one of us here in this room.\nHe and his wife, Adrian, has just been, they've pitted me a southern hospitality.\nThey're warm and loving and they've never met a stranger before.\nAnd I just really am glad and honored and proud of all the work that he has done in this body.\nAnd I know he will do this chamber well in representing each and every one of you.\nSo at this time, there's recognize our Senator from the 20th.\nis our new President Pro Tem, Larry Walford.\nThank you, thank you, wow, this is awesome, thank you all so much.\nSo I was seven years old when my father was elected to the House and over the next 32\nyears. I spent a good bit of time here at the Capitol along with my mother, Janice, and\nour family. And I could never have imagined I would serve in this August body, the Senate,\nmuch less be the President, pro-tem. So I'm deeply humbled by the trust you've placed\nand me to serve as your president, pro-Tam, and I'll try to live up to any expectations\nand do you proud.\nI want to thank my colleagues in the Republican Caucus for nominating me, by acclimation\nback in the summer, and I want to thank my good friend, the minority leader, and the minority\ncaucus for your support. Actually when I was first elected the minority\nleader was my office sweet mate and we became fast friends and ever main\nfriends so I appreciate that very very much. I stand here today as a product of\nGeorgia values. I was reared in middle Georgia in Perry. I was born in the\nCounty and home of some mighty good leaders, Senator Sam Nunn, Governor Perdue, to name a few.\nAnd those folks modeled what I think it means to be servant leaders and to be true statesman.\nAnd I hope I can learn from that and somewhat emulate them.\nMy heart and my roots are firmly planted in the Soul of District 20, and I carry the\nvalues of my amazing communities that I represent across the state with me every day.\nFor me, the importance of community and public service was taught to us at our house around\nthe dinner table and instilled in me and my father, Larry Walker Jr., as I already said,\nspent 32 years serving in the house and he served 16 of those years as majority leader\nand I learned a lot from him and realized the opportunity we have from our constituents\nputting us in this position, the opportunity we have to make a difference and to do good.\nAnd I think what we've done really good work in the 10 years that I've been here.\nI'm real proud of the work we've done.\nBut at the end of the day, it's really not about the bills we pass or the budgets we pass,\nalthough those are very important.\nIt's really about the friendships we build, and the relationships we make, and the positive encouragement, as Dr.\nTate said, that we can give to the people around us, our constituents, and the folks working here in this building.\nAnd I hope we'll remember that, and we're giving a really unique opportunity to have a positive\ninfluence on people's lives and especially the young people because we need to leave\nthis place better than we found it and be training up the next generation of leaders.\nSo I hope we will do this.\nMy father taught me that while we sit on different sides of the aisle or come from different\nareas of the state or different perspectives, we're all bound by a common duty to leave\nGeorgia better than we found it. He understood that leadership isn't about the title you hold,\nbut the people you serve. And as I take this guy while I hope to honor his legacy\nby bringing the same spirit of steady principal leadership to this role.\nIn my decade of service in the Senate I've fought for a better Georgia and I want to use this\nplatform that I now have to continue to do the same. As your President ProTIM, my goal\nis to ensure that the Senate continues to lead, remains a place of deliberation, efficient\nprocedure, and transparent government. I want us to debate vigorously but to treat\neach other with courtesy and respect. Now more than ever, it is important to remember\nthat the people that sent us here, and the work they expect us to do, we're here to serve\nthe people of Georgia, not political agendas or ambition. To my family, my high school sweetheart\nis here with me today, Adrian, my wife of over 40 years. I'm so proud of her. Stand up,\nShe's been a rock and my encourager and she also helps keep me centered and helps\nme keep this in perspective and I appreciate and love her.\nOur three sons Ben Cody and Wade, they've been unwavering in their support and understanding\nof the time away, and I wouldn't be standing here without any of them.\nAnd then to my colleagues, I look forward to working with each and every one of you with\ncivility and purpose.\nLet us honor the traditions of the Senate while working toward a bright future for our\nstate.\nI believe that Georgia is the greatest state in the nation\nto live, work, and raise a family.\nAnd I'm honored to join all of you in working\nto ensure that it stays this way.\nThank you, and God bless the great state of Georgia.\nThank you.\nThank you.\nThank you.\nApplause\nI don't know what I'm going to need at this point.\nMan, I agree.\nI got to figure out where I had to work at.\nAll right, we'll get him out.\nIt was nice to see all the House that were here because of the Secretary of the President.\nOh my God.\nMr. Wood, he's done.\nThat was just cool.\nMr. Wood, that was just cool.\nThat was just cool.\nMr. Wood, that was just cool.\nThat was just cool.\nMr. Wood, that was just cool.\nMr. Wood, that was just cool.\nAll right, very, very nice, and I appreciate the, the protein for his kind words and he'll\nbe a great leader.\nNext order of business will be the adoption of the resolution related to the convening\nof the Senate, Secretary Reed announces.\nthe resolution 557 by Walker of the 20th.\nAnd of Attarte of the 31st and Jones, the second of the 22nd.\nA resolution to notify the House of Representatives that the Senate has convened in for other purposes.\nThank you, Mr. President, that could be the order.\nHe is the objection to the adoption of resolution.\nChair here is done and the resolution is adopted.\nI recognize the majority leader for a motion.\nMr. President, I ask you an am to consent that SR557 and all resolutions adopt a today requiring\ntransmittal be immediately transmitted to the House.\nMajority leader has moved for immediate transmit of SR557.\nIs there objection?\nObjection is approved.\nI also, while we have a moment here, the senator from the 35th, he went in here earlier\nwhen we recognize them, but let's give our new senator from Cobb County, Senator Howard\nfrom the 35th here. Let's give him a big round of applause.\nSenator and I had a nice long conversation right after you won a couple of weeks ago and\nI enjoyed our talks and learned a lot about him.\nI think he'd be a great member to this body.\nSo looking forward for him serving.\nNice to have you here, Senator.\nAre there any unanimous concerns?\nDoes any Senator rise on a point of personal privilege?\nSenator from the 26, our longest serving member\nthe General Assembly right here.\ntell you what, in the history of the General Assembly, the man from\nMegan Georgia. I sat beside her for 10 years, he's got that looking on his face,\nhe's got business on his mind right now.\nThank you, Mr. Governor. I come this morning to\nto ask the lieutenant governor to take the chairman of the insurance committee and have\nthe folks who run our health plan before the committee.\nThey are doing things and making decisions that I disagree with.\nLet me tell you something.\nI played football, it was good I got education, but I wanted to want to end up with bad knees,\nthree knee operations.\nI don't feel like laying on the table no more unless I'm about to die.\nI went and asked the insurance company, you know, we got new technology now.\nI went to an orthopedic surgeon and it said, I had bone,\nown bone, which meant every time I made a step, it hurt.\nThere's new technology.\nThey can inject the knee.\nAnd what they inject with, it's almost like grease.\nIt lubricates the knee where you're not getting the lubrication\nbetween the loans.\nThey refused me, so I had to pay $1,000\nfor the injection to go in my knee.\nNow, if I had to have a knee replacement,\nthat's about $65, $70,000.\nAnd then you're talking about two knees.\nI do pretty good.\nI got a shot about four months ago,\nabout time for me to get a note.\nBut I don't feel like laying on the table three hours\nto be cut on and then turn around\nand you got the rehab.\nI know about rehab because I had to do it\nwhen I wanted to play football with those knee operations.\nAnd so what I'm asking the insurance committee\ndo is to bring them in. You will pay 75,000 for a knee replacement, but you won't give\nme a thousand dollars to get the injection in my knee, so I don't hurt. I like hunting\nand I like fishing, but what they ain't about it, if you can't walk into woods, how you\ngoing to walk out. So I would ask the Lieutenant Governor to appoint a committee to deal with\nthe folks who held our insurance. And the reason I said it, for 51 years they got my money\non time, not a mispayment. Now I need something from you, because I'm old. Not a strange chicken\nCan't jump, can't run that fast, take step, one by one.\nBut something is wrong, when we have all this new technology, and then you tell me I can't get an injection in my knee that'll make me walk without paying.\nThank you.\nThank you, Senator. Any other Senator wish to rise on point of personal privilege?\nChair, hearing none.\nAre there any motions to withdraw and recommit?\nYou have a consent calendar of local bills before you.\nChair, recognize the senator from the 45th.\nReunanimous consent for all the bills on the Senate local consent calendar to be\nrecommitted to the committee on state and local government.\nSenator has moved in all the bills pending, be moved back to local,\nstate and local government operations.\nHere's their objection.\nHearing none, all bills appearing on today's Senate local consent calendar are\nrecommended to the committees on the state and local government operations.\nWe're going to ask the senator from the 31st.\nMr. President, I ask you names consent that all bills and resolutions that were placed on the table during the 2025 legislative session will be taken from the table.\nThe majority leader has moved his objection.\nOut of objection, all bills will be taken from the table.\nAnd I was the majority leader again for a motion.\nMr. President, I ask unanimous consent that the bills and resolutions on the Senate calendar be committed to the committee from which they were last reported.\nMajority leaders move and ask for unanimous consent that the bills and resolutions on the Senate calendar are being committed from the last committee for which they were reported.\nIs there objection?\nHere none of those are re-committed.\nWe're waiting on the sea if the house is going to be able to get the calendar over to\nus.\nBut I was reminded I was looking at my good friend, Greg Bloomstein back there in the back and\nMy pastor was talking about the articles\nthat were in Abraham Lincoln's front pocket when he died.\nAnd I got the thinking about that.\nI said, I wonder if I'll have a reporter\nwrite a good article about me.\nAnd then I thought, well, Greg, at some point in time\nin his career, I'm sure we'll write a good one about me.\nRight, Greg?\nI love Greg, I'm just picking at him.\nGood to have Eric Johnson here, one of our former members.\nLet's give Eric a big round of applause.\nApplause.\nLet's give it to have Eric.\nLooking good.\nAre we going to have Eric Johnson here, one of our former members?\nLet's give Eric a big round of applause.\ngreat to see you again. I move under Senate rule 7-1.10B to give notice that on the next\nlegislative day I intend to move SB 204 after house action.\nDirector, read the caption.\nSenate bill 204 bill to be in the bill, Senator Jones,\nthe second of the 22nd of the bill to be entitled,\nan act to amend code section 17-7-70.1 of the OCGA relating to trial upon accusation of certain felony and misdemeanor cases and trial upon plea upon guilty, or in a little contender and further purposes.\nMr. President, that completes the order.\nThank you, Senator Knows has been served.\nI do recognize one, another Senate member's wife is in the chamber here today.\nWe've got Lindsey Strickland here today.\nLindsey, give everybody a round of applause, give everybody a wave here.\nI'm looking around they're supposed to let me know and some of these special guests come in here, but we're learning we're learning\nAll right, we're now moving on to center calendar\nWe're going to stand at ease waiting on the house, which is a common thing for us around\nhere.\nWe'll go stand at ease.\nYou\nThank you.\nWell, I also want to recognize young ladies back there in the back, the first lady from\nthe 53rd, the first lady from the 16th are here as well today, so I'm glad to have\nThank you very much.\nThank you.\nThank you.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nHello, all right, there he goes, guys, and a little technical difficulties today.\ntoday. Anyway, we're going to be here in about five minutes. We received our\ninformation from the house, the resolutions, and so give us the secretaries\njust printing them off and going to put them on your desk. So we'll be back in\nliterally about five minutes. Thank you.\nYou\nYou\nall right we're back the Senate will now reconvene Senate will now reconvene\ntaking up House Resolution 996 Secretary read the caption House Resolution 996 by\nrepresentative frustration a resolution to notify the governor that the\nGeneral Assembly has convened for other purposes.\nThank you, Mr. President.\nThat could be the order.\nIt is an objection to the Dobson Resolution.\nChair, here's the Dobson Resolution.\nIt is adopted.\nSecretary, House Resolution 997.\nHouse Resolution 997 by Representative\nof the 104th, a resolution calling a joint session\nthe House represented in the Senate for the purpose of hearing a message from the governor\ninviting the justices of the Supreme Court and the judges of the Court of Appeals to be present\nat the joint session and for other purposes.\nThat completes the order, Mr. President.\nIs there objection to the adoption resolution?\nChair, here's none, and resolution is adopted.\nNow we will read, Secretary Reed, House Resolution 9998.\nHouse Resolution 999 by Representative Stration of the 104th, a resolution relative to meetings and adjournments of the General Assembly and for other purposes.\nThank you, Mr. President.\nMay I please the order?\nMajority Leader, would you like to speak to the resolution?\nPlease recognize the majority of the leader to speak to the resolution.\nMr. President, House resolution 998, First I want to say thank you and thank you for being collaborative to the leader in the House.\nMr. President and you and your team's work and speaker burns to provide provide certainty not only to the staff and\nFolks who work in this building but to our constituents that we represent to provide transparency\nSo they can plan days to visit come up here and advocate for the issues that are important to them, but also to\nSo they know what it is we are doing in this capital. So I urge you to vote green on HR 998. Thank you, Mr. President\nI had a question for the gentleman that was in the whip.\nLet me ask you this.\nThis is projected, so it could change if we have some problems or need to do some other\nthings and have to change the needs in that correct.\nIt would take an action of both chambers, but yes, that's correct.\nThank you for the question.\nAny other Senator Wishrise speaking?\nHere none, we're going to put this one on the board.\nQuestions on the adoption of resolution?\nAll those in favor of the resolution will vote\nyay, opposed nay, secretary, on lock the machine.\nThe\nSo Senator from 7th for what purpose do you rise Parliamentary Query station requiring is it not true that this\nThe calendar does not reflect the holidays of the Jewish and Muslim faith, including Eid and Passover.\nAnd is it not true that I am voting yesterday for the good of the order, but moving forward we should have an inclusive calendar.\nSenator, I have to know about what she speaks.\nAll the passes of the resolution the a's are feature one and the a's are zero this resolution\npass pass.\nAt this time I will appoint the following senators to the committee of notification to\njoin with the similar committee from the House for the purposes of notifying the governor's\noffice that the general assembly has convened.\nLike to appoint the senator from the 20th, the pro team, the senator from the 15th, the\nDean of the Senate, Senator from the 31st, a majority leader,\nSenator from the 22nd, the minority leader,\nSenator from the 49th, the floor leader,\nSenator from the 50th, the floor leader.\nI would ask that the members of the committee beat and\nSecretary of Senate's office at the conclusion of session today.\nWe'd also at this time like we'll point the following senators to the committee of escort to join the similar committee from the House for\nhis Excellency, the governor, to the state of the state.\nSenator from the 20th, President Provincy, I'm Senator from the 31st Majority Leader,\nSenator from the 22nd, the minority leader, Senator from the 15th, the dean of the Senate.\nSenator from the 29th, the majority whip, Senator from the 41st, minority whip.\nSenator from the 49th, floor leader, Senator from the 50th, floor leader,\nSenator from the 46th, and the Senator from the 47th.\nThank you, Mr. President, just as a reminder, you have an invitation on your desk to the\nPresident's Pro Tem launch, and I hope to see each and every one of you there looking\nforward to it.\nThank you, Senator.\nAll members are invited to the Pro Tem launch, so hope to see each and every one of you\nthere.\nThank you for that reminder, Senator.\nRecognize the majority leader for a motion.\nThe surprise time move to the Senate's standard year until 10 a.m. on Tuesday, January 13th, 2026.\nThe majority leader has moved.\nSecretary, read the announcements.\nMr. President, there are no announcements, did it?\nThe majority leader has moved to the Senate's standard year until tomorrow, 10 a.m.\nAll those in favor of the motion will signify by saying aye.\nall those opposed no guys clearly have it have a wonderful day\n",
  "updated_at": "2026-02-12T01:29:14.565258+00:00"
}