{
  "video_id": "y_n9JCT_xTE",
  "url": "https://www.youtube.com/watch?v=y_n9JCT_xTE",
  "title": "Sen. Islam Parkes Press Conference | 02/22/2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Overview:\nState Senator Nebula Assam Parks held a press conference highlighting three bills she has introduced to provide tax relief for Georgia families - eliminating the sales tax on menstrual products, providing a tax break for baby supplies in the first three years, and reinstating the sales tax holiday for school supplies. She contrasts these bills with the legislature's prioritization of a gun tax holiday, arguing that the state should focus on supporting families rather than firearms.\n\nKey Actions:\nNo bills passed or referred during this press conference.\n\nBills Introduced (First Reading):\n- **SB 51**: Eliminate sales tax on menstrual products\n- **SB 372**: Provide tax break for baby supplies in first 3 years\n- **SB 527**: Reinstate sales tax holiday for school supplies\n\nNotable Moments:\n- Sen. Parks spoke passionately about the need to prioritize family-focused policies over measures catering to the gun lobby.\n- She drew on her personal background growing up in a working-class family to emphasize the importance of these tax relief measures.\n- She criticized the legislature for prioritizing a gun tax holiday over bills that would directly benefit Georgia's families and children.\n\nVotes: \nNo votes mentioned.\n\nAttendance:\nNot discussed.\n\nAdjournment:\nThis was a press conference, not a legislative session, so no adjournment information provided.",
  "transcript": "Good afternoon. My name is State Senator Nebula Assam Parks. I stand before you\ntoday not just as a state senator but as a fiery advocate for every\nGeorgian family and as a first expectant mother ever in the state Senate. I'm\nfighting not just for the future of my children but for all of our children. We\nare out of crossroads folks where the choices we make today in this legislature\nwill echo in our homes our schools and our wallets for generations to come.\nNow, let's talk about priorities because it seems we've got a case of misplaced ones\nright here.\nWe've got a legislator that's bending over backward to pass a tax break for gun owners.\nYes, you heard that, right?\nWhile our families are counting pennies trying to make ends meet, the powers that be think\nthat we really need is a cheaper way to buy guns during hunting season and build that's\nnot just a missed shop but a misfire in addressing the real needs of Georgians.\nBut here I am, standing up, not just for common sense, but for common decency, I've introduced\na trio of bills that aim to lighten the load for Georgia's families.\nFirst up, it's Senate Bill 51, because believe it or not, in the year 2023, we're still\ntaxing menstrual products.\nAs if managing menstruation is a luxury.\nWhen ladies are gentlemen, it's time to end this archaic discriminatory pink tax and\nacknowledge that tampons and pads are not optional.\nThey are a medical necessity.\nAnd let's not forget, the most vulnerable Georgians.\nSenate Bill 372 is here to offer a tax break\nfor supplies used in the first three years of a baby's life.\nDipers, strollers, you name it.\nBecause if there's anything that you unite us, left or right,\nit is a belief that our infants deserve a healthy start in life.\nAnd next, we've got Senate Bill 527.\nBecause somehow, we've forgotten that the education\nis a cornerstone of our future.\nThis bill is about restoring the sales tax holiday\non school supplies, and this isn't a new concept.\nIt's a proven relief that we, inexplicably,\nlet slip through our fingers.\nAnd it's time we brought it back.\nMaking it easier for parents to provide\nfor the children's educational needs\nwithout the added stress of the sales tax.\nAnd it's about supporting our families\nand investing in our children's future.\nAnd folks, this isn't just about taxes.\nIt's about values.\nAnd it's about choosing to support families over fire\narms, babies over bullets.\nAnd while some in this legislature are pre-occupied\nwith pandering to the gun lobby and playing politics,\nI'm here fighting for policies that\nput Georgia's families first.\nSo I ask my colleagues, and I ask every Georgian, what\nkind of state do we want to live in?\nOne that prioritizes tax breaks for ammunition\nor one that invests in people,\nfrom our school children to our hardworking parents,\nand to every woman and girl\nwho's ever had to pay extra for a basic necessity.\nAnd the choice is clear.\nLet's choose families, let's choose progress,\nand let's choose compassion and common sense,\nand let's pass these bills and show the country\nwhat Georgia really stands for.\nThank you.\nI'm open to any questions.\nHow about these bills are, oh, they're very, I get emails every day asking me to please\npass the bill and menstrual products, please end the sales tax on diapers.\nPlease reintroduce the school supplies tax holiday because they feel like it is a grave\ninjustice that we've prioritized guns and not the basic necessities of hard working\nGeorgia families. Well, I feel like this has bipartisan support. It's just not being\nprioritized right now, which is a shame. And as we've seen in the state senate, we've\nalready passed a bill, a prioritizing five day gun tax holiday, but none of these bills\nhave been brought to the Senate floor.\nThere's also a measure to provide incentives for the state of Georgia, the number one leading\ncause of children is guns and so that I supported but we don't need a gun\ntax holiday for guns. This was not something that none of my constituents emailed\nme about, called me about or have mentioned in a town hall.\nAre these bills going to sign a committee yet?\nI got a hearing only on the Senate Bill 51 last session and they've been\nassigned to the Finance Committee and I've asked for a hearing in a vote and I\nhave not I've yet to receive one on a personal level. Do you remember going\nschool shopping and there not be a tax on my parents prior to like I can't\nhonestly I I am not what about to be 35 my memory is not that sharp but I do\nremember though going on the days that there was a tax holiday and we bought\neverything that day and in the stores were packed because it has saved on average annually Georgians 50 million dollars in sales taxes\nThis is\nMy chief staff provided for me you he found it actually online and\nHe was able to tell me that's about how much it's been saving Georgians when we had it in effect\nThat's a big number 50 million dollars is a big number\nfor that one weekend correct we would wait until that one weekend because it\ndid provide I grew up in a working class family my mom was a warehouse worker\nmy dad was a file clerk you know I went to I grew up on free and reduced\nlunches and so these schools the the tax holiday and school supplies was a\nform of relief for my family and something that we look forward to and it\nsaddens me that we haven't brought this back even though we have a sixteen\nbillion dollar surplus and yet we've prioritized a tax holiday for\ngoods instead of school supplies.\nIt's just shocking to me.\nIt's not only beneficial to your\nconstituents, but this is the first one.\nYes, it is personal to me.\nAnd I feel like my story is a story of many\nGeorgians in the state of Georgia.\nAnd that's why when I come to the state senate,\nI know that I have a lot of shared lived experiences with so\nmany working Georgians.\nAnd that's why I introduce these bills because I want to make\nsure that they get the relief that they deserve.\nWhat is your choice?\nThe final thought, saying, do you want to leave us with?\nWe should no one understand.\nGeorgia should know that Democrats have introduced bills to provide relief when it comes to\nmenstrual products, when it comes to products for babies under the age of three, and when it\ncomes to school supplies for children and teachers, and that we are trying to pass them.\nWe are prioritizing these bills over trying to pass a five day tax all day for guns.\nLook.\nThank you.\n",
  "updated_at": "2026-02-12T19:29:42.789465+00:00"
}