[
  {
    "video_id": "XEKouvzGV14",
    "url": "https://www.youtube.com/watch?v=XEKouvzGV14",
    "title": "April 1st Rules Meeting for the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "# Georgia April 1st Rules Meeting for the 2025 Session\n\n## Overview\nThis session focused primarily on advancing several Senate bills, including SB 255 regarding the legislature's investigative powers and SB 125 related to plumbing work. The meeting was generally routine, with few notable moments beyond the standard bill considerations.\n\n## Key Actions\n**SB 255**: Bill regarding the legislature's investigative powers and subpoena authority\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this meeting.\n\n## Notable Moments\n- Prayer and opening remarks by the chair\n- Brief discussions on SB 291, SB 51, and SB 36\n\n## Votes\n- SB 125: Approved a rules substitute (LC 550644S) by unanimous vote\n- SB 5 (now HB 124): Adopted a rules substitute (LC 520855S) without opposition\n\n## Attendance\nQuorum was present, with no notes on attendance issues.\n\n## Adjournment\nThe meeting was adjourned. The next session is scheduled for April 2nd."
  },
  {
    "video_id": "UNWjOGW0iks",
    "url": "https://www.youtube.com/watch?v=UNWjOGW0iks",
    "title": "Senate PM 5 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 1,
    "summary": "Here is a summary of the Georgia Senate PM 5 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis was a brief session focused on adjourning for the day. No substantive legislation was discussed.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\nThe majority leader moved to adjourn the session \"sine die\" (without setting a future date). There was some opposition voiced, but the motion ultimately passed.\n\n**Votes**\nA voice vote was held on the motion to adjourn sine die. The majority in favor was clear, despite some opposition.\n\n**Attendance**\nA quorum was present to conduct business.\n\n**Adjournment**\nThe Senate adjourned sine die, with no future session date set."
  },
  {
    "video_id": "xE822lYvzvg",
    "url": "https://www.youtube.com/watch?v=xE822lYvzvg",
    "title": "Rules PM Meeting for Day 40 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThe meeting had a cheerful atmosphere, with members dancing and singing as they arrived. The main focus was on procedural matters, including recognitions, presentations of legislation, and the approval of study committees.\n\n## Key Actions\n**SB 148**: Pilot program for development of outdoor learning spaces in schools, along with other education-related provisions.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Recognition of Erin Garland, an assistant from Elverton, who was attending the Rules Committee for the first time.\n- Presentation of a proposed rules committee substitute for SB 148, which combined several education-related bills.\n- Discussion and approval of 11 study committee requests, with the days reduced from five to three.\n- Discussion of House Resolution 887 regarding code cleanup.\n\n## Votes\n- SB 148 by Substitute LC 610264S was approved.\n- The 11 study committee requests were approved as a group.\n- A supplemental calendar was set, including several house resolutions and SB 148.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session."
  },
  {
    "video_id": "S9BR9KnnIIU",
    "url": "https://www.youtube.com/watch?v=S9BR9KnnIIU",
    "title": "Rules AM Meeting for Day 40 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 28,
    "summary": "Here is a structured markdown summary of the Georgia Rules AM Meeting for Day 40 of the 2025 Session:\n\n**Overview**\nThis meeting discussed House Resolution 885, which would establish a House Study Committee to examine Georgia's election procedures and policies. The discussion centered around the composition of the study committee and ensuring diverse perspectives are represented.\n\n**Key Actions**\n**HR 885**: Resolution to create a House Study Committee on Georgia election procedures\n\n**Bills Introduced (First Reading)**\nNone noted\n\n**Notable Moments**\n- Rep. Evans proposed amending the study committee to include non-legislative members such as election board chairs and election law experts.\n- Rep. Hughley requested the study not impose new election rules in an election year and that the minority party be equally represented on the committee.\n- Chairman Anderson stated the intent was to have a legislative-only committee that could hear testimony from outside experts, rather than directly including them on the committee.\n\n**Votes**\nNo recorded votes\n\n**Attendance**\nQuorum present, no issues noted.\n\n**Adjournment**\nMeeting adjourned. Next session date not provided."
  },
  {
    "video_id": "VDon2vYQnhA",
    "url": "https://www.youtube.com/watch?v=VDon2vYQnhA",
    "title": "Senate PM Meeting pt. 3 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 84,
    "summary": "Here is a summary of the Georgia Senate PM Meeting pt. 3 for Day 39 of the 2025 Session:\n\n**Overview:** The session featured debate and passage of a bill to establish a Georgia Music Office and promote the state's music industry. Senators highlighted Georgia's rich musical heritage and the need to support local musicians and the music economy.\n\n**Key Actions:**\n**HB 14:** Establishes the Georgia Music Office and Music Ready Communities Act to promote Georgia's music industry.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Sen. Hatcher (46th) gave an impassioned speech celebrating Georgia's musical legacy, from Otis Redding to R.E.M. to Usher, and called for greater state support for the music industry.\n- Sen. Hatcher reminisced about his own love of music, including buying 8-track tapes as a teenager.\n- Sen. Hatcher acknowledged bipartisan support for the bill and thanked Sen. Jones (39th) for her collaboration.\n- Sen. Smith (8th) playfully tested Sen. Hatcher's music knowledge by asking him to name the greatest solo recording artist of all time (Elvis Presley).\n\n**Votes:**\n- HB 14 passed with a unanimous vote.\n\n**Attendance:** Quorum present.\n\n**Adjournment:** The session adjourned. Next session date not specified."
  },
  {
    "video_id": "2zeUiLWlNsY",
    "url": "https://www.youtube.com/watch?v=2zeUiLWlNsY",
    "title": "House PM 4 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 54,
    "summary": "Here is a structured markdown summary of the key details from the Georgia House PM 4 Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThis session focused on passing several notable bills and resolutions, including final action on HB 399 related to landlords and tenants, and HB 296 related to driver's licenses. The session also involved the recognition of various community members and organizations through privileged resolutions.\n\n## Key Actions\n**HB 399**: Bill to create accountability for hedge funds and out-of-state investors purchasing large numbers of single-family homes, passed by the House.\n**HB 296**: Bill to amend laws related to the issuance, expiration, and renewal of driver's licenses, including mobile driver's licenses.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- The House took up a large number of privileged resolutions recognizing and honoring various individuals and organizations for their contributions to the community.\n- There was a pause in the proceedings to ensure all members were present in the chamber.\n\n## Votes\n- HB 399 passed the House by a vote of 159-5.\n- HB 296 was agreed to by the House.\n\n## Attendance\nQuorum was present, with all members instructed to be seated in the chamber.\n\n## Adjournment\nThe session adjourned, with the next meeting date not specified."
  },
  {
    "video_id": "C7AXuXJ18x0",
    "url": "https://www.youtube.com/watch?v=C7AXuXJ18x0",
    "title": "Senate PM 3 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Here is a summary of the Georgia Senate PM 3 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis session focused on the passage of SB 82, which aims to incentivize local charter school approval. Several new bills were also introduced for first reading.\n\n**Key Actions**\n**SB 82**: A bill to enact the Local Charter School Authorization and Support Act of 2025, providing incentives for local boards of education to approve new charter school petitions.\n\n**Bills Introduced (First Reading)**\n- SB 373: To amend Article 1 of Chapter 17, Title 45\n- SB 374: To amend Part 1 of Article 1 of Chapter 2 of Title 35 (Public Safety)  \n- SB 375: To amend Chapter 1\n- SB 376: By Senator Robertson\n- SB 377: By Senator Smith\n- SB 378: By Senator Smith\n\n**Notable Moments**\n- The Senate suspended certain rules to allow for the first reading and assignment of the new bills.\n- The chamber broke for dinner, which was provided by Copeland's restaurant.\n\n**Votes**\n- The Senate voted 44-10 to agree to the House substitute on SB 82.\n\n**Attendance**\n- A quorum was present.\n\n**Adjournment**\nThe Senate stood at ease for dinner and reconvened around 7:30pm. The session then adjourned for the day."
  },
  {
    "video_id": "BQYKI5_G8pc",
    "url": "https://www.youtube.com/watch?v=BQYKI5_G8pc",
    "title": "House PM 2 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Overview:\n- The Georgia House held a legislative session on Day 40 of the 2025 Session. The session focused on passing two bills related to the judicial system and public records.\n\nKey Actions:\n- **SB 218**: Moves the Prosecuting Attorney's Qualifications Commission (PAQC) from the Prosecuting Attorney's Council to the Administrative Office of the Courts, clarifies the appeals process, and modifies confidentiality related to District Attorneys and Solicitor Generals.\n- **SB 12**: Defines the custodian of public records and specifies that requests to view public records must go through the custodian. Also requires third parties with government records to provide them to the custodian upon request.\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Debate on whether SB 218 removed a requirement for sheriff's deputies in courthouses.\n- Confirmation that SB 12 reverted back to the original Senate-passed version with carefully vetted language.\n\nVotes:\n- SB 218 passed 149-18.\n- SB 12 passed 167-1.\n\nAttendance: Quorum present, no notes on attendance.\n\nAdjournment: No explicit mention of adjournment, but the session appears to have concluded."
  },
  {
    "video_id": "-LHjoc6G1HA",
    "url": "https://www.youtube.com/watch?v=-LHjoc6G1HA",
    "title": "Senate PM Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 71,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Day 40 of the 2025 Legislative Session:\n\n## Overview\nThe session included discussions on several bills, including HB 172 related to student loan forgiveness for veterinarians, HB 222 regarding bond information requirements, and amendments to other bills. There was some debate and procedural wrangling, but ultimately several bills were passed.\n\n## Key Actions\n**HB 172**: Provides for limits on student loan forgiveness program for veterinary education and other purposes.  \n**HB 222**: Amends Title 17 to revise certain bond holding requirements and require inclusion of contact information.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- There was a discussion about the need for large animal veterinarians in Georgia, with a Senator recounting a presentation he attended by an Alabama veterinarian.\n- An amendment was proposed to HB 222 to revise bond holding requirements, but a point of order was raised that it was a \"floor substitute\" and should be struck per the Senate rules.\n\n## Votes\n- HB 172 passed with a vote of 43-4.\n- The amendment to HB 222 was subject to a point of order challenging it as a \"floor substitute\".\n\n## Attendance\nA quorum was present, with one Senator excused for business outside the chamber.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "Z1tirjPBB7Q",
    "url": "https://www.youtube.com/watch?v=Z1tirjPBB7Q",
    "title": "Senate PM Meeting pt. 2 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n### Overview\nThe session focused on considering amendments to House Bill 54, which aims to authorize advanced practice registered nurses and physician assistants to order home health care services. Several amendments were proposed to address concerns around self-referrals and create a pathway for foreign-trained physicians to become licensed in Georgia.\n\n### Key Actions\n**HB 54**: Bill to authorize advanced practice registered nurses and physician assistants to order home health care services\n\n### Bills Introduced (First Reading)\nNone mentioned\n\n### Notable Moments\n- Debate and amendments around HB 54 to address self-referral concerns and create a pathway for foreign-trained physicians to practice in Georgia\n\n### Votes\n- HB 54 and amendments passed, but specific vote tallies not provided\n\n### Attendance\nNo quorum issues mentioned\n\n### Adjournment\nNo specific adjournment time or next session date provided"
  },
  {
    "video_id": "3d9T-dhAQlc",
    "url": "https://www.youtube.com/watch?v=3d9T-dhAQlc",
    "title": "Rules Meeting Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\n- The session focused on discussing several bills, including SB 102 related to cockfighting, SB 131 related to behavioral health parity, and other bills.\n- There was some debate and discussion around the details and implications of the bills.\n\nKey Actions:\n- **SB 102**: Bill to add language related to cockfighting, allowing local law enforcement to have jurisdiction over it.\n- **SB 131**: Substitute bill passed to add one member to the behavioral health and council, the insurance commissioner, and create a parity compliance review panel.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Discussion around SB 102 and concerns about impacts on those raising game fowl for purposes other than fighting.\n- Debate over whether the bill would effectively stop cockfighting or just drive it underground.\n\nVotes:\n- SB 131 substitute bill passed the committee.\n\nAttendance:\n- Quorum was present.\n\nAdjournment:\n- The meeting was adjourned. Next session date was not specified."
  },
  {
    "video_id": "Oj_RYaSpi4o",
    "url": "https://www.youtube.com/watch?v=Oj_RYaSpi4o",
    "title": "Rules PM Meeting pt. 2 for Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a structured summary of the Georgia Rules PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n**Overview:** This meeting focused on discussing and explaining the details of a substitute version of Senate Bill 12, which deals with defining custodians for open records requests and expanding legislative privilege.\n\n**Key Actions:** None detected.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Chairman Anderson explained the key provisions of the substitute Senate Bill 12, including defining custodians for open records requests and expanding legislative privilege to cover communications between the legislative and executive branches.\n- There was a discussion around whether the expanded legislative privilege provisions were intended to hide information from the public, with concerns raised about protecting communications with private entities that may influence legislation.\n- The chairmen defended the changes as necessary to protect the ability to have candid conversations and receive accurate information, arguing that existing legislative privilege should extend to written records as well.\n\n**Votes:** No recorded votes detected.\n\n**Attendance:** Quorum was present to conduct the meeting.\n\n**Adjournment:** The meeting was adjourned. No information provided on the next scheduled session."
  },
  {
    "video_id": "9FVRC2Pei1w",
    "url": "https://www.youtube.com/watch?v=9FVRC2Pei1w",
    "title": "Rules PM Meeting for Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 15,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 39 of the 2025 Session:\n\n## Overview\nThe meeting focused on a substitute for Senate Bill 59 regarding municipal sovereign immunity, as well as a discussion around Senate Bill 185 which would prohibit the Georgia Department of Corrections from using state funding for transgender surgeries for inmates. There was significant debate and opposition expressed around the necessity and prioritization of the transgender surgery bill.\n\n## Key Actions\n**SB 59**: Substitute bill providing liability limits for municipal governments\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Debate around the necessity and prioritization of SB 185 to prohibit transgender surgeries for inmates, with concerns raised about the bill addressing a non-existent problem while larger issues like healthcare access and teacher/prison staff shortages go unaddressed.\n- Questions around whether any transgender surgeries have actually been performed on inmates in Georgia's prisons.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nQuorum was present, though specific attendance numbers were not provided.\n\n## Adjournment\nThe meeting adjourned, but a specific time was not noted. The next session date was also not provided."
  },
  {
    "video_id": "d9fS5b4vmNM",
    "url": "https://www.youtube.com/watch?v=d9fS5b4vmNM",
    "title": "House Evening Session for Day 38 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 86,
    "summary": "Here is a structured markdown summary of the Georgia House Evening Session for Day 38 of the 2025 Legislative Session:\n\n## Overview\nThe House session focused on passing key school safety legislation, including provisions from previous bills SB 17 (known as Ricky and Alyssa's Law) and incorporating new requirements around emergency communications, threat assessment plans, and mental health support for students. The session also included the introduction and passage of SB 199 related to campaign finance and transparency.\n\n## Key Actions\n**HB 268**: Amends education laws to require public schools to implement mobile panic alert systems, share digital mapping data with emergency responders, establish threat assessment plans, and create a student advocacy specialist position to coordinate mental health services.\n\n**SB 199**: Requires the State Ethics Commission to not accept or reject complaints against candidates within 60 days of an election, and streamlines campaign finance reporting requirements.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Rep. Persinger provided an overview of the changes made to HB 268 in the Senate substitute, highlighting the incorporation of Ricky and Alyssa's Law and new requirements around emergency communications, threat assessments, and mental health support.\n- Several representatives asked clarifying questions about the implementation and funding of the new school safety requirements in HB 268.\n- There was discussion about ensuring timely transfer of student disciplinary records between schools.\n\n## Votes\n- The House voted 154-12 to agree to the Senate's substitute for HB 268, passing the school safety legislation.\n\n## Attendance\nNo explicit quorum notes provided.\n\n## Adjournment\nThe transcript does not provide information about the time of adjournment or the date of the next session."
  },
  {
    "video_id": "q9Y3YDWb1ec",
    "url": "https://www.youtube.com/watch?v=q9Y3YDWb1ec",
    "title": "Rules Day 38 of the 2025 Legislative PM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 3,
    "summary": "# Georgia Rules Day 38 of the 2025 Legislative PM Session\n\n## Overview\nThe session focused on passing several bills with little substantive debate or notable moments. The main action was a substitute amendment to SB 298 that expanded legislative immunity and privilege.\n\n## Key Actions\n**SB 162**: Amended to clarify anesthesiologist supervision requirements\n**SB 298**: Substitute amendment added legislative immunity and privilege provisions\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Chairman Levitt explained the substitute amendment to SB 298, expanding legislative immunity and privilege\n\n## Votes\nNo recorded votes detected\n\n## Attendance\nQuorum was present, no attendance issues noted.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  }
]