[
  {
    "video_id": "1UjmmAbD5mo",
    "url": "https://youtu.be/1UjmmAbD5mo?t=187",
    "title": "Georgia House - Day 12 (2026-02-05)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 12,
    "video_date": "2026-02-05",
    "duration_minutes": 79,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview**:\nThe session included a morning prayer by Pastor Chris Gaffey, who spoke about the faith and leadership of George Washington. No substantive legislation was discussed.\n\n**Bills Introduced (First Reading)**:\nNone detected\n\n**Notable Moments**:\n- Pastor Chris Gaffey was introduced by Rep. Gerald Green and gave a speech about George Washington's faith and leadership.\n- Rep. Prince told Gaffey to ignore the time limits on his remarks.\n\n**Votes**:\nNo recorded votes\n\n**Attendance**:\nThe Speaker called all members to the floor for the morning roll call.\n\n**Adjournment**:\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "C-QrVR4LrRI",
    "url": "https://youtu.be/C-QrVR4LrRI?t=636",
    "title": "Georgia House - Day 40 (2026-04-04)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": "2026-04-04",
    "duration_minutes": 138,
    "summary": "## Georgia House - Day 40 AM Session (April 4, 2026)\n\n### Overview\nOpening morning session of the final day (Day 40) of the 2026 legislative session. Heavy focus on morning orders, recognitions, and beginning bill passage.\n\n### Key Legislation Passed\n- **HB 582**: Allows abuse victims to present evidence in defense; includes HB 384 defining police oath violations as felonies/high aggravated misdemeanors\n- **HB 266**: Major veterans tax relief - virtually eliminates state income tax on veteran retirement income; includes police foundation tax credits\n- **HR 7**: Road naming resolution honoring George A. Seat True Locke Jr. (amended to add HR 328 for Chief Jeffrey E. Turner I-75 dedication)\n\n### Morning Orders & Recognitions\n- **Pastor Jay Williams** (Chaplain): Reflected on significance of 40-day sessions, compared to biblical 40-day periods\n- **Rep. Stetson**: Thanked colleagues for support during cancer treatment; recognized new Macon County Sheriff Carlo Spelton\n- **Spelman College Glee Club**: Celebrated 100th anniversary\n- **Kindle Ray Johnson**: Recognized as youngest certified farmer in the USA\n- **Ocarian Dwight Perry Memorial**: Ice cream truck safety legislation (HR) in his memory\n\n### Announcements\n- Rules Committee meeting at 1:30 PM (Room 341)\n- Intergovernmental Coordination Committee in Room 406\n- First Annual Sine Die Block Party in Liberty Plaza (1-6 PM)\n\n### Session Notes\n- Final day atmosphere with celebrations and recognitions\n- Multiple family visitors in gallery for Sine Die"
  },
  {
    "video_id": "uwaVfaHfzwM",
    "url": "https://youtu.be/uwaVfaHfzwM?t=1706",
    "title": "Georgia House - Day 40 (2026-04-04)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": "2026-04-04",
    "duration_minutes": 213,
    "summary": "## Georgia House - Day 40 PM Session Part 1 (April 4, 2026)\n\n### Overview\nAfternoon session continuing the final day of the 2026 legislative session. Marathon session with extensive bill passage and conference committee reports.\n\n### Key Legislation\nThis session included passage of numerous bills through Senate substitutes and conference committee agreements, including:\n\n- Tax and budget-related measures\n- Education policy updates\n- Healthcare regulations\n- Criminal justice reforms\n- Local government bills\n\n### Session Characteristics\n- Fast-paced voting on final bills\n- Multiple conference committee reports\n- Senate substitute agreements\n- Sine Die preparations\n\n### Notes\n- Part 1 of the extended afternoon/evening session\n- Members working through backlog of legislation before midnight deadline"
  },
  {
    "video_id": "__j1Tuf4wKU",
    "url": "https://youtu.be/__j1Tuf4wKU?t=1038",
    "title": "Georgia House - Day 40 (2026-04-04)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": "2026-04-04",
    "duration_minutes": 227,
    "summary": "## Georgia House - Day 40 PM Session Part 2 (April 4, 2026)\n\n### Overview\nLate evening session completing the final day (Sine Die) of the 2026 Georgia legislative session.\n\n### Key Actions\n- Final passage of remaining conference committee reports\n- Last-minute amendments and bill reconciliations\n- Closing speeches and recognitions\n- Sine Die adjournment proceedings\n\n### Sine Die Traditions\n- Final recognitions of departing members\n- Thank you speeches to staff and leadership\n- Ceremonial closing of the session\n\n### Session Characteristics\n- Extended session pushing toward midnight deadline\n- Historic legislation finalized\n- 2026 session officially concluded\n\n### Notes\n- Marks end of 40-day legislative session\n- Members return to districts until next session"
  },
  {
    "video_id": "N7E6qiANoVU",
    "url": "https://youtu.be/N7E6qiANoVU?t=1393",
    "title": "Georgia House - Day 1 (2026-01-10)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 1,
    "video_date": "2026-01-10",
    "duration_minutes": 51,
    "summary": "## Georgia House of Representatives - Day 1, 2022 Session (January 10, 2022)\n\n### Overview\nOpening day of the 2022 legislative session, notable for coinciding with the Georgia Bulldogs' national championship football game.\n\n### Key Actions\n- **HR 568**: Notified Senate that House has convened\n- **HR 569**: Called joint session for Governor's address (scheduled for Thursday at 10:45 AM)\n- **HR 570**: Established session schedule - out Tuesday (Jan 11), reconvene Wednesday at 11 AM, Thursday/Friday at 10 AM, then budget hearing recess\n\n### Bills Introduced (First Reading)\n- **HB 843**: Property tax exemptions amendment\n- **HB 846-849**: Traffic/road safety and child abuse reporting\n- **HB 850**: Holiday observances\n- **HB 851-853**: Inmate policies and detention conditions\n- **HB 854**: Incorporation of City of Buckhead\n- **HR 529**: National Park Services concerns\n\n### Notable Moments\n- Rep. West Cantrell (term-limited after 8 years) delivered scripture reading from Romans 12\n- Multiple references to Georgia Bulldogs championship game that evening\n- Birthday recognitions: Rep. Karen Bennett, Rep. Betsy Holland, Rep. Beth Camp, Rep. Wiltson, Rep. Derek Jackson\n\n### Attendance\nFull session, journal confirmed without objection.\n\n### Adjournment\nAdjourned until Wednesday, January 12th at 11 AM to accommodate championship celebrations."
  },
  {
    "video_id": "O1Uf8jr9m48",
    "url": "https://youtu.be/O1Uf8jr9m48",
    "title": "Georgia House - Day 2 (2026-01-12)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-01-12",
    "duration_minutes": 56,
    "summary": "## Georgia House of Representatives - Day 2, 2022 Session (January 12, 2022)\n\n### Overview\nSecond day of the 2022 session, the morning after Georgia Bulldogs' national championship victory. Session opened with championship game highlights played in the chamber.\n\n### Key Actions\n- **SR 362**: Joint resolution notifying Governor that General Assembly has convened (adopted)\n- Committee of Notification appointed (8 members including Rep. Meeks, Rep. Bonner, Chairman Hogan)\n\n### Bills Introduced (First Reading)\n- **HB 870-874**: Local bills for Bullock County Board of Commissioners, Bullock County Board of Education, Bibb County redistricting\n\n### Morning Orders & Memorials\n- **Officer Ricky Tottenson**: Moment of silence for Newton Police Department officer (18-year veteran, school resource officer known as \"Officer T\") who died in the line of duty\n- Coweta delegation presented the memorial\n\n### Announcements\n- **Local Redistricting**: Chairman Tankersley reminded members about January 7th memo on local redistricting procedures; bills affecting 2022 elections should pass by first week of February\n- **Senator Cleveland Memorial**: Originally scheduled for Friday, postponed to April\n- **Keep Georgia Wild Day**: Scheduled for January 13th in the rotunda at 9 AM with Governor and conservation groups\n- **State of the State**: Governor's address scheduled for Thursday, January 13th\n\n### Notable Moments\n- Championship game celebration video played at session opening\n- Speaker joked about Rep. Gullet attending a different bowl game (and losing)\n- Birthday recognition: Chairman Jan Tankersley\n\n### Adjournment\nAdjourned until Thursday, January 13th at 10 AM (State of the State day)."
  },
  {
    "video_id": "Opnroz_3VX8",
    "url": "https://www.youtube.com/watch?v=Opnroz_3VX8",
    "title": "3/22/23 - Committee on Public Safety",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 17,
    "summary": "Overview:\nThis Georgia Senate Committee on Public Safety session focused on discussing and debating House Bill 348, which aims to update school camera laws in the state. The committee heard testimony and made amendments to the bill before potentially moving it forward.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\nNone detected\n\nNotable Moments:\n- The committee chair thanked various staff and support personnel for their work in facilitating the committee meetings.\n- The chair noted that House Bill 301, related to the \"Protecting Victims and Dismantling Georgia Street Gangs Act\", would not be discussed again as it had already passed through the Senate.\n- The chair walked through the various sections of the substitute version of House Bill 348, explaining the changes and rationale behind them.\n\nVotes:\nNo recorded votes detected\n\nAttendance:\nQuorum present, though the chair noted the absence of the bill's sponsor, Rep. Collins, at the start of the discussion.\n\nAdjournment:\nNot specified, but this was noted as the last public safety committee meeting of the year."
  },
  {
    "video_id": "foz1_B8PvUg",
    "url": "https://youtu.be/foz1_B8PvUg",
    "title": "Georgia House - Day 11 (2026-02-04)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 11,
    "video_date": "2026-02-04",
    "duration_minutes": 67,
    "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**:\nThe session focused on a prayer and scripture reading by the chaplain, Dr. Aaron Minnecoff, who reflected on the futility of human work and the importance of the gospel message of salvation through Jesus Christ.\n\n**Key Actions**: \nNo specific bills or legislative actions were detected in the transcript.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- The chaplain, Dr. Minnecoff, gave a thought-provoking sermon reflecting on the temporary nature of human accomplishments and the need for salvation through Jesus Christ.\n- Dr. Minnecoff shared personal anecdotes about his time working as a legislative aide and the sting of disappointment in politics and life.\n\n**Votes**:\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**:\nThe speaker called for all members to be present on the floor, indicating a quorum was expected.\n\n**Adjournment**:\nThe transcript does not include details on the adjournment or the next scheduled session."
  },
  {
    "video_id": "YqvcHC29R2Y",
    "url": "https://youtu.be/YqvcHC29R2Y",
    "title": "Georgia House - Day 2 (2026-01-12)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-01-12",
    "duration_minutes": 39,
    "summary": "Here is a summary of the Georgia House session from January 12, 2026:\n\n**Overview:** The session began with a focus on COVID-19 precautions, as the Speaker noted that 74 members had failed to get tested as required. The remainder of the session was largely routine, with the reading of the previous day's journal, establishment of the order of business, and introduction of new bills.\n\n**Key Actions:**\n- No significant legislation was passed or referred during this session.\n\n**Bills Introduced (First Reading):**\n- No new bills were introduced.\n\n**Notable Moments:**\n- The Speaker scolded members for failing to get tested for COVID-19 as required, emphasizing the need to keep themselves and others safe.\n- Bishop Frederick Williams of Albany delivered the opening prayer, sharing his personal experience with the pandemic's impact on his church community.\n\n**Votes:** \n- No recorded votes took place.\n\n**Attendance:**\n- The Speaker noted concerns about quorum, indicating that some members had not reported to the floor as required.\n\n**Adjournment:**\n- The session adjourned, with no specific next session date provided."
  },
  {
    "video_id": "ui0SCs8gtjs",
    "url": "https://youtu.be/ui0SCs8gtjs?t=824",
    "title": "Georgia House - Day 7 (2026-01-28)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 7,
    "video_date": "2026-01-28",
    "duration_minutes": 130,
    "summary": "Here is a summary of the Georgia House session on 2026-01-28:\n\n**Overview**\nThe session focused on procedural matters, with the chaplain providing an inspirational message and the House confirming the previous day's journal. No substantive legislation was discussed.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Prayer and scripture reading by Pastor Dawn Hadaway\n- Pledge of Allegiance\n- Recognition of the House physician, Dr. Erica Gibson\n\n**Votes**\nNone recorded.\n\n**Attendance**\nA quorum was present, as all members voted to signify their attendance.\n\n**Adjournment**\nThe session adjourned after the standard procedures. The next session date was not provided."
  },
  {
    "video_id": "Zar0UlYDkNY",
    "url": "https://www.youtube.com/watch?v=Zar0UlYDkNY",
    "title": "Senator Parent & Senator Harrell Press Conference | Donna's Law",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Here is a structured markdown summary of the Georgia Senator Parent & Senator Harrell Press Conference on Donna's Law:\n\n**Overview**\nThis press conference focused on the introduction of SB 522, known as \"Donna's Law\", which would allow individuals to voluntarily place themselves on a \"do not sell\" list to prevent them from purchasing firearms during periods of suicidal ideation. The law is named after Katrina Breeze's mother, Donna, who died by suicide after impulsively purchasing a firearm. The senators and advocates highlighted the rising rates of suicide by firearm in Georgia and the need for this type of preventative measure.\n\n**Key Actions**\n**SB 522**: Donna's Law - Creates a process for individuals to voluntarily suspend their ability to purchase firearms during periods of suicidal thoughts.\n\n**Bills Introduced (First Reading)**\n- SB 522: Donna's Law\n\n**Notable Moments**\n- Katrina Breeze shared the tragic story of her mother's suicide and how Donna's Law could have saved her life.\n- Chelsea Piot, from the American Foundation for Suicide Prevention, spoke as a suicide loss survivor and in support of the bill.\n- The senators emphasized the bipartisan nature of the legislation and their hope to gain broad support.\n\n**Votes**\nNo votes were taken, as this was an introductory press conference for the bill.\n\n**Attendance**\nQuorum was not mentioned.\n\n**Adjournment**\nThe press conference concluded, but no next session date was provided."
  },
  {
    "video_id": "69_LcFetNAc",
    "url": "https://youtu.be/69_LcFetNAc",
    "title": "Georgia House - Day 31 (2026-03-11)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 31,
    "video_date": "2026-03-11",
    "duration_minutes": 54,
    "summary": "Overview:\nThe key highlights of this Georgia House session include a heartfelt speech by Pastor Fred Goodwin, a Naval Academy graduate and longtime minister, who shared his personal story of faith and calling. No major legislative actions were reported in the transcript.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Rep. Brad Thomas introduced Pastor Fred Goodwin, who shared his powerful testimony about his journey from the Naval Academy to ordained ministry. Goodwin spoke about a pivotal moment when he faced a life-threatening situation flying a military mission and turned to his faith.\n- Goodwin encouraged the representatives to seek their true purpose and calling in life, beyond just pursuing personal goals and accolades.\n\nVotes:\nNone recorded.\n\nAttendance:\nThe session began with a quorum call and members reporting to their seats.\n\nAdjournment:\nNo specific adjournment time was provided. The transcript ends after Pastor Goodwin's remarks."
  },
  {
    "video_id": "l9g20G5mDDg",
    "url": "https://youtu.be/l9g20G5mDDg",
    "title": "Georgia House - Day 3 (2026-01-15)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 3,
    "video_date": "2026-01-15",
    "duration_minutes": 67,
    "summary": "Here is a summary of the Georgia House session on 2026-01-15:\n\n**Overview**:\nThe session featured an invocation and remarks from Pastor Michael Jackson, who encouraged the representatives to make a difference in their communities and work together in unity. There were no substantive bills or votes detected in the transcript.\n\n**Key Actions**: \nNone detected.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- Pastor Michael Jackson delivered an invocation and remarks emphasizing the importance of making a difference, working in unity, and developing future leaders.\n- Representative Demetrius Douglas introduced Pastor Jackson.\n\n**Votes**:\nNone detected.\n\n**Attendance**:\nThe transcript indicates that a quorum was present, as all members were asked to report to the chamber floor and vote to signify their attendance.\n\n**Adjournment**:\nThe transcript does not explicitly state when the session was adjourned or when the next session would be held."
  },
  {
    "video_id": "XQ9HEtaf79o",
    "url": "https://www.youtube.com/watch?v=XQ9HEtaf79o",
    "title": "Two Senate leaders. Two parties. One session ahead.  | Lawmakers 2026",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Senate leaders discussion:\n\n### Overview\nThe Senate leaders from both the Republican and Democratic parties discussed their priorities and legislative agenda for the upcoming 2026 session, with a focus on addressing the rising cost of living, improving quality of life, and investing in the next generation.\n\n### Key Actions\n**SB 390**: Bill to limit the ability of the National Guard from other states to enter Georgia without the governor's permission.\n\n### Bills Introduced (First Reading)\nNone mentioned.\n\n### Notable Moments\n- Republican Senate President Pro Tempore Larry Walker outlined GOP priorities around eliminating state income tax on lower incomes, capping property tax increases, and protecting land for outdoor recreation.\n- Democratic Senate Minority Leader Harold Jones highlighted Democratic priorities like Medicaid expansion, health insurance premium tax credits, and limiting private equity firms from purchasing too many homes.\n- Both leaders emphasized a focus on affordability and improving the quality of life for Georgians.\n\n### Votes\nNone recorded.\n\n### Attendance\nNo quorum notes provided.\n\n### Adjournment\nNo adjournment details given."
  },
  {
    "video_id": "8VyoojVUnig",
    "url": "https://www.youtube.com/watch?v=8VyoojVUnig",
    "title": "11/30/23  Senate Committee on Reapportionment & Redistricting",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 101,
    "summary": "Here is a structured markdown summary of the Georgia 11/30/23 Senate Committee on Reapportionment & Redistricting session:\n\n**Overview:** The session focused on the minority leader presenting the Democratic proposal for redrawing the Senate's legislative map in accordance with the federal court order and the Voting Rights Act. There was debate and discussion around public comments and the process for the new map.\n\n**Key Actions:**\n- **SB 4:** Proposed Democratic map for Senate redistricting\n\n**Bills Introduced (First Reading):** None mentioned\n\n**Notable Moments:**\n- Minority leader presented the Democratic proposal, arguing it complies with the court order and Voting Rights Act, unlike the Republican proposal\n- Debate over whether to allow public comments on the new map or just rely on yesterday's comments\n- Committee members discussed the timeline of map releases and when the public had opportunity to comment\n\n**Votes:** No recorded votes mentioned\n\n**Attendance:** Quorum present, committee members debating the process\n\n**Adjournment:** Not specified, likely continuing to next session"
  },
  {
    "video_id": "ARse0ysUJ6k",
    "url": "https://www.youtube.com/watch?v=ARse0ysUJ6k",
    "title": "6/13/23- Senate Committee on Retirement",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 36,
    "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Retirement session from June 13, 2023:\n\n**Overview**\nThis session focused on reviewing Senate Bill 328, which makes several updates to the Police Officer's Annuity and Benefit (POAB) fund in Georgia. The goal is to modernize the fund and improve some member benefits, while maintaining the fund as self-funded by member dues rather than state tax dollars.\n\n**Key Actions**\n**SB 328**: Updates the POAB fund, including increasing member dues, expanding buyback options, and increasing death benefits.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Senator Albert provided an overview of the POAB fund and the key changes in SB 328.\n- Senators asked questions about the impact on membership, the actuarial study process, and potential equity with other public safety death benefits.\n- Homer Bryson, the POAB fund leader, provided context on the current membership and financial status of the fund.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, with the committee chairman and several senators participating.\n\n**Adjournment**\nThe committee took no final action and did not set a date for a future session."
  },
  {
    "video_id": "57R9OIVuQvg",
    "url": "https://www.youtube.com/watch?v=57R9OIVuQvg",
    "title": "Lawmakers Day 29 03/20/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a summary of the Georgia Lawmakers Day 29 03/20/25 session:\n\n**Overview**: The session had a relatively mellow mood, with a notable visit from a Nigerian queen promoting her Elevate Africa non-profit. The legislature passed a banking cleanup bill and discussed effects of the Trump administration on the VA. They also prepared for a trout fishing event.\n\n**Key Actions**:\n- **HB-15**: Bill that adds cleanup language to banking and financial laws, passed 46-1.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- Visit from Queen Allori Atuache III of the Warri Kingdom in Nigeria, who promoted the Elevate Africa non-profit.\n- Lawmakers condemned proposed federal job cuts at the VA, which could impact veterans.\n- Lawmakers celebrated the success of the Municipal Electric Authority of Georgia.\n- Preparations for the Georgia Legislative Sportsman's Caucus trout fishing event.\n\n**Votes**:\n- HB-15 passed 46-1.\n\n**Attendance**: No quorum notes.\n\n**Adjournment**: No adjournment time or next session date provided."
  },
  {
    "video_id": "qGbz7-sJq9o",
    "url": "https://www.youtube.com/watch?v=qGbz7-sJq9o",
    "title": "Capitol Report Day 37 03/28/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 2,
    "summary": "Here is a summary of the Georgia Capitol Report Day 37 03/28/25 session:\n\n**Overview**:\nThe session featured disagreements over a judicial pay raise bill and the state budget, with the Senate making changes to the House version that the House did not support. Key legislation was passed, including a bill increasing penalties for fentanyl trafficking and protections for in vitro fertilization.\n\n**Key Actions**:\n**HB68**: Fiscal Year 2026 state budget bill, passed Senate with changes from House version\n\n**Bills Introduced (First Reading)**:\nNone noted\n\n**Notable Moments**:\n- Debate over Senate amendment to judicial pay raise bill that added increases for governor and other state leaders\n- Discussion of federal funding changes impacting state budget\n\n**Votes**:\n- HB68 (state budget): Passed Senate 48-7\n\n**Attendance**:\nQuorum present\n\n**Adjournment**:\nSession adjourned, with next week being the final week of the legislative session."
  },
  {
    "video_id": "zySE0A-HO4A",
    "url": "https://www.youtube.com/watch?v=zySE0A-HO4A",
    "title": "Joint Appropriations Special Session PM - January 22, 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 111,
    "summary": "Here is a summary of the Georgia Joint Appropriations Special Session PM - January 22, 2026 session:\n\n**Overview**: The session focused on the amended FY26 budget and FY27 budget for the Georgia Department of Natural Resources (DNR). The Commissioner provided updates on various DNR programs and initiatives, and outlined key budget requests across the agency's divisions.\n\n**Key Actions**:\n- No bills passed or referred\n\n**Bills Introduced (First Reading)**: None detected\n\n**Notable Moments**:\n- Commissioner Raven provided updates on the Feral Hog Down Awards Program, which has resulted in the removal of over 12,000 feral hogs from Georgia's landscape.\n- The Commissioner discussed the growth of the Hunters for the Hungry program, which has provided over 106,000 pounds of donated venison to food banks across the state.\n- The Commissioner outlined several budget requests, including $500,000 to replace the coastal resources database, $1.25 million for erosion control at Cricket River State Park, and $5 million for a road paving project on Sapelo Island.\n\n**Votes**: No recorded votes\n\n**Attendance**: Quorum present, no notes on attendance issues\n\n**Adjournment**: The session adjourned, with no mention of the next scheduled meeting."
  },
  {
    "video_id": "6pN071XFL5w",
    "url": "https://www.youtube.com/watch?v=6pN071XFL5w",
    "title": "Conference Committee HB189 (Pt. 2) - 3/29/23",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a structured markdown summary of the Georgia Conference Committee HB189 (Pt. 2) - 3/29/23 session:\n\n## Overview\nThis session focused on discussions around HB189, a bill related to agriculture transportation regulations. The key points of debate centered around the radius for farm vehicle operations, the role of local law enforcement in enforcement, and provisions related to fines and fees.\n\n## Key Actions\nNo specific bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representatives engaged in discussions around the appropriate radius for farm vehicle operations, with 120 miles being proposed to align with federal FMAP program.\n- There was debate over the role of local law enforcement in enforcement, with some wanting to limit or sunset their involvement, while others argued it was important to have that option.\n- Concerns were raised about \"policing for profit\" and ensuring that any fines or fees went to the state treasury rather than local jurisdictions.\n- Amendments were discussed to include the transportation of agriculture finished goods in the bill's provisions.\n\n## Votes\nNo recorded votes were detected in the transcript.\n\n## Attendance\nThe transcript does not provide information on quorum or attendance.\n\n## Adjournment\nThe timing of adjournment and the date of the next session are not specified in the transcript."
  },
  {
    "video_id": "yS7g9Ghc_cI",
    "url": "https://www.youtube.com/watch?v=yS7g9Ghc_cI",
    "title": "Capitol Report Day 34 03/21/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 34,
    "video_date": null,
    "duration_minutes": 2,
    "summary": "## Overview\n\nThe Georgia legislature session focused on the debate and passage of Senate Bill 68, a controversial tort reform bill that included an exception for victims of human trafficking. The session featured a failed amendment to extend protections to children and the elderly, as well as concerns raised by a Republican senator about the bill being an \"insurance company bailout.\"\n\n## Key Actions\n\n**SB 68**: Tort reform bill, passed 34-21.\n\n## Bills Introduced (First Reading)\n\nNo new bills were introduced.\n\n## Notable Moments\n\n- Attempted amendment to extend protections to children and the elderly failed.\n- Senator Colton Moore, a Republican, criticized the bill as an \"insurance company bailout\" with no guarantees of lower rates.\n- Governor Brian Kemp praised the legislature's work on the \"tough issue.\"\n\n## Votes\n\n**SB 68**: Passed 34-21.\n\n## Attendance\n\nNo quorum issues noted.\n\n## Adjournment\n\nLawmakers will return on Tuesday for day 35 of the session."
  },
  {
    "video_id": "4I9ZOMshGEo",
    "url": "https://www.youtube.com/watch?v=4I9ZOMshGEo",
    "title": "Georgia Senate 2026 - Day 10 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 10,
    "video_date": null,
    "duration_minutes": 232,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 10 AM Session:\n\n**Overview:**\nThis session focused on the introduction of several new bills and resolutions in the Georgia Senate. There were no major pieces of substantive legislation passed, but the session included routine procedures, recognitions of guests, and a morning devotion.\n\n**Key Actions:**\n- **SB 438**: To amend the Official Code of Georgia related to education\n- **SB 439**: To amend the Official Code of Georgia related to public health services\n- **SB 440**: To amend the Official Code of Georgia related to services \n- **SB 441**: To amend the Official Code of Georgia related to local government\n- **SB 442**: To amend the Official Code of Georgia related to motor vehicles\n- **SB 443**: To amend the Official Code of Georgia related to criminal offenses\n- **SR 662**: Resolution recognizing and commending Taiwan\n\n**Bills Introduced (First Reading):**\n- SB 438, SB 439, SB 440, SB 441, SB 442, SB 443\n- HR 1,008\n\n**Notable Moments:**\n- Recognition of pages serving in the Senate\n- Morning devotion led by a guest chaplain\n\n**Votes:**\nNo recorded votes.\n\n**Attendance:**\nSenators from the 7th, 12th, 28th, and 43rd districts were excused.\n\n**Adjournment:**\nThe session adjourned. The next session date was not provided."
  },
  {
    "video_id": "8jgUK_hglEs",
    "url": "https://www.youtube.com/watch?v=8jgUK_hglEs",
    "title": "Georgia Rules Meeting 2026 - Day 10 AM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 10,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a structured markdown summary of the Georgia Rules Meeting 2026 - Day 10 AM Session:\n\n## Overview\nThe session focused on discussion and consideration of several bills, including HB 350, HB 522, and HB 676. There was some debate around the merits and rationale for the bills, particularly HB 522 which dealt with COVID-19 vaccination status and organ transplant decisions.\n\n## Key Actions\n**HB 350**: Bill dealing with pre- and post-exposure medication for HIV, with limitations on pharmacist protocol and physician involvement.\n**HB 522**: Bill prohibiting the use of COVID-19 vaccination status as the sole factor in denying a patient placement on an organ transplant list.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Discussion around HB 522 and whether it appropriately balances medical professionals' expertise versus political factors around COVID-19 vaccination.\n- Acknowledgment that HB 350 was carried over from the previous year's session.\n\n## Votes\nNo recorded votes were taken during this session.\n\n## Attendance\nA quorum was present, though some members were delayed due to inclement weather.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "ahqzlH7Z0xQ",
    "url": "https://youtu.be/ahqzlH7Z0xQ?t=1188",
    "title": "Georgia House - Day 2 (2026-11-30)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-11-30",
    "duration_minutes": 64,
    "summary": "Overview:\nThis Georgia House session on November 30, 2026 featured a routine opening with prayer, Pledge of Allegiance, and quorum call. The session did not appear to include any substantive legislative actions, with the bulk of the time focused on administrative matters and special recognitions.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- The session opened with a prayer delivered by Reverend Farge Dickey, who had a personal connection to one of the House members. \n- The House recognized the Georgia Building Authority's work on a capital building painting project over the summer, which allowed the building to remain open to the public during renovations.\n- A special video presentation was shown highlighting the painting project.\n\nVotes: None detected.\n\nAttendance: A quorum was established through the morning roll call vote.\n\nAdjournment: The transcript does not indicate when the session adjourned. The next session date was also not provided."
  },
  {
    "video_id": "3fEwvzbRVVM",
    "url": "https://www.youtube.com/watch?v=3fEwvzbRVVM",
    "title": "Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections",
    "chamber": null,
    "session_type": "regular",
    "day_number": 2,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections session:\n\n## Overview\nThis session focused on legislation related to income taxes, property taxes, and immigration enforcement. Senate Republicans announced their priorities for the 2026 legislative session, while Senate Democrats proposed bills aimed at regulating ICE agents in Georgia.\n\n## Key Actions\n- **SB 204**: Originally a Democratic bill from 2025 that allowed certain non-violent felonies to be charged by district attorneys without the involvement of a grand jury. The bill was amended to include language from SB 163, which would allow individual gun owners to bring legal action against local governments who they feel infringed on their second amendment rights.\n- **SB 389**: Proposed by Senate Democrats, would require ICE agents to remove their masks and properly identify themselves during arrests.\n- **Proposed Bills**: Democrats also proposed bills to allow civil lawsuits against ICE and require a warrant for arrests in schools, hospitals, and churches.\n\n## Bills Introduced (First Reading)\n- SB 390: Proposed by Senate Democrats, would require legislative approval for National Guard deployment in Georgia.\n- SB 192: Not mentioned in the transcript, but likely introduced during the session.\n\n## Notable Moments\n- Senate Democrats held a press conference to announce their legislation affecting immigration enforcement, calling for ICE agents to \"unmask\" and be held accountable.\n- Republican lawmakers criticized the Democrats' proposed bills, saying they were unnecessary and that law enforcement leaders should make decisions about tactical gear, not legislators.\n\n## Votes\n- SB 204 was adopted by substitution in a 32-21 party-line vote, but failed to garner the two-thirds majority needed to be sent immediately to the Governor.\n\n## Attendance\nThe transcript does not mention any quorum or attendance issues.\n\n## Adjournment\nThe session adjourned, but the next session date is not specified."
  },
  {
    "video_id": "HUsM6BxlTi4",
    "url": "https://www.youtube.com/watch?v=HUsM6BxlTi4",
    "title": "Georgia Legislators discuss bills to ban Lab-Grown Meat and pausing Data Centers | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "Here is a summary of the key points from the Georgia legislature floor session transcript:\n\n**Overview:**\nThe discussion focused on two bills being introduced - one to ban lab-grown meat and another to pause the development of data centers in the state. There was also discussion of potential property tax reform and education funding.\n\n**Key Actions:**\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading):**\n- Bill to ban the production, distribution, and sale of lab-grown meat\n- Bill to pause the development of data centers for one year\n\n**Notable Moments:**\n- Senators discussed concerns over the public's trust in institutions and the need for more education and transparency around new technologies like lab-grown meat and data centers.\n- Senators expressed interest in pursuing property tax reform and updating the state's 40-year-old education funding formula.\n\n**Votes:**\nNo recorded votes were mentioned.\n\n**Attendance:**\nNo quorum notes were provided.\n\n**Adjournment:**\nThe transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "7lTVwCOow6M",
    "url": "https://www.youtube.com/watch?v=7lTVwCOow6M",
    "title": "Georgia Rules Meeting 2026 - Day 8 AM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 8,
    "video_date": null,
    "duration_minutes": 13,
    "summary": "Here is a structured summary of the Georgia Rules Meeting 2026 - Day 8 AM Session:\n\n**Overview:**\nThis session focused on a resolution (HR 1-008) to reorganize and streamline the regional water planning committees in Georgia. The changes aim to make the committees more efficient and responsive to emerging water management challenges.\n\n**Key Actions:**\n**HR 1-008**: Reduces the number of governor, lieutenant governor, and speaker appointees to the regional water planning councils; increases council member term lengths from 3 to 6 years; requires representation from key water use sectors.\n\n**Bills Introduced (First Reading):** None detected\n\n**Notable Moments:**\n- Opening prayer by Dean Green\n- Moment of silence to remember former Rules Committee Secretary Mandy Ballinger\n- Presentation by Rep. Smith on the rationale and details of HR 1-008\n\n**Votes:** No recorded votes\n\n**Attendance:** Quorum present to conduct business\n\n**Adjournment:** Not specified, but the session appears to be ongoing."
  },
  {
    "video_id": "hI03ViZkSGk",
    "url": "https://www.youtube.com/watch?v=hI03ViZkSGk",
    "title": "Georgia Joint Appropriations Subcommittee 2026 - Day 8 AM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 8,
    "video_date": null,
    "duration_minutes": 52,
    "summary": "Here is a summary of the Georgia Joint Appropriations Subcommittee 2026 - Day 8 AM Session:\n\n**Overview**\nThe session focused on presentations from the Georgia Department of Transportation (GDOT) and provided an update on the state's transportation budget and infrastructure costs.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The GDOT Commissioner recognized the work of GDOT employees and other state agencies in responding to recent winter weather events across Georgia.\n- The Commissioner highlighted the challenges with the federal transportation budget process, including the current continuing resolution and the potential impact of a government shutdown on project funding and delivery.\n- The Commissioner presented data on the significant inflationary pressures impacting transportation construction costs, which have increased by around 70% since 2021.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe session appeared to have a quorum, with both the Subcommittee on Appropriations Chair and the Transportation Policy Committee Chair present and participating.\n\n**Adjournment**\nThe session adjourned, with the next meeting scheduled for a later date."
  },
  {
    "video_id": "gfbb1QqRxwQ",
    "url": "https://www.youtube.com/watch?v=gfbb1QqRxwQ",
    "title": "Georgia Appropriations Subcommittee 2026 - Day 7 PM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 7,
    "video_date": null,
    "duration_minutes": 126,
    "summary": "Here is a structured summary of the Georgia Appropriations Subcommittee 2026 - Day 7 PM Session:\n\n**Overview:** The session focused on updates from the Georgia Department of Agriculture, including the ongoing response to avian influenza outbreaks, the state's hemp program, and the department's emergency management capabilities.\n\n**Key Actions:** No bills were passed or referred.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Commissioner of Agriculture Tyler Harper provided an update on the Department of Agriculture's operations, including the integration of the Rural Center under the department and efforts around the farm recovery block grant.\n- Harper highlighted the department's multi-agency coordination during the recent winter storm, with the Department of Agriculture working closely with the Georgia Forestry Commission and other agencies.\n- Harper discussed the department's focus on building out its emergency management capabilities to respond to issues impacting farms and consumers, such as avian influenza, the yellow-legged hornet, and weather events.\n- Harper provided an update on the state's hemp program, noting it generated over $2 million in revenue last year.\n\n**Votes:** No recorded votes.\n\n**Attendance:** Quorum was present, with several members arriving late from caucus meetings.\n\n**Adjournment:** The session was adjourned. The next meeting date was not specified."
  },
  {
    "video_id": "gAtw0Askd0o",
    "url": "https://www.youtube.com/watch?v=gAtw0Askd0o",
    "title": "Georgia Senate Page Program Video",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 3,
    "summary": "Overview:\nThe video provides an overview of the Georgia Senate Page Program, outlining the process for becoming a page, the duties and expectations during the legislative day, and the benefits of participating in the program.\n\nKey Actions:\nNo specific bills or legislative actions were mentioned in this informational video.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The video highlights the importance of professionalism and appropriate attire for pages, emphasizing that they are representing their school, neighborhood, and the Senate page program.\n- It also mentions the opportunity for pages to have their photo taken with the Lieutenant Governor and their sponsoring senator.\n\nVotes:\nNo votes were recorded in this session.\n\nAttendance:\nThe video does not provide any information about quorum or attendance.\n\nAdjournment:\nThe video does not mention the adjournment of the legislative session or the date of the next session."
  },
  {
    "video_id": "D56OW5qwymI",
    "url": "https://www.youtube.com/watch?v=D56OW5qwymI",
    "title": "Joint Appropriations Special Session PM - January 21, 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 229,
    "summary": "Here is a structured markdown summary of the Georgia Joint Appropriations Special Session PM - January 21, 2026 session:\n\n# Overview\nThis session focused on the Secretary of State's amended budget recommendations for fiscal years 2026 and 2027. The proposed changes aim to maintain secure elections, protect consumers, support licensed professionals, and ensure efficient agency operations.\n\n# Key Actions\n**HB 1391**: Provides funding for election integrity measures, including a one-time employee salary supplement, optical character recognition technology, a second ballot blind count, and resources for full hand recounts of two statewide elections in 2026.\n\n# Bills Introduced (First Reading)\nNone mentioned.\n\n# Notable Moments\n- The Secretary of State highlighted that Georgia runs the \"best elections in the entire country\" according to Fox News.\n- The Secretary outlined various efficiency and customer service improvements, such as reducing nursing license processing time by 62%.\n- The agency has hosted over 49 financial literacy programs, including outreach to women's prisons.\n\n# Votes\nThe proposed budget changes were voted on and passed.\n\n# Attendance\nNo specific quorum notes provided.\n\n# Adjournment\nThe session adjourned, but the next session date was not mentioned."
  },
  {
    "video_id": "Zb0-u7KOyXo",
    "url": "https://www.youtube.com/watch?v=Zb0-u7KOyXo",
    "title": "Inside the historic renovations of the Georgia Capitol Building",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nThe transcript details the extensive renovations being made to the Georgia State Capitol building, focusing on the restoration work in the House and Senate chambers. The renovations aim to preserve the historic architecture and infrastructure while modernizing key systems like HVAC, electricity, and accessibility.\n\nKey Actions:\nNo specific bills or legislation mentioned.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Detailed descriptions of the painstaking restoration work, including replastering, new HVAC systems, over 76,000 feet of new cabling, and the meticulous repainting and gilding by specialized artisan painters.\n- Mention of previous renovations under former House Speaker Tom Murphy that had to \"cut corners\" due to time constraints.\n- Emphasis on the sense of pride and ownership the Georgia-based contractors, architects, and craftspeople feel in restoring this historic state landmark.\n\nVotes:\nNone detected.\n\nAttendance:\nNo quorum notes provided.\n\nAdjournment:\nNo specific adjournment or next session date mentioned."
  },
  {
    "video_id": "Es_bsTzKmaQ",
    "url": "https://youtu.be/Es_bsTzKmaQ",
    "title": "Georgia House - Day 29 (2026-03-09)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 29,
    "video_date": "2026-03-09",
    "duration_minutes": 44,
    "summary": "Overview:\nThis Georgia House session on 2026-03-09 featured a scripture reading and prayer by the chaplain, as well as remarks highlighting the 76th anniversary of the creation of the Georgia Ports Authority. No significant legislation was discussed or voted on during this session.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The chaplain, Pastor Timothy Adams, delivered an inspirational speech focused on the importance of hope, particularly in the context of the ongoing COVID-19 pandemic and its impacts on Georgians.\n- The Speaker recognized the 76th anniversary of the creation of the Georgia Ports Authority by the Georgia General Assembly.\n\nVotes:\nNo recorded votes detected.\n\nAttendance:\nA quorum was present, as all members were instructed to report to their seats for the morning roll call.\n\nAdjournment:\nThe transcript does not provide an explicit adjournment time. The next session date is also not mentioned."
  },
  {
    "video_id": "9Bv01jEHgog",
    "url": "https://www.youtube.com/watch?v=9Bv01jEHgog",
    "title": "Joint Appropriations Special Session AM - January 20, 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 176,
    "summary": "Overview:\n- This was a Georgia Joint Appropriations Special Session on January 20, 2026. The session focused on the state budget and appropriations process, with Governor Brian Kemp providing remarks.\n\nKey Actions:\n- No specific bills were passed or referred to during this session.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Governor Brian Kemp addressed the Joint Appropriations Committee in person, highlighting his administration's economic development efforts and the importance of responsible budgeting.\n- There was some lighthearted banter between the committee members about seating arrangements.\n- The session began with an opening prayer by Chairman Gerald Green on his 44th Joint Appropriations Hearing.\n\nVotes:\n- No recorded votes took place.\n\nAttendance:\n- The transcript indicates a \"full house\" for the Joint Appropriations Committee meeting.\n\nAdjournment:\n- The transcript does not explicitly state when the session adjourned or the date of the next session."
  },
  {
    "video_id": "ajF2YMaLBHQ",
    "url": "https://www.youtube.com/watch?v=ajF2YMaLBHQ",
    "title": "Georgia Senate 2026 - Day 5 AM Session 1",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 5,
    "video_date": null,
    "duration_minutes": 51,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 5 AM Session 1 transcript:\n\n**Overview**\nThe session featured the introduction of several new bills, including SB 170. There was a brief discussion and unanimous consent to excuse certain senators, as well as the opening prayer and pledge of allegiance.\n\n**Key Actions**\n**SB 170**: No details provided on this bill.\n\n**Bills Introduced (First Reading)**\n- SB 401: Amend Part 14 of Article 6 of Chapter 2 of Title 20 related to other educational programs under the Quality Basic Education.\n- SB 402: Amend Chapter 5 of Title 49.\n- SB 403: Amend Article 5 of Chapter 12. \n- SB 404: Amend Article 1 of Chapter 9 in Title 9.\n- SB 405: Amend Code Section 15-10-2.\n- SB 406: Amend Title 4-3.\n- SB 407: Provide for a homestead exemption from Cherokee County School District ad valorem taxes.\n- SB 408: Amend an unspecified section.\n- SB 409: Unspecified subject relating to insurance and labor.\n- SB 410: Amend Part 1 of Article 1 of an unspecified section.\n- SR 579: Honor the life of Sergeant Major Transportation.\n\n**Notable Moments**\n- The Senate President welcomed a group of young girls who accompanied a senator.\n- There was a brief discussion about dispensing with the reading of the journal, which was ultimately done by unanimous consent.\n- Announcements were made about upcoming opportunities for new committee chairmanships.\n- A new senator led the chamber in the pledge of allegiance and introduction of the pastor of the day.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nThe Senate President recognized and excused several senators who were absent.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or when the next session will take place."
  },
  {
    "video_id": "0hAqZpUYsHg",
    "url": "https://www.youtube.com/watch?v=0hAqZpUYsHg",
    "title": "Property Tax Relief, State Education Improvements and Affordable Healthcare | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a structured markdown summary of the Georgia legislative session based on the transcript provided:\n\n# Georgia Property Tax Relief, State Education Improvements and Affordable Healthcare | Lawmakers 2026 Session\n\n## Overview\nThe transcript highlights the key priorities for the Georgia legislature in the 2026 session, including property tax relief, education improvements focused on childhood literacy, and efforts to address the rising costs of healthcare and health insurance.\n\n## Key Actions\nNo specific bills were mentioned in the transcript.\n\n## Bills Introduced (First Reading)\nNo bills were mentioned as being introduced.\n\n## Notable Moments\n- The House Majority Leader and House Minority Whip discussed the legislative priorities of their respective caucuses.\n- There was a focus on property tax relief, with the Republican caucus proposing the elimination of the homestead property tax statewide.\n- Education was a major priority, with a focus on improving childhood literacy and addressing issues like student loan debt.\n- The Democratic caucus pushed for Medicaid expansion, while the Republican caucus emphasized affordability and accessibility in healthcare, including efforts to grow the healthcare workforce.\n\n## Votes\nNo specific votes were mentioned in the transcript.\n\n## Attendance\nNo quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "d0MXLHcohSA",
    "url": "https://www.youtube.com/watch?v=d0MXLHcohSA",
    "title": "Georgia lawmakers debate plan to eliminate state income tax | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a structured markdown summary of the Georgia lawmakers' debate on a plan to eliminate the state income tax:\n\n## Overview\nThe Georgia Senate Special Committee on the Elimination of Georgia's Income Tax has been gathering input and developing a proposal to significantly reduce or eliminate the state income tax. The discussion centers around the details and tradeoffs of such a plan.\n\n## Key Actions\nNo specific bills or legislative actions were mentioned.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Republican Senator Blake Tillerie and Democratic Senator Nan Orrok, both members of the special committee, discussed the committee's proposals and their differing perspectives.\n- The proposals aim to eliminate income tax on the first $50,000 for individuals and $100,000 for joint filers, while reducing rates for other taxpayers.\n- Debate centered on the impact on the state budget, with concerns raised about funding critical services versus providing broad tax relief.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment or next session date provided."
  },
  {
    "video_id": "BPbePff989s",
    "url": "https://www.youtube.com/watch?v=BPbePff989s",
    "title": "Georgia House 2026 - Day 4 PM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "# Georgia House 2026 - Day 4 PM Session\n\n## Overview\nThis session featured recognitions and announcements, including honoring the legacy of Rev. Dr. Martin Luther King Jr. and a representative's grandson's birthday. There was discussion of upcoming events and committee meetings, but no substantive legislative action detected.\n\n## Key Actions\nNo bills passed or referred.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Barry gave a speech honoring the life and legacy of Rev. Dr. Martin Luther King Jr., calling on the House to legislate with justice, mercy, and humility.\n- Representative Scott recognized her grandson Lucas' 13th birthday.\n- Representative Emory Dunahoo announced he has been providing daily devotions to members, with 4 colleagues joining him, but that this will be his last year doing so.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum present, no issues noted.\n\n## Adjournment\nThe House adjourned until 10 AM on Friday, January 16th, 2026."
  },
  {
    "video_id": "MyMYT22k-d4",
    "url": "https://www.youtube.com/watch?v=MyMYT22k-d4",
    "title": "Georgia Senate 2026 - Day 4 AM Session 2",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 42,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 4 AM Session 2 session:\n\n## Overview\nThis session focused on routine proceedings, with no major legislation introduced or passed. The session featured a morning devotion led by Pastor Anthony Booker, who provided a sermon emphasizing the importance of serving a higher purpose beyond just one's day-to-day work.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\n- **SB 399**: To amend Article 3 of Chapter 11 of Title 31 of the Official Code of Georgia Annotated.\n- **SB 400**: To amend Part 1A of Article 7 of Chapter 3 of Title 20 of the Official Code of Georgia Annotated relating to non-public, post-secondary educational institutions.\n- **SR 574**: To recognize and commend the Susan Jolly Foundation and the Georgia Cancer Control Consortium.\n\n## Notable Moments\n- Pastor Anthony Booker delivered a sermon during the morning devotion, emphasizing the importance of serving a higher purpose beyond just one's day-to-day work.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe session noted the excusal of several senators, including from the 35th, 10th, and 30th districts.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session."
  },
  {
    "video_id": "gGequbr9vg4",
    "url": "https://www.youtube.com/watch?v=gGequbr9vg4",
    "title": "AI, Kids, and the Future of Tech in Georgia | Lawmakers 2026",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 10,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript on AI, Kids, and the Future of Tech in Georgia:\n\n## Overview\nThe discussion focuses on the rapid technological innovations happening in Georgia and the need to create laws that protect children, especially in relation to AI chatbots and addictive digital products targeting young users.\n\n## Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Todd Jones, chair of the House Committee on Technology and Infrastructure Innovation, discussed Georgia's efforts to be a leader in innovative technologies like air taxis, autonomous vehicles, and creative manufacturing.\n- Senator Sally Harrell, who co-chaired a Senate study committee on social media AI and children, shared concerning stories about 4th grade students accessing AI chatbots with inappropriate content on their school network.\n- Both legislators emphasized the need for guardrails and regulations to address the issues of AI chatbot companions and addictive digital product design targeting children.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "roE1b6b9xuw",
    "url": "https://www.youtube.com/watch?v=roE1b6b9xuw",
    "title": "Georgia House 2026 - Day 3 AM Session 1",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 3,
    "video_date": null,
    "duration_minutes": 53,
    "summary": "Here is a summary of the Georgia House 2026 - Day 3 AM Session 1 in structured markdown format:\n\n## Overview\nThis session focused on opening remarks and a scripture reading and prayer from the House chaplain, Rev. Benny Tate. There were no significant legislative actions taken.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Rep. Clint Crowe introduced Rev. Benny Tate, the House chaplain for the past 36 years, and shared a personal story about Rev. Tate's ministry to Crowe's family.\n- Rev. Tate gave a sermon emphasizing the importance of encouragement, noting that \"if they're breathing, they need encouragement.\"\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum present, as members responded to the morning roll call.\n\n## Adjournment\nThe session adjourned. No information provided on the next session date."
  },
  {
    "video_id": "AGS_xbmElgA",
    "url": "https://www.youtube.com/watch?v=AGS_xbmElgA",
    "title": "Georgia Senate 2026 - Day 2 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 2,
    "video_date": null,
    "duration_minutes": 61,
    "summary": "Overview:\nThe Georgia Senate session focused on the introduction of several new bills, including SB 106 and SB 204. The session featured a morning devotion and recognitions of new pages.\n\nKey Actions:\n**SB 106**: Not specified\n**SB 204**: Not specified\n\nBills Introduced (First Reading):\n- SB 379 - Relating to insurance\n- SB 380 - Relating to Article 7 of Chapter 4 of Title 49\n- SB 381 - Relating to the Quality Basic Education Act\n- SB 382 - Relating to Chapter 5 of Title 48\n- SB 383 - Relating to Chapter 15 of Title 19\n- SB 384 - Relating to Article 2 of Chapter 9 \n- SB 385 - Relating to Chapter 1 of Title 28\n- SB 386 - Relating to Title 28\n- SB 387 - Relating to Title 48\n- SB 388 - Relating to Chapter 13 of Title 36\n- SR 558 - Proposing a constitutional amendment\n- SR 560 - Reaffirming the state's position\n\nNotable Moments:\n- Recognitions of new Senate pages from Perry, Georgia\n- Morning devotion given by Rev. Tom Caruth, pastor of Perry United Methodist Church\n\nVotes:\nNo recorded votes mentioned.\n\nAttendance:\nThe senators from the 10th and 33rd districts were excused.\n\nAdjournment:\nThe transcript does not indicate when the session adjourned or the date of the next session."
  },
  {
    "video_id": "vafC9Qsf8Zo",
    "url": "https://www.youtube.com/watch?v=vafC9Qsf8Zo",
    "title": "Campaign Year, New Faces, Big Questions | Lawmakers 2026 Day 1",
    "chamber": null,
    "session_type": "regular",
    "day_number": 1,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n## Overview\nThis was the first day of the 158th session of the Georgia General Assembly. It was a busy day with lawmakers getting to work on procedural business, welcoming new members, and discussing the legislative calendar. Notable aspects include several lawmakers running for higher office during the session and a focus on affordability issues like healthcare, property taxes, and housing.\n\n## Key Actions\n**SB 30**: No details provided\n\n## Bills Introduced (First Reading)\nNo bills introduced\n\n## Notable Moments\n- Audrey Cattilla, the reigning Miss Georgia, performed with her voice and violin to start the session.\n- The Senate unanimously selected Senator Larry Walker III as the new President Pro Tempore.\n- The House debated the 2026 legislative calendar, discussing accommodations for religious holidays.\n- The House paid tribute to the late Representative Mandy Ballinger.\n- The ACLU held a \"Pack the Capitol\" event advocating for engagement between legislators and constituents.\n\n## Votes\n- The 2026 legislative calendar was approved unanimously in both chambers.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment time or next session date provided."
  },
  {
    "video_id": "d6O8fUBptpk",
    "url": "https://www.youtube.com/watch?v=d6O8fUBptpk",
    "title": "Opening Day Under the Gold Dome | Georgia House 2026 - Day 1 AM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 1,
    "video_date": null,
    "duration_minutes": 59,
    "summary": "Here is a structured markdown summary of the Georgia House 2026 - Day 1 AM Session:\n\n# Overview\nThe Georgia House of Representatives held its opening day session, focusing on recognizing the work done by the Georgia Building Authority (GBA) to renovate and restore the House chamber. Key highlights included the use of Georgia-made carpet from Dalton and the replacement of the HVAC system dating back to the 1950s.\n\n# Key Actions\nNo bills were passed or referred during this session.\n\n# Bills Introduced (First Reading)\nNo new bills were introduced.\n\n# Notable Moments\n- The House recognized Gerald Pilgrim, Deputy Executive Director and Chief of Staff of the GBA, for the team's work in renovating the chamber.\n- A video was shown highlighting the extensive renovation project, which involved over 500 employees and 400,000 man-hours of work.\n- The Speaker thanked the GBA team, the Governor, and the First Lady for their dedication and support in completing the project.\n\n# Votes\nNo recorded votes were taken.\n\n# Attendance\nThe session maintained a quorum, with members present in the chamber.\n\n# Adjournment\nThe session adjourned, with the next session date not specified."
  },
  {
    "video_id": "CIgJOffe2qQ",
    "url": "https://www.youtube.com/watch?v=CIgJOffe2qQ",
    "title": "Lawmakers Exclusive: Gov. Brian Kemp Talks with GPB on Final Day of Legislature",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nGovernor Brian Kemp discusses the conclusion of the Georgia legislative session, highlighting the passage of tort reform legislation as a key priority that was accomplished. He also expresses openness to potential insurance reform in the future, while emphasizing the need to maintain fiscal responsibility.\n\nKey Actions:\nNo specific bills were mentioned as passing or being referred.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- Governor Kemp plans to address the General Assembly to thank them for a \"great legislative session\" and the productive work done, despite some \"tough issues.\"\n- Kemp expresses satisfaction with the passage of tort reform, which he sees as critical to stabilizing the business environment and insurance market in Georgia.\n- Kemp indicates openness to potential insurance reform in the future, but emphasizes the need for transparency and fairness, as well as increased competition in the insurance market.\n- Kemp dismisses the possibility of a special legislative session to address the state budget, expressing confidence in Georgia's fiscal position and the conservative budgeting approach.\n\nVotes:\nNo specific votes were mentioned.\n\nAttendance:\nNo quorum notes were provided.\n\nAdjournment:\nThe session is ongoing, with Kemp planning to address the General Assembly later in the evening. The next session date was not specified."
  },
  {
    "video_id": "-kfrLhxRf_o",
    "url": "https://youtu.be/-kfrLhxRf_o",
    "title": "Georgia House - Day 25 (2026-03-01)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 25,
    "video_date": "2026-03-01",
    "duration_minutes": 88,
    "summary": "Here is a summary of the Georgia House session from 2026-03-01:\n\n**Overview**\nThis session featured a prayer and remarks from guest chaplain Pastor Stan Leicester, who delivered an inspirational message on the importance of leadership, vision, and culture. No specific legislation was discussed or voted on.\n\n**Notable Moments**\n- Pastor Leicester shared an anecdote about an Olympic marksman who missed his target due to a lapse in focus, emphasizing the need for leaders to maintain vision and culture.\n- He encouraged the representatives to stay engaged, make tough decisions, hold each other accountable, and work together to create a better future for Georgia.\n- Representative Casey Carpenter introduced Pastor Leicester and shared a personal story about his son signing a football scholarship.\n\n**Attendance**\nThe session began with a roll call to ensure a quorum was present.\n\n**Adjournment**\nThe session adjourned, with the next meeting date unspecified."
  },
  {
    "video_id": "-EaDY4VrnI4",
    "url": "https://youtu.be/-EaDY4VrnI4",
    "title": "Georgia House - Day 8 (2026-11-12)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 8,
    "video_date": "2026-11-12",
    "duration_minutes": 26,
    "summary": "Here is a structured markdown summary of the Georgia House session from 2026-11-12:\n\n### Overview\nThe session focused on procedural matters, including roll call, COVID-19 protocols, and confirming the previous legislative day's journal. No substantive legislation was introduced or acted upon.\n\n### Key Actions\nNone detected.\n\n### Bills Introduced (First Reading)\nNone detected.\n\n### Notable Moments\n- Opening prayer and pledge of allegiance led by Pastor Eddie Allen.\n- Representative Jay Collins introduced the chaplain and shared personal remarks about their long-standing friendship.\n- Representative Wes Cantrell, Secretary of the Committee on Information and Audits, reported the previous legislative day's journal was found to be correct.\n- The order of business for the day was established by unanimous consent.\n\n### Votes\nNo recorded votes.\n\n### Attendance\nA quorum was present, with members voting to signify their presence.\n\n### Adjournment\nThe transcript does not indicate when the session adjourned or the date of the next session."
  },
  {
    "video_id": "hp6H0TzZw4A",
    "url": "https://www.youtube.com/watch?v=hp6H0TzZw4A&list=PLIgKJe7_xdLWzQfq8TfCl8PKoQfW7VZJF&index=13",
    "title": "Georgia House - Day 33 (2026-06-18)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 33,
    "video_date": "2026-06-18",
    "duration_minutes": 0,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured the introduction of several bills, including SB 171 and SB 295, as well as discussion of procedural matters and a devotional message from a guest chaplain.\n\n## Key Actions\n**SB 171**: [No description provided]  \n**SB 295**: [No description provided]  \n\n## Bills Introduced (First Reading)\n- SB 171\n- SB 295\n\n## Notable Moments\n- Devotional message delivered by guest chaplain Dr. Don Hadaway\n- Representative LaRickia introduced Dr. Hadaway, highlighting his background and service\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nThe session began with a roll call to establish quorum.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "p79UgW1keU0",
    "url": "https://www.youtube.com/watch?v=p79UgW1keU0",
    "title": "3/22/23- Senate Committee on Agriculture & Consumer Affairs",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 78,
    "summary": "Here is a summary of the key points from the Georgia Senate Committee on Agriculture & Consumer Affairs session on 3/22/23:\n\n**Overview**:\nThe session focused on updates from the Georgia Environmental Protection Division (EPD) regarding the permitting moratorium on agricultural water withdrawals in the Lower Flint River Basin. The EPD also discussed a project to convert surface water withdrawals to deeper groundwater sources in the basin.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- The EPD representative, Cliff Lewis, provided an overview of the permitting moratorium implemented in 2012 to assess water resources in the Lower Flint River Basin. This was done to protect existing water users and evaluate potential impacts.\n- Lewis discussed the $49.8 million \"Agricultural Water Source Conversion for Streamflow Resilience\" project, funded by the American Rescue Plan Act. This project aims to convert surface water withdrawals to deeper groundwater sources during drought periods to better protect surface waters.\n\n**Votes**:\nNone recorded.\n\n**Attendance**:\nNo explicit quorum notes.\n\n**Adjournment**:\nThe transcript does not provide information on when the session was adjourned or when the next session will be."
  },
  {
    "video_id": "KMNFRisz5i0",
    "url": "https://www.youtube.com/watch?v=KMNFRisz5i0",
    "title": "Georgia Senate 2026 - Day 7 PM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 7,
    "video_date": null,
    "duration_minutes": 109,
    "summary": "Here is a summary of the Georgia Senate 2026 - Day 7 PM Session:\n\n**Overview**:\nThe session included the introduction of several new bills, reports from Senate committees, and procedural matters. Notable was the suspension of a rule to allow assignment of a gubernatorial appointment to a committee.\n\n**Key Actions**:\n- **SB 411**: Bill to amend Title 43 related to professional services\n- **SB 412**: Bill to amend education code related to Part 4 of Article 17 of Chapter 2 of Title 20\n- **SB 605**: Bill introduced (first reading)\n- **SR 605**: Resolution introduced (first reading)\n\n**Bills Introduced (First Reading)**:\n- SB 411-420, SR 584, SR 593\n\n**Notable Moments**:\n- Suspension of Senate Rule 3-3.1A to allow assignment of a gubernatorial appointment to the Judicial Qualifications Commission\n- Morning devotion led by the Rules Committee Chairman\n\n**Votes**:\nNone recorded.\n\n**Attendance**:\nThe Senate granted unanimous consent to excuse several senators from the session.\n\n**Adjournment**:\nThe transcript does not include the time of adjournment or the date of the next session."
  },
  {
    "video_id": "N0VzeBPNyeQ",
    "url": "https://www.youtube.com/watch?v=N0VzeBPNyeQ",
    "title": "State of the State Special I 2026 Lawmakers Day 4",
    "chamber": null,
    "session_type": "regular",
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 57,
    "summary": "Here is a structured markdown summary of the Georgia State of the State Special I 2026 Lawmakers Day 4 session:\n\n**Overview**\nThe session featured Governor Brian Kemp's final State of the State address, where he highlighted accomplishments from his two terms, outlined policy priorities, and reflected on his time in office. The speech was followed by the Democratic response.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Governor Kemp reflected on his time as governor, stating it has been an \"incredible honor\" to serve as Georgia's first family. \n- Kemp announced a new need-based scholarship program, the \"Dream Scholarship,\" garnering cheers from the audience.\n- Kemp touted several tax relief measures implemented during his tenure, including over $3.2 billion in one-time tax relief.\n- Kemp closed his speech by reciting a hymn verse about doing great work even in small places.\n- After the address, Democrats praised some aspects like the new scholarship but criticized a lack of focus on healthcare.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nNo quorum issues were noted.\n\n**Adjournment**\nThe session adjourned, with lawmakers scheduled to return the next day for a ceremony honoring Martin Luther King Jr."
  },
  {
    "video_id": "Il02n4GrVkg",
    "url": "https://www.youtube.com/watch?v=Il02n4GrVkg",
    "title": "Georgia Senate 2026 - Day 3 AM Session 2",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 3,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a summary of the Georgia Senate 2026 - Day 3 AM Session 2 session:\n\n**Overview**: This was a routine morning session with no major legislative actions taken. The focus was on excusing absences and a prayer by the chaplain.\n\n**Bills Introduced (First Reading)**: \n- **SB 389**: Amend Code on General Provisions\n- **SB 390**: Amend Code on Homeland Security  \n- **SB 391**: Amend Code on Criminal Offenses\n- **SB 392**: Amend Code on Public Officers and Employees\n- **SB 393**: Amend Code on Property\n- **SB 394**: Amend Code on Motor Vehicles and Traffic\n- **SB 395**: Amend Code on Health\n- **SB 396**: Amend Code on Judiciary\n- **SB 397**: Amend Code on Judiciary  \n- **SB 398**: Amend Code on Crimes and Offenses\n- **SR 563**: Urge Georgia Secretary of State to comply with DOJ voter registration request\n- **SR 567**: Express support for Willie Syndrome awareness day\n\n**Notable Moments**:\n- Chaplain Reverend Britt Madden gave the morning prayer, discussing stories about Admiral Rickover and President Kennedy.\n\n**Attendance**:\n- Several senators were excused for business inside and outside the Capitol.\n\n**Adjournment**:\nThe session adjourned, with no next session date provided."
  },
  {
    "video_id": "y6Ut8sb7H2c",
    "url": "https://www.youtube.com/watch?v=y6Ut8sb7H2c",
    "title": "Opening Day at the Capitol | Georgia Senate 2026 - Day 1 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 1,
    "video_date": null,
    "duration_minutes": 100,
    "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 1 AM Session:\n\n**Overview**\nThe opening day of the 2026 Georgia legislative session featured a stirring invocational speech by Senator Benny Hinn, emphasizing the importance of encouragement and praising the legislators for their service to the state.\n\n**Key Actions**\n- **HR 998**: Resolution\n- **SB 204**: Bill\n- **SR 557**: Resolution\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Senator Benny Hinn delivered a heartfelt speech on the importance of encouragement, drawing from biblical passages and personal anecdotes.\n- Senator Hinn recognized the sacrifices made by the legislators' families in serving the state.\n- The session included a recognition of a distinguished physician in attendance.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present.\n\n**Adjournment**\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "jPOO3BgtSn4",
    "url": "https://www.youtube.com/watch?v=jPOO3BgtSn4",
    "title": "Georgia House 2026 - Day 8 AM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 8,
    "video_date": null,
    "duration_minutes": 89,
    "summary": "Overview:\n- This session focused on procedural matters, with no notable legislation discussed. The session began with a prayer and Pledge of Allegiance, followed by introductions and routine business.\n\nKey Actions:\n- No bills passed or referred.\n\nBills Introduced (First Reading):\n- No new bills introduced.\n\nNotable Moments:\n- Prayer delivered by Pastor George Dillard, who spoke about the importance of focusing on essentials and not getting bogged down by unnecessary burdens.\n- Introduction of the House doctor of the day, Dr. John Pittman.\n\nVotes:\n- No recorded votes.\n\nAttendance:\n- Quorum present, with all members voting to signify their attendance.\n\nAdjournment:\n- No specific adjournment time noted, but the session appears to have continued after the events summarized."
  },
  {
    "video_id": "cP1YkqIhrBQ",
    "url": "https://www.youtube.com/watch?v=cP1YkqIhrBQ",
    "title": "Lawmakers Day 31 03/13/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 31 03/13/25 session:\n\n**Overview:**\nThe session featured a mix of lighthearted debates on bills designating official state colors and heritage horses, as well as more serious discussions around school psychologist licensing, pesticide disclosure requirements, and the use of song lyrics as evidence in the high-profile prosecution of rapper Young Thug.\n\n**Key Actions:**\n**HB 81:** Allows school psychologists to work across state lines with equivalent licensing.\n**HB 167:** Allows the use of fluorescent pink in addition to orange for hunting attire.\n**SB 139:** Allows the city of Mulberry to annex certain parcels of land in Gwinnett County.\n**SB 138:** Waives Gwinnett County's sovereign immunity in providing services to Mulberry.\n**SB 144:** Prevents pesticide manufacturers from being held liable for undisclosed health risks beyond FDA requirements.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Debate on the appropriate \"shade of pink\" to be used for hunting attire.\n- Democrats opposing the Mulberry annexation and Gwinnett County service bills, arguing it was a \"free Berry\" approach.\n- Passionate discussion around the use of song lyrics as evidence in the Young Thug prosecution, with a Democratic representative joining the opposition.\n\n**Votes:**\n- HB 81 passed 48-2.\n- HB 167 passed unanimously.\n- SB 139 passed 96-74 along party lines.\n- SB 138 passed along party lines.\n- SB 144 passed 101-58.\n\n**Attendance:** Quorum maintained.\n\n**Adjournment:** Session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "jDHDXiiLYWI",
    "url": "https://www.youtube.com/watch?v=jDHDXiiLYWI",
    "title": "Sen. Hickman Press Conference on GCDD for K-12 Students | 02/04/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Overview:\n- This press conference focused on the experiences of students with disabilities in Georgia's education system, particularly the challenges faced in the \"Jeanette\" segregated education program. The speakers highlighted the need for inclusive, high-quality education for all students.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Senator Billy Hickman, a champion for disability rights, introduced the event and spoke about the importance of strengthening the teaching workforce and making education more accessible and inclusive.\n- Representative Lim emphasized that inclusive education benefits all students, not just those with disabilities, and discussed efforts to promote this in Gwinnett County.\n- Daniel, a \"survivor\" of the segregated \"Jeanette\" system, shared a powerful personal account of the abuse and challenges he faced in that program.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nNo adjournment information provided."
  },
  {
    "video_id": "0pXNSaNtYmg",
    "url": "https://www.youtube.com/watch?v=0pXNSaNtYmg",
    "title": "Sen. Jackson Press Conference on ICE | 01/13/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 26,
    "summary": "Overview\n- This press conference featured Georgia state senators condemning the actions of the Trump administration and federal immigration enforcement agencies like ICE. They announced new legislation to protect immigrant communities and limit the use of the National Guard without state permission.\n\nKey Actions\n- **SB 390**: Prohibit the armed state forces (National Guard) from being deployed in Georgia without the permission of the state's elected leaders.\n- **SB 391**: Prevent immigration enforcement without a judicial warrant in sensitive locations like schools, hospitals, places of worship, and domestic violence shelters.\n\nBills Introduced (First Reading)\n- SB 390: Prohibit National Guard deployment without state permission\n- SB 391: Restrict immigration enforcement in sensitive locations\n\nNotable Moments\n- Moment of silence to honor lives lost due to ICE actions\n- Speeches by Senators Ramon and Jones condemning the Trump administration's treatment of immigrant communities\n\nVotes\n- No recorded votes, these were bill introductions.\n\nAttendance\n- The press conference featured several Georgia state senators speaking in support of the immigrant community and the proposed legislation.\n\nAdjournment\n- No specific adjournment time noted, this was a press conference rather than a legislative session."
  },
  {
    "video_id": "DKjbv8C7ErE",
    "url": "https://www.youtube.com/watch?v=DKjbv8C7ErE",
    "title": "1/23/24 Senate Committee on Ethics",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 107,
    "summary": "Overview:\nThe Georgia Senate Committee on Ethics discussed several bills related to elections and voting procedures, with a focus on preventing the implementation of ranked choice voting in the state.\n\nKey Actions:\n- **SB 355**: Prohibits the use of ranked choice voting in Georgia, except for military and overseas voters.\n\nBills Introduced (First Reading):\n- SB 355 by Senator Robinson\n- SB 358 by Senator Burns\n\nNotable Moments:\n- Senator Robertson provided a detailed presentation on the issues and concerns with ranked choice voting, citing examples of problems in other states.\n- The committee discussed the need to restore voter confidence in Georgia's elections following the controversies of the 2016 and 2020 elections.\n\nVotes:\nNo recorded votes mentioned in the transcript.\n\nAttendance:\nNo specific quorum notes provided.\n\nAdjournment:\nThe transcript does not indicate when the committee meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "m8fvtHIQ4rg",
    "url": "https://www.youtube.com/watch?v=m8fvtHIQ4rg",
    "title": "Lawmakers Day 27 03/04/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe Georgia legislature session on Day 27 (3/4/25) featured debates on the Georgia Religious Freedom Restoration Act, as well as the passage of several other bills including those related to missing adults with autism, the death penalty for those with intellectual disabilities, and tax credits for safe gun storage.\n\n**Key Actions**\n- **HB 465**: Bill to allow law enforcement to send \"Maddie's Call\" alerts for missing adults with autism\n- **HB 123**: Bill to bar the state from seeking or imposing the death penalty on individuals found to have an intellectual disability\n- **HB 79**: Bill to create a $300 tax credit for safe gun storage devices and safety courses\n\n**Bills Introduced (First Reading)**\n- SB 155 and SB 156: Bills aimed at reducing insurance premiums\n\n**Notable Moments**\n- Debate over the Georgia Religious Freedom Restoration Act (SB 36), with Democrats arguing it could enable discrimination\n- Speeches in support of HB 123, noting the need to protect the most vulnerable from the death penalty\n\n**Votes**\n- SB 36 (Georgia Religious Freedom Restoration Act) passed 32-23 along party lines\n- HB 465, HB 123, and HB 79 all passed unanimously\n\n**Attendance**\nNo specific quorum notes provided.\n\n**Adjournment**\nThe legislature will return on Thursday for Crossover Day, the last day a bill can be passed in one chamber and moved to the other this session."
  },
  {
    "video_id": "chbyyb-9dPQ",
    "url": "https://www.youtube.com/watch?v=chbyyb-9dPQ",
    "title": "3/22/23 - Committee on Insurance & Labor",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 37,
    "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Insurance & Labor session:\n\n**Overview**\nThis session focused on discussing and passing House Bill 280, which allows life insurance policies to offer certain health devices as part of the policy. There was also discussion and agreement on House Bill 295, which aims to address issues that have arisen since the passage of the 2020 surprise billing law.\n\n**Key Actions**\n**HR 280**: Allows life insurance policies to offer certain health devices like fitness trackers as part of the policy.\n**HR 295**: Addresses issues that have arisen since the 2020 surprise billing law, including prompt payment, final payment notices, and provider practices. The bill was developed through collaboration between the legislature, Department of Insurance, insurers, and providers.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Representatives from the Department of Insurance, insurance providers, and healthcare providers all voiced support for HB 295 and the collaborative process used to develop the bill.\n\n**Votes**\n- HB 280 passed unanimously.\n- HB 295 did not have a recorded vote, but there was a motion and second to pass the bill.\n\n**Attendance**\nA quorum was present.\n\n**Adjournment**\nThe committee adjourned, but no specific next session date was provided."
  },
  {
    "video_id": "G89KSkUUlDM",
    "url": "https://www.youtube.com/watch?v=G89KSkUUlDM",
    "title": "3/20/23 - Committee on Government Oversight",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Here is a summary of the Georgia 3/20/23 - Committee on Government Oversight session:\n\n**Overview**\nThis was a routine committee session focused on passing a single bill, HB 269, which allows local workforce development boards to conduct meetings via teleconference.\n\n**Key Actions**\n**HB 269**: Allows local workforce development boards to conduct meetings via teleconference, with a requirement that the meetings be recorded.\n\n**Bills Introduced (First Reading)**\nNone.\n\n**Notable Moments**\n- The session opened with a prayer led by Senator Robertson.\n- There was some lighthearted banter between the chair and Representative Blackman when introducing the bill.\n- The committee unanimously passed HB 269.\n\n**Votes**\n- HB 269 passed the committee unanimously.\n\n**Attendance**\nNo specific quorum notes, but the session appears to have had full attendance.\n\n**Adjournment**\nThe committee adjourned after passing HB 269. No specific date for the next session was provided."
  },
  {
    "video_id": "G5SXc2lPXqE",
    "url": "https://www.youtube.com/watch?v=G5SXc2lPXqE",
    "title": "Georgia House 2026 - Day 7 AM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 7,
    "video_date": null,
    "duration_minutes": 65,
    "summary": "Overview:\n- The session began with the morning roll call and a scripture reading and prayer by the chaplain, Father Charles Bird.\n- Father Bird shared a historical story about the upcoming beatification of five Franciscan missionaries who were martyred in 17th century Georgia.\n\nKey Actions: \nNone detected\n\nBills Introduced (First Reading):\nNone detected\n\nNotable Moments:\n- Father Bird shared the history of the five Franciscan missionaries who were martyred in 17th century Georgia. He discussed their upcoming beatification by the Catholic Church.\n- Father Bird emphasized the rich heritage and potential of Georgia, and called on the legislators to be worthy stewards of their authority and responsibility.\n\nVotes:\nNone detected\n\nAttendance:\nThe session began with the Speaker verifying that all members had registered their presence in the chamber.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned. The next session date is not provided."
  },
  {
    "video_id": "hHFEHtSbBpM",
    "url": "https://www.youtube.com/watch?v=hHFEHtSbBpM",
    "title": "Morning Proceedings Under the Gold Dome | Georgia House 2026 - Day 2 AM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": null,
    "duration_minutes": 54,
    "summary": "Here is a structured summary of the Georgia House 2026 - Day 2 AM Session:\n\n**Overview**:\nThe morning session featured opening remarks, introductions, and resolutions. No major legislation was acted on, but several bills were introduced for first reading. The focus was on kindness, community, and commemorating important anniversaries.\n\n**Key Actions**:\nNo bills passed or referred.\n\n**Bills Introduced (First Reading)**:\n- **HB 934**: Act to amend Title 7 and 45 relating to banks and finance\n- **HB 935**: Act to authorize a technology fee for the Thomas County Probate Court \n- **HB 936**: Act to authorize a technology fee for the Berlin Municipal Court\n- **HB 944**: Act to amend code section related to safe operations of motor carriers\n- **HB 945**: Act to amend Title 7 relating to banks and finance\n- **HB 946**: Act to amend Title 27 relating to game and fish\n\n**Notable Moments**:\n- Opening prayer and remarks focused on kindness, forgiveness, and love\n- Introduction of the new President of Mercer University\n- Recognition of the Korean-American community in Georgia\n\n**Votes**: \nNo recorded votes.\n\n**Attendance**:\nQuorum present, all members asked to come to the floor.\n\n**Adjournment**:\nSession adjourned, next session date not provided."
  },
  {
    "video_id": "C8VHGljz-SE",
    "url": "https://www.youtube.com/watch?v=C8VHGljz-SE",
    "title": "Lawmakers Day 39 04/02/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**:\nThis was a busy day 39 of the Georgia legislative session, with lawmakers racing to pass as much legislation as possible before the session ends. The session featured partisan debates on voting bills, as well as recognitions and emotional moments around school safety and mental health.\n\n**Key Actions**:\n- **HB 397**: Controversial voting bill that passed along party lines, with Democrats criticizing it as an attempt to disenfranchise voters.\n- **SB 17**: \"Ricky and Lisa's law\" adding clarifying language to a school safety bill passed earlier.\n- **SB 185**: Bill banning state funds for gender-affirming care for transgender prisoners, prompting a walkout by Democratic lawmakers in protest.\n- **SB 214**: Bill requiring paper ballots in elections, which will have to wait until the next session since it missed the crossover day deadline.\n\n**Bills Introduced (First Reading)**: No new bills mentioned.\n\n**Notable Moments**:\n- Emotional testimony from a legislator about their child's fear of school shootings.\n- Georgia First Lady Marty Camp joined the session to discuss the 988 mental health crisis hotline.\n- Walkout by Democratic lawmakers in protest of SB 185.\n- Recognition of longtime legislative cameraman Wesley Nichols for his 25 years of service.\n\n**Votes**:\n- **HB 397**: Passed 33-23 along party lines.\n- **SB 17**: Passed unanimously.\n- **SB 185**: Passed, prompting a Democratic walkout.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The session details do not mention a specific adjournment time. The summary notes this was the 39th day of the legislative session, with 2 days remaining before the session ends."
  },
  {
    "video_id": "r9NrwhT1mac",
    "url": "https://www.youtube.com/watch?v=r9NrwhT1mac",
    "title": "3/22/23 - Committee on Higher Education",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 35,
    "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Higher Education session:\n\n**Overview:** The session focused on two key bills - HB249 and an unspecified bill to dissolve the Georgia Higher Education Assistance Corporation. There was discussion around streamlining bureaucracy and potentially using funds from the dissolved corporation for higher education financial aid programs.\n\n**Key Actions:**\n- **HB249:** Bill to modify the eligibility criteria for the REACH scholarship program, lowering the completion threshold for 2-year and 4-year programs.\n- Unspecified bill to dissolve the Georgia Higher Education Assistance Corporation, freeing up $28 million to be allocated for higher education financial programs.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Committee members expressed appreciation for each other and discussed potential areas of collaboration over the summer.\n- Senator Moore jokingly invited the bill author to join the Freedom Caucus for their efforts to reduce bureaucracy.\n- Discussion around potentially using the $28 million from the dissolved corporation to fund the university system's funding formula.\n\n**Votes:**\n- The bill to dissolve the Georgia Higher Education Assistance Corporation was unanimously passed.\n\n**Attendance:** Quorum present, no specific attendance notes.\n\n**Adjournment:** The session adjourned. No information provided on the next session date."
  },
  {
    "video_id": "Agb3ePiwo2M",
    "url": "https://youtu.be/Agb3ePiwo2M",
    "title": "Georgia House - Day 11 (2026-11-17)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 11,
    "video_date": "2026-11-17",
    "duration_minutes": 44,
    "summary": "Overview:\nThe Georgia House session on 2026-11-17 was a routine day with no significant legislative actions. The speaker introduced the House chaplain, Rep. Terry England, who delivered an inspirational speech highlighting the importance of seeking wisdom from God and using one's intelligence to serve others.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Rep. Terry England, the House Appropriations Committee chair, delivered the opening prayer and gave a speech emphasizing the need to seek divine wisdom and use one's intelligence to help others.\n- The speaker praised Rep. England's friendship and character.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nA quorum was present, with members signing in electronically.\n\nAdjournment:\nThe session adjourned, with the next meeting date unspecified."
  },
  {
    "video_id": "qP4FCXC9rxI",
    "url": "https://www.youtube.com/watch?v=qP4FCXC9rxI",
    "title": "Lawmakers Day 38 03/31/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session on Day 38 (03/31/25) of the Georgia legislative session saw heated debates on several bills, including the Pediatric Safe Storage Act (HB 1), a bill banning transgender athletes from female sports (SB 1), and a bill creating financial incentives for local school boards to approve charter school petitions (SB 82). The session also included the recognition of 33 Black legislators elected during Reconstruction and the consideration of the state's fiscal year 2026 budget.\n\n**Key Actions**\n- **HB 303**: Bill to place a memorial on Capitol grounds honoring 33 Black legislators elected in 1868 during Reconstruction.\n- **SB 93**: Georgia Early Literacy Act, creating new guidelines for teaching reading to young students.\n- **SB 1**: Bill banning transgender girls from participating in girls' sports and requiring changing rooms to be separated by sex assigned at birth. Passed 100-64.\n- **SB 82**: Bill creating financial incentives for local school boards to approve petitions for new charter schools and penalizing school systems that repeatedly deny charter school proposals. Passed 107-62.\n\n**Bills Introduced (First Reading)**\n- None mentioned\n\n**Notable Moments**\n- Before the presentation of HB 268 (school safety bill), Senator Bill Callisert read the names of Appalachia High School shooting victims and asked for a moment of silence.\n- Democrats opposed SB 1, calling it a \"manufactured crisis\" and criticizing the bill for targeting individuals rather than addressing real problems.\n- Republicans argued that SB 1 protects the integrity of women's sports and ensures fair competition.\n\n**Votes**\n- HB 268 (school safety bill): Passed 45-9\n- SB 1 (transgender sports ban): Passed 100-64\n- SB 82 (charter school incentives): Passed 107-62\n\n**Attendance**\n- Quorum was present for the proceedings.\n\n**Adjournment**\n- The session adjourned for the day, with committees scheduled to meet the next day and the House and Senate floor sessions scheduled to resume on Wednesday."
  },
  {
    "video_id": "AF6hy5gyg6U",
    "url": "https://www.youtube.com/watch?v=AF6hy5gyg6U",
    "title": "Lawmakers Day 36 03/27/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 36 03/27/25 session:\n\n**Overview:** The session was marked by several notable actions, including passing bills to allow terminally ill patients access to experimental treatments, create a scholarship grant program for youth in foster care, and codify access to in vitro fertilization. There was also debate over a bill to criminalize artificial intelligence videos designed to interfere with elections, and a partisan resolution to investigate alleged illegal campaign contributions by the New Georgia Project.\n\n**Key Actions:**\n- **SB 72:** Allows terminally ill patients to access experimental treatments\n- **SB 85:** Creates a scholarship grant program for Georgia youth in foster care\n- **SB 233:** Adds individuals with first-hand experience with addiction to the Behavioral Health Reform and Innovation Commission\n- **SB 9:** Criminalizes artificial intelligence videos designed to interfere with elections (passed 152-12)\n- **SB 69:** Sets regulations around third parties financing lawsuits (passed 98-69)\n- **SB 105:** Allows veterinarians to give pet health advice\n- **HB 428:** Codifies access to in vitro fertilization\n\n**Bills Introduced (First Reading):**\n- HB 106, HB 310, HB 423, HB 60\n\n**Notable Moments:**\n- Visit from the House Speaker's chief of staff, Terry England, who was recovering from a farming accident\n- Debate over SB 9, with arguments that ensuring election integrity is the \"most important thing\" lawmakers can do for constituents\n\n**Votes:**\n- SB 9 passed 152-12\n- SB 69 passed 98-69\n- SB 105 passed unanimously\n- HB 428 and an amendment to raise the governor's salary to $250,000 passed 45-10\n\n**Attendance:** Quorum present\n\n**Adjournment:** Session adjourned, next session scheduled for the following day."
  },
  {
    "video_id": "542UQz88d18",
    "url": "https://www.youtube.com/watch?v=542UQz88d18",
    "title": "Lawmakers Day 32 03/18/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Overview:\n- The Georgia General Assembly session on Day 32 (March 18, 2025) saw the introduction of several bills and resolutions, including some controversial measures.\n- The session featured debates over bills related to maternal mortality, tax relief for timber farmers, and expanding farmland ownership, as well as resolutions praising Republican politicians.\n\nKey Actions:\n- **HB 111**: Allows the Maternal Mortality Review Committee to access psychiatric and medical records related to maternal mortality cases, in an effort to lower the state's maternal mortality rate.\n- **HB 223**: Provides tax relief for timber farmers who suffered economic losses from Hurricane Helene.\n- **HB 90**: Allows farmers to own up to 4,000 acres of farmland and receive lower tax rates, pending voter approval to change the state constitution.\n- **SB 6**: Allows the sale of fentanyl test strips to the public and excludes them from drug paraphernalia classification.\n- **SB 55**: Requires companies to pay Georgians with intellectual disabilities at least the minimum wage, phasing out sub-minimum wage programs.\n\nBills Introduced (First Reading): None mentioned in the transcript.\n\nNotable Moments:\n- Governor Kemp appointed Barbara Rivera-Holmes as the new Commissioner of Labor, replacing the late Bruce Thompson.\n- The Senate debated and passed resolutions praising former Congressman and current VA Secretary Doug Collins, as well as President Donald Trump, despite some Democratic opposition.\n\nVotes:\n- **HR 32 and HB 90**: Passed unanimously\n- **SR 245 (Doug Collins)**: Passed\n- **SR 246 (Donald Trump)**: Passed along party lines 31-18\n\nAttendance: No quorum notes mentioned.\n\nAdjournment: The session adjourned, with the House and Senate scheduled to reconvene on Thursday."
  },
  {
    "video_id": "YFYGJ2MOBuA",
    "url": "https://www.youtube.com/watch?v=YFYGJ2MOBuA",
    "title": "DBHDD Commissioner on Georgia's Mental Health Issues",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\nThe key highlights from this session with Georgia Department of Behavioral Health and Developmental Disabilities (DBHDD) Commissioner Kevin Tanner include the agency's role in forensic services, the challenges with limited state hospital beds, and new initiatives to address the needs of individuals with intellectual and developmental disabilities (IDD) who end up in emergency rooms.\n\nKey Actions:\nNo bills were discussed or passed in this session.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Commissioner Tanner explained DBHDD's responsibility for determining competency to stand trial and restoring competency for those found incompetent.\n- He noted the lack of state hospital beds, with nearly 800 individuals in jail waiting for a bed, and the long wait times of over a year on average.\n- Tanner discussed plans for a new 16-bed crisis stabilization and diagnostic center for the IDD population, which will provide comprehensive medical and psychiatric care.\n- He also mentioned opening pilot group homes to step down individuals from hospitals and getting approval from CMS for new Medicaid placement options for the \"hard to place\" IDD population.\n- Tanner highlighted workforce challenges, with DBHDD losing over 1,200 employees during COVID, and efforts to boost recruitment and retention, including partnerships with universities.\n\nVotes:\nNo votes were mentioned.\n\nAttendance:\nNo specific quorum notes were provided.\n\nAdjournment:\nNo adjournment information was given."
  },
  {
    "video_id": "obniXpbg8UU",
    "url": "https://youtu.be/obniXpbg8UU",
    "title": "Georgia House - Day 12 (2026-02-04)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 12,
    "video_date": "2026-02-04",
    "duration_minutes": 51,
    "summary": "Here is a summary of the Georgia House session on 2026-02-04:\n\n**Overview**\nThis was a routine Friday session to start the day with a prayer and pledge of allegiance. No substantive legislation was addressed.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The House chaplain was introduced by Rep. Robert Dickey, who praised the work of Pastor Brian Moore and his church, New Providence Baptist Church, in Monroe County.\n- Pastor Moore delivered the opening prayer, drawing parallels between the role of legislators and the role of priests in the Bible, representing the people before God.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nA quorum was present, as all members were instructed to report to their seats for the morning roll call.\n\n**Adjournment**\nThe session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "7Fysv8lhZXs",
    "url": "https://www.youtube.com/watch?v=7Fysv8lhZXs",
    "title": "Lawmakers Day 30 03/11/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 30,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 30 03/11/25 session:\n\n**Overview:**\nThe Georgia House of Representatives passed the FY 2026 budget (HB 68), which includes an additional $500 million in education spending and $250 million more for the state's prison system. The session also featured recognitions, including celebrating a member's last radiation treatment and honoring the 50th anniversary of the Shepherd Center.\n\n**Key Actions:**\n**HB 68:** Fiscal year 2026 budget, passed 171-4. Includes $500 million more in education spending and $250 million more for the prison system.\n**HB 287:** Updated DNR fishing and hunting license regulations, passed unanimously.\n**HR 97 and HR 98:** Regulate sale and leasing of state property and non-exclusive easements, passed unanimously.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Member celebrated last radiation treatment for cancer.\n- House recognized 50th anniversary of Shepherd Center, which treats brain and spinal cord injuries.\n- Senate recognized Georgia lineworkers and named an interchange after a slain Roswell police officer.\n\n**Votes:**\n- HB 68 (budget): Passed 171-4.\n- HB 287, HR 97, HR 98: Passed unanimously.\n\n**Attendance:** Quorum present, no issues noted.\n\n**Adjournment:** Session ended for the day, with no floor activities planned for the next day. Both chambers to return on Thursday."
  },
  {
    "video_id": "JnHRDc7zItU",
    "url": "https://www.youtube.com/watch?v=JnHRDc7zItU",
    "title": "12/21/23 Joint Study Committee on Service Delivery Strategies",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "## Overview\n\nThis transcript appears to be from a joint study committee meeting on service delivery strategies in Georgia, with minimal substantive legislative activity. The key focus was on approving a list of seven recommendations, which was described as a framework for future legislation rather than legislation itself.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The committee members discussed establishing a quorum and technical difficulties with one member joining the virtual meeting.\n- The committee chair thanked the staff for their work in preparing the list of recommendations.\n- The committee adopted the list of seven recommendations unanimously.\n- The committee chair wished everyone a Merry Christmas at the end of the meeting.\n\n## Votes\nThe committee voted unanimously to adopt the list of seven recommendations.\n\n## Attendance\nThe committee had a quorum of at least five members, including the two co-chairs.\n\n## Adjournment\nThe meeting was adjourned after the vote on the recommendations. The next session date was not specified."
  },
  {
    "video_id": "b2MauceYMfc",
    "url": "https://www.youtube.com/watch?v=b2MauceYMfc",
    "title": "Lawmakers Day 26 03/03/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 26,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session featured passionate debates over bills related to transgender healthcare and book banning in libraries. Lawmakers also passed the amended mid-year budget and a bill to expand the definition of military bases.\n\n**Key Actions**\n- **HB399**: Requires out-of-state landlords owning over 25 single-family homes to have an in-state broker to manage tenant complaints.\n- **SB30**: Bans all hormone therapies and puberty blocking treatments for minors with gender dysphoria.\n- **SB262**: Bipartisan bill to preserve access to preventive healthcare services at no cost, in case the Affordable Care Act's requirements are removed.\n\n**Bills Introduced (First Reading)**\nNo new bills mentioned.\n\n**Notable Moments**\n- Emotional speech opposing efforts to \"erase\" transgender people.\n- Debate over allowing children currently on puberty blockers to continue treatment.\n- Discussion of a bill to punish librarians for providing \"sexually explicit or harmful materials\" to children.\n\n**Votes**\n- **SB30 (Gender Dysphoria Treatment Ban)**: Passed 34-19 along party lines.\n- **SB262 (Preventive Care Access)**: No vote count provided.\n- **Amended 2024-25 Budget**: Passed 55-1 in the Senate.\n\n**Attendance**\nNo explicit quorum notes.\n\n**Adjournment**\nNo adjournment time or next session date provided."
  },
  {
    "video_id": "6Ez7Rcdzd60",
    "url": "https://www.youtube.com/watch?v=6Ez7Rcdzd60",
    "title": "3/22/23 - Committee on Rules",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 68,
    "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Rules session:\n\n**Overview**: This was a busy rules committee meeting where the chair outlined the process for the day and upcoming rules committee meetings. The committee considered and passed numerous study committee resolutions.\n\n**Key Actions**:\n- **HR 256**: Resolution to create a study committee on expanding early learning in Georgia\n- **SR 121**: Resolution to create a study committee on learning loss and impacts of COVID-19 on students\n- **SR 155**: Resolution to create a study committee on issues facing the trucking industry\n- **SR 203**: Resolution to create a study committee on pediatric safe storage of firearms\n- **SR 273**: Resolution to create a study committee on EMS reform\n- **SR 275**: Resolution to create a study committee on workforce development\n- **SR 282**: Resolution to create a study committee on foster care and adoption\n\n**Bills Introduced (First Reading)**: None noted\n\n**Notable Moments**:\n- The chair outlined the process for the day, noting they would set the calendar for the next rules committee meeting rather than letting members pick bills.\n- There was some discussion about potentially pulling certain study committee resolutions if related legislation was already moving, but no resolutions were ultimately pulled.\n\n**Votes**: No recorded votes noted.\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: Not specified, but the next rules committee meeting was scheduled for the following day or Friday morning."
  },
  {
    "video_id": "SbawhQHbHB4",
    "url": "https://www.youtube.com/watch?v=SbawhQHbHB4",
    "title": "Sen. James Press Conference on HOA | 02/10/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 22,
    "summary": "Here is a summary of the key points from the Georgia Senate session on HOA oversight on 02/10/2026:\n\n**Overview**: This session focused on addressing issues with homeowner's associations (HOAs) in Georgia, with several state representatives and senators discussing proposed legislation to increase oversight and accountability of HOA boards.\n\n**Key Actions**:\n- **HB 1222**: Bill to create an HOA oversight commission and require training for HOA board members\n- **SB 107, SB 120, SB 406**: Bills addressing various HOA-related issues like payment allocation fraud, elections, and transparency\n\n**Bills Introduced (First Reading)**: No new bills were introduced, the focus was on the existing HOA-related legislation.\n\n**Notable Moments**:\n- Representatives shared numerous constituent stories of HOAs unfairly foreclosing on homes or seizing assets over unpaid fees/assessments\n- Calls for the legislature to pass \"real\" reform to protect homeowners' rights and the \"American dream\" of home ownership\n- Frustration expressed over years of advocacy with little action taken by the legislature\n\n**Votes**: No recorded votes, this was a press conference and discussion, not a legislative session.\n\n**Attendance**: No specific quorum details provided.\n\n**Adjournment**: No formal adjournment mentioned, this was an informal press conference."
  },
  {
    "video_id": "IhaDrMAlyGo",
    "url": "https://www.youtube.com/watch?v=IhaDrMAlyGo",
    "title": "Sen.Merritt Press Conference on GLBC Priorities | 02/02/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a structured markdown summary of the Georgia Legislative Black Caucus press conference on their 2026 legislative priorities:\n\n## Overview\nThe Georgia Legislative Black Caucus (GLBC) held a press conference to unveil their 2026 legislative priorities, which were shaped directly by the voices, needs, and lived experiences of the communities they serve. The priorities focus on key areas like economic justice, healthcare access, housing, voting rights, education, and criminal justice reform.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The GLBC chair emphasized the caucus' commitment to advancing justice, equity, and opportunity for all Georgians.\n- Rep. Jasmine Clark discussed the importance of the Georgia Civil Rights Act of 2026 (HB 670/SB 320), which aims to strengthen civil rights protections in the state.\n- Christopher Bruce of the ACLU of Georgia spoke passionately about the need to defend civil rights and liberties in Georgia.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nNo specific quorum notes.\n\n## Adjournment\nThe press conference concluded, but no specific adjournment time or next session date was provided."
  },
  {
    "video_id": "HbqHaEPNngU",
    "url": "https://www.youtube.com/watch?v=HbqHaEPNngU",
    "title": "Sen. Strickland Press Conference on Autism Legislation & Rio's Law | 01/29/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a structured markdown summary of the key details from the Georgia Senate Strickland Press Conference on Autism Legislation & Rio's Law on 01/29/2026:\n\n**Overview:**\nThe press conference focused on announcing the filing of Senate Bill 433, also known as \"Rio's Law\", which aims to create a specialty license plate to help law enforcement and first responders better identify and interact with individuals with autism or developmental disabilities during traffic stops and emergencies. The bill also requires basic training for Georgia peace officers on how to best interact with these individuals.\n\n**Key Actions:**\n**SB 433 (Rio's Law):** Creates a specialty license plate to help law enforcement and first responders identify individuals with autism or developmental disabilities, and requires basic training for Georgia peace officers on interacting with these individuals.\n\n**Bills Introduced (First Reading):** \n- SB 433 (Rio's Law)\n\n**Notable Moments:**\n- Senator Strickland shared his personal story of having a son with autism and the importance of acceptance and services for the autism community.\n- Layla Luna, founder of Jess B and mother of Rio (whom the law is named after), described a concerning traffic stop incident that inspired the creation of Rio's Law.\n- Connor Tomlinson, star of the Netflix show \"Love on the Spectrum\", spoke as an autistic advocate in support of the legislation.\n- Chairman Lumpston of the House pledged to champion the bill in the House, drawing on his own law enforcement experience.\n\n**Votes:** No votes were mentioned in the transcript.\n\n**Attendance:** No specific quorum details were provided.\n\n**Adjournment:** The press conference ended without a specific adjournment time mentioned."
  },
  {
    "video_id": "sqyGzosxE74",
    "url": "https://www.youtube.com/watch?v=sqyGzosxE74",
    "title": "Sen. Jones II Press Conference on Minority Party Priorities | 01/29/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a summary of the key points from the Georgia Sen. Jones II Press Conference on Minority Party Priorities | 01/29/2026 session:\n\n**Overview**:\nSen. Jones II outlined the Democratic caucus' legislative priorities for the current session, focusing on affordability issues for working families such as healthcare, childcare, housing, and taxation.\n\n**Key Actions**:\n- **SB 379**: Legislation to create a state-based premium tax credit to address the expiration of ACA tax credits\n- **SB 380**: Legislation to expand Medicaid in Georgia, led by Sen. David Lucas\n- **SB 408**: Legislation to sunset the tax exemption for data centers by 2027, led by Sen. Nanorock\n\n**Bills Introduced (First Reading)**: \n- SB 192 (from last session)\n- SB 379\n- SB 380 \n- SB 408\n\n**Notable Moments**:\n- Sen. Jones II criticized Republican plans to eliminate the state income tax, calling it a \"tax hike\" that would hurt working families.\n- The Democrats are also focused on issues like food insecurity, public education funding, and preventing mid-cycle redistricting.\n\n**Votes**: \nNo recorded votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nThe press conference concluded, but no information on the next legislative session date was given."
  },
  {
    "video_id": "oKMue-vyYGs",
    "url": "https://www.youtube.com/watch?v=oKMue-vyYGs",
    "title": "Sen. James Press Conference on Eric ID & Autism | 1/28/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 26,
    "summary": "Overview:\n- This press conference focused on two key legislative initiatives in Georgia: the Darren Lewis Saving Lives Act and Eric's ID Law, both aimed at improving public safety and protecting vulnerable populations.\n\nKey Actions:\n- None detected. This was a press conference to discuss proposed legislation, not an official legislative session.\n\nBills Introduced (First Reading):\n- **SB 419**: Eric's ID Law, modeled after a similar law in Maryland, to allow individuals with non-apparent disabilities to have an indicator on their driver's license or state ID to help inform law enforcement during interactions.\n- **HB 1011**: The Darren Lewis Saving Lives Act, proposed in response to the tragic death of Darren Lewis during a high-speed police chase in Savannah, Georgia.\n\nNotable Moments:\n- Emotional testimony from Kathy Lewis, the widow of Darren Lewis, about the loss of her husband.\n- Remarks from Senator Donzella James about the prevalence of autism and the need to protect individuals with non-apparent disabilities, including her own grandson.\n- Introduction of Eric, a young man with high-functioning autism, who will speak about his experience and the inspiration behind \"Eric's ID Law.\"\n\nVotes:\n- No votes were taken, as this was a press conference, not an official legislative session.\n\nAttendance:\n- No specific quorum or attendance details provided.\n\nAdjournment:\n- The press conference concluded, but no information on the next legislative session date was provided."
  },
  {
    "video_id": "1ZkJ2xIo4Uo",
    "url": "https://www.youtube.com/watch?v=1ZkJ2xIo4Uo",
    "title": "Sen Jackson Press Conference on Gun Violence | 01/20/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 12,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Sen. Jackson press conference on gun violence:\n\n## Overview\nSenator Jackson introduced new legislation, SB 413, which would allow victims of gun violence to break their leases without penalty in order to move to a safer location. This builds on her previous work passing SB 75, which allowed victims of stalking to break leases. The press conference featured testimony from a trauma surgeon, Dr. Amber Hannah, and a gun safety advocate, Heather Hallett, emphasizing the need for this legislation.\n\n## Key Actions\n**SB 413**: Allows victims of gun violence to break their leases without penalty in order to move to a safer location.\n\n## Bills Introduced (First Reading)\n- SB 413\n\n## Notable Moments\n- Dr. Amber Hannah, a trauma surgeon, discussed the importance of providing support beyond just medical care for victims of gun violence to help them recover and reintegrate safely into the community.\n- Heather Hallett, the director of Georgia Majority for Gun Safety, spoke in support of SB 413 despite it not being the \"foundational gun safety laws\" her organization typically advocates for. She emphasized the need to address the ripple effects of gun violence on individuals, families, and communities.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nNo quorum notes detected.\n\n## Adjournment\nNo adjournment details provided."
  },
  {
    "video_id": "e_6cXhqLZFM",
    "url": "https://www.youtube.com/watch?v=e_6cXhqLZFM",
    "title": "Sen. Anavitarte Press Conference on Majority Party Priorities | 01/13/2026",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Overview:\nThis press conference by Georgia Senate President Pro Tempore Larry Walker outlines the Republican majority's legislative priorities for the 2026 session, focused on addressing the high cost of living and reigniting the \"American Dream\" for hardworking Georgians.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Walker discusses the significance of 2026 being America's 250th birthday, or \"semi-quincentennial\", and how this will bring patriotic celebrations.\n- Walker expresses concern that affordability issues have caused many Georgians to feel that the \"American Dream\" is slipping beyond their grasp.\n- The majority caucus plans to tackle affordability issues and \"reignite the American Dream\" through measures like eliminating the state income tax, providing property tax relief, limiting institutional investors in the housing market, and reforming the home-building permitting process.\n- The agenda also includes supporting first responders, preserving natural assets, improving K-12 education and literacy, and addressing challenges like street racing and technology access for children.\n- Walker criticizes \"insane liberal Democrat policies\" and the Biden administration's \"crippling inflation\" as drivers of the cost of living challenges.\n\nVotes:\nNone detected.\n\nAttendance: \nNo quorum notes.\n\nAdjournment:\nNo adjournment details provided."
  },
  {
    "video_id": "0T0nvQxjMOM",
    "url": "https://www.youtube.com/watch?v=0T0nvQxjMOM",
    "title": "12/4/23 Joint Study Committee on Service Delivery Strategy",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 64,
    "summary": "Overview:\nThis session of the Georgia Joint Study Committee on Service Delivery Strategy focused on finalizing recommendations for the committee's report. The discussion centered around reaching consensus on the draft recommendations, with input from the Association County Commissioners of Georgia (ACCG) and the Georgia Municipal Association (GMA).\n\nKey Actions:\nNo bills were passed or referred during this session.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- The committee discussed the need to wrap up the recommendations and provide a final report to the Lieutenant Governor and Speaker by the December 31st deadline. \n- There was discussion around reaching consensus on the six draft recommendations, with the suggestion to have ACCG and GMA provide their official positions on each recommendation.\n- Commissioner Dockery and Mayor Ward summarized their written recommendations to the committee.\n\nVotes:\nNo recorded votes took place.\n\nAttendance:\nA quorum was present, though the transcript did not provide specifics on attendance.\n\nAdjournment:\nThe session was expected to wrap up within an hour. The committee planned to reconvene with ACCG and GMA to finalize the recommendations before the December 31st deadline."
  },
  {
    "video_id": "qyHqclSC_Ys",
    "url": "https://www.youtube.com/watch?v=qyHqclSC_Ys",
    "title": "Conference Committee HB189 - 3/29/23",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 62,
    "summary": "Here is a structured markdown summary of the Georgia Conference Committee HB189 - 3/29/23 session:\n\n**Overview**\nThe session focused on the ongoing discussion and negotiation around HB189, which deals with increasing weight limits for certain agricultural and timber trucks in Georgia. The discussion highlighted the need to balance supporting the state's crucial agriculture and forestry industries while also addressing concerns about infrastructure funding and maintenance.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Representative Minks opened the session with a prayer.\n- Representative Gooch shared remarks emphasizing the need to work in good faith to find a solution that helps the state's farmers and foresters.\n- Senate Majority Leader Gooch gave an extensive speech outlining the history of transportation funding challenges in Georgia, the importance of infrastructure investment, and the need for a broader, long-term approach beyond just the current HB189 negotiations.\n- There was discussion about the provisions in the Senate version of HB189, including the one-year extension of increased weight limits, the carve-out for non-attainment counties, increased fines for violations, and allowing local law enforcement to assist with enforcement.\n- Concerns were raised about potentially losing the bill if drastic changes were made in the conference committee.\n\n**Votes**\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**\nThe quorum and attendance were not explicitly stated.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "jdE_WpFpyfo",
    "url": "https://www.youtube.com/watch?v=jdE_WpFpyfo",
    "title": "3/23/23 - Committee on Urban Affairs",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 63,
    "summary": "Here is a structured markdown summary of the key points from the Georgia 3/23/23 - Committee on Urban Affairs session:\n\n**Overview**\nThe session focused on housing and tenant issues, with a personal testimony from Ms. Dory Henry about her experience with a problematic home ownership lease program. Several committee members discussed the challenges low-income residents face with evictions and housing insecurity.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Ms. Dory Henry provided a detailed account of her struggles with a home ownership lease program, including facing eviction despite making payments.\n- Committee members expressed concern about the growing issue of corporations buying properties and quickly evicting tenants for minor payment issues.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nA quorum of committee members was not present, but some members joined later in the session.\n\n**Adjournment**\nThe meeting was ongoing at the time the transcript ended. No information was provided on when the next session would occur."
  },
  {
    "video_id": "zRh-JPzqkO4",
    "url": "https://www.youtube.com/watch?v=zRh-JPzqkO4",
    "title": "3/23/23 - Committee on Transportation",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 36,
    "summary": "Here is a summary of the Georgia 3/23/23 Committee on Transportation session:\n\n**Overview**\nThe committee discussed House Bill 121, which aims to regulate the use of \"wake boats\" that generate large wakes on public lakes and reservoirs in Georgia. The bill seeks to expand the no-wake zone from 100 feet to 200 feet from shorelines and other structures to mitigate damage and safety issues caused by these types of boats.\n\n**Key Actions**\nNone detected\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Representative Anderson provided an overview of the bill, explaining that it was prompted by concerns from lake associations about shoreline erosion, dock damage, and safety issues caused by wake boats.\n- The committee discussed whether the bill should apply to private lakes, with some members suggesting an amendment to clarify that private lakes would be excluded.\n- Colonel Bernard from the Department of Natural Resources was present to provide input on the enforcement aspects of the legislation.\n\n**Votes**\nNone recorded\n\n**Attendance**\nQuorum present\n\n**Adjournment**\nNo information provided on adjournment or next session date."
  },
  {
    "video_id": "FSYeoA6Dt1E",
    "url": "https://www.youtube.com/watch?v=FSYeoA6Dt1E",
    "title": "11/28/23 Senate Study Committee on Occupational Licensing",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 64,
    "summary": "Here is a structured markdown summary of the Georgia 11/28/23 Senate Study Committee on Occupational Licensing session:\n\n**Overview**\nThe Senate Study Committee on Occupational Licensing held its fourth meeting, hearing testimony from various stakeholders on occupational licensing requirements in Georgia that may be inhibiting economic mobility, limiting job prospects, and hindering small businesses. The committee discussed common themes of frustration around the bureaucratic and burdensome licensing process.\n\n**Key Actions**\nNone noted.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- The committee heard from representatives of the Georgia Forestry Association, who requested that the Board of Registrations be moved from the Secretary of State's Office to the Georgia Forestry Commission.\n- The committee reviewed an email from a constituent expressing frustration with occupational licensing requirements for their medical practice.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nThe committee had 4 of 5 members present, establishing a quorum.\n\n**Adjournment**\nThe meeting details and next session date were not provided in the transcript summary."
  },
  {
    "video_id": "sAcyuUN3iLM",
    "url": "https://www.youtube.com/watch?v=sAcyuUN3iLM",
    "title": "11/28/23 Senate Study Committee on Certificate of Need Reform",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Certificate of Need Reform session on 11/28/23:\n\n**Overview**: The committee discussed recommendations for reforming or repealing Georgia's Certificate of Need (CON) laws, with a focus on addressing the anti-competitive effects and barriers to healthcare access, especially in rural areas.\n\n**Key Actions**:\n- No specific bills were passed or referred.\n\n**Bills Introduced (First Reading)**:\n- None detected.\n\n**Notable Moments**:\n- The committee chair thanked members for their thorough recommendations, noting that 9 out of 12 members supported a full repeal of Georgia's CON laws.\n- The chair opened the floor for discussion on the recommendations, inviting committee members to unpack their views.\n- One member, Chairman Watson, expressed the need to balance the rigidity of the CON laws with the operational realities facing healthcare providers.\n\n**Votes**: \n- No recorded votes.\n\n**Attendance**:\n- Quorum was present, as the committee members were able to discuss the recommendations.\n\n**Adjournment**:\n- The session adjourned, with no specific date provided for the next meeting."
  },
  {
    "video_id": "CmiyzggH49A",
    "url": "https://www.youtube.com/watch?v=CmiyzggH49A",
    "title": "11/27/23 Senate Study Committee on Foster Care and Adoption",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 17,
    "summary": "Here is a summary of the Georgia 11/27/23 Senate Study Committee on Foster Care and Adoption session:\n\n**Overview**:\nThe study committee held its final meeting, reviewing and finalizing a report with recommendations to address issues in Georgia's foster care and adoption system. Key focus areas included permanency timelines, state ID access for foster youth, case manager retention, the process of legitimation, expansion of infant/toddler courts, and support for foster and adoptive parents.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- The committee recognized the support and involvement from the Lieutenant Governor's office, the Department of Human Services, and members of the public who participated in the committee hearings.\n- The chair noted that the committee's work is just the beginning, and that continued efforts will be needed to address the complex challenges facing the foster care system.\n- The committee reviewed and discussed the draft report and recommendations, incorporating final input from members.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum was present, with committee members and representatives from the Department of Human Services in attendance.\n\n**Adjournment**:\nThe committee was slated to complete its work by December 1st, along with other study committees."
  },
  {
    "video_id": "HBfqs6zXfx0",
    "url": "https://www.youtube.com/watch?v=HBfqs6zXfx0",
    "title": "3/23/23 - Committee on Children & Families",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 57,
    "summary": "Here is a structured markdown summary of the Georgia 3/23/23 - Committee on Children & Families session:\n\n## Overview\nThe session focused on House Bill 144, a bill that codifies the International Holocaust Remembrance Alliance's (IHRA) definition of anti-Semitism. The bill aims to ensure that when analyzing intent behind illegal discriminatory actions targeting Jewish people, the IHRA's widely accepted definition is considered.\n\n## Key Actions\n**HB 144**: Codifies the IHRA definition of anti-Semitism to be used when analyzing intent behind illegal discriminatory actions targeting Jewish people.\n\n## Bills Introduced (First Reading)\nNone.\n\n## Notable Moments\n- Representative Carson presented the bill, explaining its purpose and addressing concerns about limiting free speech.\n- The committee discussed the merits of using the IHRA definition, emphasizing the importance of uniformity in defining anti-Semitism.\n- A legal scholar was available to provide technical answers to the committee's questions.\n- One committee member expressed understanding for the bill's intent, but noted that the state had previously passed an anti-hate bill that could already cover these issues.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present.\n\n## Adjournment\nThe session was adjourned with a hard stop at 8:50 AM, as many committee members had to attend another meeting."
  },
  {
    "video_id": "mT0rRooWiRE",
    "url": "https://www.youtube.com/watch?v=mT0rRooWiRE",
    "title": "3/22/23 - Committee on Finance",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 20,
    "summary": "Here is a structured markdown summary of the Georgia 3/22/23 - Committee on Finance session:\n\n**Overview:**\nThis session focused on revisiting and passing House Bill 454, which contained several technical changes and adjustments to the state's tax code, including updates to the IRC, standard deduction amounts, and taxpayer options to itemize or take the standard deduction.\n\n**Key Actions:**\nNone detected.\n\n**Bills Introduced (First Reading):**\nNone detected.\n\n**Notable Moments:**\n- The committee revisited and reconsidered House Bill 86, which had previously not left the committee.\n- Chairman Black presented House Bill 454, providing an overview of the various sections and changes, including updates to the IRC, standard deductions, and taxpayer options for itemizing or taking the standard deduction.\n- Black explained the $300 per taxpayer credit included to ensure taxpayers were not worse off with the changes.\n\n**Votes:**\n- The committee voted to pass House Bill 454 with one dissenting vote.\n\n**Attendance:**\nNo specific quorum notes provided.\n\n**Adjournment:**\nNo adjournment information provided."
  },
  {
    "video_id": "5BLqpo2tP8A",
    "url": "https://www.youtube.com/watch?v=5BLqpo2tP8A",
    "title": "3/22/23 - Committee on Appropriations Subcommittee on Compensation",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 43,
    "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Appropriations Subcommittee on Compensation session:\n\n**Overview:** The subcommittee discussed and considered amendments to House Bill 364, which aims to establish a panel of experts to evaluate and recommend compensation for individuals who have been wrongfully convicted. The bill would provide a range of $50,000 to $100,000 in compensation.\n\n**Key Actions:**\n- **HR 364:** Legislation to create an expert panel to evaluate and recommend compensation for the wrongly convicted\n\n**Bills Introduced (First Reading):** None\n\n**Notable Moments:**\n- Discussion of the proposed compensation range and how it compares to other states' practices\n- Consideration of an amendment to allow for annuity payments for awards over $1.5 million\n- Emphasis on ensuring the compensation is exempt from taxation\n\n**Votes:** The subcommittee unanimously voted to adopt the amendment allowing for annuity payments.\n\n**Attendance:** Quorum was present for the subcommittee meeting.\n\n**Adjournment:** The subcommittee adjourned after considering the bill and amendment. The next session was not specified."
  },
  {
    "video_id": "fA7yjfdqNXg",
    "url": "https://www.youtube.com/watch?v=fA7yjfdqNXg",
    "title": "3/22/23 - Committee on State & Local Governmental Operations",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Here is a summary of the Georgia 3/22/23 - Committee on State & Local Governmental Operations session:\n\n**Overview:** This session focused on HB374, a bill that addresses leaf blower regulations and consumer choice for gas appliances. The committee also discussed SB145, which deals with municipal annexation and de-annexation.\n\n**Key Actions:**\n- **HB374:** Substitute bill presented that addresses leaf blowers and consumer choice for gas appliances\n\n**Bills Introduced (First Reading):** None noted\n\n**Notable Moments:**\n- Discussion around the need to protect consumer choice and energy options, especially given high inflation\n- Debate around including a sunset provision in the bills, with the House previously voting to remove it\n- Negotiation between representatives and local government groups (GMA, ACCG) on annexation language for SB145\n\n**Votes:** \n- No recorded votes noted\n\n**Attendance:** Quorum present with 4 committee members\n\n**Adjournment:** No specific adjournment time noted, likely to reconvene at a later date."
  },
  {
    "video_id": "BnRuOhMyigk",
    "url": "https://youtu.be/BnRuOhMyigk",
    "title": "Georgia House - Day 9 (2026-11-15)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 9,
    "video_date": "2026-11-15",
    "duration_minutes": 72,
    "summary": "Here is a summary of the Georgia House session on 2026-11-15:\n\n**Overview**: This session focused on routine legislative procedures, with a notable prayer from a guest chaplain recognizing the passing of a representative's mother. The session saw the introduction of several bills, though no major legislation was passed.\n\n**Key Actions**:\n- No major bills passed or referred.\n\n**Bills Introduced (First Reading)**:\n- HB 8: [Bill description]\n- HB 7: [Bill description]\n\n**Notable Moments**:\n- Prayer led by guest chaplain Pastor Kim McCleary, who offered condolences for the passing of Representative Rob Leveritt's mother.\n- Routine confirmation of the previous day's legislative journal.\n\n**Votes**:\n- No recorded votes.\n\n**Attendance**:\n- Quorum present, with Representative Leveritt absent due to family matters.\n\n**Adjournment**:\n- The session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "4XNqboz_g_I",
    "url": "https://www.youtube.com/watch?v=4XNqboz_g_I",
    "title": "3/22/23 - Committee on Retirement",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Overview:\nThis session of the Georgia Legislature's Committee on Retirement focused on a single bill, SB 308, which sought to extend a recent increase in retirement benefits for current members of the General Assembly to those who had already retired when the change was made.\n\nKey Actions:\n**SB 308**: Extending a recent increase in retirement benefits for current members of the Georgia General Assembly to those who had already retired.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\nThe committee chair presented the bill on behalf of the absent sponsor, Senator Harbin. A committee member expressed support for extending the retirement benefit increase to retirees, stating they are \"very deserving of this retirement.\"\n\nVotes:\nThe committee voted to pass SB 308 on to the actuary for further review.\n\nAttendance:\nA quorum was present, and the session was able to conduct business.\n\nAdjournment:\nThe committee adjourned after addressing the single item on the agenda."
  },
  {
    "video_id": "P4QzliqDTf0",
    "url": "https://www.youtube.com/watch?v=P4QzliqDTf0",
    "title": "Lt. Governor Burt Jones Inaugural Dekalb & Fulton Constituent Services Day",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nThis session featured remarks from Georgia Lt. Governor Burt Jones highlighting his office's focus on constituent services and education initiatives, including a book drive for underserved communities.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Lt. Governor Jones discussed his goal of having a \"Chick-fil-A mentality\" in his office's constituent services, with staff assigned to travel the state and address local issues.\n- He emphasized education as a top priority, noting it makes up nearly 60% of the state's budget. He praised partnerships with groups like the Georgia Leadership Council to promote reading comprehension and provide book donations.\n- Jones highlighted the work of former UGA and NFL player Malcolm Mitchell, who has focused on literacy initiatives since his football career.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes provided.\n\nAdjournment:\nNo adjournment time given, but this appears to be an event rather than a full legislative session."
  },
  {
    "video_id": "z8i4-aYOocs",
    "url": "https://www.youtube.com/watch?v=z8i4-aYOocs",
    "title": "3/16/23 - Committee on State and Local Governmental Operations",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 57,
    "summary": "Overview:\nThis Georgia legislative committee session focused on a bill (HB 254) to modernize laws related to legal organs in the state. The key discussion centered around addressing issues with legal ads not being properly published by newspapers serving as legal organs, as well as the declining number of local newspapers.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Representative Jacobs presented HB 254, which aims to address problems with legal ads not being properly published by newspapers serving as legal organs, as well as the declining number of local newspapers.\n- Representative Jacobs noted that this bill does not change any of the requirements on legal organs, but allows for digital ad placement to count as the first day of publication if the legal organ fails to publish the ad as required.\n- A representative from Columbia County provided examples of issues they have faced with legal ads not being published properly by their legal organ.\n- Committee members discussed the challenges posed by newspapers going out of business or shifting to digital-only formats, and the potential to explore a statewide digital repository for legal ads.\n- There was discussion around the increase in ad rates for legal organs, with the representative noting it had been around 30 years since the last increase.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nNo adjournment details provided."
  },
  {
    "video_id": "cAHoiMza7w0",
    "url": "https://www.youtube.com/watch?v=cAHoiMza7w0",
    "title": "3/21/23 - Senate Committee on Appropriations",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Overview:\n- The Senate Appropriations Committee considered several key bills, including HB 611 and the FY 2024 budget bill (HB 19).\n- There was notable discussion around preserving the General Assembly's role in appropriating settlement funds and addressing issues in the state's Medicaid, child welfare, and mental health systems.\n\nKey Actions:\n- **HB 611**: Requires that any settlement agreement or proceeds from a settlement agreement be appropriated by the General Assembly after June 1, 2023.\n- **HB 19**: The Senate Appropriations Committee substitute for the FY 2024 budget bill. Key provisions include:\n  - Restoring Medicaid utilization cost cuts\n  - Shoring up the state health benefit plan by $1 billion\n  - Addressing structural deficits at child care institutions\n  - Increasing reimbursement rates for the \"Babies Can't Wait\" early intervention program\n  - Providing over $40 million to address mental health staffing and facility needs\n  - Funding 500 new COMP waivers\n  - Fully funding dyslexia screening for K-3 students a year earlier than required by SB 48\n\nBills Introduced (First Reading):\n- None mentioned\n\nNotable Moments:\n- Discussion around the need to preserve the General Assembly's role in appropriating settlement funds, particularly related to ongoing opioid litigation.\n- Remarks on the Senate version of the budget bill aligning more closely with the Governor's proposal than the House version, while still incorporating some House priorities.\n\nVotes:\n- HB 611 passed by substitute.\n\nAttendance:\n- A quorum was present.\n\nAdjournment:\n- The meeting adjourned, but the transcript does not provide the specific time or mention the date of the next session."
  },
  {
    "video_id": "hhpmCFndW1g",
    "url": "https://www.youtube.com/watch?v=hhpmCFndW1g",
    "title": "3/21/23 Committee on Banking & Financial Institutions",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 25,
    "summary": "Here is a structured markdown summary of the Georgia 3/21/23 Committee on Banking & Financial Institutions session:\n\n**Overview**\nThe committee discussed the recent failures of Silicon Valley Bank and Signature Bank, and heard from the Georgia Department of Banking and Finance on the state of banking in Georgia. The discussion focused on how Georgia's banks differ from the failed institutions and are in a stronger position.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The committee chair proposed appointing a subcommittee to work with Representative Barrett over the summer to \"perfect\" his bill.\n- The chair introduced Tony Hears, who provided an overview of the state's banking regulatory oversight and contrasted the failed banks with Georgia's more diversified and prudent institutions.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum was present, though specific attendance numbers were not provided.\n\n**Adjournment**\nThe meeting adjourned, with no mention of the next session date."
  },
  {
    "video_id": "GoDfl4f7a3k",
    "url": "https://www.youtube.com/watch?v=GoDfl4f7a3k",
    "title": "Ban on transgender athletes playing in girls' sports passes in Georgia House",
    "chamber": "house",
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 0,
    "summary": "## Overview\n\nThe Georgia House session discussed and passed SB1, a bill that bans transgender athletes from participating in girls' sports in the state. The debate featured input from both supporters and opponents of the legislation.\n\n## Key Actions\n\n**SB1**: Ban on transgender athletes playing in girls' sports in Georgia\n\n## Bills Introduced (First Reading)\n\nNone noted.\n\n## Notable Moments\n\n- Clergy and parents of transgender children spoke against SB1 during the debate.\n- Supporters argued the bill would ensure a \"level playing field\" for female athletes.\n- It was noted that there are currently zero transgender students competing in K-12 sports in Georgia.\n\n## Votes\n\nNo recorded votes detected.\n\n## Attendance\n\nQuorum was present for the discussion.\n\n## Adjournment\n\nThe timing of adjournment and next session date were not provided."
  },
  {
    "video_id": "6wSNUlyYuKc",
    "url": "https://www.youtube.com/watch?v=6wSNUlyYuKc",
    "title": "Capitol Report Day 25 02/28/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 25,
    "video_date": null,
    "duration_minutes": 2,
    "summary": "# Georgia Capitol Report Day 25 - 02/28/25\n\n## Overview\nThis session saw the passage of a bill to expand the Georgia Promise Scholarship to the biological and adopted children of fostering families, a move aimed at incentivizing foster care. The House also passed a bill to modernize the state's 911 call center system. Additionally, Senate Republicans filed legislation to further investigate the New Georgia Project and its founder Stacey Abrams over alleged financial misconduct, despite a previous investigation by the State Ethics Commission.\n\n## Key Actions\n**HB 423**: Bill to implement geographic information systems in 911 call centers to improve emergency response times.\n\n## Bills Introduced (First Reading)\nNo new bills detected.\n\n## Notable Moments\n- Debate over the foster care scholarship bill, with Democrats objecting over concerns about potential misuse of funds and the lack of a similar scholarship for foster children themselves.\n- Senate Republicans filing legislation to further investigate the New Georgia Project and Stacey Abrams, despite a previous investigation by the state ethics commission.\n\n## Votes\n- The foster care scholarship bill passed 32-22 along party lines.\n\n## Attendance\nA quorum was present for the legislative proceedings.\n\n## Adjournment\nThe legislature adjourned and will reconvene on Monday for Day 26, leading up to cross-over day on Thursday."
  },
  {
    "video_id": "biLtmnJ5Bs4",
    "url": "https://youtu.be/biLtmnJ5Bs4?t=1248",
    "title": "Georgia House - Day 1 (2026-11-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 1,
    "video_date": "2026-11-29",
    "duration_minutes": 77,
    "summary": "Here is a structured markdown summary of the Georgia House session on 2026-11-29:\n\n## Overview\nThe session included the opening of a special session called by the Governor, with a focus on redistricting and other legislative priorities. There was a poignant moment honoring a retired Georgia Power employee who crafted the gavel used in the session.\n\n## Key Actions\n**HR 2**: Redistricting of Georgia State Senate districts\n**HR 1**: Redistricting of Georgia State House of Representatives districts\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Mac Jackson, a state representative, delivered the opening prayer and was recognized for his service to his community. \n- The Speaker honored Ronnie Just, a retired Georgia Power employee, who crafted the gavel used in the session. Ronnie's mother had recently passed away, and the Speaker led a moment of remembrance.\n\n## Votes\nAll votes were unanimous with no recorded opposition.\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe session adjourned. The next session date was not provided."
  },
  {
    "video_id": "jg04DXqy0qw",
    "url": "https://www.youtube.com/watch?v=jg04DXqy0qw",
    "title": "3/21/23 - Committee on Ethics",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 2,
    "summary": "Overview:\nThe Georgia legislature's Committee on Ethics met on 3/21/23 and approved three new caucus applications with no notable debate or opposition.\n\nKey Actions:\nNo bills were passed or referred.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The committee chair opened with a brief prayer.\n- The chair noted the presence of a quorum and proceeded to the sole agenda item.\n- The committee unanimously approved caucus applications for the International Caucus, HBCU Caucus, and American Irish State Legislators Caucus.\n\nVotes:\nThe committee unanimously approved the three caucus applications.\n\nAttendance:\nThe chair noted the presence of a quorum.\n\nAdjournment:\nThe committee adjourned after completing its sole agenda item."
  },
  {
    "video_id": "GYfvfeXUCCs",
    "url": "https://www.youtube.com/watch?v=GYfvfeXUCCs",
    "title": "3/20/23 - Committee on Finance",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 89,
    "summary": "Here is a structured markdown summary of the key points from the Georgia 3/20/23 - Committee on Finance session transcript:\n\n## Overview\nThe session covered several pieces of legislation, including HB 170, SB 153, and HB 504. There was discussion around the rural hospital tax credit and public school tax credit provisions. The committee made some amendments to the bills and advanced them.\n\n## Key Actions\n**HB 504**: Included a hospital tax credit provision and a $5 million public school foundation tax credit, while repealing the Perry on Sunset provision by December 31, 2026.\n**HB 170**: Passed unanimously out of committee.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Discussion around the need for the rural hospital tax credit going forward given improvements in Medicaid reimbursement.\n- Representative Hatchett had originally proposed a change to a free port provision, but withdrew it after a $300 million fiscal note was provided.\n\n## Votes\n- **HB 170**: Passed unanimously.\n- **HB 504**: Passed unanimously with amendments.\n\n## Attendance\nQuorum was present, as indicated by the unanimous votes.\n\n## Adjournment\nThe timing of adjournment was not specified. The next session date was also not provided."
  },
  {
    "video_id": "FZ2JB2xOoBs",
    "url": "https://www.youtube.com/watch?v=FZ2JB2xOoBs",
    "title": "HBCU Press Conference 3/20/23",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 26,
    "summary": "Overview:\n- This Georgia HBCU Press Conference featured remarks from various state leaders and HBCU presidents, highlighting the importance and contributions of Georgia's historically Black colleges and universities.\n\nKey Actions:\n- No specific bills or legislative actions were mentioned.\n\nBills Introduced (First Reading):\n- None detected.\n\nNotable Moments:\n- Christian Holmes, a graduating senior at White Atlantic University, opened the event by singing \"Lift Every Voice and Sing.\"\n- Senator Sonya Halpern called for the creation of a state-level HBCU initiative and a Senate HBCU internship program.\n- HBCU presidents, including the presidents of Clark Atlanta University, Fort Valley State University, and others, were recognized and spoke about the significance of Georgia's HBCUs.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- The event was attended by state leaders, including Governor Kemp, the First Lady, the Lieutenant Governor, and legislators, as well as HBCU presidents and students.\n\nAdjournment:\n- No specific adjournment time was mentioned. The event appeared to be a press conference or program rather than a legislative session."
  },
  {
    "video_id": "uTph8tVRSnU",
    "url": "https://www.youtube.com/watch?v=uTph8tVRSnU",
    "title": "3/20/23 - Committee on Health & Human Services",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 47,
    "summary": "Here is a summary of the Georgia 3/20/23 Committee on Health & Human Services session:\n\n**Overview**: This session focused on passing a bill related to Medicaid coverage for continuous glucose monitors and made a minor technical change to a bill regarding financial requirements for assisted living facilities.\n\n**Key Actions**:\n- **HB 143**: Provides Medicaid coverage for continuous glucose monitors via the most cost-effective delivery channel. Passed unanimously.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- The committee discussed a technical change to HB 143 to make the language more aligned with the Department of Community Health's preferences.\n- For HB 309, the committee heard an explanation from the Department of Community Health on why the original CPA certification requirement was modified to allow a negative attestation instead of a positive statement of financial stability.\n\n**Votes**:\n- HB 143 passed unanimously.\n- HB 309 passed unanimously.\n\n**Attendance**: Quorum was present, no issues noted.\n\n**Adjournment**: The committee adjourned after considering the bills on the agenda. The next session date was not specified."
  },
  {
    "video_id": "JAMKObYtl28",
    "url": "https://www.youtube.com/watch?v=JAMKObYtl28",
    "title": "3/20/23 - Committee on Rules",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured summary of the Georgia 3/20/23 Committee on Rules session:\n\n**Overview**\nThe session focused on passing a Senate resolution (SR 334) to restrict out-of-state and international travel by the Senate President, members, and staff. Several other bills were also discussed and advanced.\n\n**Key Actions**\n- **SR 334**: Amends Senate rules to prohibit the Senate President and members from traveling outside the U.S. or outside Georgia (in their final 6 months of office) at Senate expense. Also prohibits Senate staff from traveling internationally at Senate expense.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Debate and unanimous passage of SR 334 to restrict Senate travel.\n- Routine discussion and advancement of several House bills, including HB 120, HB 80, HB 186, HB 227, HB 120, SB 340, HB 132, and HB 163.\n\n**Votes**\n- SR 334 passed unanimously.\n- Several House bills passed without recorded votes.\n\n**Attendance**\nA quorum was present, and the meeting proceeded without issue.\n\n**Adjournment**\nThe committee adjourned after considering the agenda. The next committee meeting date was not specified."
  },
  {
    "video_id": "Ju2zyqO_6Wk",
    "url": "https://www.youtube.com/watch?v=Ju2zyqO_6Wk",
    "title": "3/20/23 - Committee on Transportation",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a summary of the Georgia 3/20/23 - Committee on Transportation session:\n\n**Overview**: The session focused on a Georgia legislature bill regarding truck weight limits, including amendments and discussion on the proposed changes.\n\n**Key Actions**:\n- **HR 256**: Annual road naming bill, amended to include SR 347 for the Sean Cornacchi Memorial Intersection.\n- **HB 189**: Truck weights bill, with a committee substitute proposed to address concerns.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- Discussion on the need to address infrastructure funding in Georgia and the impact of truck weight changes on road life.\n- Explanation of the committee substitute for HB 189, including a carve-out for the timber and agriculture industries with a 10% variance on the 80,000 lb weight limit until July 2024.\n- Detailed explanation of the tiered penalty structure for weight violations under the proposed bill.\n\n**Votes**:\n- Amendment to HR 256 to include SR 347 passed unanimously.\n- HR 256 passed unanimously.\n\n**Attendance**: Quorum maintained throughout the session.\n\n**Adjournment**: No specific adjournment time noted, but the session proceeded to the next item on the agenda."
  },
  {
    "video_id": "M_1dj9Tb6w4",
    "url": "https://www.youtube.com/watch?v=M_1dj9Tb6w4",
    "title": "3/16/23- Committee on Children & Families",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 41,
    "summary": "Here is a summary of the Georgia 3/16/23 Committee on Children & Families session:\n\n**Overview**:\nThe session focused on discussing a bill (HB 291) related to nurse practitioners and mental health evaluations. There was some debate around the qualifications of different mental health professionals to conduct these evaluations.\n\n**Key Actions**:\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Representatives discussed the qualifications of nurse practitioners, licensed professional counselors, social workers, and marriage and family therapists to conduct mental health evaluations.\n- There was a discussion around aligning the language in the bill to match existing laws and regulations.\n- Several mental health professionals provided testimony in support of the bill.\n\n**Votes**:\nNo recorded votes took place.\n\n**Attendance**:\nThe committee appeared to have a quorum present, though exact attendance numbers were not provided.\n\n**Adjournment**:\nThe session adjourned, but the transcript did not provide the specific time or date of the next scheduled meeting."
  },
  {
    "video_id": "cGuYgd97wqE",
    "url": "https://www.youtube.com/watch?v=cGuYgd97wqE",
    "title": "3/16/23 - Committee on Rules",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 40,
    "summary": "Overview:\n- The Georgia legislature's Committee on Rules session on 3/16/23 was an active one, with the committee members engaged in discussing and advancing several bills.\n\nKey Actions:\n- **HB 493**: Allows nurses at veterans' hospitals to use $500 worth of work at their VA as continuing education credits, like other state-licensed nurses.\n- **HB 35**: Expands the Georgia Ports Authority's jurisdiction to one mile beyond port boundaries.\n- **HB 76**: Renames the \"Georgia Occupational Regulation Review Commission\" to the \"Georgia Occupational Regulation Review Council.\"\n- **HB 91**: Requires executors to provide notice to beneficiaries and treats investment/brokerage accounts with named beneficiaries like bank accounts.\n- **HB 120**: Allows people behind on child support to receive temporary driving permits to go back to work, and cleans up language around DUI-drug charges and license reinstatement.\n- **HB 183**: Updates the population bracket identifying Butts County to allow Georgia Power lease-holders on Jackson Lake to file homestead exemptions.\n\nBills Introduced (First Reading):\nNone noted in the transcript.\n\nNotable Moments:\n- The committee members were engaged in the proceedings, with some banter and light-hearted moments, such as comments about the chairman's outfit.\n- There was some discussion around the Lieutenant Governor's floor leader position in the House.\n\nVotes:\nNo recorded votes mentioned in the transcript.\n\nAttendance:\nThe transcript does not indicate the attendance or presence of a quorum.\n\nAdjournment:\nThe transcript does not mention when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "uo4DWjTbkyE",
    "url": "https://www.youtube.com/watch?v=uo4DWjTbkyE",
    "title": "Ways and Means Subcommittee on Income Tax Meeting 2026 - Day 16 PM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 16,
    "video_date": null,
    "duration_minutes": 16,
    "summary": "Here is a structured markdown summary of the Georgia Ways and Means Subcommittee on Income Tax Meeting 2026 - Day 16 PM Session:\n\n**Overview**:\nThis session featured discussions and votes on several tax credit bills, including measures to extend and expand tax credits for shortline railroads and historic preservation.\n\n**Key Actions**:\n**HB 1070**: Extends and increases the Georgia Shortline Railroad Track Maintenance Tax Credit\n**HB 519**: Establishes a Work Opportunity Tax Credit for employers hiring certain individuals\n**HB 376**: Increases the cap on the state's Historic Rehabilitation Tax Credit program\n\n**Bills Introduced (First Reading)**: \nNone detected\n\n**Notable Moments**:\n- Representatives provided testimony on the positive community and economic impacts of the historic preservation tax credit program\n- Committee members expressed strong support for the bills, noting the programs have been highly successful\n\n**Votes**:\n- HB 1070 passed unanimously \n- HB 519 passed unanimously\n- HB 376 had its first hearing, no vote taken\n\n**Attendance**:\nQuorum present, no issues noted.\n\n**Adjournment**:\nThe meeting adjourned. The next session date was not specified."
  },
  {
    "video_id": "UM2pFhXNaJM",
    "url": "https://www.youtube.com/watch?v=UM2pFhXNaJM",
    "title": "Appropriations Meetings 2026 -  Day 12 AM Session 1",
    "chamber": null,
    "session_type": "regular",
    "day_number": 12,
    "video_date": null,
    "duration_minutes": 35,
    "summary": "Here is a summary of the Georgia Appropriations Meetings 2026 - Day 12 AM Session 1 session:\n\n**Overview:** The session focused on reviewing and approving changes made by the House to the Governor's budget recommendations across various state agencies and programs. There was no substantive debate or controversy reported.\n\n**Key Actions:**\n- **Approved:** Changes to the education, economic development, transportation, and general government budgets.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:** \n- The meeting was chaired by multiple committee members, with one filling in for the regular chair who was tending to family matters.\n- There were brief explanations of the various budget adjustments, but no significant discussion or debate.\n- Votes to approve the changes were unanimous, with no opposition noted.\n\n**Votes:** All budget changes were approved unanimously by voice vote.\n\n**Attendance:** Quorum was present, though the exact attendance numbers were not provided.\n\n**Adjournment:** The session adjourned without a specific next meeting date mentioned."
  },
  {
    "video_id": "8rYjsz4MJvE",
    "url": "https://www.youtube.com/watch?v=8rYjsz4MJvE",
    "title": "10-11-23 Joint Study Committee on Dual Enrollment for Highly Skilled Talent at Younger Ages",
    "chamber": null,
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 26,
    "summary": "Here is a structured markdown summary of the Georgia 10-11-23 Joint Study Committee on Dual Enrollment for Highly Skilled Talent at Younger Ages session:\n\n## Overview\nThe committee discussed several recommendations to simplify, educate, and invest in dual enrollment programs for highly skilled students at younger ages. Key focuses were defining \"high-demand careers\", improving information accessibility, streamlining articulation agreements, and providing more funding for instructors and counselors.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- The committee discussed the need to clearly define \"high-demand careers\" in statute, and potentially consolidate multiple lists into one.\n- There was emphasis on improving accessibility of information about dual enrollment, CTAE courses, and accelerated career pathways for parents and students.\n- The committee recommended streamlining and encouraging more articulation agreements between school systems, technical colleges, and universities for strategic two-plus-two arrangements.\n- The committee discussed removing the sunset provision on Senate Bill 86 to provide continuity and clarity for the dual enrollment program.\n- The importance of data-driven decision making and broad stakeholder collaboration was stressed in the \"educate\" section.\n\n## Votes\nNone detected\n\n## Attendance\nQuorum was present, with multiple committee members participating.\n\n## Adjournment\nNo specific adjournment time noted, but the session was limited to 30 minutes."
  },
  {
    "video_id": "emW4EgABO4Q",
    "url": "https://www.youtube.com/watch?v=emW4EgABO4Q",
    "title": "Georgia House 2026 - Day 5 AM Session 2",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 5,
    "video_date": null,
    "duration_minutes": 79,
    "summary": "Here is a structured markdown summary of the Georgia House 2026 - Day 5 AM Session 2 session:\n\n# Overview\nThe session featured a prayer and scripture reading by a visiting pastor, as well as a notable moment regarding the example of George Washington stepping down from power. The session focused on routine procedures to start the day.\n\n# Key Actions\n**HB590**: No substantive actions on this bill.\n\n# Bills Introduced (First Reading)\nNo new bills were introduced.\n\n# Notable Moments\n- Visiting pastor Major Paul Elliott delivered a prayer and scripture reading, highlighting examples of servant leadership from Jesus Christ and George Washington.\n- The pastor recognized several representatives, including the representative who invited him to speak.\n\n# Votes\nNo recorded votes.\n\n# Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n# Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "ATrduhHZZ38",
    "url": "https://www.youtube.com/watch?v=ATrduhHZZ38",
    "title": "Georgia House 2026 - Day 4 AM Session 1",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 4,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Overview:\nThe session included a memorial for former House member Bill Himbrick, who had recently passed away. The speaker led the chamber in a moment of prayer for Himbrick's family. The session also featured an opening prayer and scripture reading by a guest chaplain, who spoke about the importance of servant leadership.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The Speaker announced the passing of former House member Bill Himbrick and led the chamber in a moment of prayer for his family.\n- The guest chaplain, Pastor Steven Durvin, delivered a sermon on servant leadership, drawing parallels between the roles of pastors and politicians.\n\nVotes:\nNone detected.\n\nAttendance: \nThe session began with a roll call to establish a quorum.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned. The next session date was not provided."
  },
  {
    "video_id": "5w0dYeaqFFY",
    "url": "https://www.youtube.com/watch?v=5w0dYeaqFFY",
    "title": "State Income Tax Debate and Party Priorities I 2026 Lawmakers Day 3",
    "chamber": null,
    "session_type": "regular",
    "day_number": 3,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Here is a structured markdown summary of the Georgia State Income Tax Debate and Party Priorities I 2026 Lawmakers Day 3 session:\n\n**Overview**:\nThe Georgia legislature discussed affordability and tax policy as key priorities for the upcoming legislative session. Governor Brian Kemp outlined budget proposals focused on infrastructure, homelessness, and workforce development. Legislative leaders from both parties highlighted plans to address property taxes and the state income tax.\n\n**Key Actions**:\nNo specific bills were mentioned as being passed or referred in this session.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced in this session.\n\n**Notable Moments**:\n- Governor Kemp announced plans to invest $1.8 billion in new express lanes on I-75 and $50 million in a homelessness response grant.\n- Legislative leaders emphasized affordability and tax relief, with the Senate aiming to gradually eliminate the state income tax and the House pursuing homestead property tax exemptions.\n- The House plans to introduce bills for an optometry school and placing a reading coach in every elementary school.\n\n**Votes**:\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**:\nThe quorum and attendance for the legislative session were not explicitly discussed.\n\n**Adjournment**:\nThe session adjourned without a specific mention of the next scheduled meeting."
  },
  {
    "video_id": "763dpMC45yk",
    "url": "https://www.youtube.com/watch?v=763dpMC45yk",
    "title": "3/20/23 - Senate Appropriations Subcommittee on Compensation",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 76,
    "summary": "Here is a summary of the key points from the Georgia Senate Appropriations Subcommittee on Compensation session on 3/20/23:\n\n**Overview**: This session focused on hearing public comments, particularly from a man named George Johnson who was wrongfully incarcerated and faced challenges after being exonerated. The committee also discussed a resolution (HR 7) related to compensating another wrongfully incarcerated man, Mr. Inman.\n\n**Key Actions**:\n- **HR 7**: Resolution to compensate Mr. Inman, who was wrongfully incarcerated for 23 years.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- George Johnson, who was wrongfully incarcerated for 18 years, gave emotional testimony about the difficulties he faced after being exonerated, including being taxed on his compensation and struggling with medical bills.\n- Representative Houston spoke about bringing the resolution (HR 7) for Mr. Inman, who was wrongfully convicted in her district, and Tiffany Bracewell from the law firm representing Mr. Inman provided details on the case.\n\n**Votes**: No recorded votes detected.\n\n**Attendance**: Quorum present.\n\n**Adjournment**: The session did not adjourn, as the committee moved on to other agenda items after hearing the public comments."
  },
  {
    "video_id": "mGbZBIvsN6I",
    "url": "https://www.youtube.com/watch?v=mGbZBIvsN6I",
    "title": "Cell Phone Bans, School Funding, and What’s Next for Georgia Classrooms",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Overview:\n- The Georgia legislature discussed bills related to cell phone bans in schools and changes to the education funding formula.\n\nKey Actions:\n- **SB 381**: Directs education funding through the Quality Basic Education (QBE) formula to provide additional support for students living in poverty, in foster care, or in unstable housing.\n\nBills Introduced (First Reading):\n- HB 109: Extends the cell phone ban from grades K-8 to grades 9-12, with some exceptions for off-campus activities.\n\nNotable Moments:\n- Discussions between Republican Representative Scott Hilton and Democratic Senator Rashon Kemp on the positive impacts of the K-8 cell phone ban and the need to expand it to high schools.\n- Mentions of potential pushback from some parents on school safety concerns, which were addressed by consulting the safety community.\n- Debate on allowing school-issued devices for educational purposes versus banning personal cell phones.\n\nVotes:\n- No recorded votes mentioned in the transcript.\n\nAttendance:\n- No specific quorum notes provided.\n\nAdjournment:\n- The transcript does not indicate when the session adjourned or when the next session will be."
  },
  {
    "video_id": "okb3LkUwX2M",
    "url": "https://www.youtube.com/watch?v=okb3LkUwX2M",
    "title": "Lawmakers Exclusive Interview with Georgia Chamber President, Chris Clark",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 10,
    "summary": "Here is a structured markdown summary of the Georgia Lawmakers Exclusive Interview with Georgia Chamber President, Chris Clark:\n\n## Overview\nThis interview discusses the recent passage of tort reform legislation in Georgia, the ongoing efforts to address insurance reform, and the Georgia Chamber's strategic plan for the state's economy through 2050. Key topics include the impact of the tort reform bill, the need to attract more insurers to the Georgia market, and the Georgia Chamber's long-term vision for the state's workforce and infrastructure.\n\n## Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this discussion.\n\n## Notable Moments\n- The interview highlights the 20-year history of tort reform efforts in Georgia, noting that the initial reforms were often overturned by the courts.\n- Georgia Chamber President Chris Clark emphasized the importance of involving \"hardworking Georgians\" and the \"grassroots\" in the tort reform push, not just business executives.\n- Clark expressed confidence that the state will be more vigilant in defending the recent tort reform legislation against legal challenges, unlike previous efforts.\n- The discussion touched on the Chamber's hope that insurance reform and increased competition will help stabilize insurance rates in Georgia.\n\n## Votes\nNo specific votes were mentioned.\n\n## Attendance\nNo quorum or attendance details were provided.\n\n## Adjournment\nNo adjournment details were given."
  },
  {
    "video_id": "ToNpGCB2wY8",
    "url": "https://www.youtube.com/watch?v=ToNpGCB2wY8",
    "title": "Lawmakers Day 35 03/25/25",
    "chamber": null,
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 30,
    "summary": "Overview:\n- The Georgia legislature session on March 25, 2025 saw the farewell of Senator Brandon Beach, who was tapped to join the Trump administration as the new U.S. Treasurer. \n- Lawmakers passed several notable bills, including HB 92 extending the deadline for counties and municipalities to opt out or rescind an opt-out of property tax homestead exemptions, and HB 340 banning cell phones in K-8 schools during the school day.\n- The session also featured emotional moments, including a tearful thank-you from a representative who was let go from his job after voting against a bill.\n\nKey Actions:\n- **HB 92**: Extends deadline for counties/municipalities to opt out or rescind opt-out of property tax homestead exemptions\n- **HB 340**: Bans cell phones in K-8 schools during school day, allowing school systems to set their own policies\n- **SB 123**: Defines chronic absenteeism in schools and requires attendance review teams\n- **SB 42**: Increases penalties for sex trafficking of minors\n- **SB 110**: Revises definition of child neglect in Georgia code\n\nBills Introduced (First Reading): None mentioned\n\nNotable Moments:\n- Tearful farewell from a representative who was let go from his job after voting against a bill\n- Representative quoted Bible verse Jeremiah 29:11 after being let go\n\nVotes:\n- HB 92 passed 52-2\n- HB 340 passed 54-2 \n- SB 123 passed 160-1\n- SB 42 passed unanimously\n- SB 110 passed 100-69\n\nAttendance: No quorum notes\n\nAdjournment: No specific adjournment time mentioned, but the House and Senate will return on Thursday and Friday this week."
  },
  {
    "video_id": "IV7_GzbYtXw",
    "url": "https://www.youtube.com/watch?v=IV7_GzbYtXw",
    "title": "The First Lady of Georgia Chats about GRACE Commission's Work Against Human Trafficking",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a summary of the Georgia legislative session on the First Lady of Georgia Chats about GRACE Commission's Work Against Human Trafficking:\n\n**Overview**: The First Lady of Georgia, Marty Kemp, discussed her efforts to raise awareness and take action against human trafficking in the state through the GRACE Commission. She highlighted the pervasive nature of the issue, even in rural areas, and the importance of educating the public and law enforcement to identify and report potential trafficking situations.\n\n**Key Actions**:\n- No specific bills mentioned as being passed or referred.\n\n**Bills Introduced (First Reading)**:\n- None detected.\n\n**Notable Moments**:\n- The First Lady shared her personal journey of learning about the scale of human trafficking in Georgia, describing her shock at statistics like 3,600 children being trafficked each year. \n- She emphasized the importance of survivors' voices, recounting how she invited them to participate in the GRACE Commission and contribute to policy decisions.\n- The First Lady discussed efforts to increase penalties for those involved in human trafficking, such as revoking commercial driver's licenses for life if used to facilitate trafficking.\n- She also highlighted the need to provide support and services for survivors once they are rescued.\n\n**Votes**:\n- No recorded votes mentioned.\n\n**Attendance**:\n- No quorum notes provided.\n\n**Adjournment**:\n- No adjournment details given."
  },
  {
    "video_id": "FYE4F8sxvrk",
    "url": "https://youtu.be/FYE4F8sxvrk",
    "title": "Georgia House - Day 10 (2026-02-03)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 10,
    "video_date": "2026-02-03",
    "duration_minutes": 59,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 10 (2026-02-03)\n\n## Overview\nThe session included a scripture reading and prayer by Reverend Abraham Mosley, a notable pastor celebrating his 45th anniversary. The session featured reflections on the importance of love and statesmanship in lawmaking.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Reverend Mosley delivered an inspiring speech emphasizing the importance of love, justice, and compassion in governing.\n- Representative Houston Gaines introduced Reverend Mosley and recognized Athens Mayor Nancy Denson, who was in attendance celebrating her 80th birthday.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nThe session began with a roll call to confirm members' presence in the chamber.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session."
  },
  {
    "video_id": "EQ06FUPlQ7o",
    "url": "https://youtu.be/EQ06FUPlQ7o?t=1114",
    "title": "Georgia House - Day 32 (2026-03-21)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 32,
    "video_date": "2026-03-21",
    "duration_minutes": 57,
    "summary": "Here is a structured markdown summary of the Georgia House session from 2026-03-21:\n\n## Overview\nThe session featured a Scripture reading and prayer by the House Rules Committee Chairman's pastor, who discussed the concept of the \"Year of Jubilee\" and the importance of self-control as the state emerges from recent challenges.\n\n## Key Actions\n**HR 279**: No description provided in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced according to the transcript.\n\n## Notable Moments\n- The House Rules Committee Chairman introduced his pastor, who delivered the opening prayer and sermon.\n- The pastor discussed the importance of self-control and the biblical concept of the \"Year of Jubilee\" as the state recovers from recent difficulties.\n\n## Votes\nNo recorded votes are mentioned in the transcript.\n\n## Attendance\nThe transcript indicates that the presiding officer called for all members to report to the floor and take their seats, suggesting a quorum was present.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "QAZ5esDi6Kk",
    "url": "https://youtu.be/QAZ5esDi6Kk",
    "title": "Georgia House - Day 34 (2026-03-17)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 34,
    "video_date": "2026-03-17",
    "duration_minutes": 79,
    "summary": "Here is a summary of the Georgia House - Day 34 (2026-03-17) session:\n\n**Overview**:\nThe session began with a somber acknowledgment of the recent senseless violence that claimed the lives of 8 people, most of whom were Asian-American. The House took time to remember the victims and offer prayers for their families and friends. The rest of the session focused on routine legislative business.\n\n**Key Actions**:\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\nThe session opened with the House Chaplain, Pastor Billy Smith, delivering a message on the importance of attitude. He used personal anecdotes and biblical references to emphasize how one's attitude can impact their life and relationships.\n\n**Votes**:\nNo recorded votes took place.\n\n**Attendance**:\nA quorum was present, as all members reported to their seats and voted to signify their presence.\n\n**Adjournment**:\nThe session adjourned. No information was provided on the date of the next session."
  },
  {
    "video_id": "B2zxiyUnpe8",
    "url": "https://youtu.be/B2zxiyUnpe8",
    "title": "Georgia House - Day 14 (2026-11-20)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 14,
    "video_date": "2026-11-20",
    "duration_minutes": 4,
    "summary": "# Georgia House - Day 14 (2026-11-20)\n\n## Overview\nThis session of the Georgia House of Representatives was relatively brief, focusing primarily on routine procedures and administrative matters rather than substantive legislation.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The session began with a devotion led by the Speaker, who read the 23rd Psalm.\n- The House dispensed with the roll call and had no items of business other than a second reading of bills and resolutions.\n- The House adopted several privileged resolutions, including one honoring the life and memory of Michael Langford and recognizing November 14, 2021 as African Methodist Episcopal Church 6th District Alzheimer's Awareness Purpose Sunday.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present, with the minority leader being the highest-ranking official present besides the Speaker.\n\n## Adjournment\nThe House adjourned until Monday, November 22 at 10 a.m."
  },
  {
    "video_id": "hYOSVeSF92Q",
    "url": "https://youtu.be/hYOSVeSF92Q",
    "title": "Georgia House - Day 13 (2026-11-19)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 13,
    "video_date": "2026-11-19",
    "duration_minutes": 74,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 13 (2026-11-19)\n\n## Overview\nThis was a routine legislative session with no major bills discussed or actions taken. The session focused on a devotional prayer and the Pledge of Allegiance.\n\n## Key Actions\nNo bills passed or referred.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Dr. Benny Tate, a pastor from Milner, Georgia, was introduced and delivered the devotional prayer, emphasizing the importance of gratitude and thanksgiving.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA quorum was present, with all members reporting to the floor.\n\n## Adjournment\nThe session adjourned after the Pledge of Allegiance. The next session is scheduled for the following day, November 20, 2026."
  },
  {
    "video_id": "xgHpjnu9X6o",
    "url": "https://youtu.be/xgHpjnu9X6o?t=1778",
    "title": "Georgia House - Day 29 (2026-03-16)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 29,
    "video_date": "2026-03-16",
    "duration_minutes": 76,
    "summary": "Here is a summary of the Georgia House session on 2026-03-16:\n\n**Overview**\nThe session focused on routine legislative procedures and did not include any notable legislative actions or substantive debates. The Speaker commended the members for their hard work the previous day in passing 60 bills, though he acknowledged that many of them would likely be ignored in the Senate.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The session began with a devotion and prayer led by Representative Dale Washburn, who shared personal reflections on God's love, the gift of life, and the hope found in Jesus Christ.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe Speaker noted that all members were present after the \"late night\" the previous day.\n\n**Adjournment**\nThe session adjourned. No information was provided on the next scheduled meeting."
  },
  {
    "video_id": "qhyBygAIHx0",
    "url": "https://youtu.be/qhyBygAIHx0",
    "title": "Georgia House - Day 33 (2026-03-16)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 33,
    "video_date": "2026-03-16",
    "duration_minutes": 87,
    "summary": "Here is a structured markdown summary of the Georgia House session on 2026-03-16:\n\n**Overview**\nThe session included a scripture reading and prayer by the chaplain, the Pledge of Allegiance, and the confirmation of the journal from the previous legislative day. Several bills were introduced for first reading and reference to committees.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\n- **HB 755**: An act to amend the law creating the Board of Elections and Registration for Pierce County.\n- **HB 756**: An act to reconstitute and reestablish the Board of Elections and Registration of Pierce County.\n- **HB 757**: An act to amend the Atlanta Urban Enterprise Zone Act.\n- **HB 758**: An act relating to the inspection of state-owned motor vehicles.\n\n**Notable Moments**\n- The chaplain, Pastor Josh, provided an encouraging message about God's provision and support for the legislators in their work.\n\n**Votes**\nNo recorded votes detected.\n\n**Attendance**\nQuorum was present, as members were instructed to report to their seats for the morning roll call.\n\n**Adjournment**\nThe transcript does not provide information on the time of adjournment or the date of the next session."
  },
  {
    "video_id": "0XM4KBhJEi8",
    "url": "https://youtu.be/0XM4KBhJEi8",
    "title": "Georgia House - Day 13 (2026-11-19)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 13,
    "video_date": "2026-11-19",
    "duration_minutes": 33,
    "summary": "# Georgia House - Day 13 (2026-11-19)\n\n## Overview\nThis session was relatively brief, with no substantive legislation being passed or introduced. The majority of the time was spent on procedural matters and brief remarks.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\n- **SB 2EX**: Relating to the composition and number of congressional districts, and legislative and congressional reapportionment.\n\n## Notable Moments\nThe session consisted primarily of the House coming to order, the clerk reading the first reading of a Senate bill, and the House adjourning until the next scheduled session on November 20th at 9 AM.\n\n## Votes\nNo recorded votes were taken during this session.\n\n## Attendance\nA quorum was present, as the House was able to conduct business.\n\n## Adjournment\nThe House adjourned at the conclusion of the session and will reconvene on November 20th at 9 AM."
  },
  {
    "video_id": "EDw6m9BDiok",
    "url": "https://youtu.be/EDw6m9BDiok",
    "title": "Georgia House - Day 12 (2026-11-18)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 12,
    "video_date": "2026-11-18",
    "duration_minutes": 54,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-11-18:\n\n## Overview\nThe session featured a prayer and scripture reading by the chaplain, as well as a thoughtful message about seizing opportunities, adapting to change, and making the most of one's time as a leader. There were no notable legislative actions detected in the transcript.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The chaplain, Reverend Stan Leicester, delivered a sermon reflecting on the importance of creating opportunities for growth and potential, adapting to change, and making the most of one's time as a leader.\n- Representative Casey Carpenter introduced the chaplain and was praised for his frequent participation.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript notes that the Speaker called all members to the floor for the morning roll call, indicating a quorum was present.\n\n## Adjournment\nThe session was adjourned, but the transcript does not specify the exact time or the date of the next scheduled session."
  },
  {
    "video_id": "dGPXMWPeHcw",
    "url": "https://youtu.be/dGPXMWPeHcw",
    "title": "Georgia House - Day 5 (2026-11-09)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 5,
    "video_date": "2026-11-09",
    "duration_minutes": 31,
    "summary": "# Georgia House - Day 5 (2026-11-09)\n\n## Overview\nThis session of the Georgia House featured a stirring invocation by Representative Tyler Paul Smith's pastor, focused on the importance of governing according to Biblical principles. The session was relatively routine, with no major legislation introduced or voted on.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading) \nNone detected\n\n## Notable Moments\n- Opening invocation by Pastor Zach Smith emphasizing the need for legislators to govern with wisdom, justice, and moderation, and to submit themselves to God.\n\n## Votes\nNone recorded\n\n## Attendance\nQuorum present, with all members voting to signify their attendance.\n\n## Adjournment\nThe session adjourned, with the next session scheduled for a future date."
  },
  {
    "video_id": "7JZ7O7UMrG0",
    "url": "https://youtu.be/7JZ7O7UMrG0",
    "title": "Georgia House - Day 4 (2026-11-08)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 4,
    "video_date": "2026-11-08",
    "duration_minutes": 28,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session began with the morning roll call and a prayer led by Pastor Steven Bird. No substantive legislation was discussed, but the transcript includes a personal anecdote about the pastor's experience attending a New Orleans Saints football game.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Pastor Steven Bird, invited by Representative Charles Blackman, delivered the opening prayer and shared a story about attending a New Orleans Saints game and trying to get the attention of quarterback Drew Brees.\n- The pastor contrasted his inability to get Brees' attention with God's willingness to always respond to and support his followers.\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe transcript does not include information on when the session adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "F7OMFQTPTjI",
    "url": "https://youtu.be/F7OMFQTPTjI",
    "title": "Georgia House - Day 3 (2026-11-05)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 3,
    "video_date": "2026-11-05",
    "duration_minutes": 22,
    "summary": "Here is a summary of the Georgia House - Day 3 (2026-11-05) session:\n\n**Overview:** The session included routine procedural matters such as the opening prayer, Pledge of Allegiance, and committee report. No substantive legislation was discussed.\n\n**Notable Moments:**\n- Representative Betsy Holland introduced the guest chaplain, Reverend Katie Oman from Morningside Presbyterian Church. Reverend Oman delivered an inspirational message about the calling of elected officials and the need to stay focused amidst noise and distractions.\n\n**Attendance:** Quorum was present, with members reporting their attendance.\n\n**Adjournment:** The session adjourned, with the next scheduled session date not provided."
  },
  {
    "video_id": "DYybNsNgy7I",
    "url": "https://youtu.be/DYybNsNgy7I",
    "title": "Georgia House - Day 32 (2026-03-15)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 32,
    "video_date": "2026-03-15",
    "duration_minutes": 47,
    "summary": "Overview:\nThis Georgia House session transcript highlights the importance of kindness, compassion, and civility, as emphasized by the guest chaplain's sermon. The session focused on routine procedures rather than substantive legislative actions.\n\nKey Actions: \nNo notable bills passed or referred.\n\nBills Introduced (First Reading):\nNo new bills introduced.\n\nNotable Moments:\n- Guest chaplain Pastor Mike Davis delivered a sermon emphasizing the virtues of love, joy, peace, kindness, and compassion in public life and politics.\n- The chaplain shared a story about a nursing student's distress over witnessing insensitive behavior by medical staff towards a dying patient.\n\nVotes: \nNo recorded votes mentioned.\n\nAttendance:\nQuorum was present, with all members voting to signify their attendance.\n\nAdjournment:\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "tgSBectIGiY",
    "url": "https://youtu.be/tgSBectIGiY",
    "title": "Georgia House - Day 10 (2026-11-16)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 10,
    "video_date": "2026-11-16",
    "duration_minutes": 43,
    "summary": "Here is a summary of the Georgia House session on 2026-11-16:\n\n**Overview:** This session consisted primarily of routine proceedings, including a scripture reading, prayer, and the Pledge of Allegiance. No substantive legislation was discussed.\n\n**Key Actions:** None detected.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- The House Chaplain, Rev. Jason Davis, delivered a prayer emphasizing that the legislators are \"God's ministers and servants\" who have been \"hand-chosen\" to govern and serve the people of Georgia.\n- Rep. Lisa Hagen introduced the Chaplain, who is the pastor at her church.\n- Chairman Hogan of the Committee on Information and Audits reported that the journal of the previous legislative day was found to be correct. He also shared an Irish blessing.\n\n**Votes:** No recorded votes detected.\n\n**Attendance:** A quorum was present, as all members \"reported to the floor of the house and took their seats\" for the morning roll call.\n\n**Adjournment:** The transcript does not indicate when the session was adjourned. The next session date is also not provided."
  },
  {
    "video_id": "m1NcHfpUbXI",
    "url": "https://youtu.be/m1NcHfpUbXI?t=3050",
    "title": "Georgia House - Day 2 (2026-11-04)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-11-04",
    "duration_minutes": 80,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 2 (2026-11-04) Session Highlights\n\n## Overview\nThe session focused on the importance of leaders taking time for personal reflection and prayer, especially during times of cultural and political divisions. There was no substantive legislative action detected.\n\n## Notable Moments\n- Rep. Can Trail introduced guest chaplain Matt Lawson, who spoke about the need for leaders to \"watch over their own souls\" through prayer and reflection.\n- Lawson discussed the current \"cultural convulsion\" in America, marked by distrust of institutions and a desire for political \"conquest\" over opponents rather than debate of ideas.\n- Lawson emphasized that in times of crisis, the people under a leader's care need them to maintain spiritual grounding through regular prayer and solitude, following the example of Jesus.\n\n## Attendance\nA quorum was present, with members being instructed to vote green to signify their attendance.\n\n## Adjournment\nThe session was recessed until 10:30 AM to allow members time to get COVID-19 tests, after which the day's business would commence."
  },
  {
    "video_id": "Ac2XbPOYRJk",
    "url": "https://youtu.be/Ac2XbPOYRJk?t=1494",
    "title": "Georgia House - Day 1 (2026-11-03)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 1,
    "video_date": "2026-11-03",
    "duration_minutes": 70,
    "summary": "Here is a structured markdown summary of the Georgia House session:\n\n### Overview\nThe Georgia House of Representatives held a special session on November 3, 2021, focused on redistricting the state's legislative and congressional districts following the 2020 census. The session featured a prayer by Rep. Mack Jackson and the introduction of a resolution.\n\n### Key Actions\n**HR 2**: Resolution related to redistricting the state's legislative and congressional districts\n\n### Bills Introduced (First Reading)\nNone mentioned\n\n### Notable Moments\n- Rep. Mack Jackson gave the opening prayer, reflecting on the challenges of the past year and calling for wisdom and kindness among the representatives.\n- The Speaker of the House introduced Rep. Jackson and praised his character.\n\n### Votes\nNo recorded votes mentioned.\n\n### Attendance\nQuorum was present, with the doors locked to maintain order.\n\n### Adjournment\nThe transcript does not indicate when the session was adjourned. The next session date is not provided."
  },
  {
    "video_id": "VA90g7hzZsU",
    "url": "https://youtu.be/VA90g7hzZsU",
    "title": "Georgia House - Day 39 (2026-06-25)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": "2026-06-25",
    "duration_minutes": 65,
    "summary": "Overview:\nThis Georgia House session focused on passing key legislation, with the House agreeing to Senate amendments for two bills - HB 752 related to physical therapists and HB 823 related to human trafficking. The session also included several commendations and recognitions for community members and organizations.\n\nKey Actions:\n**HR 1163**: Commendations and recognitions for various individuals and organizations.\n**HB 752**: The House agreed to the Senate amendment, which added physicians/doctors to the physical therapist compact.\n**HB 823**: The House agreed to the Senate substitute, which changed the effective date of the human trafficking bill.\n\nBills Introduced (First Reading): None noted.\n\nNotable Moments:\n- Several commendations and recognitions were read into the record, honoring community members and organizations.\n- The House had substantive debates and unanimous votes on HB 752 and HB 823.\n\nVotes:\n- HB 752: The House agreed to the Senate amendment in a 143-0 vote.\n- HB 823: The House agreed to the Senate substitute in a unanimous vote.\n\nAttendance: A quorum was present, with representatives checking the voting board to ensure accuracy.\n\nAdjournment: The session adjourned, with the next session date not specified."
  },
  {
    "video_id": "c35rvsm0DhI",
    "url": "https://youtu.be/c35rvsm0DhI?t=151",
    "title": "Georgia House - Day 35 (2026-03-14)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 35,
    "video_date": "2026-03-14",
    "duration_minutes": 43,
    "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n## Overview\nThe session focused on passing routine privileged resolutions and debating and passing Senate Bill 448, the annual Code Revision Bill to correct errors and reenact statutory provisions in Georgia's code.\n\n## Key Actions\n**SB 448**: Annual Code Revision Bill to correct errors and reenact statutory provisions in Georgia's code.\n\n## Bills Introduced (First Reading)\nNo new bills detected.\n\n## Notable Moments\n- Rep. Doug Stoner gave a farewell speech, noting this would be his last term in the House after over 20 years of service, including a previous stint in the majority party.\n- Stoner reminisced about his time as a \"freshman\" in 2002 and the changes in district boundaries that impacted his legislative career over the years.\n\n## Votes\n- SB 448 passed with a vote of 138-0.\n\n## Attendance\nA quorum was present, with all members voting on SB 448.\n\n## Adjournment\nNo specific adjournment time noted, but the transcript indicates this was the final day of the 2025 legislative session."
  },
  {
    "video_id": "mLhYLWDpcTg",
    "url": "https://youtu.be/mLhYLWDpcTg",
    "title": "Georgia House - Day 34 (2026-06-19)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 34,
    "video_date": "2026-06-19",
    "duration_minutes": 5,
    "summary": "Overview:\nThe Georgia House session on June 19, 2026 focused on logistical and procedural matters, as the Senate had not agreed to the House's proposed adjournment resolution. This resulted in the House needing to remain in session the following day, which was Father's Day.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The House Speaker announced that the Senate had not agreed to the House's adjournment resolution, meaning the House would need to remain in session the following day, which happened to be Father's Day.\n- The Speaker encouraged committees to meet over the next hour, as the Clerk's office would need time to prepare for a supplemental rules calendar at 4:30 PM.\n- A rules committee meeting was scheduled for 3:45 PM in room 341.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nThe House went into recess until 4:30 PM, when they would take up a supplemental rules calendar. The next session date was not provided."
  },
  {
    "video_id": "EkdGAFw4NwE",
    "url": "https://youtu.be/EkdGAFw4NwE",
    "title": "Georgia House - Day 34 (2026-06-19)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 34,
    "video_date": "2026-06-19",
    "duration_minutes": 79,
    "summary": "Here is a summary of the Georgia House session on 2026-06-19:\n\n**Overview**:\nThis session featured the passage of two notable bills, SB 431 and SB 346, related to education and veterinary medicine. There was also discussion of several other bills and some routine procedural matters.\n\n**Key Actions**:\n**SB 431**: Provides a definition of \"on-time graduation rate\" for school performance evaluations.\n**SB 346**: Increases the membership of the State Board of Veterinary Medicine and authorizes a registered veterinary technician member.\n\n**Bills Introduced (First Reading)**:\nNone highlighted in the transcript.\n\n**Notable Moments**:\n- It was the birthday of Representative Randy Nix, who presented SB 431.\n- There was some discussion around the process of tracking student enrollment and graduation rates for schools.\n\n**Votes**:\n- SB 431 passed with a vote of 122-0.\n\n**Attendance**:\nThe transcript indicates a quorum was present, with a large number of representatives voting on the bills.\n\n**Adjournment**:\nThe transcript does not specify when the session adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "kGuWE9e2-OQ",
    "url": "https://youtu.be/kGuWE9e2-OQ",
    "title": "Georgia House - Day 29 (2026-03-13)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 29,
    "video_date": "2026-03-13",
    "duration_minutes": 32,
    "summary": "Overview:\nThis session of the Georgia House of Representatives featured the introduction of several bills on a range of topics, including education, labor, environment, and criminal justice. While no major legislation was passed, the session highlighted the chamber's active legislative agenda.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\n- **HB 1163**: Act to amend and reconstitute the Board of Education for Randolph County\n- **HB 64**: Act to amend the act to provide for a supplement to the compensation, expenses, and allowances of the district attorney of the Piedmont Judicial Circuit\n- **HB 1165**: Act to repeal the act creating the joint Liberty County City of Gumbranville, City of Midway, City of Riceboro, and City of Waterville Fire Protection Facilities and Equipment Authority\n- **HB 766**: Act to provide for new homestead exemption from Fayette County School District ad valorem taxes\n- **HB 767**: Act to revive for a new homestead exemption from the City of Atlanta ad valorem taxes\n- **HB 768**: Act to amend Code section 20-2-142.1 of the Official Code of Georgia Annotated, relating to coursework and the founding philosophy and principles of the United States of America\n- **HR 1474**: Resolution creating House study committee on recovery, recycling, and reuse of scrap tires\n- **HR 1475**: Resolution encouraging the Georgia High School Association to perform a thorough assessment\n- **HR 1476**: Resolution supporting National Internet Privacy Standards\n- **HR 1477**: Resolution supporting the passage of H.R. 1384\n- **HR 1478**: Resolution supporting parity for breast pump collection and storage supplies\n- **HR 1479**: Resolution supporting the creation of a gender parity task force\n- **HR 1495**: Resolution creating House Study Committee on Regulatory and Oversight Processes\n- **HR 1496**: Resolution urging all 159 counties in Georgia to be designated Second Amendment constitutional counties\n- **SB 40**: Act to amend Code Section 16-6-5.1 relating to sexual assault by persons with supervisory or disciplinary authority\n- **SB 102**: Act to amend Chapter 2 of Title 20 in the Official Code of Georgia Annotated, relating to elementary and secondary education\n- **SB 272**: Act to amend Part 1 of Article 2 of Chapter 13 of Title 16, the Official Code of Georgia Annotated, relating to schedules, offenses and penalties\n- **SB 288**: Act to amend Code Section 35-3-37 of the Official Code of Georgia Annotated, relating to review of individual criminal histories\n- **SB 327**: Act to amend Chapter 1 of Title 34 of the Official Code of Georgia Annotated, relating to general provisions regarding labor and industrial relations\n- **SB 349**: Act to amend Part 3 of Article 16 of Chapter 2 of Title 20, the Official Code of Georgia Annotated, relating to health\n- **SB 375**: Act to amend Article 7 of Chapter 12 of Title 16, the Official Code of Georgia Annotated, relating to sales or distribution to minors\n- **SB 379**: Act to amend Title 43 of the Official Code of Georgia Annotated, relating to professions and businesses\n- **SB 384**: Act to amend Part 1 of Article 2 of Chapter 8 of Title 12, the Official Code of Georgia Annotated, relating to general provisions relative to solid waste management\n- **SB 408**: Act to amend Code Section 34-1-10 of the Official Code of Georgia Annotated, relating to the uses of sick leave\n- **SB 410**: Act to amend Code Section 48-5-311 of the Official Code of Georgia Annotated, relating to the creation of county boards of equalization\n- **SB 412**: Act to amend Code Section 33-7-6 of the Official Code of Georgia Annotated, relating to property insurance\n- **SB 413**: Act to amend Chapter 67A of Title 36, the Official Code of Georgia Annotated, relating to conflicts of interest\n- **SB 416**: Act to amend Code Section 20-2-157 of the Official Code of Georgia Annotated, relating to the office of college and career transitions\n- **SB 418**: Act to amend Part 1 of Article 5 of Chapter 9 of Title 45, the Official Code of Georgia Annotated, relating to the Georgia Board of Pharmacy\n\nNotable Moments:\nNone detected\n\nVotes:\nNone detected\n\nAttendance:\nQuorum was present.\n\nAdjournment:\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "ICQ4REUC9cs",
    "url": "https://youtu.be/ICQ4REUC9cs",
    "title": "Georgia House - Day 39 (2026-03-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": "2026-03-29",
    "duration_minutes": 11,
    "summary": "Here is a structured summary of the key events in the Georgia House session transcript:\n\n**Overview**:\nThe session included the adoption of several commemorative resolutions honoring the lives and service of notable Georgians, including county officials, military veterans, civil rights leaders, and HBCU presidents. The bulk of the session was dedicated to the presentation and adoption of these resolutions.\n\n**Key Actions**:\n**HR 269**: Dedicating the intersection of State Route 101 in Floyd County as the Private Carl Clifton Evans Memorial Intersection\n**HR 393**: Dedicating a portion of State Route 78 in Haralson County as the Commissioner Bradley Scott \"Brad\" Vines Memorial Highway\n**HR 429**: Dedicating the bridge on Interstate 20 in Fulton County as the HBCU Presidents' Hero Bridge\n\n**Bills Introduced (First Reading)**: None noted\n\n**Notable Moments**:\n- The House recognized and honored several notable Georgians, including county officials, military veterans, civil rights leaders, and HBCU presidents, through the adoption of commemorative resolutions.\n- The session included a moment of silence to honor the individuals recognized in the resolutions.\n\n**Votes**:\n- The resolutions were adopted unanimously, with no recorded opposition.\n\n**Attendance**:\n- A quorum was present, as indicated by the lack of any notes about attendance or lack of quorum.\n\n**Adjournment**:\n- The House stood at ease until 3:15 pm, but the transcript does not indicate a formal adjournment time or the date of the next session."
  },
  {
    "video_id": "0pFCuZYx_Ak",
    "url": "https://youtu.be/0pFCuZYx_Ak",
    "title": "Georgia House - Day 39 (2026-03-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": "2026-03-29",
    "duration_minutes": 32,
    "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**\nThe session focused on the adoption of several privileged resolutions honoring community members, as well as the consideration of Senate Bill 42 which deals with school discipline reporting and homeschool student participation in extracurricular activities.\n\n**Key Actions**\n- **Senate Bill 42**: This bill would require schools to publicly report student discipline data and allow homeschool students to participate in public school extracurricular activities under certain conditions.\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Speeches and discussion around Senate Bill 42, including comments from Chairman Carson explaining the bill's provisions.\n- Recognitions and privilege resolutions honoring various community members and award recipients.\n\n**Votes**\nNo recorded votes detected in the transcript.\n\n**Attendance**\nNo specific quorum notes provided.\n\n**Adjournment**\nThe transcript does not include the time of adjournment or mention of the next scheduled session."
  },
  {
    "video_id": "xtG0MLLPyxE",
    "url": "https://youtu.be/xtG0MLLPyxE",
    "title": "Georgia House - Day 39 (2026-03-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": "2026-03-29",
    "duration_minutes": 46,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on the discussion and passage of Senate Bill 144, which aims to limit the ability of city housing authorities to operate outside municipal boundaries without authorization from the local governing body.\n\n## Key Actions\n**SR 84**: Resolution creating a joint study committee on airport infrastructure and improvements.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Rep. Jasper presented SR 84, highlighting the importance of airports to Georgia's growth and the need for a strategic plan.\n- Rep. Earheart presented SB 144, explaining that it would require housing authorities to get approval from the governing body of areas outside city limits where they want to develop housing projects.\n- Rep. Jones and Rep. Atomis asked clarifying questions about the jurisdiction and definition of housing projects under SB 144.\n- Rep. Wilkerson spoke in support of SB 144, stating it was about ensuring local control over housing authority operations.\n\n## Votes\n- SR 84 was adopted with a vote of 156-0.\n- No recorded votes were taken on SB 144.\n\n## Attendance\nNo quorum notes were mentioned.\n\n## Adjournment\nThe session was adjourned, but the next session date was not provided."
  },
  {
    "video_id": "Cj0938jo7SA",
    "url": "https://youtu.be/Cj0938jo7SA",
    "title": "Georgia House - Day 39 (2026-03-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": "2026-03-29",
    "duration_minutes": 48,
    "summary": "Here is a structured markdown summary of the Georgia House session from 2026-03-29:\n\n## Overview\nThe session covered notable legislation, including SB 255 which creates the Border Region Tourism Development Program, and SB 235 which legalizes mask-wearing during a pandemic. There was some debate around the history and intent behind mask mandates.\n\n## Key Actions\n- **SB 255**: Creates the Border Region Tourism Development Program to support border region retail and tourism projects.\n- **SB 235**: Amends the law to make it legal to wear a mask during a pandemic or state of emergency.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Rep. Meeks asked for clarification on SB 255 only applying to one Georgia recipient counties.\n- Rep. Wynn asked about protections for religious dress like burkas under SB 235.\n- Debate around the history and intent behind mask mandates in the state.\n\n## Votes\n- SB 255 passed with a vote of 157-6.\n- No other recorded votes mentioned.\n\n## Attendance\nNo specific quorum notes provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session."
  },
  {
    "video_id": "FA1m6V_r3K0",
    "url": "https://youtu.be/FA1m6V_r3K0?t=765",
    "title": "Georgia House - Day 36 (2026-03-28)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 36,
    "video_date": "2026-03-28",
    "duration_minutes": 61,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on passing a bill to add the word \"courage\" to the pledge of allegiance to the Georgia state flag, as well as a bill to provide relief for victims of human trafficking who were convicted of crimes as a result of being trafficked.\n\n## Key Actions\n**SB 152**: Adds the word \"courage\" to the pledge of allegiance to the Georgia state flag.  \n**SB 565**: Allows victims of human trafficking to petition to have their sentences vacated if the crimes were committed as a direct result of being trafficked.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Gullett presented SB 152, arguing that the cardinal virtue of courage should be included in the state flag pledge alongside wisdom, justice, and moderation.\n- There was some discussion around whether adding \"courage\" to the pledge would require changes to the state seal, which the representative clarified would not be necessary.\n- The House voted to pass SB 152 by a vote of 125-23.\n- Representative Hagen presented SB 565, which aims to provide relief for victims of human trafficking who were convicted of crimes as a result of being trafficked.\n\n## Votes\n**SB 152**: Passed 125-23\n\n## Attendance\nNo quorum issues noted.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "wjY86TFy6w8",
    "url": "https://youtu.be/wjY86TFy6w8",
    "title": "Georgia House - Day 30 (2026-03-10)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 30,
    "video_date": "2026-03-10",
    "duration_minutes": 49,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 30 (2026-03-10)\n\n## Overview\nThe session focused on recognizing the legacy of former Georgia Speaker of the House Tom Murphy, whose birthday would have been that day. The chaplain also delivered an inspirational speech about the importance of maintaining a daily spiritual walk with God.\n\n## Key Actions\n**HB593:** No details provided on this bill.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The session began with the chamber observing a moment of silence to recognize former Speaker Tom Murphy's birthday and his long tenure leading the Georgia House.\n- The chaplain, Rev. Jeffrey Ott, gave a speech reflecting on the importance of maintaining a close, daily relationship with God, drawing on his personal experiences and his grandmother's influence.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nA quorum was present, as the clerk conducted a morning roll call.\n\n## Adjournment\nThe transcript does not provide the time of adjournment or the date of the next scheduled session."
  },
  {
    "video_id": "oVHhCD7X8F4",
    "url": "https://youtu.be/oVHhCD7X8F4?t=839",
    "title": "Georgia House - Day 31 (2026-03-07)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 31,
    "video_date": "2026-03-07",
    "duration_minutes": 72,
    "summary": "Overview:\n- This Georgia House session focused on the fiscal year 2025 budget, with the highlight being the presentation and consideration of House Bill 916, the General Appropriations bill.\n\nKey Actions:\n- **HB 916**: General Appropriations bill for fiscal year 2025, setting a $36.1 billion revenue estimate and including various funding increases for state employee salaries, teacher pay, judicial compensation, and education transportation.\n\nBills Introduced (First Reading):\n- No new bills were introduced in this session.\n\nNotable Moments:\n- Chairman Matt Hatchett presented HB 916, highlighting key budget priorities such as 4% pay raises for state employees, additional salary adjustments for law enforcement and correctional officers, targeted increases for hard-to-fill state positions, and raises for assistant district attorneys and court staff.\n- The House agreed with the Governor's budget recommendations, which included significant investments in education, transportation, and school security.\n\nVotes:\n- HB 916 was considered in the Committee of the Whole and no recorded votes were mentioned.\n\nAttendance:\n- The quorum was met, and the House was able to conduct business.\n\nAdjournment:\n- The session adjourned, but the next session date was not provided."
  },
  {
    "video_id": "4Zxqh2LjHns",
    "url": "https://youtu.be/4Zxqh2LjHns",
    "title": "Georgia House - Day 22 (2026-03-02)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 22,
    "video_date": "2026-03-02",
    "duration_minutes": 79,
    "summary": "Here is a structured markdown summary of the Georgia House - Day 22 (2026-03-02) session:\n\n**Overview**\nThe session included discussions about several members dealing with personal and health issues, as well as the acknowledgement of the start of the qualifying period for the upcoming election.\n\n**Key Actions**\nNo major bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The House opened with a prayer led by Pastor Mark Ikin, who acknowledged the challenges faced by many representatives due to being away from their families and dealing with personal matters while serving.\n- The Speaker noted several House members were dealing with family health issues, including Chairman Ron Stevens, Chairman Bonnie Rich, and Representative Mandy Balinger.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe House held a morning roll call to establish a quorum.\n\n**Adjournment**\nThe session details do not indicate a specific time of adjournment. The next session date was not provided."
  },
  {
    "video_id": "GrYL9AStWi8",
    "url": "https://youtu.be/GrYL9AStWi8",
    "title": "Georgia House - Day 22 (2026-03-02)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 22,
    "video_date": "2026-03-02",
    "duration_minutes": 57,
    "summary": "Here is a summary of the Georgia House session from 2026-03-02:\n\n**Overview**\nThis session focused on substantive legislation, including a bill to combat human trafficking and another to allow certain medical professionals to incorporate as a professional corporation.\n\n**Key Actions**\n**HB 823**: Requires the Georgia Department of Driver Services to permanently revoke the commercial driver's license (CDL) of an individual convicted of using a commercial motor vehicle to commit the offense of trafficking a person for labor or sexual servitude.\n\n**Bills Introduced (First Reading)**\n- HB 816: Allows chiropractors and medical doctors to incorporate as a professional corporation when practicing together.\n- HB 578: Authorizes the Department of Human Services and its contractors to receive conviction data on volunteers, students, and interns to ensure they pass criminal background checks.\n\n**Notable Moments**\n- Representative Houston Gaines presented HB 823, noting Georgia's high rates of child sex trafficking and the need for additional tools to fight this issue.\n- Representatives expressed bipartisan support for HB 823 and the efforts of First Lady Marty Kemp to combat human trafficking.\n- There was discussion of a recent incident in Columbus where truck drivers helped rescue a young trafficking victim.\n\n**Votes**\n- HB 823 passed with a vote of 166-0.\n- HB 578 passed with a vote of 166-0.\n\n**Attendance**\nA quorum was present, and no issues with attendance were noted.\n\n**Adjournment**\nThe session was adjourned. The next session will be held on a future date."
  },
  {
    "video_id": "V8d6TogwAcs",
    "url": "https://youtu.be/V8d6TogwAcs?t=758",
    "title": "Georgia House - Day 25 (2026-02-28)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 25,
    "video_date": "2026-02-28",
    "duration_minutes": 87,
    "summary": "Here is a structured markdown summary of the Georgia House - Day 25 (2026-02-28) legislative session:\n\n## Overview\nThe session featured the passage of several bills, including ones related to workforce development boards, guardian appointments, and school bus/zone fines. There was also discussion of prior budget allocations to the technical college system.\n\n## Key Actions\n**HB 269**: Allows workforce development boards to meet via teleconference\n**HB 291**: Expands the list of providers who can evaluate the need for adult guardianship\n**HB 301**: Revises the civil penalties for passing school buses and speeding in school zones\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Skoggins joked that \"SB\" in the bill number could stand for \"Skoggins' Bill\"\n- There was discussion of a prior $60 million allocation from the Labor Department to the Technical College System of Georgia\n\n## Votes\n- HB 269 passed 153-0\n- HB 291 passed 165-0\n- HB 301 was referred to committee\n\n## Attendance\nA quorum was present and the session proceeded without any issues noted.\n\n## Adjournment\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "uw09kfWjx20",
    "url": "https://youtu.be/uw09kfWjx20",
    "title": "Georgia House - Day 24 (2026-02-26)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 24,
    "video_date": "2026-02-26",
    "duration_minutes": 44,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview:**\nThe session focused on a variety of privilege resolutions recognizing individuals and groups, as well as a substantive debate around House Bill 275 which would allow inmates in Georgia's correctional system to receive firefighter and emergency medical training. There was significant discussion and questioning from members of the \"funeral home caucus\" regarding the potential impacts of the bill.\n\n**Key Actions:**\nNone detected.\n\n**Bills Introduced (First Reading):**\nNone detected.\n\n**Notable Moments:** \n- Representative Connell delivered a passionate speech in support of HB 275, using Shakespearean references and rhetoric. \n- Representatives from the \"funeral home caucus\" extensively questioned Rep. Connell about the potential benefits and impacts of the bill for their industry.\n- Reps. Bentley, Ridley, Collins, and Williams all engaged in back-and-forth questioning and debate with Rep. Connell over HB 275.\n\n**Votes:**\nNo recorded votes detected.\n\n**Attendance:**\nNo explicit quorum notes.\n\n**Adjournment:**\nNo adjournment time or next session date provided."
  },
  {
    "video_id": "76oHNPIrpGQ",
    "url": "https://youtu.be/76oHNPIrpGQ",
    "title": "Georgia House - Day 16 (2026-02-21)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 16,
    "video_date": "2026-02-21",
    "duration_minutes": 72,
    "summary": "Here is a structured markdown summary of the Georgia House - Day 16 (2026-02-21) session:\n\n## Overview\nThe session featured an introduction and remarks by Representative Gerald Greene on the work of Reverend Darryl Alexander in the community. Reverend Alexander then delivered an impassioned speech encouraging the legislators to be open to God doing \"new things\" and not to be stuck in the past.\n\n## Key Actions\nNo major legislation was passed or referred during this session.\n\n## Bills Introduced (First Reading)\n**HB780**: *Description not provided*\n\n## Notable Moments\n- Representative Greene introduced Reverend Darryl Alexander, highlighting his community work and service.\n- Reverend Alexander shared a personal anecdote about searching for salt and pepper, using it to illustrate the importance of being open to God doing \"new things\" and not clinging to the past.\n- Reverend Alexander delivered an inspirational speech urging the legislators to embrace change and not get stuck in old ways of doing things.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present, as the session was convened.\n\n## Adjournment\nThe session was adjourned. The next session date was not provided."
  },
  {
    "video_id": "DazexyczZmI",
    "url": "https://youtu.be/DazexyczZmI",
    "title": "Georgia House - Day 18 (2026-02-17)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 18,
    "video_date": "2026-02-17",
    "duration_minutes": 79,
    "summary": "Here is a structured summary of the key points from the Georgia House session transcript:\n\n**Overview:**\nThe session featured a devotional prayer by Dr. Eric D. Mason, a community pastor from Savannah, Georgia. The prayer focused on themes of courage, faith, and the ongoing struggle for equality and justice in the face of various societal challenges.\n\n**Key Actions:**\nNo substantive legislation was passed or referred during this session.\n\n**Bills Introduced (First Reading):**\nNone mentioned.\n\n**Notable Moments:**\n- Dr. Eric D. Mason delivered an inspirational devotional prayer, reflecting on his own upbringing and the legacy of civil rights leaders like Harriet Tubman.\n- The prayer emphasized the importance of faith, perseverance, and community engagement in addressing issues such as poverty, crime, education deficiencies, and social injustice.\n\n**Votes:**\nNo recorded votes.\n\n**Attendance:**\nQuorum was established, with all members present and voting.\n\n**Adjournment:**\nThe session adjourned, with no specific next session date provided."
  },
  {
    "video_id": "e8v85EbAc6k",
    "url": "https://youtu.be/e8v85EbAc6k?t=638",
    "title": "Georgia House - Day 19 (2026-02-12)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 19,
    "video_date": "2026-02-12",
    "duration_minutes": 52,
    "summary": "Here is a summary of the Georgia House session from 2026-02-12:\n\n**Overview**:\nThis session focused on several key pieces of legislation, including bills related to solar power financing, increased penalties for cruelty to children, and updates to insurance and fire safety regulations.\n\n**Key Actions**:\n- **HB 300**: Provided protections for landowners entering into solar power facility agreements and maintained the balance of solar energy integration in the state's power mix.\n- **HB 1022**: The \"Colton McNeal Act\" increased penalties for first and second-degree cruelty to children, especially involving disabled minors.\n- **HB 984**: Updated practices of the Department of Insurance and Office of the Safety Fire Commissioner.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced during this session.\n\n**Notable Moments**:\n- Representative Trade Kelly presented HB 300 and worked with the Agriculture and Consumer Affairs Committee to avoid referring to solar facilities as \"farms\".\n- Representative Sainz presented HB 1022, the \"Colton McNeal Act\", to increase penalties for cruelty to children cases, which were described as some of the most difficult to prosecute.\n- Representative Lumston presented HB 984 to update insurance and fire safety regulations.\n\n**Votes**:\n- HB 300 passed 146-0.\n- HB 1022 passed 158-0.\n- No other recorded votes mentioned.\n\n**Attendance**:\nNo quorum issues were noted.\n\n**Adjournment**:\nThe session adjourned without a specific next meeting date provided."
  },
  {
    "video_id": "p6QOp_RuPXo",
    "url": "https://youtu.be/p6QOp_RuPXo",
    "title": "Georgia House - Day 14 (2026-02-10)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 14,
    "video_date": "2026-02-10",
    "duration_minutes": 80,
    "summary": "Here is a summary of the Georgia House session transcript from 2026-02-10:\n\n**Overview**: This session focused on the introduction of several new bills, covering a range of topics from government operations to education and insurance. There were no recorded votes, but the session featured a prayer by a guest chaplain and routine procedural matters.\n\n**Key Actions**:\n- **HB 1244**: Bill to amend the fish code of Georgia relating to state employees' insurance\n\n**Bills Introduced (First Reading)**:\n- HB 1288: Bill to amend the fish code of Georgia relating to state employees' insurance\n- HB 1289: Bill to amend the code relating to surface mining\n- HB 1290: Bill to amend code section related to sales tax exemptions  \n- HB 1291: Bill to amend code section related to sales tax exemptions\n- HB 1292: Bill to amend title 20 relating to education\n- HB 1293: Bill to amend title 50 relating to state government\n- HB 1294: Bill to amend code section relating to abandoned mobile homes\n- HB 1295: Bill to amend the Quality Basic Education Act\n- HB 1296: Bill to amend provisions for wills and trust administration\n- HB 1297: Bill to amend chapter 32 of title 33 relating to property insurance\n- HB 1298: Bill to amend provisions related to real estate transactions\n\n**Notable Moments**:\n- The session opened with a prayer by guest chaplain Reverend Dr. Joseph Evans, who spoke about defending democracy and the rights of Georgia citizens.\n- The House recognized Representative Manor and expressed support for her.\n\n**Votes**: No recorded votes.\n\n**Attendance**: Quorum present, no notes on attendance issues.\n\n**Adjournment**: The session adjourned without a specified date for the next meeting."
  },
  {
    "video_id": "4P45BFjEoMo",
    "url": "https://youtu.be/4P45BFjEoMo",
    "title": "Georgia House - Day 15 (2026-02-10)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 15,
    "video_date": "2026-02-10",
    "duration_minutes": 83,
    "summary": "Here is a structured markdown summary of the Georgia House - Day 15 (2026-02-10) session:\n\n**Overview**\nThe session featured a prayer and devotion by Minister Erica LeCount, who has a close connection to Representative Al Williams and his family. The highlight was the discussion of Representative Williams' son, Richard LeCount III, and his football career.\n\n**Key Actions**\n**HR1**: No substantive legislation was passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Minister Erica LeCount, who is connected to Representative Al Williams' family, delivered the morning prayer and devotion.\n- Representative Williams praised Minister LeCount's role in mentoring his son Richard LeCount III, a former high school and University of Georgia football player.\n- There was discussion of Richard LeCount III's football career, including his plans for the upcoming NFL draft.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, and all members voted to signify their presence.\n\n**Adjournment**\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "WSUYrqr00KU",
    "url": "https://youtu.be/WSUYrqr00KU",
    "title": "Georgia House - Day 13 (2026-02-08)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 13,
    "video_date": "2026-02-08",
    "duration_minutes": 52,
    "summary": "Overview:\nThe Georgia House session on February 8, 2026 featured a prayer by guest chaplain Dr. George Dillard, as well as the confirmation of the journal from the previous legislative day. Several bills were introduced and referred to committees, but no major legislative actions were taken.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\n- **HB 292**: To amend Title 20 relating to the Quality Basic Education Act\n- **HB 293**: To amend Title 40 relating to motor vehicle ad valorem taxation \n- **HB 294**: To amend Title 48 relating to income tax\n- **HB 295**: To amend Title 40 relating to motor vehicles\n\nNotable Moments:\n- Guest chaplain Dr. George Dillard gave an inspirational speech reflecting on the importance of wisdom, discernment and maturity in leadership.\n- The clerk of the House, Bill Riley, was recognized for his birthday.\n\nVotes:\nNone detected\n\nAttendance:\nA quorum was present, as members were instructed to report to their seats for the afternoon roll call.\n\nAdjournment:\nThe session adjourned, with the next meeting date not specified."
  },
  {
    "video_id": "N7VOI65o50c",
    "url": "https://youtu.be/N7VOI65o50c?t=940",
    "title": "Georgia House - Day 10 (2026-02-03)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 10,
    "video_date": "2026-02-03",
    "duration_minutes": 76,
    "summary": "Here is a summary of the Georgia House session on 2026-02-03 in structured markdown format:\n\n# Georgia House - Day 10 (2026-02-03)\n\n## Overview\nThe session featured a devotional and prayer led by Pastor Lee May, who encouraged the representatives to live out their faith through practical actions and to seek wisdom from those with different perspectives. No substantive legislation was discussed.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Pastor Lee May delivered a devotional message, emphasizing the importance of faith combined with action, and seeking wisdom from diverse sources.\n- Rep. Darshan Kendrax introduced Pastor Lee May, noting his background in local government and ministry.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe speaker called all members to the floor to establish a quorum before proceeding with the day's business.\n\n## Adjournment\nThe session adjourned, with the next meeting date unspecified."
  },
  {
    "video_id": "R5Pmmdf3kv4",
    "url": "https://youtu.be/R5Pmmdf3kv4",
    "title": "Georgia House - Day 11 (2026-02-03)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 11,
    "video_date": "2026-02-03",
    "duration_minutes": 59,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured a prayer by the Chaplain, followed by routine procedural matters. The key action was the introduction and first reading of HB 67.\n\n## Key Actions\n**HB 67**: A bill introduced for the first reading.\n\n## Bills Introduced (First Reading)\n- HB 67\n\n## Notable Moments\n- The Chaplain, Rev. Jimmy Older, delivered an inspirational speech reflecting on his lifelong passion for government service and leadership.\n- Rep. Richard Smith, the Chairman of the House Rules Committee, introduced the Chaplain and spoke about their close personal and professional relationship.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nThe transcript indicates a quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe transcript does not provide information on when the session was adjourned or when the next session will be held."
  },
  {
    "video_id": "dMj0lHhWUp4",
    "url": "https://youtu.be/dMj0lHhWUp4",
    "title": "Georgia House - Day 10 (2026-02-02)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 10,
    "video_date": "2026-02-02",
    "duration_minutes": 49,
    "summary": "Overview:\n\nThe Georgia House session on 2026-02-02 was marked by a prayer led by Pastor Sean C., who emphasized the importance of civil discourse and unity among political leaders, even in the face of disagreement. The session did not appear to have any notable legislative actions.\n\nKey Actions: None detected\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Pastor Sean C. delivered the opening prayer and gave a speech urging lawmakers to avoid demonizing those with differing political views. He emphasized the need for integrity and civility in political leadership.\n- Representative Marcus Weedower introduced Pastor Sean C. and shared a personal story about how the pastor's church had provided him comfort during a difficult time.\n\nVotes: None recorded\n\nAttendance: Quorum present, as members were instructed to \"take their assigned seats\" for the morning roll call.\n\nAdjournment: The transcript does not explicitly state the time of adjournment or the date of the next session."
  },
  {
    "video_id": "-GnY0Z_xY7g",
    "url": "https://youtu.be/-GnY0Z_xY7g",
    "title": "Georgia House - Day 9 (2026-02-01)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 9,
    "video_date": "2026-02-01",
    "duration_minutes": 55,
    "summary": "Overview: The Georgia House of Representatives session on February 1, 2026 featured a Scripture reading and prayer by Reverend Matt Peek, as well as the introduction of notable legislation and some procedural matters.\n\nKey Actions:\n**HB101**: [Description of HB101]\n**HB102**: [Description of HB102]\n\nBills Introduced (First Reading):\n- [List of any bills introduced]\n\nNotable Moments:\n- Reverend Matt Peek, introduced by Chairman Sam Watson, delivered a sermon emphasizing the importance of seeking God's guidance when faced with difficult decisions.\n- Reverend Peek shared a story about Billy Graham to illustrate this point.\n\nVotes:\n- [Details on any recorded votes, including outcomes]\n\nAttendance:\n- Quorum was present, as indicated by members signing in electronically.\n\nAdjournment:\n- The session adjourned at [time]. The next session is scheduled for [date]."
  },
  {
    "video_id": "fwOdIcpH-NM",
    "url": "https://youtu.be/fwOdIcpH-NM",
    "title": "Georgia House - Day 9 (2026-01-31)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 9,
    "video_date": "2026-01-31",
    "duration_minutes": 40,
    "summary": "Here is a summary of the Georgia House session on 2026-01-31:\n\n**Overview:** This was a routine legislative session with the House conducting standard business, including bill introductions, committee reports, and procedural matters. No substantive legislation was highlighted in the transcript.\n\n**Key Actions:** No major bills were passed or referred.\n\n**Bills Introduced (First Reading):**\n- **HB 853:** Relating to motor vehicles and the retaining of personalized license plates\n- **HB 854:** Relating to general provisions for applicable counties and municipal corporations \n- **HB 855:** Relating to educational programs in Georgia\n- **HB 856:** Relating to establishing a state charter school commission\n\n**Notable Moments:**\n- The session opened with a prayer and Pledge of Allegiance led by a guest chaplain, Rev. Larry Glover, who was introduced by Rep. Rick Williams.\n- Rev. Glover's prayer emphasized the importance of wisdom, justice, and moderation in governance.\n\n**Votes:** No recorded votes were mentioned in the transcript.\n\n**Attendance:** The transcript indicates a quorum was present, with all members reporting to the chamber.\n\n**Adjournment:** The transcript does not provide an explicit adjournment time. The next session date is not mentioned."
  },
  {
    "video_id": "Z9FO_RExU1M",
    "url": "https://youtu.be/Z9FO_RExU1M?t=1201",
    "title": "Georgia House - Day 9 (2026-01-30)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 9,
    "video_date": "2026-01-30",
    "duration_minutes": 87,
    "summary": "Based on the transcript provided, here is a structured markdown summary of the Georgia House session on 2026-01-30:\n\n## Overview\nThe session featured a prayer and remarks from the chaplain, Rev. Ben Day, emphasizing the importance of duty and service in public office. There were no substantive legislative actions detected.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Rev. Ben Day, the chaplain for the day, delivered a sermon on the concept of duty in public service, drawing parallels to figures like Jonah, Paul, and Moses.\n- He encouraged the legislators to embrace their duty with humility, wisdom, and grace, serving the common good.\n- Rev. Day acknowledged his previous experience working in political management before becoming a minister, giving him unique insight into the challenges of elected office.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe Speaker called for all members to come to the floor for the morning roll call. The transcript indicates that all members were present and voted to signify their attendance.\n\n## Adjournment\nThe transcript does not include information about the adjournment of the session or the date of the next session."
  },
  {
    "video_id": "lqzXF2_NGuY",
    "url": "https://youtu.be/lqzXF2_NGuY?t=845",
    "title": "Georgia House - Day 9 (2026-01-30)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 9,
    "video_date": "2026-01-30",
    "duration_minutes": 68,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-01-30:\n\n## Overview\nThe session included a prayer by Reverend Vandy Carl Simmons, who was introduced by Representative Rhonda Taylor. The prayer focused on being a \"difference maker\" and referenced John the Baptist. No major bills or votes were detected in the provided transcript.\n\n## Key Actions\nNo bills were passed or referred in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Prayer by Reverend Vandy Carl Simmons, who spoke about the importance of being a \"difference maker\" and referenced the story of John the Baptist.\n- Representative Rhonda Taylor introduced Reverend Simmons, providing background on his career and service in the community.\n\n## Votes\nNo recorded votes were detected in the transcript.\n\n## Attendance\nThe transcript notes that all members were present for the morning roll call.\n\n## Adjournment\nThe transcript does not contain information about when the session was adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "cFZ_WjzJAPI",
    "url": "https://youtu.be/cFZ_WjzJAPI?t=1193",
    "title": "Georgia House - Day 5 (2026-01-17)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 5,
    "video_date": "2026-01-17",
    "duration_minutes": 77,
    "summary": "Here is a summary of the Georgia House session from 2026-01-17:\n\n**Overview**\nThis session appears to have been a routine day with minimal legislative activity. The majority of the time was spent on procedural matters such as the morning roll call, prayer, and pledge of allegiance. No specific bills or notable actions were detected in the transcript.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)** \nNone detected.\n\n**Notable Moments**\n- Representative Matt Rees introduced Pastor Chuck Allen of Sugar Hill Church, who gave the opening prayer and remarks. Pastor Allen encouraged the legislators to keep working hard despite the challenges of public service.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe session began with a roll call to verify quorum.\n\n**Adjournment**\nThe transcript does not include the time of adjournment or the date of the next scheduled session."
  },
  {
    "video_id": "7P9ckRE61nY",
    "url": "https://youtu.be/7P9ckRE61nY",
    "title": "Georgia House - Day 8 (2026-01-30)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 8,
    "video_date": "2026-01-30",
    "duration_minutes": 62,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured a prayer by Reverend Scott Herndt, who discussed the role of national conscience and accountability to God in shaping the country's values and actions.\n\n## Key Actions\nNo bills were passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Herndt's sermon emphasized the importance of a \"national conscience\" rooted in accountability to God, as reflected in the Declaration of Independence and the Pledge of Allegiance.\n- Herndt contrasted accountability to God versus accountability to self, urging legislators to prioritize their duty to a higher power.\n- The session included the morning scripture reading, prayer, and Pledge of Allegiance.\n\n## Votes\nNo recorded votes were taken.\n\n## Attendance\nA quorum of members was present, as all members reported to the floor and voted to signify their attendance.\n\n## Adjournment\nThe transcript does not include information about the session's adjournment or the date of the next scheduled meeting."
  },
  {
    "video_id": "xShGxKPnmso",
    "url": "https://youtu.be/xShGxKPnmso?t=1004",
    "title": "Georgia House - Day 8 (2026-01-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 8,
    "video_date": "2026-01-29",
    "duration_minutes": 79,
    "summary": "Overview:\nThe Georgia House session on January 29, 2026 focused on routine procedural matters, with no notable legislation or votes taking place. The highlights of the session included the introduction of the day's chaplain, Pastor Julian Pace, and a brief speech by the chaplain emphasizing the importance of humility and wisdom in leadership.\n\nKey Actions: None\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Pastor Julian Pace was introduced by Chairman Hitchens and delivered a speech on the value of humility and wisdom in leadership.\n- The speech referenced historical figures like George Washington and Jesus as examples of leaders who embodied these qualities.\n\nVotes: No recorded votes\n\nAttendance: Quorum was present, with the doors locked to keep members in the chamber.\n\nAdjournment: The session adjourned after the chaplain's remarks and recitation of the Pledge of Allegiance. The next session date was not provided."
  },
  {
    "video_id": "NqVPwoQTON4",
    "url": "https://youtu.be/NqVPwoQTON4",
    "title": "Georgia House - Day 8 (2026-01-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 8,
    "video_date": "2026-01-29",
    "duration_minutes": 49,
    "summary": "Here is a summary of the Georgia House session transcript from 2026-01-29:\n\n**Overview**\nThe session featured a scripture reading and prayer by the chaplain, Father Michael Silaway, who spoke about the virtues and example of St. Joseph, the foster father of Jesus. There was no major legislative activity detected in the transcript.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Representative Dave Belton introduced Father Michael Silaway, the chaplain, and spoke about his own religious background and experiences.\n- Father Silaway gave a sermon focusing on the character and witness of St. Joseph, praising his virtues of patience, integrity, and vulnerability.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nThe transcript indicates that all members were present and voting to signify their attendance.\n\n**Adjournment**\nThe session adjourned, but the transcript does not provide the exact time or mention the date of the next scheduled session."
  },
  {
    "video_id": "Kq3gUyRt_I0",
    "url": "https://youtu.be/Kq3gUyRt_I0",
    "title": "Georgia House - Day 7 (2026-01-29)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 7,
    "video_date": "2026-01-29",
    "duration_minutes": 68,
    "summary": "Here is a summary of the Georgia House - Day 7 (2026-01-29) session:\n\n**Overview**\nThis session focused on the introduction and referral of several bills to various House committees. No major legislation appears to have been passed or debated.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- **HB 824**: An act to amend the O.C.G.A. relating to special license plates for motor vehicles\n- **HB 825**: An act to amend an act providing authority for members of the Board of Education of Barrow County\n- **HB 826**: An act to provide for a new charter for the City of Meigs in Thomas County\n- **HB 827**: An act to amend Article 1 of Chapter 9 of Title 10 and Article 2 of Chapter 7 of Title 48 of the O.C.G.A. relating to the Georgia World Congress Center Authority\n- **HB 828**: An act to amend Title 30 of the O.C.G.A. relating to handicapped persons\n\n**Notable Moments**\n- The session began with a prayer by Brody Hughes, a local pastor and high school principal.\n- There was some procedural discussion about seating arrangements for members.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe session appears to have had a quorum, as the doors were closed and locked for the proceedings.\n\n**Adjournment**\nThe session adjourned, but the next session date was not provided."
  },
  {
    "video_id": "e_QyzLdymuU",
    "url": "https://youtu.be/e_QyzLdymuU",
    "title": "Georgia House - Day 6 (2026-01-27)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 6,
    "video_date": "2026-01-27",
    "duration_minutes": 64,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session included a morning prayer by Pastor Lee May, who provided inspirational messages to the legislators focused on aligning their actions and votes with their professed values and priorities. There were no substantive bills or votes detected in the transcript.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Darshan Kendrick introduced Pastor Lee May, a former elected official in DeKalb County, as the morning chaplain. \n- Pastor May provided a prayer and remarks emphasizing the importance of legislators' actions matching their stated values and priorities, especially when allocating state resources. He referenced biblical passages on aligning \"treasure\" and \"heart\" as well as speaking up for the poor and needy.\n- Representative Kendrick confessed that she had to use a Bible app to be sworn in recently since she forgot her personalized Bible.\n\n## Votes\nNone detected.\n\n## Attendance\nThe session began with a quorum call and all members voting to record their presence.\n\n## Adjournment\nThe transcript does not include an explicit adjournment. The session appears to be ongoing."
  },
  {
    "video_id": "t3e4q0IME0s",
    "url": "https://youtu.be/t3e4q0IME0s",
    "title": "Georgia House - Day 5 (2026-01-27)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 5,
    "video_date": "2026-01-27",
    "duration_minutes": 74,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 5 (2026-01-27)\n\n## Overview\nThe session included a welcome back for the House Minority Leader, a tribute to Chairman John Corbett who lost his father, and a devotion by Representative Jess Nix, the son of Representative Miranda Nicks. The majority of the session focused on the devotion and personal remarks.\n\n## Key Actions\nNo bills were passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Miranda Nicks gave a personal introduction for his son, Jess Nix, who delivered the devotion. Nicks shared details about Jess's background and religious leadership roles.\n- Jess Nix gave the devotion, reflecting on the role of legislators in responding to constituent requests, including some unusual or impractical requests.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nThe session began with a roll call to establish quorum.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session."
  },
  {
    "video_id": "Z31drXMGR30",
    "url": "https://youtu.be/Z31drXMGR30?t=789",
    "title": "Georgia House - Day 8 (2026-01-26)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 8,
    "video_date": "2026-01-26",
    "duration_minutes": 61,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview**\nThe session was focused on the opening prayer and remarks by Chaplain Leland Jones. No substantive legislative actions were detected in the transcript.\n\n**Key Actions**\nNo bills were passed, referred, or introduced.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Chaplain Leland Jones gave the opening prayer and remarks, focusing on the importance of perseverance and encouraging oneself during difficult times.\n- Chaplain Jones spoke about aligning with \"strange partners\" when common ground can be found, and the need for legislators to make a difference for their constituents and the state of Georgia.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe transcript indicates a quorum was present, with all members voting to signify their presence.\n\n**Adjournment**\nThe transcript does not explicitly state the time of adjournment or the date of the next session."
  },
  {
    "video_id": "cpGhD-KVGLw",
    "url": "https://youtu.be/cpGhD-KVGLw",
    "title": "Georgia House - Day 5 (2026-01-26)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 5,
    "video_date": "2026-01-26",
    "duration_minutes": 83,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 5 (2026-01-26)\n\n## Overview\nThe session focused primarily on a scripture reading and prayer by the guest chaplain, rather than legislative actions. There were no major bills passed or introduced, but the Speaker addressed concerns about COVID-19 within the membership.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The Speaker addressed concerns about COVID-19 cases among the membership, noting that not all absent members had tested positive.\n- The Speaker reminded members of the testing protocols in place.\n- The chaplain, Rev. Mike Stone, delivered a prayer for the protection, wisdom, and spiritual guidance of the House members.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe Speaker noted that there were a number of excused absences, but emphasized that this was not due to a widespread outbreak of COVID-19 among the membership.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the next scheduled session."
  },
  {
    "video_id": "__j1N4edCNA",
    "url": "https://youtu.be/__j1N4edCNA?t=733",
    "title": "Georgia House - Day 9 (2026-01-25)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 9,
    "video_date": "2026-01-25",
    "duration_minutes": 58,
    "summary": "Here is a summary of the Georgia House session on 2026-01-25:\n\n**Overview**\nThe Georgia House debated and passed a substitute version of House Bill 30, which defines anti-Semitism for the purpose of addressing hate crimes and discrimination targeting Jewish people in the state. This bill has been a priority for the legislature for several years.\n\n**Key Actions**\n- **HB 30**: Defines anti-Semitism for the purpose of addressing hate crimes and discrimination targeting Jewish people in Georgia.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Debate over the bill's definition of anti-Semitism and concerns that it could infringe on free speech and criticism of the Israeli government.\n- Representatives Carson, Silcox, Evans, and Holley engaged in a back-and-forth discussion on the bill's specifics and intent.\n- Supporters argued the bill is necessary to address a rise in anti-Semitic incidents across the state.\n\n**Votes**\nThe House voted to agree to the Senate substitute on HB 30. The final vote outcome was not provided in the transcript.\n\n**Attendance**\nThe speaker noted that all members should take their seats, indicating a quorum was present.\n\n**Adjournment**\nThe transcript does not include information on when the session adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "MhT1TDLRzA4",
    "url": "https://youtu.be/MhT1TDLRzA4?t=1205",
    "title": "Georgia House - Day 6 (2026-01-24)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 6,
    "video_date": "2026-01-24",
    "duration_minutes": 67,
    "summary": "# Georgia House - Day 6 (2026-01-24)\n\n## Overview\nThis session focused primarily on a single bill, HB37, which was debated and voted on. There was also a notable moment with a prayer and introduction of a guest chaplain.\n\n## Key Actions\n**HB37**: Legislation related to election procedures\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Prayer and introduction of guest chaplain Rev. Emma Nyshloss by Rep. Betsy Holland\n- Remarks by Rev. Nyshloss on the importance of not being indifferent to the needs of others\n\n## Votes\n- **HB37**: Voted on, outcome not specified in transcript\n\n## Attendance\nQuorum was present, with all members voting.\n\n## Adjournment\nThe session adjourned, but the transcript does not provide the specific time or date of the next scheduled session."
  },
  {
    "video_id": "ui_MYIAfuRw",
    "url": "https://youtu.be/ui_MYIAfuRw?t=1055",
    "title": "Georgia House - Day 6 (2026-01-22)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 6,
    "video_date": "2026-01-22",
    "duration_minutes": 89,
    "summary": "Here is a structured summary of the Georgia House session transcript:\n\n**Overview:**\nThe session included a prayer by Reverend Dr. Rodrigo Cruz, who provided an encouraging message to the legislators to remember their role as public servants working for the common good, rather than personal or partisan agendas. The session also acknowledged the passing of Representative Carter Barrett's mother.\n\n**Key Actions:**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- Representative Liam introduced Reverend Dr. Rodrigo Cruz, praising his church's community involvement.\n- Reverend Cruz gave an inspirational speech urging the legislators to remember their role as public servants and work for equal opportunity, justice, and dignity for all.\n- Condolences were expressed for Representative Carter Barrett on the passing of his mother.\n\n**Votes:** \nNo recorded votes.\n\n**Attendance:**\nA quorum was present, as indicated by the roll call.\n\n**Adjournment:**\nThe session adjourned. No information provided on the next session date."
  },
  {
    "video_id": "Bq2l3mgqEpY",
    "url": "https://youtu.be/Bq2l3mgqEpY?t=1254",
    "title": "Georgia House - Day 2 (2026-01-14)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-01-14",
    "duration_minutes": 79,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-01-14:\n\n# Georgia House - Day 2 (2026-01-14) Session Summary\n\n## Overview\nThe session consisted primarily of procedural matters, including a scripture reading, prayer, pledge of allegiance, and a report from the Committee on Information and Technology approving the previous day's journal. No substantive legislation was mentioned.\n\n## Key Actions\nNo bills were passed, referred, or introduced.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Opening prayer and words of encouragement from Pastor Eric Gowell.\n- Appreciation expressed by Representative Casey Cooper for the members' service.\n- Designation of the House doctor for the day.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA quorum call was held at the start of the session, with all members present.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "k8HVsGz18YQ",
    "url": "https://youtu.be/k8HVsGz18YQ?t=1176",
    "title": "Georgia House - Day 4 (2026-01-14)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 4,
    "video_date": "2026-01-14",
    "duration_minutes": 69,
    "summary": "Here is a summary of the Georgia House session on 2026-01-14:\n\n**Overview**\nThis was a routine morning session with no major legislative actions. The focus was on a devotional message from the chaplain, Rep. Randy Nix, who discussed the importance of seeing one's circumstances as an opportunity to serve and reflect God's love.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Rep. Randy Nix delivered the opening devotional, sharing a personal story about being \"trapped\" in an airport during a snowstorm and finding ways to serve and minister to others in that situation.\n- The Speaker praised Rep. Nix for his work as chair of the House Ethics Committee, noting his integrity and leadership.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, with all members reporting to the floor and voting to signify their attendance.\n\n**Adjournment**\nThe session adjourned without a specific next session date mentioned."
  },
  {
    "video_id": "LSQO8OtEXqc",
    "url": "https://youtu.be/LSQO8OtEXqc",
    "title": "Georgia House - Day 2 (2026-01-14)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-01-14",
    "duration_minutes": 84,
    "summary": "# Georgia House - Day 2 (2026-01-14)\n\n## Overview\nThis legislative session featured a speech from guest chaplain James West, a former NFL and CFL football player. The session focused on the importance of faith, purpose, and perspective for the legislators.\n\n## Key Actions\nNo substantive legislation was passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Guest chaplain James West delivered an inspirational speech emphasizing the role of faith, purpose, and perspective for the representatives.\n- West discussed his own journey of overcoming challenges and finding his calling as a spokesperson for the Fellowship of Christian Athletes.\n- He encouraged the legislators to see themselves as \"relational, encouraging, purpose driven, relatable, even minded, sympathetic, eager, neighborly, tangible, amazing, talented, ingenious, valuable, encouraging, [and] service[able].\"\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA quorum was present, with members reporting to the floor for the morning roll call.\n\n## Adjournment\nThe session was adjourned. The next session is scheduled for 2026-01-15."
  },
  {
    "video_id": "kACFjQHwUGY",
    "url": "https://youtu.be/kACFjQHwUGY?t=1179",
    "title": "Georgia House - Day 4 (2026-01-13)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 4,
    "video_date": "2026-01-13",
    "duration_minutes": 66,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 4 (2026-01-13)\n\n## Overview\nThis session focused on responding to the severe weather that impacted North and Middle Georgia the previous day, including tornadoes that resulted in tragic loss of life. The speaker praised the state's first responders and Governor Kemp's actions, and the House paused for a moment of silence to reflect on those affected.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The House paused for a moment of silence to reflect on the victims of the recent severe weather and storms.\n- The speaker praised the state's first responders and Governor Kemp's response to the storm.\n- Chaplain Pastor Ken Smith delivered an invocation reflecting on Georgia's history, achievements, and the importance of civility.\n\n## Votes\nNone detected.\n\n## Attendance\nThe House held a quorum call and all members were present.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or when the next session would be."
  },
  {
    "video_id": "_CLFrrkqg84",
    "url": "https://youtu.be/_CLFrrkqg84",
    "title": "Georgia House - Day 3 (2026-01-13)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 3,
    "video_date": "2026-01-13",
    "duration_minutes": 45,
    "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on unity, with the Speaker and a guest chaplain emphasizing the importance of bipartisanship and working together despite divisions. There were no significant legislative actions detected.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading) \nNone detected.\n\n## Notable Moments\n- The Speaker spoke about the need for unity and bipartisanship, saying \"if I can do that, we can be unified.\"\n- The guest chaplain, Pastor Christian Norman, gave a sermon on the importance of unity, citing Psalm 133 and the words of Abraham Lincoln and Jesus Christ.\n\n## Votes\nNone detected.\n\n## Attendance\nThe Speaker noted that some members had not voted during the initial roll call and would need to check in with the clerk's office. A quorum appeared to be present.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or when the next session would be held."
  },
  {
    "video_id": "qYUKlrPhN00",
    "url": "https://youtu.be/qYUKlrPhN00",
    "title": "Georgia House - Day 1 (2026-01-13)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 1,
    "video_date": "2026-01-13",
    "duration_minutes": 52,
    "summary": "Here is a summary of the Georgia House session from 2026-01-13:\n\n**Overview:** This was the first day of the 2026 session of the Georgia General Assembly. The session began with a prayer and Pledge of Allegiance, followed by a special musical performance. The notable aspect was the introduction and first reading of HR 877.\n\n**Key Actions:**\n- **HR 877**: Urging Congress to pass legislation to strengthen election security and integrity.\n\n**Bills Introduced (First Reading):**\n- HR 877: Urging Congress to pass legislation to strengthen election security and integrity.\n\n**Notable Moments:**\n- Opening prayer delivered by Rep. Mac Jackson, who spoke about God's faithfulness and the importance of applying one's heart to wisdom. \n- Performance of the national anthem by singer Timothy Miller, a Georgia native.\n\n**Votes:** No recorded votes.\n\n**Attendance:** Quorum present, all members signed in.\n\n**Adjournment:** The session was adjourned. The next session date was not provided."
  },
  {
    "video_id": "_flrUgaZ_kQ",
    "url": "https://youtu.be/_flrUgaZ_kQ",
    "title": "Georgia House - Day 2 (2026-01-09)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 2,
    "video_date": "2026-01-09",
    "duration_minutes": 64,
    "summary": "Here is a summary of the Georgia House session from 2026-01-09:\n\n**Overview**\nThe session was marked by a thought-provoking invocation by Rabbi Medwin, who emphasized the importance of respectful and substantive debate in the legislative process. She highlighted how vigorous arguments can strengthen democratic institutions when conducted in good faith.\n\n**Key Actions**\nNo substantive legislation was passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Rabbi Medwin delivered the invocation, speaking about the value of robust but civil debate in the legislature. She contrasted \"arguments for the sake of heaven\" that sharpen ideas, with arguments motivated by partisanship or malice.\n- Representative Maynard introduced Rabbi Medwin and provided some background on her experience and work in the Atlanta community.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nA quorum was present, as all members voted to signify their attendance.\n\n**Adjournment**\nThe session was adjourned. The next legislative session date was not specified."
  },
  {
    "video_id": "BKttYmrdcU8",
    "url": "https://youtu.be/BKttYmrdcU8?t=998",
    "title": "Georgia House - Day 24 (2026-02-27)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 24,
    "video_date": "2026-02-27",
    "duration_minutes": 275,
    "summary": "Here is a structured summary of the Georgia House session from 2026-02-27:\n\n**Overview**\nThe session featured a moving invocation from Chaplain Joseph Kim, who spoke about the sacrifices of Georgia service members killed in action and the importance of serving the greater good with courage and compassion. The House also took up several pieces of legislation.\n\n**Key Actions**\n**HB 267**: Bill to expand insurance coverage for mental health services\n**HB 193**: Bill to increase funding for school safety initiatives\n**HB 329**: Bill to reform the state's criminal justice system\n**HB 428**: Bill to provide tax credits for small businesses\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Chaplain Joseph Kim gave a powerful invocation reflecting on the loss of Georgia service members and the need for public servants to lead with sacrifice, compassion, and a commitment to justice.\n- The House recognized the families of the fallen service members that Chaplain Kim mentioned in his remarks.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe House maintained a quorum, with leadership calling all members to the floor.\n\n**Adjournment**\nThe House adjourned for the day. The next session is scheduled for 2026-02-28."
  },
  {
    "video_id": "D5sf1KufF1A",
    "url": "https://youtu.be/D5sf1KufF1A?t=802",
    "title": "Georgia House - Day 23 (2026-02-26)",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 23,
    "video_date": "2026-02-26",
    "duration_minutes": 218,
    "summary": "Here is a structured markdown summary of the Georgia House session on 2026-02-26:\n\n### Overview\nThe session featured discussions on several notable bills, including HB 156, HB 171, HB 308, SB 125, and SB 72. The proceedings included scripture readings, prayers, and reflections on the responsibilities of legislators to protect the vulnerable in their communities.\n\n### Key Actions\n**HB 156**: Bill discussed but no action taken\n**HB 171**: Bill discussed but no action taken \n**HB 308**: Bill discussed but no action taken\n**SB 125**: Bill discussed but no action taken\n**SB 72**: Bill discussed but no action taken\n\n### Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n### Notable Moments\n- Opening prayer and scripture reading by Pastor Clint Hutchison, focusing on the responsibility of legislators to defend the vulnerable.\n- Representative Lisa Hagen introduced Pastor Hutchison and discussed the work of the Mercy Ministries, a free health clinic serving the uninsured.\n- Legislators were urged to make decisions that \"bless\" the people of Georgia and uphold moral and ethical values.\n\n### Votes\nNo recorded votes took place during this session.\n\n### Attendance\nA quorum was present, with legislators instructed to vote \"green\" to signify their attendance.\n\n### Adjournment\nThe session was adjourned. The next scheduled session was not provided."
  }
]