[
  {
    "video_id": "dopAmYHvZX0",
    "url": "https://www.youtube.com/watch?v=dopAmYHvZX0",
    "title": "House Day 37 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 150,
    "summary": "Overview: This Georgia House session focused on the introduction and referral of several key bills, including HB 86, SB 44, and SB 79. The session also featured a prayer by Pastor Jonas Chambliss Jr. and recognized the doctor of the day.\n\nKey Actions:\n**HB 86**: Bill to amend the Georgia Student Finance Authority\n**SB 44**: Bill to amend the state employees health insurance plan\n**SB 79**: Bill introduced but details not provided\n\nBills Introduced (First Reading):\n- HB 86: Bill to amend the Georgia Student Finance Authority\n- HB 68: Bill to amend the state employees health insurance plan \n- HB 71: Bill introduced but details not provided\n\nNotable Moments:\n- Prayer by Pastor Jonas Chambliss Jr. of Living Word Baptist Church\n- Recognition of the doctor of the day, Dr. Sanford Duke\n\nVotes: No recorded votes mentioned.\n\nAttendance: Quorum present, all members voted to signify attendance.\n\nAdjournment: The session adjourned, with the next session date not provided."
  },
  {
    "video_id": "ZsRA-DQFIuM",
    "url": "https://www.youtube.com/watch?v=ZsRA-DQFIuM",
    "title": "House PM Meeting for Day 36 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 115,
    "summary": "Overview:\nThe Georgia House session covered substantive legislation related to the state's Behavioral Health Reform and Innovation Commission. Key changes included expanding the commission's membership to better represent those with lived experiences of mental health and addiction issues.\n\nKey Actions:\n**SB 233**: Amends the law regarding the Behavioral Health Reform and Innovation Commission to increase its membership from 24 to 30 members, specifically adding representatives who have personal or family experience with mental health or addiction challenges.\n\nBills Introduced (First Reading):\nNone noted in the transcript.\n\nNotable Moments:\n- Rep. Cannon expressed support for the bill, noting the importance of including the perspectives of those who have navigated behavioral health challenges firsthand. \n- Rep. Oliver provided historical context, explaining how the commission was established in a bipartisan manner under former Speaker Ralston and has made significant progress on mental health funding and reforms.\n\nVotes:\nNo recorded votes mentioned, but the bill appears to have passed without objection.\n\nAttendance:\nNo quorum issues noted.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "4DwA2w7EdCI",
    "url": "https://www.youtube.com/watch?v=4DwA2w7EdCI",
    "title": "Appropriation Subcommittee Meetings for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 71,
    "summary": "Here is a summary of the Georgia Appropriation Subcommittee Meetings for Day 29 of the 2025 Session:\n\n**Overview**:\nThe subcommittee meetings focused on several key funding adjustments across the University System of Georgia, Student Finance Commission, Transportation, and Behavioral Health and Developmental Disabilities areas.\n\n**Key Actions**:\n- **HB 68**: Bill to establish a public school employee memorial grant program was discussed, with a $540,000 placeholder included.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- Discussions on reducing austerity at the Skidaway Institute of Oceanography, increasing funds for Georgia capital history publication, and adjusting the Zell/HOPE scholarship award amounts.\n- Proposals to increase airport aid funding, maintain rail program funding despite revenue losses, and request a report on the effectiveness of Atlanta Regional Transit.\n- Expansions of peer support for alcohol use disorder, citizen advocacy services, jail diversion programs, and homelessness services in the behavioral health area.\n\n**Votes**:\n- The subcommittee motions and votes to approve the funding changes were passed.\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: The subcommittee meetings were adjourned. The next session date was not specified."
  },
  {
    "video_id": "fpvKJldZVXQ",
    "url": "https://www.youtube.com/watch?v=fpvKJldZVXQ",
    "title": "House Day 33 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 33,
    "video_date": null,
    "duration_minutes": 187,
    "summary": "Here is a structured markdown summary of the Georgia House Day 33 session:\n\n# Georgia House Day 33 Session Summary (2025)\n\n## Overview\nThis session featured a spirited discussion, with members celebrating a victory over the Senate in a kickball game. The House also heard a devotional message from a local pastor.\n\n## Key Actions\n**SB 45**: Introduced and referred to committee  \n**SB 68**: Introduced and referred to committee\n\n## Bills Introduced (First Reading)\n- SB 45\n- SB 68 \n\n## Notable Moments\n- Pastor Brandon Newell delivered a devotional message, discussing Jesus as our \"great high priest\"\n- Members celebrated a kickball game victory over the Senate\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nA quorum was present, with all members asked to come to the floor and vote to signify their attendance.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "wOmDpc4T2UE",
    "url": "https://www.youtube.com/watch?v=wOmDpc4T2UE",
    "title": "Rules Meeting for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\n- The summary covers a Georgia legislative Rules Committee meeting, focusing on various funding and program initiatives related to education.\n\nKey Actions:\n- No specific bills were passed or referred.\n\nBills Introduced (First Reading):\n- None detected.\n\nNotable Moments:\n- Discussions around funding for agricultural education programs, STEM software, PSAT/AP exam support, literacy coaches, character education, school nutrition, school bus driver training, school safety initiatives, mental health providers, social workers, after-school programs, and heavy equipment simulators.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- No specific quorum notes provided.\n\nAdjournment:\n- The transcript does not indicate when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "Hw47NgR3IiY",
    "url": "https://www.youtube.com/watch?v=Hw47NgR3IiY",
    "title": "Senate Day 36 of the 2025 Legislature session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 116,
    "summary": "Here is a summary of the Georgia Senate Day 36 session in 2025:\n\n**Overview**\nThis session featured the introduction of several new bills, including SB 350 and SB 211, as well as some procedural matters like the confirmation of a judicial appointment. The session had a mix of routine business and more substantive legislative action.\n\n**Key Actions**\n- **SB 350**: Provided a homestead exemption\n- **SB 211**: Amended various code sections\n\n**Bills Introduced (First Reading)**\n- SB 356-361: Various bills related to county governance, boards, and code revisions\n- SR 454, 463, 474, 476: Resolutions honoring individuals and creating a study committee\n\n**Notable Moments**\n- Senator Ork gave a historical speech reflecting on the 160th anniversary of key events during the Civil War.\n\n**Votes**\n- Unanimous consent was given to suspend Senate rules to allow for the reading and assignment of a judicial appointment.\n\n**Attendance**\n- A quorum was present, and the session proceeded without any noted attendance issues.\n\n**Adjournment**\nThe session adjourned on March 27th, 2025. The next session date was not provided."
  },
  {
    "video_id": "DnpmT7oizxI",
    "url": "https://www.youtube.com/watch?v=DnpmT7oizxI",
    "title": "House Day 38 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 114,
    "summary": "Here is a structured markdown summary of the Georgia House Day 38 of the 2025 Legislative Session session:\n\n## Overview\nThe session focused on routine procedures, including roll call, a prayer by the chaplain, and a tribute to a deceased Georgia Southern Eagle mascot. No substantive legislation was discussed.\n\n## Key Actions\nNone.\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- The House paid tribute to \"Freedom\", the deceased Georgia Southern Eagle mascot, and recognized the work of the handler Steve Hines.\n- The chaplain, Dr. Rich Conwisher, delivered a sermon on excerpts from the Sermon on the Mount.\n\n## Votes\nNone recorded.\n\n## Attendance\nA quorum was present, as all members voted during the initial roll call.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "XEKouvzGV14",
    "url": "https://www.youtube.com/watch?v=XEKouvzGV14",
    "title": "April 1st Rules Meeting for the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "# Georgia April 1st Rules Meeting for the 2025 Session\n\n## Overview\nThis session focused primarily on advancing several Senate bills, including SB 255 regarding the legislature's investigative powers and SB 125 related to plumbing work. The meeting was generally routine, with few notable moments beyond the standard bill considerations.\n\n## Key Actions\n**SB 255**: Bill regarding the legislature's investigative powers and subpoena authority\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this meeting.\n\n## Notable Moments\n- Prayer and opening remarks by the chair\n- Brief discussions on SB 291, SB 51, and SB 36\n\n## Votes\n- SB 125: Approved a rules substitute (LC 550644S) by unanimous vote\n- SB 5 (now HB 124): Adopted a rules substitute (LC 520855S) without opposition\n\n## Attendance\nQuorum was present, with no notes on attendance issues.\n\n## Adjournment\nThe meeting was adjourned. The next session is scheduled for April 2nd."
  },
  {
    "video_id": "YdTnq2W0IEg",
    "url": "https://www.youtube.com/watch?v=YdTnq2W0IEg",
    "title": "House Day 34 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 34,
    "video_date": null,
    "duration_minutes": 122,
    "summary": "Overview:\nThe Georgia House session featured the introduction of several bills, including HB1294, SB 13, and SB 154. The session included a morning prayer by the chaplain, a pledge of allegiance, and recognition of a doctor of the day.\n\nKey Actions:\n**HB1294**: [Bill description not provided]\n**SB 13**: [Bill description not provided] \n**SB 154**: [Bill description not provided]\n\nBills Introduced (First Reading):\n- HB1294\n- SB 13\n- SB 154\n\nNotable Moments:\n- Opening prayer by Reverend Kim Washburn, introduced by Representative Dale Washburn\n- Reverend Washburn's message emphasized the importance of \"doing good\" and serving others\n\nVotes:\nNo recorded votes mentioned.\n\nAttendance:\nQuorum present, members verified attendance.\n\nAdjournment:\nThe session adjourned, with the next session date not provided."
  },
  {
    "video_id": "Z8CNhdqE0wM",
    "url": "https://www.youtube.com/watch?v=Z8CNhdqE0wM",
    "title": "House Day 31 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 184,
    "summary": "Here is a summary of the Georgia House Day 31 of the 2025 Session session:\n\n**Overview**\nThe session featured a prayer and remarks from Dr. Derek Lemons, a professor at the University of Georgia, highlighting the importance of using blessings to bless others. He drew parallels to the UGA football team's championship season and the university's mission to serve the state of Georgia.\n\n**Key Actions**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- SB 138\n- SB 139 \n- SB 68\n- SB 81\n\n**Notable Moments**\n- Dr. Lemons delivered a speech emphasizing the importance of passing on blessings and appreciating others, drawing on his experiences at UGA.\n- There was discussion of the UGA football team's national championship victory the previous season.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe speaker noted that some members were absent, attending a \"yellow rose ceremony\" in the blue room, but a quorum was present.\n\n**Adjournment**\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "PyvSpE1Zh_4",
    "url": "https://www.youtube.com/watch?v=PyvSpE1Zh_4",
    "title": "Rules Meeting for Day 30 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 30,
    "video_date": null,
    "duration_minutes": 225,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Rules Meeting for Day 30 of the 2025 Session:\n\n## Overview\nThis session focused on the last two substantive sections of Senate Bill 68. The committee heard from over 25 people, with around 18 in opposition and 8 in support. The discussion centered on concerns about the bill's potential impact on patient privacy, access to healthcare, and subrogation rights.\n\n## Key Actions\n**SB 68**: Bill regarding transparency in medical billing\n\n## Bills Introduced (First Reading)\nNone mentioned\n\n## Notable Moments\n- Testimony from a chiropractor and healthcare executive expressing concerns that the bill could infringe on patient privacy and make it harder for vulnerable populations to access care\n- Testimony from an attorney arguing the bill would negatively impact workers' compensation subrogation and reduce hospital bill recovery\n\n## Votes\nNo recorded votes\n\n## Attendance\nQuorum present, no specific attendance notes\n\n## Adjournment\nNo mention of adjournment or next session date"
  },
  {
    "video_id": "HGEIOYhgS9E",
    "url": "https://www.youtube.com/watch?v=HGEIOYhgS9E",
    "title": "House Day 31 of the 2025 PM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 86,
    "summary": "Here is a structured markdown summary of the Georgia House Day 31 of the 2025 PM Session session:\n\n**Overview**:\nThe session focused on passing various privileged resolutions honoring individuals and organizations, as well as the introduction and discussion of Senate Bill 144 related to liability for use of fertilizers and pesticides.\n\n**Key Actions**:\n**SB 144**: Clarifies that a manufacturer cannot be held liable for failing to warn consumers of health risks above those required by the EPA for fertilizers and pesticides.\n\n**Bills Introduced (First Reading)**: \nNone noted.\n\n**Notable Moments**:\n- Extensive discussion and defense of SB 144 by a representative, highlighting the importance of agricultural science and technology, the rigorous regulatory environment in the US compared to other countries, and the need to keep domestic chemical manufacturing viable.\n- Concerns raised about the timing of EPA regulatory changes and how that impacts Georgia farmers.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum present, all members called to the House floor.\n\n**Adjournment**:\nThe session details do not mention when the House adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "LAWKF2YLRgQ",
    "url": "https://www.youtube.com/watch?v=LAWKF2YLRgQ",
    "title": "2-27-2025 | GLBC Priorities Press Conference",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 12,
    "summary": "Overview:\nThe Georgia Legislative Black Caucus held a press conference to outline their legislative priorities for the 2025-2026 session. The priorities focused on expanding healthcare access, affordable housing, supporting Black-owned businesses, ensuring equitable education, criminal justice reform, and protecting voting rights and Black cultural heritage.\n\nKey Actions:\n**SB 50**: Peach Care Plus Act of 2025 to expand Medicaid under the Affordable Care Act\n**HB 149**: Health Mothers Act to address high maternal mortality rates, especially among Black women\n**SB 65**: Mandates kindergarten before 1st grade\n**SB 54**: Establishes statewide database to track school safety threats\n**HB 135**: Prohibits housing discrimination based on hairstyles associated with race or ethnicity\n**HB A**: Renews state investment tax credit and removes barriers for investors\n\nBills Introduced (First Reading):\n- Legislation to define housing habitability standards based on federal definitions\n- Restrictions on corporations buying up homes in Georgia\n\nNotable Moments:\n- Chair Nikki Merritt outlined the GLBC's key priorities across healthcare, housing, economic empowerment, education, public safety, and advocacy.\n- Whip Terry Cummings and Vice Chair Doreen Carter provided additional details on the legislative agenda.\n- References were made to the Trump administration's education reforms and the new conservative White House administration's proposed cuts to arts/culture funding.\n\nVotes: \nNo specific votes mentioned, but several bills were described as passed or in committee.\n\nAttendance:\nNo quorum notes provided.\n\nAdjournment:\nNo adjournment time given, but this appears to be an ongoing press conference."
  },
  {
    "video_id": "uWSQJMN-W9A",
    "url": "https://www.youtube.com/watch?v=uWSQJMN-W9A",
    "title": "House AM Day 27 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 133,
    "summary": "Here is a summary of the Georgia House AM Day 27 of the 2025 Session session:\n\n**Overview**\nThe session included a scripture reading and prayer by the chaplain, as well as recognition of a local pastor from Warner Robins. The majority of the session focused on routine procedures and did not feature any notable legislative actions.\n\n**Key Actions**\nNone.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- The chaplain, Pastor Vince Harrington, delivered a sermon focusing on the parable of the Good Samaritan and the importance of showing love and compassion in the decisions made by the legislators.\n- Rep. Biffany Ballard introduced Pastor Harrington and spoke about his work in the community, including operating a warming center and providing resources for homeless residents.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nA quorum was present, as all members were instructed to come to the floor for the morning roll call.\n\n**Adjournment**\nThe session adjourned, but the transcript does not specify the exact time or the date of the next session."
  },
  {
    "video_id": "4Qs2er5Zilo",
    "url": "https://www.youtube.com/watch?v=4Qs2er5Zilo",
    "title": "Appropriations Subcommittee Meeting for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "Overview:\nThis transcript covers the Georgia Appropriations Subcommittee meeting for Day 29 of the 2025 legislative session. The subcommittee discussed several line items in the state budget related to the judicial branch, including increases in funding for judicial salaries, security initiatives, recruitment and retention efforts, legal fees, and new judgeships.\n\nKey Actions:\n- **HB199**: Bill carried by Vice Chairman Kelly that lowered funding for traditional security initiatives.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- Prayer led by Representative Matthew Gamble to start the meeting.\n- Discussion of various budget line items related to the judicial branch, including salary increases, legal fees, and new judgeships.\n\nVotes:\n- Motion to approve the subcommittee's decisions on the judicial budget line items passed.\n\nAttendance:\nNo explicit quorum notes.\n\nAdjournment:\nThe subcommittee adjourned after completing its business."
  },
  {
    "video_id": "iEvpoo6rKTQ",
    "url": "https://www.youtube.com/watch?v=iEvpoo6rKTQ",
    "title": "Rules PM Meeting for day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for day 28 of the 2025 Session:\n\n## Overview\nThe session covered several bills, including HB384 on standardizing police officer oaths, HB57 amending the Insist's Law, HB35 increasing pay for special prosecutors, HB471 on water safety for infants, HB704 transitioning to an annual reporting dashboard, HB675 creating an offense for terrorist financial attacks, HB133 allowing religious studies off school premises, HB101 mandating insurance company rebate reporting, and HB285 providing a process to remove involuntarily committed individuals from criminal background checks. The main focus was on a rule substitute for HB521 related to annexation.\n\n## Key Actions\n- **HB521**: Rule substitute LC 473531 passed, relating to annexation requirements.\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Discussion and passage of the rule substitute for HB521 on annexation.\n\n## Votes\n- HB521 rule substitute passed with no opposition.\n\n## Attendance\nNo quorum notes mentioned.\n\n## Adjournment\nNo adjournment or next session date provided."
  },
  {
    "video_id": "9wf8Eo3VE-A",
    "url": "https://www.youtube.com/watch?v=9wf8Eo3VE-A",
    "title": "Sen. H Jones Dem Caucus Press Conference on Torte Reform  | 02/20/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "## Overview\nThis press conference by Georgia State Senate Democratic Caucus Leader H. Jones focuses on the introduction of SB 223, the \"Pro-People Pro-Business Act,\" which aims to reform tort liability laws in the state. The bill seeks to balance the interests of protecting public safety and shielding businesses from frivolous lawsuits.\n\n## Key Actions\n**SB 223**: The \"Pro-People Pro-Business Act\" that introduces several provisions to reform premises liability laws, including:\n- Establishing an affirmative defense for businesses located in high-crime areas\n- Creating a rebuttable presumption against liability if businesses have taken safety measures like proper lighting and security\n\n## Bills Introduced (First Reading)\n- SB 223: The \"Pro-People Pro-Business Act\" on tort reform\n\n## Notable Moments\n- Sen. Jones emphasizes the bill's goal of protecting legitimate claims while cutting off frivolous lawsuits against businesses\n- He criticizes the Republican approach, arguing they are attempting to restrict access to the courthouse for legitimate cases rather than just frivolous ones\n\n## Votes\nNo votes were mentioned in the transcript.\n\n## Attendance\nNo quorum or attendance details were provided.\n\n## Adjournment\nThe press conference ended without any mention of adjournment or the next session date."
  },
  {
    "video_id": "I4WS1HWcWyk",
    "url": "https://www.youtube.com/watch?v=I4WS1HWcWyk",
    "title": "House Day 25 for the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 25,
    "video_date": null,
    "duration_minutes": 155,
    "summary": "Here is a summary of the Georgia House Day 25 session for the 2025 Session:\n\n**Overview**:\nThe session featured a prayer by Rabbi Adam Star, who spoke about the importance of moral courage and standing up against bigotry, particularly in light of recent anti-Semitic attacks. The session proceeded with routine business, including reports from committees.\n\n**Key Actions**:\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**:\n- HB 303\n- HB 422 \n- HB 529\n- SB 495\n\n**Notable Moments**:\n- Rabbi Adam Star gave an inspirational prayer, calling on lawmakers to speak out against hatred and violence, especially towards the Jewish community.\n- The Speaker recognized the physician of the day, Dr. Catherine West, who was invited by Representative Lee Hawkins.\n\n**Votes**:\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**:\nThe Speaker asked all members to come to the floor and take their seats, indicating a quorum was present.\n\n**Adjournment**:\nThe transcript does not specify when the session was adjourned or when the next session would be."
  },
  {
    "video_id": "Rhm3Zlx0cdo",
    "url": "https://www.youtube.com/watch?v=Rhm3Zlx0cdo",
    "title": "Sen. Tillery Press Conference on Eliminating State Income Tax | 07-24-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "## Overview\nSen. Tillery announced his plan to introduce legislation in the 2026 legislative session to eliminate the Georgia state income tax. He will chair a study committee to determine how to responsibly achieve this goal while protecting the state's priorities. The senator emphasized this is not a debate about whether to eliminate the tax, but rather how to do it.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Sen. Tillery stated his commitment to eliminating the Georgia state income tax during the 2026 legislative session.\n- He will chair a study committee to determine the path forward, working closely with the Lieutenant Governor.\n- The senator argued that eliminating the state income tax is about competitiveness, economic freedom, and allowing Georgians to keep more of their money.\n- He pointed to 9 states that have already eliminated their state income tax as examples Georgia can learn from.\n\n## Votes\nNone detected\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment details provided."
  },
  {
    "video_id": "crLr2N1HUwY",
    "url": "https://www.youtube.com/watch?v=crLr2N1HUwY",
    "title": "Majority Caucus Press Conference | 02/03/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 16,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Majority Caucus Press Conference on 02/03/2025:\n\n## Overview\nThe Georgia Senate Majority Caucus outlined a conservative legislative agenda focused on providing security and relief for Georgia families and communities impacted by Hurricane Helene. Key priorities include disaster aid, balancing the civil justice system, and protecting children in schools.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Senate President John Kennedy thanked the caucus members for their unity and hard work, and outlined three key priorities:\n  1. Providing state resources and relief to communities devastated by Hurricane Helene\n  2. Balancing the civil justice system to ensure fair access and stabilize insurance costs\n  3. Protecting children and creating safe school environments\n- Majority Leader Steve Gooch framed the caucus' agenda around providing \"security\" for families, neighbors in need, and job creators. He highlighted plans to explore legislative remedies to assist timber owners and farmers impacted by Hurricane Helene.\n\n## Votes\nNone detected.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment or next session date mentioned."
  },
  {
    "video_id": "_v4ewO5oSWU",
    "url": "https://www.youtube.com/watch?v=_v4ewO5oSWU",
    "title": "Sen. Halpern's Response to President Trump's Joint Address to Congress | 3-4-2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "# Georgia Sen. Halpern's Response to President Trump's Joint Address to Congress | 3-4-2025\n\n## Overview\nSenator Sonia Halpern of Georgia's 39th Senate District delivered a critical response to President Trump's joint address to Congress, highlighting the negative impacts of the Trump administration's policies on Georgia families and businesses.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Sen. Halpern expressed concern over President Trump's campaign promises being broken, resulting in economic consequences for her constituents.\n- She criticized the Trump administration's policies, including layoffs at the CDC, tariffs hurting Georgia farmers, and cuts to research funding.\n- Sen. Halpern called on Congress to provide a check and balance on the President and his \"co-president\" Elon Musk, and to focus on reducing costs for American families, protecting jobs, and growing the economy.\n- She pledged to continue working at the state level to improve education, healthcare, and wages for Georgia families.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum maintained.\n\n## Adjournment\nNo specific adjournment time provided. Next session date not mentioned."
  },
  {
    "video_id": "d9FvL9o5P8c",
    "url": "https://www.youtube.com/watch?v=d9FvL9o5P8c",
    "title": "House Day 36 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 117,
    "summary": "Overview: This Georgia House session was focused on recognizing the contributions of long-time state Representative Terry England, as well as the opening prayer and pledge of allegiance.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- The House recognized the presence of Terry England, a beloved state representative, and celebrated his service and impact.\n- The opening prayer was delivered by Reverend Dr. Hugh Ward, who was introduced by Representative Chaz Cannon.\n\nVotes: None detected.\n\nAttendance: A quorum was present, as members were called to the floor to vote their presence.\n\nAdjournment: The session transcript does not indicate when the session was adjourned. The next session date is not provided."
  },
  {
    "video_id": "UNWjOGW0iks",
    "url": "https://www.youtube.com/watch?v=UNWjOGW0iks",
    "title": "Senate PM 5 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 1,
    "summary": "Here is a summary of the Georgia Senate PM 5 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis was a brief session focused on adjourning for the day. No substantive legislation was discussed.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\nThe majority leader moved to adjourn the session \"sine die\" (without setting a future date). There was some opposition voiced, but the motion ultimately passed.\n\n**Votes**\nA voice vote was held on the motion to adjourn sine die. The majority in favor was clear, despite some opposition.\n\n**Attendance**\nA quorum was present to conduct business.\n\n**Adjournment**\nThe Senate adjourned sine die, with no future session date set."
  },
  {
    "video_id": "xE822lYvzvg",
    "url": "https://www.youtube.com/watch?v=xE822lYvzvg",
    "title": "Rules PM Meeting for Day 40 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThe meeting had a cheerful atmosphere, with members dancing and singing as they arrived. The main focus was on procedural matters, including recognitions, presentations of legislation, and the approval of study committees.\n\n## Key Actions\n**SB 148**: Pilot program for development of outdoor learning spaces in schools, along with other education-related provisions.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Recognition of Erin Garland, an assistant from Elverton, who was attending the Rules Committee for the first time.\n- Presentation of a proposed rules committee substitute for SB 148, which combined several education-related bills.\n- Discussion and approval of 11 study committee requests, with the days reduced from five to three.\n- Discussion of House Resolution 887 regarding code cleanup.\n\n## Votes\n- SB 148 by Substitute LC 610264S was approved.\n- The 11 study committee requests were approved as a group.\n- A supplemental calendar was set, including several house resolutions and SB 148.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session."
  },
  {
    "video_id": "S9BR9KnnIIU",
    "url": "https://www.youtube.com/watch?v=S9BR9KnnIIU",
    "title": "Rules AM Meeting for Day 40 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 28,
    "summary": "Here is a structured markdown summary of the Georgia Rules AM Meeting for Day 40 of the 2025 Session:\n\n**Overview**\nThis meeting discussed House Resolution 885, which would establish a House Study Committee to examine Georgia's election procedures and policies. The discussion centered around the composition of the study committee and ensuring diverse perspectives are represented.\n\n**Key Actions**\n**HR 885**: Resolution to create a House Study Committee on Georgia election procedures\n\n**Bills Introduced (First Reading)**\nNone noted\n\n**Notable Moments**\n- Rep. Evans proposed amending the study committee to include non-legislative members such as election board chairs and election law experts.\n- Rep. Hughley requested the study not impose new election rules in an election year and that the minority party be equally represented on the committee.\n- Chairman Anderson stated the intent was to have a legislative-only committee that could hear testimony from outside experts, rather than directly including them on the committee.\n\n**Votes**\nNo recorded votes\n\n**Attendance**\nQuorum present, no issues noted.\n\n**Adjournment**\nMeeting adjourned. Next session date not provided."
  },
  {
    "video_id": "VDon2vYQnhA",
    "url": "https://www.youtube.com/watch?v=VDon2vYQnhA",
    "title": "Senate PM Meeting pt. 3 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 84,
    "summary": "Here is a summary of the Georgia Senate PM Meeting pt. 3 for Day 39 of the 2025 Session:\n\n**Overview:** The session featured debate and passage of a bill to establish a Georgia Music Office and promote the state's music industry. Senators highlighted Georgia's rich musical heritage and the need to support local musicians and the music economy.\n\n**Key Actions:**\n**HB 14:** Establishes the Georgia Music Office and Music Ready Communities Act to promote Georgia's music industry.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Sen. Hatcher (46th) gave an impassioned speech celebrating Georgia's musical legacy, from Otis Redding to R.E.M. to Usher, and called for greater state support for the music industry.\n- Sen. Hatcher reminisced about his own love of music, including buying 8-track tapes as a teenager.\n- Sen. Hatcher acknowledged bipartisan support for the bill and thanked Sen. Jones (39th) for her collaboration.\n- Sen. Smith (8th) playfully tested Sen. Hatcher's music knowledge by asking him to name the greatest solo recording artist of all time (Elvis Presley).\n\n**Votes:**\n- HB 14 passed with a unanimous vote.\n\n**Attendance:** Quorum present.\n\n**Adjournment:** The session adjourned. Next session date not specified."
  },
  {
    "video_id": "2zeUiLWlNsY",
    "url": "https://www.youtube.com/watch?v=2zeUiLWlNsY",
    "title": "House PM 4 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 54,
    "summary": "Here is a structured markdown summary of the key details from the Georgia House PM 4 Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThis session focused on passing several notable bills and resolutions, including final action on HB 399 related to landlords and tenants, and HB 296 related to driver's licenses. The session also involved the recognition of various community members and organizations through privileged resolutions.\n\n## Key Actions\n**HB 399**: Bill to create accountability for hedge funds and out-of-state investors purchasing large numbers of single-family homes, passed by the House.\n**HB 296**: Bill to amend laws related to the issuance, expiration, and renewal of driver's licenses, including mobile driver's licenses.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- The House took up a large number of privileged resolutions recognizing and honoring various individuals and organizations for their contributions to the community.\n- There was a pause in the proceedings to ensure all members were present in the chamber.\n\n## Votes\n- HB 399 passed the House by a vote of 159-5.\n- HB 296 was agreed to by the House.\n\n## Attendance\nQuorum was present, with all members instructed to be seated in the chamber.\n\n## Adjournment\nThe session adjourned, with the next meeting date not specified."
  },
  {
    "video_id": "C7AXuXJ18x0",
    "url": "https://www.youtube.com/watch?v=C7AXuXJ18x0",
    "title": "Senate PM 3 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Here is a summary of the Georgia Senate PM 3 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis session focused on the passage of SB 82, which aims to incentivize local charter school approval. Several new bills were also introduced for first reading.\n\n**Key Actions**\n**SB 82**: A bill to enact the Local Charter School Authorization and Support Act of 2025, providing incentives for local boards of education to approve new charter school petitions.\n\n**Bills Introduced (First Reading)**\n- SB 373: To amend Article 1 of Chapter 17, Title 45\n- SB 374: To amend Part 1 of Article 1 of Chapter 2 of Title 35 (Public Safety)  \n- SB 375: To amend Chapter 1\n- SB 376: By Senator Robertson\n- SB 377: By Senator Smith\n- SB 378: By Senator Smith\n\n**Notable Moments**\n- The Senate suspended certain rules to allow for the first reading and assignment of the new bills.\n- The chamber broke for dinner, which was provided by Copeland's restaurant.\n\n**Votes**\n- The Senate voted 44-10 to agree to the House substitute on SB 82.\n\n**Attendance**\n- A quorum was present.\n\n**Adjournment**\nThe Senate stood at ease for dinner and reconvened around 7:30pm. The session then adjourned for the day."
  },
  {
    "video_id": "BQYKI5_G8pc",
    "url": "https://www.youtube.com/watch?v=BQYKI5_G8pc",
    "title": "House PM 2 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Overview:\n- The Georgia House held a legislative session on Day 40 of the 2025 Session. The session focused on passing two bills related to the judicial system and public records.\n\nKey Actions:\n- **SB 218**: Moves the Prosecuting Attorney's Qualifications Commission (PAQC) from the Prosecuting Attorney's Council to the Administrative Office of the Courts, clarifies the appeals process, and modifies confidentiality related to District Attorneys and Solicitor Generals.\n- **SB 12**: Defines the custodian of public records and specifies that requests to view public records must go through the custodian. Also requires third parties with government records to provide them to the custodian upon request.\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Debate on whether SB 218 removed a requirement for sheriff's deputies in courthouses.\n- Confirmation that SB 12 reverted back to the original Senate-passed version with carefully vetted language.\n\nVotes:\n- SB 218 passed 149-18.\n- SB 12 passed 167-1.\n\nAttendance: Quorum present, no notes on attendance.\n\nAdjournment: No explicit mention of adjournment, but the session appears to have concluded."
  },
  {
    "video_id": "-LHjoc6G1HA",
    "url": "https://www.youtube.com/watch?v=-LHjoc6G1HA",
    "title": "Senate PM Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 71,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Day 40 of the 2025 Legislative Session:\n\n## Overview\nThe session included discussions on several bills, including HB 172 related to student loan forgiveness for veterinarians, HB 222 regarding bond information requirements, and amendments to other bills. There was some debate and procedural wrangling, but ultimately several bills were passed.\n\n## Key Actions\n**HB 172**: Provides for limits on student loan forgiveness program for veterinary education and other purposes.  \n**HB 222**: Amends Title 17 to revise certain bond holding requirements and require inclusion of contact information.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- There was a discussion about the need for large animal veterinarians in Georgia, with a Senator recounting a presentation he attended by an Alabama veterinarian.\n- An amendment was proposed to HB 222 to revise bond holding requirements, but a point of order was raised that it was a \"floor substitute\" and should be struck per the Senate rules.\n\n## Votes\n- HB 172 passed with a vote of 43-4.\n- The amendment to HB 222 was subject to a point of order challenging it as a \"floor substitute\".\n\n## Attendance\nA quorum was present, with one Senator excused for business outside the chamber.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "Z1tirjPBB7Q",
    "url": "https://www.youtube.com/watch?v=Z1tirjPBB7Q",
    "title": "Senate PM Meeting pt. 2 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n### Overview\nThe session focused on considering amendments to House Bill 54, which aims to authorize advanced practice registered nurses and physician assistants to order home health care services. Several amendments were proposed to address concerns around self-referrals and create a pathway for foreign-trained physicians to become licensed in Georgia.\n\n### Key Actions\n**HB 54**: Bill to authorize advanced practice registered nurses and physician assistants to order home health care services\n\n### Bills Introduced (First Reading)\nNone mentioned\n\n### Notable Moments\n- Debate and amendments around HB 54 to address self-referral concerns and create a pathway for foreign-trained physicians to practice in Georgia\n\n### Votes\n- HB 54 and amendments passed, but specific vote tallies not provided\n\n### Attendance\nNo quorum issues mentioned\n\n### Adjournment\nNo specific adjournment time or next session date provided"
  },
  {
    "video_id": "3d9T-dhAQlc",
    "url": "https://www.youtube.com/watch?v=3d9T-dhAQlc",
    "title": "Rules Meeting Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\n- The session focused on discussing several bills, including SB 102 related to cockfighting, SB 131 related to behavioral health parity, and other bills.\n- There was some debate and discussion around the details and implications of the bills.\n\nKey Actions:\n- **SB 102**: Bill to add language related to cockfighting, allowing local law enforcement to have jurisdiction over it.\n- **SB 131**: Substitute bill passed to add one member to the behavioral health and council, the insurance commissioner, and create a parity compliance review panel.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Discussion around SB 102 and concerns about impacts on those raising game fowl for purposes other than fighting.\n- Debate over whether the bill would effectively stop cockfighting or just drive it underground.\n\nVotes:\n- SB 131 substitute bill passed the committee.\n\nAttendance:\n- Quorum was present.\n\nAdjournment:\n- The meeting was adjourned. Next session date was not specified."
  },
  {
    "video_id": "tasmpNuw9fA",
    "url": "https://www.youtube.com/watch?v=tasmpNuw9fA",
    "title": "Rules Day 38 of the 2025 Legislature Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 24,
    "summary": "Overview:\nThe Georgia legislature session on Rules Day 38 of the 2025 session featured the introduction and discussion of several key bills related to elections and the justice system. Notable aspects include proposed changes to election rules and voter rolls, as well as legislation addressing prosecutorial misconduct and wrongful convictions.\n\nKey Actions:\n- **SB 10**: Quantifies procedures and practices for judicial officers, and incorporates language from HB 199 which passed the House unanimously\n- **SB 141**: Creates a grant program for rural hospitals to purchase generators, using SB 170 as the vehicle\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The session began with an opening prayer by Jim Williamson.\n- The legislature recognized several special guests, including Michael Boswell and Andrew Blitchington from Scriven County.\n- There was some discussion around Senator Goodman allowing his legislation to be used as a vehicle for other bills.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not mention quorum or attendance.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or when the next session will take place."
  },
  {
    "video_id": "q6QXhHME-1w",
    "url": "https://www.youtube.com/watch?v=q6QXhHME-1w",
    "title": "Appropriations Meeting for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 4,
    "summary": "Overview:\nThe summary covers a Georgia Appropriations Subcommittee meeting, focusing on budget adjustments for various state agencies and programs. Notable aspects include salary adjustments, funding for new positions, and changes to existing programs.\n\nKey Actions:\nNo specific bills were passed or referred during this meeting.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The committee discussed salary adjustments and operational funding requests from the Department of Autos, an agency in the legislative branch.\n- Funds were provided to the Department of Labor to help with maintaining their legacy unemployment insurance system during a transition.\n- The committee adjusted funding for the Outdoor Stewardship Program, reducing the proposed 20% cut to 5% instead.\n- Funding was recommended for merit-based salary adjustments at the Georgia Access to Medical Cannabis Commission.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe quorum and attendance details were not provided.\n\nAdjournment:\nThe meeting was adjourned after a motion and voice vote."
  },
  {
    "video_id": "xOHGMjL6eRo",
    "url": "https://www.youtube.com/watch?v=xOHGMjL6eRo",
    "title": "Rules PM Meeting 3 for Day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Here is a summary of the Georgia Rules PM Meeting 3 for Day 28 of the 2025 Session:\n\n**Overview:** This session focused on passing various rule substitutes and resolutions, with no major legislation introduced or passed.\n\n**Key Actions:**\n- **HR 128:** Resolution to address compensation\n- **HB 397:** Rule Substitute to address election issues before 2026 election\n- **HB 529:** Rule Substitute to clarify automatic subscription renewal disclosures\n- **HB 270, HB 471, HB 266, HB 328:** Bills referred to supplemental calendar\n\n**Bills Introduced (First Reading):** None detected\n\n**Notable Moments:** The committee worked to find consensus on HB 397 before sending it to the Senate. Various rule substitutes and resolutions were explained and passed without opposition.\n\n**Votes:** All rule substitutes and resolutions passed without objection.\n\n**Attendance:** Quorum present, no notes on attendance.\n\n**Adjournment:** No explicit adjournment noted, but session appears to have concluded."
  },
  {
    "video_id": "Oj_RYaSpi4o",
    "url": "https://www.youtube.com/watch?v=Oj_RYaSpi4o",
    "title": "Rules PM Meeting pt. 2 for Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a structured summary of the Georgia Rules PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n**Overview:** This meeting focused on discussing and explaining the details of a substitute version of Senate Bill 12, which deals with defining custodians for open records requests and expanding legislative privilege.\n\n**Key Actions:** None detected.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Chairman Anderson explained the key provisions of the substitute Senate Bill 12, including defining custodians for open records requests and expanding legislative privilege to cover communications between the legislative and executive branches.\n- There was a discussion around whether the expanded legislative privilege provisions were intended to hide information from the public, with concerns raised about protecting communications with private entities that may influence legislation.\n- The chairmen defended the changes as necessary to protect the ability to have candid conversations and receive accurate information, arguing that existing legislative privilege should extend to written records as well.\n\n**Votes:** No recorded votes detected.\n\n**Attendance:** Quorum was present to conduct the meeting.\n\n**Adjournment:** The meeting was adjourned. No information provided on the next scheduled session."
  },
  {
    "video_id": "9FVRC2Pei1w",
    "url": "https://www.youtube.com/watch?v=9FVRC2Pei1w",
    "title": "Rules PM Meeting for Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 15,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 39 of the 2025 Session:\n\n## Overview\nThe meeting focused on a substitute for Senate Bill 59 regarding municipal sovereign immunity, as well as a discussion around Senate Bill 185 which would prohibit the Georgia Department of Corrections from using state funding for transgender surgeries for inmates. There was significant debate and opposition expressed around the necessity and prioritization of the transgender surgery bill.\n\n## Key Actions\n**SB 59**: Substitute bill providing liability limits for municipal governments\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Debate around the necessity and prioritization of SB 185 to prohibit transgender surgeries for inmates, with concerns raised about the bill addressing a non-existent problem while larger issues like healthcare access and teacher/prison staff shortages go unaddressed.\n- Questions around whether any transgender surgeries have actually been performed on inmates in Georgia's prisons.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nQuorum was present, though specific attendance numbers were not provided.\n\n## Adjournment\nThe meeting adjourned, but a specific time was not noted. The next session date was also not provided."
  },
  {
    "video_id": "d9fS5b4vmNM",
    "url": "https://www.youtube.com/watch?v=d9fS5b4vmNM",
    "title": "House Evening Session for Day 38 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 86,
    "summary": "Here is a structured markdown summary of the Georgia House Evening Session for Day 38 of the 2025 Legislative Session:\n\n## Overview\nThe House session focused on passing key school safety legislation, including provisions from previous bills SB 17 (known as Ricky and Alyssa's Law) and incorporating new requirements around emergency communications, threat assessment plans, and mental health support for students. The session also included the introduction and passage of SB 199 related to campaign finance and transparency.\n\n## Key Actions\n**HB 268**: Amends education laws to require public schools to implement mobile panic alert systems, share digital mapping data with emergency responders, establish threat assessment plans, and create a student advocacy specialist position to coordinate mental health services.\n\n**SB 199**: Requires the State Ethics Commission to not accept or reject complaints against candidates within 60 days of an election, and streamlines campaign finance reporting requirements.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Rep. Persinger provided an overview of the changes made to HB 268 in the Senate substitute, highlighting the incorporation of Ricky and Alyssa's Law and new requirements around emergency communications, threat assessments, and mental health support.\n- Several representatives asked clarifying questions about the implementation and funding of the new school safety requirements in HB 268.\n- There was discussion about ensuring timely transfer of student disciplinary records between schools.\n\n## Votes\n- The House voted 154-12 to agree to the Senate's substitute for HB 268, passing the school safety legislation.\n\n## Attendance\nNo explicit quorum notes provided.\n\n## Adjournment\nThe transcript does not provide information about the time of adjournment or the date of the next session."
  },
  {
    "video_id": "wlCvTTFR8N8",
    "url": "https://www.youtube.com/watch?v=wlCvTTFR8N8",
    "title": "Rules Meeting for Day 36 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 25,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 36 of the 2025 Session:\n\n**Overview:**\nThe session focused on the consideration of several bills, including the Riley Gaines Act (SB 1) and a bill to allow optometrists to dispense and sell drugs they are authorized to prescribe (SB 140). There was discussion around the potential for litigation related to the Riley Gaines Act, as well as clarification on the bill's intent to protect student data from political campaigns.\n\n**Key Actions:**\n- **HR 347:** Passed\n\n**Bills Introduced (First Reading):**\nNone mentioned.\n\n**Notable Moments:**\n- Discussion around the Riley Gaines Act and whether there have been any confirmed instances of transgender student-athletes participating in public high school sports in Georgia.\n- Clarification provided on the bill's intent to protect student data from political campaigns while still allowing traditional voter registration activities.\n\n**Votes:**\n- HR 347 was passed.\n\n**Attendance:**\nNo specific quorum notes provided.\n\n**Adjournment:**\nThe transcript does not indicate when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "mGJfPi-p6vs",
    "url": "https://www.youtube.com/watch?v=mGJfPi-p6vs",
    "title": "Rules Meeting for Day 34 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 34,
    "video_date": null,
    "duration_minutes": 32,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 34 of the 2025 Session:\n\n**Overview**: The meeting covered a variety of bills, including legislation on deregulation, veterinary education, and academic integrity. Notable discussion centered around the impact and implementation of the proposed deregulation efforts.\n\n**Key Actions**:\n- **SB 208**: Lieutenant Governor's \"red tape rollback\" bill - Referred back to Ways and Means committee for changes\n- **SB 140**: Allows optometrists to dispense certain medications\n\n**Bills Introduced (First Reading)**:\n- SB 20: Provides loan program for veterinary students\n- SB 213: Bans commercial cheating services\n\n**Notable Moments**:\n- Discussion on balancing deregulation with necessary oversight, particularly for agencies like the Department of Banking and Finance\n- Concerns raised about agencies' capacity to handle increased review requirements under the deregulation bill\n\n**Votes**: No recorded votes\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: Meeting adjourned, next session scheduled for the following week."
  },
  {
    "video_id": "q9Y3YDWb1ec",
    "url": "https://www.youtube.com/watch?v=q9Y3YDWb1ec",
    "title": "Rules Day 38 of the 2025 Legislative PM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 3,
    "summary": "# Georgia Rules Day 38 of the 2025 Legislative PM Session\n\n## Overview\nThe session focused on passing several bills with little substantive debate or notable moments. The main action was a substitute amendment to SB 298 that expanded legislative immunity and privilege.\n\n## Key Actions\n**SB 162**: Amended to clarify anesthesiologist supervision requirements\n**SB 298**: Substitute amendment added legislative immunity and privilege provisions\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Chairman Levitt explained the substitute amendment to SB 298, expanding legislative immunity and privilege\n\n## Votes\nNo recorded votes detected\n\n## Attendance\nQuorum was present, no attendance issues noted.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "MwHn68pVw-Q",
    "url": "https://www.youtube.com/watch?v=MwHn68pVw-Q",
    "title": "Senate Day 38 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 83,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 38 session:\n\n# Overview\nThis session featured the introduction of several bills and resolutions, as well as procedural discussions and votes. The notable aspects include the introduction of HB 150 and a discussion around excusing certain senators from the session.\n\n# Key Actions\n**HB 150**: Motor vehicles - use of automated traffic enforcement safety devices in school zones\n\n# Bills Introduced (First Reading)\n- SR 431 by Sen. Harold - Study committee on social media/AI impact on children\n- SR 476 by Sen. Halperin - Study committee on local school system flexibility options  \n- SR 49 by Sen. Dixon - Study committee on inclusive educational settings for students with disabilities\n- HB 651 by Rep. Powell - Motor vehicles - use of automated traffic enforcement safety devices in school zones\n\n# Notable Moments\n- Prayer and Pledge of Allegiance led by Sen. Jones, who introduced his son Elim Jones as the guest pastor for the day.\n- Discussions around excusing absences of several senators.\n\n# Votes\nNo recorded votes mentioned in the transcript.\n\n# Attendance\nQuorum was present, with requests made to excuse several senators from the session.\n\n# Adjournment\nThe transcript does not explicitly state when the session adjourned or the date of the next session."
  },
  {
    "video_id": "qzBaIuQnWT4",
    "url": "https://www.youtube.com/watch?v=qzBaIuQnWT4",
    "title": "Senate Day 37 of the 2025 Legislative PM  Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 88,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 37 of the 2025 Legislative PM Session based on the provided transcript:\n\n## Overview\nThe session focused on insurance-related legislation, with the Senate considering amendments to House Bill 348 regarding captive insurance companies. There was some debate around proposed amendments that aimed to restrict insurance companies from easily leaving the state.\n\n## Key Actions\n**HB 348**: Bill to amend the Georgia code to expand the lines of insurance and reinsurance that limited-purpose subsidiary and captive insurance companies can engage in.\n\n## Bills Introduced (First Reading)\nNone mentioned in the transcript.\n\n## Notable Moments\n- Senator from the 20th spoke in favor of HB 348, arguing it would modernize Georgia's captive insurance laws.\n- Senator from the 2nd introduced two amendments to HB 348:\n    - Amendment 1 would prohibit insurance companies from leaving Georgia if they made a profit in at least 4 of the previous 5 years.\n    - Amendment 2 would prohibit insurers from transferring funds between affiliates with intent to mislead regarding profitability.\n- The Senator from the 20th spoke against both amendments, arguing they were anti-free enterprise and would restrict insurers' ability to manage their finances.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "mf-t6V44RRk",
    "url": "https://www.youtube.com/watch?v=mf-t6V44RRk",
    "title": "Rules Meeting for Day 37 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 12,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 37 of the 2025 Session:\n\n**Overview**\nThe meeting covered a variety of bills and resolutions, with a focus on issues related to addiction, visitation rights, insurance market reform, and the legislative branch's investigative powers.\n\n**Key Actions**\n- **HR 557**: Creates a study committee on Georgia's two investment funds.\n- **HR 512**: Creates the House Study Committee on Addiction, Epidemic, and Solutions for Recovery.\n- **SB 30**: Relates to puberty blockers, with careful restrictions around their use.\n- **SB 173**: Creates a simple procedure to expedite uncontested motions in state superior courts.\n\n**Bills Introduced (First Reading)**\n- HR 659: Creates a study committee on insurance market reform.\n- HR 72: Creates a study on increasing access to cancer care and screenings for minority populations.\n- HR 611: Creates a Health Study Committee on Abandoned Child Placement Following Hospital Discharge.\n- SB 131: Discussed, but details not provided.\n- SB 255: Deals with the investigative powers of the legislative branch, including the power to issue subpoenas and compel attendance of witnesses.\n\n**Notable Moments**\n- Debate on SB 30 (puberty blockers) and its potential impact on children's mental health and suicide risk.\n- Recognition of Chairman Jasper's leadership in bringing together first responders and veterans.\n\n**Votes**\nNo recorded votes mentioned in the transcript.\n\n**Attendance**\nThe transcript mentions a \"hard stop at 9:30\" to go into the chamber, indicating a quorum was present.\n\n**Adjournment**\nThe transcript does not explicitly state when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "KL-c9YzXVpA",
    "url": "https://www.youtube.com/watch?v=KL-c9YzXVpA",
    "title": "House Rules Session for day 35 for the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Here is a summary of the Georgia House Rules Session for day 35 of the 2025 Session:\n\n**Overview**:\nThe session focused on the introduction and discussion of several bills, including Senate Bill 79 (the \"FEAR Act\" for fentanyl eradication) and a rules substitute for Senate Bill 69 (part of the governor's lawsuit reform package). The committee approved the rules substitute for SB 69 with some minor changes.\n\n**Key Actions**:\n- **SB 69**: Rules substitute approved with changes to disclosure requirements and joint/several liability provisions.\n- **SB 79**: \"FEAR Act\" for fentanyl trafficking penalties discussed.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- Explanation of SB 79 \"FEAR Act\" by Senator Govind, highlighting the severity of the fentanyl epidemic.\n- Discussion of changes to SB 69 rules substitute, including exceptions for litigation financing investors and discretionary joint/several liability.\n\n**Votes**:\n- SB 69 rules substitute approved.\n- Supplemental calendar set for bills including SB 40, SB 56, SB 69, SB 79, and SB 105.\n\n**Attendance**:\nNo specific quorum notes provided.\n\n**Adjournment**:\nThe session adjourned, with a rooms meeting scheduled for 9am the next morning."
  },
  {
    "video_id": "K080F_w50gE",
    "url": "https://www.youtube.com/watch?v=K080F_w50gE",
    "title": "Appropriations Meeting for Day 36 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 47,
    "summary": "Here is a structured markdown summary of the Georgia Appropriations Meeting for Day 36 of the 2025 Session:\n\n## Overview\nThe session focused on the review and discussion of the state budget, House Bill 68, which outlines the allocation of approximately $36-37 billion in taxpayer funds over the next 12 months. The senators highlighted the challenges of the current economic climate and the need for fiscal responsibility, while also recognizing the efforts of the House and Senate budget committees in crafting the budget.\n\n## Key Actions\nNo specific bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- The session began with an invocation led by Senator Harverson.\n- The senators expressed gratitude to Director Don, Governor Kemp, House Chairman Hatchett, and the Senate budget analysts for their contributions to the budget process.\n- The senators discussed the national economic outlook, the end of the \"federal sugar high\" from COVID-19 spending, and the state's approach to maintaining a balanced budget and reducing tax rates.\n- The senators emphasized the need to carefully consider the fiscal impacts of bills passed by the General Assembly.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript does not provide any information about quorum or attendance.\n\n## Adjournment\nThe transcript does not explicitly state when the session was adjourned or when the next session would be held."
  },
  {
    "video_id": "EptpLhs51G8",
    "url": "https://www.youtube.com/watch?v=EptpLhs51G8",
    "title": "Rules Meeting for the 2025 Legislative Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 52,
    "summary": "Here is a structured markdown summary of the Georgia Rules Meeting session:\n\n**Overview**\nThe committee discussed Senate Bill 255, which would regulate litigation financing in Georgia. The bill went through several changes in committee, including clarifying disclosure requirements, adding an appeals process for denied applications, and adjusting the effective date to allow the Department of Banking and Finance more time to set up the new regulatory framework.\n\n**Key Actions**\n- **SB 255**: Regulates litigation financing in Georgia, establishing a registration and disclosure system overseen by the Department of Banking and Finance.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Committee Chairman Lebritt provided a detailed overview of the changes made to SB 255 in committee.\n- Representative Kim Williams raised a question about whether the Department of Banking and Finance has adequate staff and resources to effectively take on the new regulatory duties under the bill.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nQuorum was present to conduct business.\n\n**Adjournment**\nThe meeting adjourned, with no next session date provided."
  },
  {
    "video_id": "GK1-jwdMtp0",
    "url": "https://www.youtube.com/watch?v=GK1-jwdMtp0",
    "title": "Rules PM Meeting Part 2 for Day 35 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nThe Georgia Rules PM Meeting Part 2 for Day 35 of the 2025 Session focused on amending and passing a substitute bill through the subcommittee. There was some debate and a failed amendment proposed, but ultimately the substitute was passed with two other amendments.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\nNone detected\n\nNotable Moments:\n- The chair proposed two amendments to the substitute bill: 1) adding \"related to the litigation\" after \"services\" on line 267, and 2) striking the word \"regulated\" on line 384.\n- A member proposed an additional amendment to change \"shall\" to \"may\" on line 274, but this amendment failed.\n- There was some procedural discussion as the chair worked to properly manage the motions and amendments.\n\nVotes:\n- The amendments proposed by the chair were approved by voice vote.\n- The final motion to pass the substitute bill as amended was approved, with one no vote.\n\nAttendance:\nA quorum of members was present.\n\nAdjournment:\nThe subcommittee meeting was adjourned after completing its business."
  },
  {
    "video_id": "7mq_mSGSQXI",
    "url": "https://www.youtube.com/watch?v=7mq_mSGSQXI",
    "title": "Rules PM Meeting for day 35 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 68,
    "summary": "Here is a summary of the Georgia Rules PM Meeting for day 35 of the 2025 Session session:\n\n**Overview**:\nThis meeting focused on discussing and potentially taking action on Senate Bill 69, which aims to regulate the growing third-party litigation funding (TPLF) industry in Georgia. The bill was recently passed unanimously by the state Senate and is now being considered by this Rules subcommittee.\n\n**Key Actions**:\n**SB 69**: Bill to regulate third-party litigation funding in Georgia, including requirements for registration, prohibited practices, and penalties for violations.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- The subcommittee chair, Rep. Rob Belverin, provided an overview of the plan for the meeting, including hearing from the Senate sponsor and reviewing a substitute version of the bill.\n- Sen. Kim, the Senate sponsor, presented the bill in detail, highlighting how it aims to protect consumers and address foreign influence in the judicial system through TPLF.\n- The subcommittee discussed specific provisions of the substitute bill, including limits on returns for litigation funders and registration requirements.\n\n**Votes**: No votes taken, as this was a discussion and presentation of the bill.\n\n**Attendance**: Quorum present, with the subcommittee chair and Senate sponsor in attendance.\n\n**Adjournment**: The meeting adjourned, with no date provided for the next session."
  },
  {
    "video_id": "l7uV9GF9AY0",
    "url": "https://www.youtube.com/watch?v=l7uV9GF9AY0",
    "title": "Rules Meeting for Day 35 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 22,
    "summary": "Here is a structured summary of the key points from the Georgia Rules Meeting transcript:\n\n**Overview:**\nThis session covered a variety of bills, including creating a study committee on motor vehicle dealer regulation, addressing student chronic absenteeism, expediting appeals for municipal immunity cases, expanding support for military children in schools, improving teacher preparation for teaching reading, renaming a bridge for a fallen police officer, regulating human composting, and expanding medical marijuana access. The discussion focused on the substantive details and impacts of these legislative proposals.\n\n**Key Actions:**\n- **HR 558**: Creates a House Study Committee on the State Board of Registration of Used Motor Vehicle Dealers\n- **SB 220**: Expands access to medical marijuana\n- **SB 298**: Allows direct appeals for municipalities challenging immunity determinations\n- **SB 46**: Renames the Hulken Bridge and 400 interchange for Fallen Police Officer Jeremy Obonte\n- **SB 63**: Allows homeschool students to take AP and college placement tests at their residential public schools\n\n**Bills Introduced (First Reading):**\n- SB 236: Expands support for military school-aged children\n- SB 93: Ensures teacher prep programs teach the science of reading\n\n**Notable Moments:**\n- Discussion of using deceased persons' remains as compost, including for growing medical marijuana\n- Debate over whether homeschool students should be able to use public school testing facilities\n\n**Votes:** \nThe bills discussed were generally described as being passed or having unanimous support, though no specific vote counts were provided.\n\n**Attendance:**\nNo quorum issues were noted.\n\n**Adjournment:**\nThe transcript does not mention a specific time of adjournment or the date of the next session."
  },
  {
    "video_id": "a_ny6tHfbgg",
    "url": "https://www.youtube.com/watch?v=a_ny6tHfbgg",
    "title": "Rules Meeting for Day 33 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 33,
    "video_date": null,
    "duration_minutes": 20,
    "summary": "Overview:\nThe Georgia Rules Committee meeting discussed several notable bills, including ones related to development authorities, administrative burden reduction, property tax rates, gas pipeline infrastructure, healthcare workforce information, and adopted children's birth certificates. There was also discussion of a foster child grant scholarship program and an adult high school diploma program.\n\nKey Actions:\n**SB 100**: Allows adopted children to access their original birth certificates when they turn 18 years old.\n**SB 252**: Allows municipalities with populations over 300,000 (i.e. Atlanta) to transfer or convey property that has not been abandoned for public use.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this meeting.\n\nNotable Moments:\n- Senator Robertson expressed excitement about becoming a grandfather and the bill's impact on his adopted daughter's ability to access her original birth certificate.\n- There was some discussion around the healthcare workforce information bill (SB 131) and concerns about potential identification of individuals in smaller counties.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not provide any information about quorum or attendance.\n\nAdjournment:\nThe transcript does not mention when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "vwFW_fLTrOo",
    "url": "https://www.youtube.com/watch?v=vwFW_fLTrOo",
    "title": "House PM Meeting 5 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 81,
    "summary": "Overview: The transcript provided does not contain any substantive legislative activity. It appears to be a presentation or discussion without any recorded bills, votes, or notable moments.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments: None detected.\n\nVotes: None detected.\n\nAttendance: No quorum details provided.\n\nAdjournment: No adjournment time or next session date mentioned."
  },
  {
    "video_id": "RTVLKi-WuQM",
    "url": "https://www.youtube.com/watch?v=RTVLKi-WuQM",
    "title": "Energy, Utilities and Telecommunications  Meeting Day 31 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Energy, Utilities and Telecommunications Meeting Day 31 of the 2025 Session session:\n\n**Overview:**\nThe session focused on a discussion around a bill that aimed to provide certain protections for manufacturers regarding disclosures and warnings. There was debate around the extent of these protections and how they would impact the ability to bring claims against manufacturers.\n\n**Key Actions:** \nNo bills were passed or referred.\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- There was discussion around whether the bill would prevent claims for wrongful death or personal injury if the manufacturer was found to have knowingly withheld, concealed or misrepresented information about health risks.\n- An amendment was proposed to clarify that the bill would not eliminate common law negligent failure to warn claims, allowing consumers to hold manufacturers accountable if they failed to inform consumers of known issues even after reporting to the EPA. The amendment was not adopted.\n- There was debate around the timing of when manufacturers would be required to disclose information to consumers versus the government.\n\n**Votes:**\nNo recorded votes were taken.\n\n**Attendance:**\nNo quorum issues were noted.\n\n**Adjournment:**\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "8moE4jquGIg",
    "url": "https://www.youtube.com/watch?v=8moE4jquGIg",
    "title": "Senate PM meeting 2 for Day 28 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 59,
    "summary": "Here is a summary of the key points from the Georgia Senate PM meeting 2 for Day 28 of the 2025 Session:\n\n**Overview**\nThe debate centered around SB 82, a bill aimed at preventing discrimination against businesses based on their political beliefs. However, there were significant concerns raised about the bill's language and potential unintended consequences, particularly regarding the provisions related to fines and lawsuits against banks.\n\n**Key Actions**\n- No bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- No new bills were introduced.\n\n**Notable Moments**\n- There was extensive discussion about the potential issues with SB 82, including concerns about the $50,000 minimum fine for unintentional violations and the risk of opening the door to frivolous lawsuits against banks.\n- An amendment (Amendment #3) was proposed to address these concerns by having the Attorney General handle enforcement rather than allowing private lawsuits.\n\n**Votes**\n- No recorded votes were taken.\n\n**Attendance**\n- No quorum issues were noted.\n\n**Adjournment**\n- The session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "7yOI3Y5gMNU",
    "url": "https://www.youtube.com/watch?v=7yOI3Y5gMNU",
    "title": "Lawmakers Day 28 2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 24,
    "summary": "Overview:\nThe Georgia legislature had a busy 28th day session, with a number of notable bills being passed or introduced. The session was marked by a bipartisan approach on some school safety measures, while more partisan debates emerged around a proposed income tax cut and a bill seeking to limit local firearm regulations.\n\nKey Actions:\n**SB 17**: Mandates mobile alert panic systems for schools and requires mapping of school properties to aid emergency response.\n**SB 61**: Adds new charges that students could be prosecuted for in superior court, including terroristic threats.\n**SB 179**: Requires sharing of student disciplinary history when transferring schools and holds parents legally responsible for not disclosing suspensions.\n**SB 163**: Rescinds local city and county laws over guns and weapons, entrusting regulation exclusively to the state.\n**HB 111**: Reduces the state's flat income tax rate from 5.39% to 5.19%.\n**HB 112**: Provides a one-time tax rebate of $250 for single taxpayers and $500 for married couples.\n**HB 657**: Annexes 45 small parcels of land into the newly formed city of Mulberry.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- Senator Colton Moore's impassioned speech advocating for his bill SB 163 to rescind local firearm regulations.\n- Debate between Republicans and Democrats over the merits of the income tax cut bill HB 111.\n\nVotes:\n- SB 17, SB 179 passed unanimously.\n- SB 61 passed 33-22 along party lines.\n- SB 163 passed 33-23 along party lines. \n- HB 111 passed 110-60, mostly along party lines.\n- HB 112 passed unanimously.\n- HB 657 passed 98-76, mostly along party lines.\n\nAttendance:\nThe session maintained a quorum throughout the proceedings.\n\nAdjournment:\nThe legislature adjourned for the day. The next session date was not specified."
  },
  {
    "video_id": "84hY111b-0I",
    "url": "https://www.youtube.com/watch?v=84hY111b-0I",
    "title": "Rules Meeting for Day 32 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 22,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 32 of the 2025 Session:\n\n**Overview:** The session included discussions on several bills, including ones related to military families, healthcare worker licensing, autoimmune disease awareness, judicial circuit expansions, Medicaid compliance, and wages for individuals with disabilities. There was some procedural discussion as well.\n\n**Key Actions:**\n- **SB 109:** Legislation to address insurance coverage issues for families of National Guard members killed in accidents\n- **SB 191:** Bill to streamline healthcare worker licensing and credentialing processes\n- **HR 463:** Resolution to designate March as Autoimmune Disease Awareness Month in Georgia\n- **SB 145:** Bill to add a 6th judge to the Augustus Judicial Circuit \n- **SB 276:** Agency bill to bring Georgia into compliance with federal Medicaid requirements\n- **SB 55:** \"Dignity of Pay Act\" to prohibit paying individuals with disabilities less than minimum wage\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Discussion of concerns over a proposed \"America First\" license plate\n- Procedural discussion around scheduling of a committee meeting at 6am\n\n**Votes:** No recorded votes mentioned.\n\n**Attendance:** Quorum present to conduct business.\n\n**Adjournment:** The transcript does not mention the time of adjournment or the date of the next session."
  },
  {
    "video_id": "GmRlqdKAKGQ",
    "url": "https://www.youtube.com/watch?v=GmRlqdKAKGQ",
    "title": "Rules Meeting Special Session for the 2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 16,
    "summary": "Here is a structured markdown summary of the Georgia Rules Meeting Special Session for the 2025 session:\n\n**Overview**:\nThe session focused on considering several Senate bills, including legislation related to organ transportation, drug testing equipment, and a dispute between Gwinnett County and the City of Mulberry. There was debate and discussion around these bills.\n\n**Key Actions**:\n- **SB 138**: Legislation to address Gwinnett County's refusal to enter into a service delivery agreement with the City of Mulberry, which was passed by the Senate.\n- **SB 81**: Bill to allow testing equipment for drugs like xylazine to be exempted from drug paraphernalia laws.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- Debate over SB 138 and the dispute between Gwinnett County and the City of Mulberry, with accusations of the county not cooperating with the city.\n- Discussion of the importance of SB 81 in allowing for testing of emerging drugs like xylazine.\n\n**Votes**:\nNo recorded votes mentioned, but SB 138 appears to have passed the Senate.\n\n**Attendance**:\nQuorum was present, with a \"slight crowd\" noted.\n\n**Adjournment**:\nThe meeting adjourned, with the next session date not specified."
  },
  {
    "video_id": "x4DOohZSJJk",
    "url": "https://www.youtube.com/watch?v=x4DOohZSJJk",
    "title": "Senate PM Meeting 4 for Day 28 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting 4 for Day 28 of the 2025 Session:\n\n**Overview:**\nThis session included the passage of two bills: SB 256, which requires certain disclosures by electric membership corporations, and SB 268, which creates a 25-foot \"halo\" safety zone around first responders conducting their duties. There was some discussion around the scope and application of SB 268.\n\n**Key Actions:**\n**SB 256:** Bill to amend laws regarding required disclosures by electric membership corporations and foreign electric cooperatives.\n**SB 268:** Bill to create a crime of interference with a first responder and establish a 25-foot safety zone around first responders.\n\n**Bills Introduced (First Reading):**\nNone detected.\n\n**Notable Moments:**\n- Discussion on the scope and application of the \"halo\" safety zone in SB 268, clarifying it applies to individuals outside of vehicles, not the move-over law for drivers.\n- Senators engaged in dialogue to ensure the bill did not inadvertently impact other laws or procedures.\n\n**Votes:**\n- SB 256 passed by substitute unanimously (51-0).\n- SB 268 passed (37-17).\n\n**Attendance:**\nQuorum was present, no issues noted.\n\n**Adjournment:**\nThe session adjourned. The next session date was not provided."
  },
  {
    "video_id": "mrNbMOV2hX4",
    "url": "https://www.youtube.com/watch?v=mrNbMOV2hX4",
    "title": "House PM Meeting 4 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 67,
    "summary": "Here is a structured summary of the Georgia House PM Meeting 4 for Day 28 of the 2025 Session:\n\n**Overview**:\nThis session featured the consideration and passage of several notable bills, including legislation to create a certification program for community health workers and require insurance coverage for necessary orthotic and prosthetic devices.\n\n**Key Actions**:\n- **HB 291**: Establishes a certification program for community health workers to serve underserved and rural areas\n- **HB 87**: Requires health insurance plans to cover medically necessary orthotic and prosthetic devices\n\n**Bills Introduced (First Reading)**:\n- HB 567\n- HB 677\n\n**Notable Moments**:\n- Debate on HB 87, which would expand insurance coverage for prosthetic and orthotic devices, highlighting personal stories of Georgians impacted\n- Presentation of HB 384 to standardize oaths taken by law enforcement officers statewide\n\n**Votes**:\n- HB 291 (Community Health Worker Certification Act) - Passed 169-4\n- HB 87 (Orthotic and Prosthetic Device Coverage) - Passed 171-2\n\n**Attendance**:\nThe session maintained a quorum, with all members present and voting.\n\n**Adjournment**:\nThe House adjourned after considering the bills, with the next session scheduled for the following day."
  },
  {
    "video_id": "6D0d0QRac0o",
    "url": "https://www.youtube.com/watch?v=6D0d0QRac0o",
    "title": "House PM Meeting 2 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 51,
    "summary": "Here is a structured markdown summary of the Georgia House PM Meeting 2 for Day 28 of the 2025 Session:\n\n## Overview\nThe session focused on passing several bills, including HB 579 to modernize professional licensing in Georgia, HB 549 to extend the reimbursement window for law enforcement training expenses, and HB 150 to require quarterly reports on foreign funding to state universities. There was some debate around the scope and approach of HB 150.\n\n## Key Actions\n**HB 579**: Provides better constituent services and modernizes professional licensing in Georgia.\n**HB 549**: Extends the reimbursement window for law enforcement training expenses from 15 to 36 months.\n**HB 150**: Requires the university system to report quarterly on funding received from \"foreign countries of concern.\"\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Debate on HB 150 regarding the scope of reporting on foreign funding to universities.\n- Questions raised about labeling individuals from \"foreign countries of concern\" as concerning.\n\n## Votes\n- HB 579 passed 158-2.\n- HB 549 passed unanimously 164-0.\n\n## Attendance\nA quorum was present, with all members voting on the bills.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "PHp1Jfxf8l8",
    "url": "https://www.youtube.com/watch?v=PHp1Jfxf8l8",
    "title": "Rules PM Meeting 2 for Day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "# Georgia Rules PM Meeting 2 for Day 28 of 2025 Session\n\n## Overview\nThis Rules Committee meeting focused on passing various resolutions and rules substitutes, with little apparent controversy or debate.\n\n## Key Actions\n**HR 128**: Room substitute for modified structure\n**HB 87**: Passed\n**HB 127**: Passed\n**HB 291**: Passed\n**HB 323**: Passed\n**HB 351**: Passed  \n**HB 384**: Passed\n**HB 430**: Passed\n**HB 483**: Passed\n**HB 506**: Passed\n**HB 531**: Passed\n**HB 555**: Rule substitute passed\n**HB 567**: Passed\n**HB 582**: Passed\n**HB 630**: Passed\n**HB 635**: Passed\n**HB 645**: Passed unanimously\n**HB 652**: Passed\n**HB 677**: Rule substitute passed\n**HB 686**: Passed\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Brief explanation provided for HB 555 rule substitute to correct drafting issues\n- HB 677 described as creating a process to address the issue of children with mental health issues languishing in hospitals\n\n## Votes\nAll bills/resolutions passed, with most appearing to be unanimous or near-unanimous.\n\n## Attendance\nQuorum present, no issues noted.\n\n## Adjournment\nNo specific adjournment time provided, but the meeting appears to have concluded."
  },
  {
    "video_id": "k1jcDUigMcI",
    "url": "https://www.youtube.com/watch?v=k1jcDUigMcI",
    "title": "Rules Meeting for Day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 34,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 28 of the 2025 Session:\n\n**Overview**: This session featured a variety of bills being considered, including measures related to voting, Black women's history, age discrimination, recovery support services, student loan forgiveness for veterinary technicians, and enforcement of transit lanes in Atlanta.\n\n**Key Actions**:\n- **HB 502**: Allows parents with young children to go to the front of the line when voting.\n- **HB 146**: Designates April as Black Women's History Month.\n- **HB 10**: Removes arrest photos of those never convicted from \"Remove for Pay\" websites.\n- **HB 311**: Removes the age cap of 70 for working individuals.\n- **HB 657**: Certifies Peer Specialists and defines Recovery Community Organizations.\n- **HB 217**: Extends a dual achievement program allowing high school dropouts to earn diplomas and technical certificates.\n- **HB 88**: Provides student loan forgiveness for veterinary technicians.\n- **HB 638**: Allows MARTA to use cameras to enforce bus rapid transit lanes.\n- **HB 442**: Allows students 25 days of school absence for film industry work.\n\n**Bills Introduced (First Reading)**: No new bills were introduced during this session.\n\n**Notable Moments**:\n- The session opened with a prayer, acknowledging the \"busy, stressful\" day.\n- The chair reminded presenters to provide bill numbers and page locations to expedite the process.\n- Several bills were noted as having been perfected or recommended by the Speaker Pro Tem.\n\n**Votes**:\n- HB 502, HB 146, HB 10, HB 311, HB 657, HB 217, HB 88, HB 638, and HB 442 all passed with no recorded opposition.\n\n**Attendance**: Quorum was met, and the session proceeded without noted attendance issues.\n\n**Adjournment**: The session adjourned. The next session date was not specified."
  },
  {
    "video_id": "jz2RwuMi-TY",
    "url": "https://www.youtube.com/watch?v=jz2RwuMi-TY",
    "title": "Rules meeting day 26 2025 session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 41,
    "summary": "Here is a summary of the key points from the Georgia Rules meeting day 26 2025 session:\n\n**Overview**: This session featured discussions and progress on several bills, including measures related to property ownership, school infrastructure, disabled parking, autism alert systems, and school personnel benefits.\n\n**Key Actions**:\n- **HB 399**: Requires out-of-state property owners with more than 25 single-family homes to have a Georgia real estate broker or representative.\n- **HB 563**: Allows licensed physical therapists to verify individuals for disabled parking permits.\n- **HB 465**: Establishes a missing autism alert system through the GBI.\n- **HB 127**: Increases the number of personal days teachers can take from their sick days from 3 to 5.\n\n**Bills Introduced (First Reading)**: No new bills were explicitly mentioned as being introduced.\n\n**Notable Moments**: \n- Discussion around HB 647, which would annex 45 parcels into the city of Mulberry, with some disagreement between the representative and county commissioners on the level of local support.\n- Procedural discussions around the process and timeline for creating new cities.\n\n**Votes**: Bills HB 399, HB 563, HB 465, HB 127 were all described as having no questions and moving forward, implying they passed.\n\n**Attendance**: No specific quorum notes were provided.\n\n**Adjournment**: The transcript does not indicate when the session adjourned or the date of the next scheduled meeting."
  },
  {
    "video_id": "nYB_xuckTNg",
    "url": "https://www.youtube.com/watch?v=nYB_xuckTNg",
    "title": "Intragovernmental Coordination Meeting for Day 25 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 25,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Overview: This legislative session covered the passage of two bills - HB 593, which made the election for the Probate Judge of Baker County nonpartisan, and HB 647, which allowed the city of Mulberry to annex roughly 45 parcels in a representative's district, giving more local control over development decisions.\n\nKey Actions:\n**HB 593**: Provided that future elections for the Office of Probate Judge of Baker County shall be nonpartisan.\n**HB 647**: Allowed the city of Mulberry to expand into a representative's district, adding 45 parcels to the city limits.\n\nBills Introduced (First Reading): None mentioned.\n\nNotable Moments:\n- This was the representative's first time presenting a bill in committee.\n- The representative cited constituent concerns over growth and high-density development as motivation for the annexation bill.\n- There was some procedural discussion, including a motion to \"do pass\" on HB 647.\n\nVotes:\n- HB 593 passed unanimously.\n- HB 647 passed with one opposed vote.\n\nAttendance: A quorum was present.\n\nAdjournment: The meeting was adjourned, but the next session date was not provided."
  },
  {
    "video_id": "TzRnRlh3Aw4",
    "url": "https://www.youtube.com/watch?v=TzRnRlh3Aw4",
    "title": "12/18/2025 Joint Senate Judiciary Committee and House Judiciary Committee",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 42,
    "summary": "Overview: This appears to be a joint session of the Georgia Senate and House Judiciary Committees to consider nominations for the new Georgia Tax Court. The session focused on the qualifications of two candidates - Emily Youngo for the Clerk of the Business Court position, and Frank O'Connell for the Chief Judge of the Georgia Tax Court.\n\nKey Actions:\n- No specific bills were passed or referred.\n\nBills Introduced (First Reading): \n- None detected\n\nNotable Moments:\n- The session began with an opening prayer.\n- The committees heard presentations from the two candidates and asked them questions about their backgrounds and qualifications.\n- There was discussion about the importance of the new Georgia Tax Court and the need for qualified leadership.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- The committees noted they were waiting for a quorum on the Senate side before taking any action.\n\nAdjournment:\n- The transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "-W2ibUsvmRA",
    "url": "https://www.youtube.com/watch?v=-W2ibUsvmRA",
    "title": "Rules Meeting Special Session of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 60,
    "summary": "Here is a summary of the Georgia Rules Meeting Special Session of the 2025 Session based on the transcript provided:\n\n**Overview**\nThe session focused on the introduction and consideration of several bills, primarily related to licensing requirements, venue regulations, homeowner associations, sexual assault kit retention, women's golf week designation, and rural hospital programs. There was some discussion and debate around one of the bills regarding potential discriminatory effects.\n\n**Key Actions**\n- **HB 512**: Caps fees charged by homeowner associations and provides for alternate dispute resolution before liens can be placed.\n- **HB 626**: Extends the retention period for sexual assault kits from 20 to 30 years.\n- **HB 718**: Designates the first week of April as Women's Golf Week in Georgia.\n- **HB 662**: Allows rural emergency hospitals to participate in the Georgia HEART program.\n- **HB 566**: Protects artists from AI-generated replicas of their work without permission.\n\n**Bills Introduced (First Reading)**\n- HB 185: Modernizes and streamlines licensing requirements for dieticians and nutritionists.\n- HB 671: Restricts minors from attending sexually explicit performances at venues.\n\n**Notable Moments**\n- There was a discussion around HB 671 and concerns about potential discriminatory effects on the LGBTQ+ community. The bill's sponsor agreed to work further on the legislation.\n\n**Votes**\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**\nThe transcript does not provide any information about quorum or attendance.\n\n**Adjournment**\nThe transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "SX72y47ud5M",
    "url": "https://www.youtube.com/watch?v=SX72y47ud5M",
    "title": "Rules PM meeting for Day 27 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a summary of the key points from the Georgia Rules PM meeting transcript for Day 27 of the 2025 Session:\n\n**Overview:** The meeting focused on discussing and passing a rules substitute for House Bill 268, a school safety bill, as well as reviewing a room substitute for House Bill 651 regarding school zone cameras.\n\n**Key Actions:**\n- **House Bill 268:** A rules substitute was passed, which adds provisions for generating reports on de-identified student records and coordinating mental health services and threat assessment teams in schools.\n- **House Bill 651:** A room substitute was presented, which addresses signage, speed detection, citation amounts, and other aspects of school zone cameras.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Discussions around the mental health coordinator positions in HB 268 and how they would be implemented based on school district size.\n- Clarification that the mental health coordinators would have a different focus from existing school counselors.\n- Debate around the 35% rule for revenue generation from school zone cameras in HB 651.\n\n**Votes:**\n- HB 268 rules substitute was passed out of the committee.\n- No recorded votes on other bills.\n\n**Attendance:** Quorum was present, as the meeting was able to proceed.\n\n**Adjournment:** The meeting adjourned, with no specific mention of the next session date."
  },
  {
    "video_id": "cHcbk3MdC1M",
    "url": "https://www.youtube.com/watch?v=cHcbk3MdC1M",
    "title": "Rules meeting for Day 27 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 20,
    "summary": "Here is a summary of the Georgia Rules meeting for Day 27 of the 2025 Session:\n\n**Overview:**\nThe Rules Committee heard presentations on several bills, including measures related to tax credits for workforce development programs, veteran license plates, and regulation of private water companies. The committee also discussed routine code revision and clean-up legislation.\n\n**Key Actions:**\n- **HB 7**: Provides a $4,000 income tax credit for graduates of workforce readiness programs employed in high-tech jobs in rural counties\n- **HB 583**: Allows totally disabled veterans or those with a high level of disability to obtain a second free license plate for their spouse or another vehicle\n- **HB 718**: Designates the first week of April as \"Women's Golf Week\" in Georgia\n- **HB 351**: Clarifies the permitting process for solid waste landfills to prevent future lawsuits\n- **HB 371**: Raises the maximum annual appropriation for capital outlay projects from $300 million to $375 million\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- Representatives advocated for their bills, highlighting the policy goals and need for the legislation.\n- The committee chair reminded members that bills not yet reported out of committee would need to be considered at a future meeting.\n\n**Votes:**\nAll bills discussed were recommended to pass, often with unanimous support.\n\n**Attendance:**\nA quorum was present, and the meeting proceeded without any notes on attendance.\n\n**Adjournment:**\nThe meeting adjourned. The next Rules Committee meeting was not specified."
  },
  {
    "video_id": "mueHu0E4XQo",
    "url": "https://www.youtube.com/watch?v=mueHu0E4XQo",
    "title": "Appropriations Meeting for Day 27 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a structured markdown summary of the Georgia Appropriations Meeting for Day 27 of the 2025 Session:\n\n## Overview\nThis session focused on considering resolutions to compensate individuals who were wrongfully incarcerated. Several cases involving issues like self-defense, manufactured evidence, and juror misconduct were discussed.\n\n## Key Actions\n**HR 119**: Resolution to compensate Mario Stinchcomb for 18 years of wrongful incarceration after he was exonerated by the Fulton Conviction Integrity Unit.  \n**HR 118**: Resolution to compensate Michael Woolfolk for wrongful incarceration after he was exonerated.  \n**HR 129**: Resolution to compensate Daryl Lee Clark for 25 years of wrongful incarceration due to issues like manufactured evidence and witness coercion.  \n**HR 128**: Resolution to compensate Joseph \"Joey\" Samuel Watkins for wrongful incarceration due to juror misconduct and buried exculpatory evidence.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Discussions of the tragic circumstances and injustices faced by the individuals who were wrongfully incarcerated.\n- Appreciation expressed for the previous support these resolutions received in the House.\n- Descriptions of the various issues that led to the wrongful convictions, including self-defense evidence, coerced testimony, and Brady violations.\n\n## Votes\n- HR 119 (Stinchcomb compensation): Passed\n- HR 118 (Woolfolk compensation): Passed  \n- HR 129 (Clark compensation): Passed\n- HR 128 (Watkins compensation): Not voted on\n\n## Attendance\nA quorum was present to conduct business.\n\n## Adjournment\nThe session adjourned, with the next session date not specified."
  },
  {
    "video_id": "K5p_QxnD30o",
    "url": "https://www.youtube.com/watch?v=K5p_QxnD30o",
    "title": "Press Conference with Senator Jones & Former Senator Jason Esteves | 12/8/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a structured markdown summary of the key points from the Georgia legislature floor session transcript:\n\n## Overview\nThe transcript highlights a press conference with Senator Jones and former Senator Jason Estevez discussing the impending healthcare crisis in Georgia due to the expiration of federal ACA subsidies. They call on Republican leadership to take action to protect healthcare access and affordability for Georgians.\n\n## Key Actions\n**SB 192**: The Georgia Health Insurance Affordability and Consumer Protection Act, introduced by former Senator Estevez to address the healthcare coverage gap when federal subsidies expire.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced in this transcript.\n\n## Notable Moments\n- Senator Jones criticizes Republicans for refusing to address the healthcare affordability crisis and failing to pass solutions like SB 192.\n- Former Senator Estevez shares his personal experience seeing the impacts of the healthcare crisis as the husband of a nurse practitioner. He pledges that as a future leader, he will fight to expand Medicaid and lower insurance premiums.\n- Kiana Randi Gregory and her mother Marilyn share how the loss of healthcare subsidies has impacted their family.\n\n## Votes\nThe transcript indicates that SB 192 was introduced but not passed, implying it failed to receive enough votes.\n\n## Attendance\nNo specific quorum or attendance details provided.\n\n## Adjournment\nThe transcript does not mention the session adjourning or provide details on the next scheduled session."
  },
  {
    "video_id": "sPd1sU0tfXk",
    "url": "https://www.youtube.com/watch?v=sPd1sU0tfXk",
    "title": "Sen. Islam Parkes Press Conference on Expiring SNAP Benefits | 10/29/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 19,
    "summary": "Here is a structured markdown summary of the Georgia Sen. Islam Parkes Press Conference on Expiring SNAP Benefits | 10/29/2025 session:\n\n## Overview\nThis press conference addressed the impending expiration of SNAP (Supplemental Nutrition Assistance Program) benefits for nearly 1.4 million Georgians, including over 640,000 children. The speakers, including Sen. Nabila Islam Parkes, Rachel Kent (a single mother), and Alicia Rivera from the nonprofit Georgia Feeding Families, called on Governor Brian Kemp to declare a state of emergency and use the state's budget surplus to continue providing SNAP assistance to affected families.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Sen. Islam Parkes emphasized that food is not optional and this is a \"humanitarian crisis unfolding in real time.\" \n- Rachel Kent, a single mother, shared her personal struggles of relying on SNAP benefits to feed her son and called on Gov. Kemp to use the state's surplus to support families in need.\n- Alicia Rivera from Georgia Feeding Families discussed the increased demand for assistance at food banks and the need for urgent action to address the crisis.\n- Former state senator Jason Estevez, who is running for governor, expressed his support for the SNAP program and criticized the current leadership for not taking action to help Georgians in need.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum was present, as senators and community representatives participated in the press conference.\n\n## Adjournment\nNo formal adjournment, as this was a press conference rather than a legislative session."
  },
  {
    "video_id": "PHhO62yduPk",
    "url": "https://www.youtube.com/watch?v=PHhO62yduPk",
    "title": "Sen. Jones & Sen McLaurin Press Conference on Free Speech | 9/25/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 19,
    "summary": "Here is a structured markdown summary of the Georgia Senate Jones & McLaurin press conference on free speech from September 25, 2025:\n\n**Overview**\nSenators Jones and McLaurin, along with advocacy groups, condemned the Trump administration's ongoing attacks on free speech and the lack of action from Senate Republicans to defend the First Amendment. They highlighted specific cases of viewpoint discrimination, media censorship, and the targeting of activists and dissenting voices.\n\n**Key Actions**\nNo specific bills were mentioned.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Sen. Jones detailed how the Trump administration has \"weaponized the FCC\" against media outlets, sued law firms over clients they represent, and restricted discussion of topics like slavery.\n- CAIR representative Asuka Mahmoud described activists being \"abducted\" and detained by ICE for speaking out against the \"Palestinian genocide.\"\n- Sen. McLaurin contrasted the Biden administration's voluntary requests to social media companies to the Trump FCC's threats to force ABC affiliates to \"take action\" against Jimmy Kimmel for his free speech remarks.\n- McLaurin expressed optimism that the American people value free speech and will not \"take this repression by the Trump administration lying down.\"\n\n**Votes**\nNo votes mentioned.\n\n**Attendance**\nNo quorum notes.\n\n**Adjournment**\nNo adjournment details provided."
  },
  {
    "video_id": "UHYZ7_4dFdo",
    "url": "https://www.youtube.com/watch?v=UHYZ7_4dFdo",
    "title": "Sen. Josh McLaurin Press Conference | 9/19/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 13,
    "summary": "Here is a structured summary of the key points from the Georgia Sen. Josh McLaurin press conference transcript:\n\n**Overview:**\n- Sen. McLaurin held a press conference to discuss the impending deportation of journalist Mario Guevara by the Trump administration's Board of Immigration Appeals (BIA), an executive agency. This is seen as part of a broader pattern of the administration's attacks on free speech and the press.\n\n**Key Actions:**\n- The BIA has issued an order to deport Mario Guevara, a journalist who has been legally residing in the US for decades, with no notice or explanation other than a 13-year-old deportation order that had been paused.\n- Guevara has an active federal court case seeking habeas relief, which the BIA is proceeding to ignore.\n\n**Bills Introduced (First Reading):** \n- None detected.\n\n**Notable Moments:**\n- Sen. McLaurin is joined by Richard Griffiths, a representative of the Georgia First Amendment Foundation and former immigrant journalist, who speaks about the troubling pattern of attacks on the press under the Trump administration.\n- Griffiths expresses how \"dispiriting\" it is to see a journalist thrown out of the country for doing their job.\n- There is an emergency hearing underway in federal court, with the ACLU and other organizations seeking a temporary restraining order to stop the deportation and allow Guevara's case to play out.\n\n**Votes:**\n- None detected.\n\n**Attendance:**\n- No quorum notes.\n\n**Adjournment:**\n- No adjournment information provided."
  },
  {
    "video_id": "pMKLBB-KsWw",
    "url": "https://www.youtube.com/watch?v=pMKLBB-KsWw",
    "title": "Sen. Wicks Press Conference on National Guard Deployments | 9-8-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a structured summary of the key points from the Georgia Sen. Wicks press conference on National Guard deployments:\n\n**Overview**\nThis press conference focused on the concerning issue of potential federal deployment of the National Guard in Georgia, which Sen. Wicks and other legislators condemned as unconstitutional and a threat to democracy. The speakers strongly opposed using the military against American citizens.\n\n**Notable Moments**\n- Sen. Wicks, a retired Army officer, passionately argued that the National Guard uniform should \"never be used to intimidate or divide\" and that its purpose is to \"protect and serve,\" not be misused against the people.\n- Rep. Bell compared the current situation to the dystopian FX series \"American Horror Story\" and urged the National Guard to \"come not with rifles but with rations\" to help the poor and suffering, not oppress them.\n- Rep. Jackson, another veteran, warned that using the National Guard for domestic law enforcement would violate the Posse Comitatus Act and disrespect the distinct roles of the military and law enforcement.\n\n**Opposition to Guard Deployments**\nThe legislators strongly condemned any potential federal deployment of the National Guard in Georgia, calling it unconstitutional, dangerous, and a violation of states' rights under the 10th Amendment. They called on the Governor and all Georgians to resist this \"federal overreach.\"\n\n**Conclusion**\nThe speakers passionately defended the principles of democracy, freedom, and the Constitution, urging resistance against any actions that would \"trample on the dignity of free men and women.\" They declared that \"this is not Nazi Germany\" and that Georgia must remain a \"beacon of democracy.\""
  },
  {
    "video_id": "8PB7mZygfEc",
    "url": "https://www.youtube.com/watch?v=8PB7mZygfEc",
    "title": "Sen  Parent Press Conference on CDC | 9-2-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 44,
    "summary": "Here is a summary of the key points from the Georgia Senate Parent Press Conference on the CDC on 9-2-2025:\n\n**Overview**: The press conference addressed the systemic attacks and dismantling of the Centers for Disease Control and Prevention (CDC) by the government. Several state representatives and former CDC officials spoke about the threats, harassment, and challenges faced by public health workers at the CDC.\n\n**Key Actions**: No specific bills or legislative actions were mentioned.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- Rep. Omari Crawford paid tribute to Officer David Rose, a Cobb County police officer who was killed while responding to a shooting near the CDC.\n- Several speakers, including Rep. Saira Draper, Dr. Deb Hauri, and Dr. Dan Jernigan, discussed the attacks, misinformation, and politically-motivated rhetoric directed at CDC employees, which they said was undermining the agency's ability to respond to health crises.\n- The speakers emphasized the importance of supporting and protecting the CDC's public health work, which impacts every Georgian and American.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The press conference concluded, but no specific adjournment time or next session date was given."
  },
  {
    "video_id": "asOV9DW3EY0",
    "url": "https://www.youtube.com/watch?v=asOV9DW3EY0",
    "title": "Sen. Kemp Federal Education Funding Press Conference | 7-14-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a summary of the key points from the Georgia Sen. Kemp Federal Education Funding Press Conference on 7-14-2025:\n\n**Overview**:\nThis press conference addressed the Trump administration's decision to freeze $6.8 billion in federal education funding, including critical support for after-school programs, summer learning, teacher training, and services for migrant students and English language learners in Georgia. The freezing of these funds is having a significant impact on school districts and community programs across the state.\n\n**Key Actions**: \nNo bills were mentioned in the transcript.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Sen. Kemp and other state leaders strongly condemned the Trump administration's decision, calling it \"reckless and callous\" and stating that it is \"wreaking havoc and concern\" in Georgia.\n- Sen. Kemp emphasized that these programs are \"not radical\" but \"essential\" for students, families, and communities across the state.\n- Representatives from after-school programs like Wings for Kids and the Lilly's Foundation for Change spoke about the devastating impact the funding freeze will have on their ability to provide critical services to thousands of students.\n- A student advocate, Deishan Katron, spoke passionately about how these programs build opportunity and support for young people.\n\n**Votes**:\nNo votes were mentioned.\n\n**Attendance**:\nNo specific quorum notes were provided.\n\n**Adjournment**:\nThe press conference concluded, but no information was given about the next legislative session."
  },
  {
    "video_id": "S671Kef9G9U",
    "url": "https://www.youtube.com/watch?v=S671Kef9G9U",
    "title": "04/01/2025 Sen. Setzler RFRA Press Conference",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 48,
    "summary": "Here is a structured markdown summary of the Georgia 04/01/2025 Sen. Setzler RFRA Press Conference session:\n\n**Overview**\nThis press conference focused on advocating for the passage of the Religious Freedom Restoration Act (RFRA) in Georgia. The speakers emphasized the importance of religious freedom and urged the state legislature to follow the example of 39 other states that have already enacted similar protections.\n\n**Key Actions**\nNo specific bills were mentioned in this transcript.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Pastors Frankie Vega and Garland Hunt gave opening and closing prayers, respectively, invoking religious freedom and calling on legislators to pass RFRA.\n- Thomas Hammond, representing the Georgia Baptist Mission Board, encouraged the House to vote on and pass the RFRA bill.\n- The speakers framed RFRA as a crucial protection of religious freedom, a fundamental right granted by God.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum notes provided.\n\n**Adjournment**\nNo adjournment details given."
  },
  {
    "video_id": "fJt6AELQimI",
    "url": "https://www.youtube.com/watch?v=fJt6AELQimI",
    "title": "Sen. McLaurin's Press Conference on Mario Guevara's ICE Detention | 7-22-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 50,
    "summary": "Here is a structured markdown summary of the Georgia Sen. McLaurin's Press Conference on Mario Guevara's ICE Detention | 7-22-2025 session:\n\n**Overview**\nThis press conference addressed the case of Mario Guevara, a journalist who has been detained by ICE for over a month despite having the charges against him dropped. The detention of a journalist exercising his First Amendment rights is seen as a troubling attack on press freedom.\n\n**Key Actions**\nNone detected\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Sen. Josh McLaren expressed concerns about the rapid expansion of ICE's budget and powers, which is creating fear in immigrant communities.\n- Jose Zamora from the Committee to Protect Journalists condemned Guevara's detention as retaliation for his journalism, making him the only journalist currently imprisoned in the U.S. for his reporting.\n- Lawyer Giovanni Diaz provided details on Guevara's case, including his legal status, the bond hearing, and efforts to secure his release.\n\n**Votes**\nNone detected\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nNo adjournment details provided"
  },
  {
    "video_id": "-2WMNWZ5V-U",
    "url": "https://www.youtube.com/watch?v=-2WMNWZ5V-U",
    "title": "6/24/2025 Democratic Press Conference on Reproductive Healthcare",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 10,
    "summary": "Here is a summary of the Georgia 6/24/2025 Democratic Press Conference on Reproductive Healthcare session:\n\n**Overview**\nThe session featured powerful testimony from Georgia women on the impacts of the state's restrictive abortion laws, particularly HB 481. However, the notable absence of the state Attorney General, who was invited but declined to attend, left many questions unanswered about the interpretation and implementation of these laws.\n\n**Key Actions**\n- **HB 481**: Georgia's \"heartbeat bill\" that bans most abortions after 6 weeks of pregnancy\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Testimony from Georgia women describing how the abortion restrictions have negatively impacted their lives and health\n- Criticism of the Attorney General for declining to attend and address questions about the laws\n- Calls for the state to prioritize the needs of women and families over politics\n\n**Votes**\nNone detected\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nThe session ended without a specific next meeting date mentioned."
  },
  {
    "video_id": "WFiNYICceNE",
    "url": "https://www.youtube.com/watch?v=WFiNYICceNE",
    "title": "5/29/2025 Sen. Islam Parkes Press Conference on Reproductive Rights in Georgia",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 19,
    "summary": "Here is a summary of the key points from the Georgia 5/29/2025 Sen. Islam Parkes Press Conference on Reproductive Rights in Georgia:\n\n**Overview:**\n- The press conference addressed the concerning situation of a brain-dead pregnant woman being kept on life support in Georgia, highlighting the ambiguity and potential harms caused by the state's restrictive abortion law.\n\n**Key Actions:**\n- **HB481**: Georgia's \"heartbeat\" abortion ban law, which is the subject of discussion and concern.\n\n**Bills Introduced (First Reading):**\n- No new bills were introduced during this press conference.\n\n**Notable Moments:**\n- Sen. Parkes called on Governor Camp to request a binding legal opinion from the Attorney General to clarify key questions about the abortion law's requirements and impacts.\n- Kasey Muroshak shared her personal story of facing barriers to care after a miscarriage due to the restrictive abortion law.\n- Speakers criticized the law for causing confusion, trauma, and harm to women and families, and called for the governor to provide clarity and leadership.\n\n**Votes:**\n- No votes were taken during this press conference.\n\n**Attendance:**\n- This was a press conference, so no quorum or attendance information was provided.\n\n**Adjournment:**\n- This was a press conference, not a legislative session, so there was no adjournment."
  },
  {
    "video_id": "owNh7YvZsvc",
    "url": "https://www.youtube.com/watch?v=owNh7YvZsvc",
    "title": "4/3/2025 | Sen. Merritt  GLBC Press Conference",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 43,
    "summary": "Here is a summary of the Georgia 4/3/2025 | Sen. Merritt GLBC Press Conference session:\n\n**Overview**: The Georgia Legislative Black Caucus (GLBC) held a press conference to address two pieces of \"unacceptable\" legislation (HB 127 and a bill impacting voting) and to stand in solidarity with the residents of Sparta who are facing eminent domain actions by a private railroad company.\n\n**Key Actions**:\n- **HB 127**: Described as an \"attack on DI programs in our state\"\n- **Bill impacting voting**: Works to reduce Black voter turnout\n\n**Bills Introduced (First Reading)**: None mentioned\n\n**Notable Moments**:\n- Rep. Al Williams gave a passionate speech condemning the eminent domain actions against Hancock County residents, drawing parallels to the civil rights movement.\n- Rep. Spencer Fry, an associate member of the GLBC, also spoke in support of the Sparta residents, highlighting the importance of generational land ownership.\n- Larry Raleigh of the Ados Advocacy Foundation spoke in solidarity with the Sparta landowners, decrying the history of land theft from Black families.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: No quorum notes provided.\n\n**Adjournment**: The transcript does not indicate when the press conference ended or the date of the next session."
  },
  {
    "video_id": "lJkwj4ScqJk",
    "url": "https://www.youtube.com/watch?v=lJkwj4ScqJk",
    "title": "4/3/2025 | Democratic Caucus Press Conference on HB127",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a summary of the key points from the Georgia legislative session transcript on the Democratic Caucus press conference regarding HB 127:\n\n**Overview**:\nThe Democratic caucus strongly opposed HB 127, describing it as a bill that would take Georgia \"backwards\" on issues of race, discrimination, and civil rights. They accused the Republican Party of being \"afraid\" to condemn slavery and the Confederacy.\n\n**Key Actions**:\n- **HB 127**: A bill that was originally about providing extra sick days for teachers, but was amended by Republicans to include \"DEI\" (diversity, equity, and inclusion) provisions that the Democrats opposed.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- Democrats accused Republicans of trying to \"hide\" and \"sneak through\" the bill by bringing it up late at night.\n- Democrats said they were prepared to fight for \"5-6 hours\" to either defeat the bill or amend it, but were denied that opportunity.\n- Democrats criticized Republicans for not allowing amendments that would have affirmed that slavery was a cause of the Civil War and that evolution should be discussed.\n\n**Votes**:\nNo specific votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nNo adjournment time or next session date mentioned."
  },
  {
    "video_id": "cB6V5JAgp6w",
    "url": "https://www.youtube.com/watch?v=cB6V5JAgp6w",
    "title": "03/20/2025 Sen. James  Press Conference on Film Day",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Overview:\nThe Georgia legislature held a press conference to celebrate \"Film Day\" and highlight the significant impact of the film industry in the state. Lawmakers emphasized the industry's economic contributions, job creation, and Georgia's status as a top filming destination.\n\nKey Actions:\nNo specific legislation was mentioned.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- State Representative Long Tran and Senator Danzala James co-hosted the event, joined by other state legislators.\n- The event honored the late Steve Messer, who had been instrumental in supporting the film industry in Georgia.\n- Speakers included Rep. Kim Skofield, Rep. Angela Moore, and Darius Evans, the president of the Georgia Production Partnership.\n- Lawmakers praised the film industry's economic impact, with the industry generating over $4.1 billion in direct spending in the state last year.\n- Legislators expressed their continued support for the film industry and commitment to keeping Georgia a top filming location.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nThe event was a press conference, not a legislative session. No adjournment information was provided."
  },
  {
    "video_id": "z_v5iUIbzbM",
    "url": "https://www.youtube.com/watch?v=z_v5iUIbzbM",
    "title": "Democrats Press Conference on SR 84 02/05/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "# Georgia Senate Session Summary - 02/05/2025\n\n## Overview\nThis session featured a press conference by Georgia Senate Democrats in support of Senate Resolution 84 (SR 84), which would amend the state constitution to protect abortion access up to fetal viability. The Democrats argued that this would give Georgia voters a direct say on the issue, contrary to the state's current restrictions.\n\n## Key Actions\n**SR 84**: Constitutional amendment to protect abortion access up to fetal viability\n\n## Bills Introduced (First Reading)\nNone noted\n\n## Notable Moments\n- Senate Democratic Leader Jones expressed the party's support for SR 84 and Senator Harrell's leadership on the issue.\n- Senator Harrell explained that the resolution would allow Georgia voters to have a direct say on abortion rights, unlike the current situation where legislators can ignore public opinion due to gerrymandering.\n- Harrell cited examples of harm caused by Georgia's restrictive abortion law, including the deaths of two women due to delayed care.\n- Harrell argued that the people of Georgia deserve the same opportunity as voters in other states to directly decide on abortion access.\n\n## Votes\nSR 84 passed\n\n## Attendance\nQuorum present\n\n## Adjournment\nSession adjourned. Next session scheduled for [DATE]."
  },
  {
    "video_id": "sjGpfZNfdeg",
    "url": "https://www.youtube.com/watch?v=sjGpfZNfdeg",
    "title": "Sen. Jackson | Equal Opportunity for Women's Sports Press Conference | 02 - 03 - 2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 16,
    "summary": "Here is a structured markdown summary of the Georgia Sen. Jackson | Equal Opportunity for Women's Sports Press Conference | 02 - 03 - 2025 session:\n\n## Overview\nThe press conference focused on addressing the inequities faced by girls and women in sports in Georgia, even decades after the enactment of Title IX. The speakers discussed various issues such as unequal treatment, lack of resources and funding, and media attention for girls' sports teams. The main legislative focus was on SB 41, the \"Equal Opportunities in Girl Sports Act\", which aims to address these disparities.\n\n## Key Actions\n- **SB 41**: The \"Equal Opportunities in Girl Sports Act\" introduced to address inequities faced by girls' sports teams in Georgia.\n- **SB 1**: The \"Fair and Safe Athletic Opportunities Act\" introduced by Senate Republicans, seen as a \"bully tactic\" targeting the trans community.\n\n## Bills Introduced (First Reading)\n- SB 41: The \"Equal Opportunities in Girl Sports Act\"\n- SB 1: The \"Fair and Safe Athletic Opportunities Act\"\n\n## Notable Moments\n- Speeches by Sen. Jackson, Rep. Oliver, and a female sports advocate highlighting the ongoing challenges and inequities in girls' and women's sports in Georgia.\n- Calls to address real issues facing girls' sports teams, such as lack of resources, funding, and media coverage, rather than focusing on the \"non-existence of girl trans athletes\".\n- Celebration of progress made, such as the inclusion of women on the Georgia High School Sports Association board, and the addition of fast-pitch softball to the high school sports system.\n\n## Votes\nNo recorded votes mentioned, but SB 41 and SB 1 were said to be making their way through the legislative process.\n\n## Attendance\nNo specific quorum notes provided.\n\n## Adjournment\nNo information on when the press conference adjourned or the date of the next session."
  },
  {
    "video_id": "pH60UVae4Og",
    "url": "https://www.youtube.com/watch?v=pH60UVae4Og",
    "title": "Crossover Day 2025 | How a Bill Becomes a Law",
    "chamber": null,
    "session_type": "regular",
    "day_number": 2025,
    "video_date": null,
    "duration_minutes": 1,
    "summary": "Overview: The transcript does not contain any substantive legislative actions or notable moments. It appears to be a generic placeholder text without any specific details about a Georgia legislative session.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments: None detected.\n\nVotes: None detected.\n\nAttendance: No quorum notes provided.\n\nAdjournment: No adjournment time or next session date mentioned."
  },
  {
    "video_id": "J2qESc0eBd0",
    "url": "https://www.youtube.com/watch?v=J2qESc0eBd0",
    "title": "3/12/2025--GLBC--Press Conference on SB67",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 28,
    "summary": "Overview:\n- This press conference focused on opposition to SB 68, a bill that Georgia legislators argue would unfairly limit victims' ability to seek justice in court, particularly for survivors of sex trafficking and drunk driving accidents.\n\nKey Actions:\n- **SB 68**: Bill that would restrict victims' ability to sue businesses, which legislators argue would protect corporate interests over victims' rights.\n\nBills Introduced (First Reading):\n- None mentioned\n\nNotable Moments:\n- Emotional testimony from sex trafficking survivors recounting their \"repeated rape, repeated sadimization, repeated beatings, repeated torture and torment at the hands of abusers.\"\n- Legislators argue the bill is \"poorly drafted\" and proponents could not articulate a scenario where sex trafficking victims could seek justice under the bill.\n- Legislators call on the governor and Republican leadership to work with them to improve the bill to better balance business and victim interests.\n- Accusations that the governor and Republican leadership have targeted and tried to silence victim advocacy groups like Mothers Against Drunk Driving who oppose the bill.\n\nVotes: \n- None mentioned\n\nAttendance:\n- No quorum notes\n\nAdjournment:\n- Press conference concluded, no mention of next session date."
  },
  {
    "video_id": "blMsMh3xlYU",
    "url": "https://www.youtube.com/watch?v=blMsMh3xlYU",
    "title": "03/11/2025--Sen .Kennedy--Press Conference on Linemen's Day",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Overview: This session was a press conference held by Senator Kennedy to honor and recognize the important work of Georgia's linemen, who play a critical role in maintaining the state's energy infrastructure, particularly during times of natural disaster. The event featured remarks by Sen. Kennedy and the Lieutenant Governor highlighting the sacrifices and risks taken by linemen to keep the lights on and communities safe.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- Sen. Kennedy praised the linemen as \"quiet heroes\" who work tirelessly, often at great personal risk, to ensure Georgia's way of life remains uninterrupted.\n- He recounted the efforts of linemen in the aftermath of Hurricane Helene, working long hours and shifts to restore power.\n- The event was attended by the Lt. Governor and other state leaders who expressed gratitude for the linemen's service.\n\nVotes: None detected.\n\nAttendance: Quorum not explicitly noted.\n\nAdjournment: No explicit adjournment mentioned, as this was a press conference rather than a legislative session."
  },
  {
    "video_id": "UNotK0HmXGM",
    "url": "https://www.youtube.com/watch?v=UNotK0HmXGM",
    "title": "03/05/2025 Sen.H.Jones II  Press Conference w/ ACLU and NAACP on DEI",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 35,
    "summary": "Here is a summary of the Georgia 03/05/2025 Sen. H.Jones II Press Conference with the ACLU and NAACP on the DEI session:\n\n**Overview**\nThe press conference addressed the recent passage of Senate Bill 120 in the Georgia Senate, which bans promoting, supporting or maintaining any programs or activities that advocate for diversity, equity and inclusion (DEI) at post-secondary institutions. Speakers strongly criticized the bill, arguing it is an assault on American and Georgia values of inclusion and diversity.\n\n**Key Actions**\n**SB 120**: Bill banning DEI programs and activities at post-secondary institutions in Georgia\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Sen. Minard Lear criticized SB 120 as a \"retreat from the American and Georgia spirit of inclusion\" that diverts attention from important issues like healthcare, housing, and income inequality.\n- Sen. Nikki Merritt called SB 120 a \"tone-deaf legislative tragedy\" that rejects Georgia's legacy of diversity and the civil rights movement.\n- Former Rep. Roger Bruce questioned why lawmakers need laws dealing with diversity to help descendants of slavery, arguing the \"playing field is not level\" due to past injustices.\n- Nancy Flake Johnson, President of the Urban League of Greater Atlanta, said SB 120 limits constitutional rights and that DEI is one of the best strategies to bring people together and achieve parity.\n\n**Votes**\nNone recorded\n\n**Attendance**\nNo specific quorum notes\n\n**Adjournment**\nNot mentioned"
  },
  {
    "video_id": "n4sTVIgKVps",
    "url": "https://www.youtube.com/watch?v=n4sTVIgKVps",
    "title": "Sen. Kennedy's Response to the President's Joint Address to Congress | 3-4-2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "# Summary of Georgia Sen. Kennedy's Response to the President's Joint Address to Congress | 3-4-2025\n\n## Overview\nSen. Kennedy delivered a strong endorsement of President Trump's policies and vision for the country, highlighting the President's commitment to economic prosperity, limited government, and putting American citizens first. He praised the President's \"America First\" agenda and pledged that Georgia Republicans would work to turn the President's vision into action.\n\n## Key Actions\nNo specific bills were mentioned.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Sen. Kennedy praised President Trump's \"bold vision for the future\" and his commitment to the principles that have \"always made this nation great.\"\n- He accused the Democratic Party of clinging to \"tired old ideas of bigger government, open borders, and weakness abroad.\"\n- He promised that Georgia Republicans would \"roll up our sleeves and get to work\" to deliver on President Trump's agenda.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "BFo8DX3u00g",
    "url": "https://www.youtube.com/watch?v=BFo8DX3u00g",
    "title": "02/28/2025 Sen.Merritt Press Conference on Family, and Workforce Justice",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "Overview:\nSenator Nikki Marrett held a press conference to introduce her \"Family and Workforce Justice\" legislative agenda for the 2025 session. The package includes several bills aimed at addressing threats to civil rights, protecting vulnerable populations, and ensuring affordable housing options.\n\nKey Actions:\n**SB 92**: \"Red flag law\" to temporarily remove firearms from those deemed a threat to themselves or others\n**SB 164**: Bans surveillance-based pricing, wage discrimination, and other unfair data-driven practices by corporations\n**SB 165**: Protects children from exploitation on social media platforms\n**SB 166**: Holds corporate landlords accountable for providing safe and high-quality housing\n**SB 167**: Prohibits discrimination in AI-based decision-making systems\n\nBills Introduced (First Reading):\n- SB 92 - \"Red flag law\"\n- SB 164 - Ban on surveillance-based pricing, wage discrimination\n- SB 165 - Protections for children on social media \n- SB 166 - Accountability for corporate landlords\n- SB 167 - Prohibiting AI-based discrimination\n\nNotable Moments:\n- Senator Marrett called for bipartisan support on the legislation, stating \"these solutions are not about red or blue\"\n- She criticized the lack of hearings so far on Democratic bills in the 2025 session\n\nVotes: \nNone detected\n\nAttendance:\nNo quorum notes provided\n\nAdjournment:\nThe press conference concluded, with no specific information on the next legislative session date."
  },
  {
    "video_id": "qxmEMoklBi0",
    "url": "https://www.youtube.com/watch?v=qxmEMoklBi0",
    "title": "Democratic Response to the State of Judiciary | 1/28/2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 15,
    "summary": "Here is a summary of the key points from the Georgia Democratic Response to the State of the Judiciary session on 1/28/2025:\n\n**Overview:** The Democratic Senate leadership introduced and discussed SB 50, a bipartisan bill to expand Medicaid in Georgia and close the insurance coverage gap. This was presented as the top legislative priority for the Democrats this session.\n\n**Key Actions:**\n**SB 50:** Expands Medicaid coverage to 500,000 Georgians, helping to reduce infant and maternal mortality, provide access to care for working parents and children, and increase access to mental health services.\n\n**Bills Introduced (First Reading):** SB 50 - Medicaid Expansion Bill\n\n**Notable Moments:**\n- Democratic Senate Memorial Leader Harold Jones highlighted the benefits of SB 50 and the bipartisan support for the bill.\n- Senator David Lucas, a sponsor of SB 50, spoke passionately about the need for Medicaid expansion in Georgia and criticized the Governor's alternative \"Pathway\" proposal.\n- There was discussion around educating the public and working with the Governor to get the bill passed.\n\n**Votes:** No recorded votes mentioned.\n\n**Attendance:** No quorum notes provided.\n\n**Adjournment:** The transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "1Y-Ekx0jKlc",
    "url": "https://www.youtube.com/watch?v=1Y-Ekx0jKlc",
    "title": "Senator Hickman | Disability and Employment Press Conference | 1/29/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 27,
    "summary": "Here is a structured markdown summary of the Georgia Senator Hickman | Disability and Employment Press Conference | 1/29/2025 session:\n\n**Overview:**\nThe session focused on the Dignity and Pay Act, a bill introduced by Senator Billy Hickman to end the use of sub-minimum wages for workers with disabilities in Georgia by 2027. The session featured speeches by advocates highlighting the unfair practice of paying some Georgians with disabilities less than minimum wage.\n\n**Key Actions:**\n**HB 1125**: The Dignity and Pay Act, introduced by Senator Hickman, aims to phase out the use of sub-minimum wages for workers with disabilities in Georgia by 2027.\n\n**Bills Introduced (First Reading):** \nNone detected.\n\n**Notable Moments:**\n- Executive Director of the Georgia Council on Developmental Disabilities, Darcy Robb, spoke about the current law that allows some disability service providers to pay workers with disabilities less than minimum wage, with documented cases of wages as low as $0.22/hour.\n- Advocates, including the sister of a worker with a disability, shared personal stories about the impacts of sub-minimum wages and the capabilities of workers with disabilities when given the opportunity.\n- Senator Hickman introduced the Dignity and Pay Act, explaining that the current law sends the wrong message about the value of contributions from people with disabilities, and that fair wages are possible as evidenced by Georgia's \"Georgia as a Model Employer\" law.\n\n**Votes:** \nNone detected.\n\n**Attendance:**\nQuorum present, with over 200 advocates in attendance.\n\n**Adjournment:**\nThe session adjourned. No information on the next session date."
  },
  {
    "video_id": "z_r5kGRcekY",
    "url": "https://www.youtube.com/watch?v=z_r5kGRcekY",
    "title": "Safe Gun Storage Press Conference   1-28-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 25,
    "summary": "Here is a structured markdown summary of the Georgia Safe Gun Storage Press Conference on 1-28-2025:\n\n## Overview\nThe press conference focused on legislative efforts to address safe gun storage and reduce unintentional gun deaths of children in Georgia. Key speakers highlighted the state's high rates of unintentional shootings by children and called for action this legislative session.\n\n## Key Actions\n**Bill 1**: Creation of a statewide database to identify students in need of essential services related to gun safety\n**Bill 2**: Establishment of a statewide \"ZARC\" (Gun Safety and Responsibility Coordinator) position to disseminate information, work with industry, and advise the legislature\n\n## Bills Introduced (First Reading)\n- Safe storage law with misdemeanor penalty for knowingly allowing minors to access firearms\n- Legislation to keep individuals adjudicated as dangers to themselves or others in the federal background check system\n\n## Notable Moments\n- Speakers emphasized that hardening schools alone is insufficient to prevent tragedies, and that addressing easy access to guns in communities is crucial.\n- Bipartisan support was highlighted, with speakers from both parties calling for action.\n- The fallout from the recent mass shooting at Appalachia High School was discussed as driving the urgency for legislative solutions.\n\n## Votes\nNo votes were mentioned.\n\n## Attendance\nNo specific quorum details were provided.\n\n## Adjournment\nThe press conference concluded, with no next session date specified."
  },
  {
    "video_id": "Mh2K3lWIyOU",
    "url": "https://www.youtube.com/watch?v=Mh2K3lWIyOU",
    "title": "Governor Kemp Press Conference | 1/13/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 17,
    "summary": "Here is a structured summary of the Georgia Governor Kemp Press Conference from January 13, 2025:\n\n**Overview**:\nThe press conference focused on Governor Kemp's education and school safety initiatives, highlighting significant investments and legislative actions taken to support public schools, teachers, and student security in Georgia.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**: \nNone detected.\n\n**Notable Moments**:\n- Governor Kemp touted major investments in public education since 2019, including nearly $10,000 raises for teachers, restoring the HOPE Scholarship, and fully funding schools for 5 consecutive years.\n- Kemp announced an additional $10.3 million for local school districts to support pupil transportation.\n- Since taking office, Kemp stated that over $185 million in one-time school security grants (roughly $80,000 per school) have been provided.\n- Kemp proposed an additional $50 million in one-time school security grants for the current fiscal year, bringing the total to over $86,000 per school.\n- Lieutenant Governor Jones and Speaker Burns expressed strong bipartisan support for the school safety initiatives and a commitment to continue building on these efforts.\n\n**Votes**:\nNo votes mentioned.\n\n**Attendance**:\nThe press conference featured Governor Kemp, First Lady Marty Kemp, Lieutenant Governor Bert Jones, Speaker of the House John Burns, and various legislative leaders.\n\n**Adjournment**:\nThe press conference concluded, but no details provided on the next session date."
  },
  {
    "video_id": "UQY8qG9j9WA",
    "url": "https://www.youtube.com/watch?v=UQY8qG9j9WA",
    "title": "Senate Day 35 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 188,
    "summary": "Here is a summary of the Georgia Senate Day 35 session in 2025:\n\n**Overview**:\nThe Georgia Senate session on Day 35 of the 2025 legislative session focused on the introduction of several new bills and resolutions, as well as the advancement of some bills through committee. There was routine procedural business but no notable moments of debate or controversy.\n\n**Key Actions**:\n- **HB 92**: Passed\n- **HB 360**: Referred to committee\n\n**Bills Introduced (First Reading)**:\n- Senate Bill 352, 353, 354, 355\n- Senate Resolution 441, 444, 445\n\n**Notable Moments**:\n- The Senate president recognized a group of 24 student pages from across Georgia who were assisting in the chamber.\n- There was some brief discussion between senators about their children's soccer games over the weekend.\n\n**Votes**:\nNo recorded votes are mentioned in the transcript.\n\n**Attendance**:\nA quorum was present, as the session proceeded without any notes about lacking members.\n\n**Adjournment**:\nThe transcript does not provide the specific time of adjournment or the date of the next scheduled session."
  },
  {
    "video_id": "5rIUWgCQGQI",
    "url": "https://www.youtube.com/watch?v=5rIUWgCQGQI",
    "title": "Senate Day 34 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 34,
    "video_date": null,
    "duration_minutes": 176,
    "summary": "Here is a summary of the Georgia Senate Day 34 session in 2025:\n\n**Overview**:\nThe session focused on the introduction and consideration of various bills and resolutions, covering topics such as education, health and human services, higher education, agriculture and natural resources, public safety, and state and local government operations.\n\n**Key Actions**:\n- **HB 1114**: Federal regulations regarding state operation of commercial motor vehicles and carriers, update reference state\n- **HB 159**: Allow certain persons to be buried in Georgia Veterans Cemetery\n- **HB 266**: Safeguarding Barrican Veteran Empowerment Act\n- **HB 58**: Superior Court Judicial Compensation Reform Act\n- **HB111**: Require coverage for medically necessary expenses for standard fertility preservation services\n- **SB 68**: Create Senate study committee on franchise fee\n- **SR 395**: Create Senate study committee on intoxicating cannabinoids\n- **SR 397**: Create Senate study committee on addressing felony disenfranchisement\n- **SR6**: Create Senate study committee on impact on social service agencies\n\n**Bills Introduced (First Reading)**:\n- SB 347, SB 351, SR 424, SR 427, SR 429, SR 431, SR 432, SR 437, SR 439\n\n**Notable Moments**:\n- Recognition of pages from across the state\n- Minority report notice filed for SR 292\n\n**Votes**:\n- HB 307, SR 237, HB 371 - passed by substitute\n- HB 154, HB 291, HB 428, HB 431, HB 567 - passed\n- HB 192, HB 322, HB 217 - passed\n- HB 131 - passed by substitute, HB 162, HB 288, HB 378, HB 447 - passed\n- HB 177 - passed by substitute, HB 238 - passed\n- HB 54 - passed by substitute, HB 187, HB 635 - passed\n- SR 292 - passed, SR 323 - passed by substitute, SR 391 - passed by substitute, HB 92 - passed by substitute, HB 44 - passed\n- SB 328, SB 329, HB 514, HB 587, HB 623, HB 624, HB 539, HB 542, HB 733 - passed\n\n**Attendance**:\nQuorum present, no issues noted.\n\n**Adjournment**:\nSession adjourned. Next session scheduled for the following legislative day."
  },
  {
    "video_id": "vPTcXEqFTgE",
    "url": "https://www.youtube.com/watch?v=vPTcXEqFTgE",
    "title": "Senate PM 4 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 108,
    "summary": "Here is a summary of the key points from the Georgia Senate PM 4 Day 40 session transcript:\n\n**Overview:**\nThe session included discussions and actions on several bills, including HB 224, HB 296, HB 491, HB 516, SB 101, SB 12, and SB 207. There was also a drawing for a sportsman caucus shotgun or pistol, with one senator winning the ticket. The governor made remarks highlighting the state's investments, tax cuts, and partnership with the legislature.\n\n**Key Actions:**\n**HB 516:** Allows county regional library boards and community service boards to conduct meetings through teleconferencing, with certain public access requirements.\n\n**Bills Introduced (First Reading):**\nNo new bills were explicitly introduced during this transcript.\n\n**Notable Moments:**\n- Sportsman caucus drawing for a shotgun or pistol, with one senator winning the ticket.\n- Governor's remarks highlighting legislative achievements, investments, tax cuts, and partnership with the legislature.\n- Debate and amendment process for HB 516 regarding public meetings and tax-exempt bond validations.\n\n**Votes:**\nNo recorded votes were included in the transcript.\n\n**Attendance:**\nThe transcript does not provide any specific quorum or attendance details.\n\n**Adjournment:**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "c5kcMBsE6IQ",
    "url": "https://www.youtube.com/watch?v=c5kcMBsE6IQ",
    "title": "House PM 3 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 162,
    "summary": "Here is a summary of the key points from the Georgia House PM 3 Meeting for Day 40 of the 2025 Session:\n\n**Overview**\nThis session focused on passing several local bills related to homestead exemptions, as well as considering two substantive bills - HB 54 regarding advanced practice nurses and HB 253 about child custody laws.\n\n**Key Actions**\n- **HB 54**: Allows advanced practice registered nurses and physician assistants to order all health care services\n- **HB 253**: Amends laws related to child custody, including allowing \"baby boxes\" for safe newborn abandonment\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced during this session.\n\n**Notable Moments**\n- Lengthy debate and final passage of several local homestead exemption bills requiring a 2/3 vote\n- Explanation by Rep. Clark on the Senate amendments and House changes to HB 54 and HB 253\n\n**Votes**\n- Homestead exemption bills (SB 234, SB 235, SB 336) passed 147-2\n- SB 330 (homestead exemption) passed 150-7 \n- HB 54 passed 157-0 after House agreed to Senate substitute\n- HB 253 passed after House agreed to Senate substitute with House amendment\n\n**Attendance**\nNo specific quorum details provided.\n\n**Adjournment**\nThe session adjourned, with the next meeting date unspecified."
  },
  {
    "video_id": "cIRwh0bSQ28",
    "url": "https://www.youtube.com/watch?v=cIRwh0bSQ28",
    "title": "Senate PM 2 Meeting for Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 92,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM 2 Meeting for Day 40 of the 2025 Legislative Session:\n\n**Overview:**\nThis session saw the Senate agree to House substitutes and amendments on several road naming resolutions, including SR 8, SR 231, and HR 7. There was some back-and-forth between senators, particularly around the number of bills the Senate has passed and the growth of government. Overall, the session focused on finalizing these road naming measures.\n\n**Key Actions:**\n- **SR 8**: Resolution honoring the life and memory of Deputy Brandon Cunningham and dedicating an intersection in his memory.\n- **SR 231**: Resolution honoring the life of Officer Jarena Lelonte and dedicating an interchange in his memory.\n- **HR 7**: Resolution honoring the life of Mr. George C. Trudeau, Jr. and dedicating portions of the state highway system.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Senators debated the number of bills passed and growth of government, with some good-natured ribbing.\n- There was a suggestion to declare a \"Greg Dolezal power hour\" in recognition of the senator's frequent speaking.\n\n**Votes:**\n- SR 8, SR 231, and HR 7 all passed with unanimous votes.\n\n**Attendance:** \n- The Senate excused the absence of the senator from the 6th.\n\n**Adjournment:**\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "brl4ZA9kdQs",
    "url": "https://www.youtube.com/watch?v=brl4ZA9kdQs",
    "title": "House PM Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 160,
    "summary": "Here is a structured markdown summary of the key points from the Georgia House PM Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThe session focused on the passage of the FY26 state budget, with notable items related to education funding, healthcare, and disaster relief. Several bills were also introduced and considered.\n\n## Key Actions\n**HB 68**: Conference committee report on the bill was adopted.\n**HB 223**: $17.3 million grant for local governments to provide reimbursements for timber severance taxes not collected.\n\n## Bills Introduced (First Reading)\n- HB 491\n- HB 1\n- SB 10\n- SB 153\n- SB 163\n- SB 179\n- SB 204\n\n## Notable Moments\n- Introductions of student pages Maya Murdoch, Miles Murdoch, and Danica Risha.\n- Discussion of the FY26 budget, including increased revenue estimates, funding for education and public safety, Apex program funding, and Medicaid rate adjustments.\n- Highlight of $15.2 million in funding for the poverty rate to impact 94,000 students in 59 school systems.\n- Provision of $3.9 million to expand Medicaid delivery service payments in rural counties.\n- Establishment of a fund with the Forestry Commission to provide speedier overtime payments to forest land firefighters.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nQuorum was achieved, with all members present.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "6kwEKXItiZs",
    "url": "https://www.youtube.com/watch?v=6kwEKXItiZs",
    "title": "Senate AM Meeting for Day 40 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 198,
    "summary": "Here is a structured markdown summary of the Georgia Senate AM Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThe Senate session included the introduction of several new bills and resolutions, as well as the recognition of pages and legislators. There was discussion around legislative procedures and traditions.\n\n## Key Actions\n- **HB 651**: Passed\n- **HB 68**: Passed\n- **HB225**: Passed\n- **HB6651**: Passed\n- **SB 20**: Referred\n- **SB 255**: Referred\n- **SB 63**: Referred \n- **SB 85**: Referred\n\n## Bills Introduced (First Reading)\n- Senate Resolution 534 by Senator Dullazal and others\n- Senate Resolution 537 by Senator Kemp and others \n- Senate Resolution 535 by Senator Kemp and others\n- Senate Resolution 553 by Senator Harper and others\n\n## Notable Moments\n- Recognized a group of legislative pages\n- Discussed the tradition of the Lt. Governor throwing the first pitch on Day 40\n- Welcomed Dr. E. Dewey Smith Jr., a prominent local pastor, to deliver the morning devotion\n\n## Votes\n- HB 651, HB 68, HB225, HB6651 - Voted and passed\n- SB 20, SB 255, SB 63, SB 85 - Referred to committee\n\n## Attendance\n- Senators from the 35th and 43rd districts were excused for business inside the Capitol\n- Senators from the 9th and 26th districts were also excused\n\n## Adjournment\nThe Senate adjourned after the morning devotion and is scheduled to reconvene for the next session."
  },
  {
    "video_id": "NI6z21GMw7w",
    "url": "https://www.youtube.com/watch?v=NI6z21GMw7w",
    "title": "Senate PM Meeting pt. 1 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 156,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting pt. 1 for Day 39 of the 2025 Session:\n\n**Overview:**\nThe session focused on passing several key bills, including HB 371 to create the Vince Dooley Battlefield Trust Fund, HB 513 to revise provisions on county service delivery strategy, and amendments to bills on video surveillance at gas stations.\n\n**Key Actions:**\n- **HB 371:** Establishes the Vince Dooley Battlefield Trust Fund to preserve historic battlefields in Georgia.\n- **HB 513:** Revises provisions on the county share of funding for jointly funded countywide services to be borne by unincorporated residents.\n- **Amendment to HB 513:** Authorizes the continuance of existing local ordinances related to video surveillance at gas stations.\n\n**Bills Introduced (First Reading):**\n- None noted in the transcript.\n\n**Notable Moments:**\n- The Vince Dooley Battlefield Trust Fund bill was championed by Senator from the classic city, with support from two former players who played for Coach Dooley.\n- Discussion of the Service Delivery Strategy Act amendments and the need to grandfather in existing video surveillance ordinances.\n\n**Votes:**\n- HB 371 passed with a vote of 47-0.\n- The amendment to HB 513 was adopted.\n\n**Attendance:**\n- Quorum was present, no issues noted.\n\n**Adjournment:**\n- The transcript does not provide information on when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "xseptv7jjSo",
    "url": "https://www.youtube.com/watch?v=xseptv7jjSo",
    "title": "House Day 35 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 142,
    "summary": "Overview:\nThe Georgia House session on this day focused on promoting unity and bipartisanship among the representatives. The chaplain's remarks emphasized the importance of peace, compassion, and humility in the legislative process.\n\nKey Actions:\n**HR 273**: Recognizing and commending the Cancer Treatment Centers of America and City of Hope Cancer Center for their commitment to patient care.\n**SB 112**: Referred to committee\n**SB 42**: Referred to committee \n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- The chaplain, Reverend Chip Gordon, gave a speech urging the representatives to be \"peacemakers\" and strive for unity, despite their differences.\n- There was a recognition of the Cancer Treatment Centers of America and City of Hope Cancer Center for their work in patient care.\n\nVotes:\nNo recorded votes took place.\n\nAttendance:\nA quorum was present, with all members voting to signify their attendance.\n\nAdjournment:\nThe session was adjourned. The next session date was not provided in the transcript."
  },
  {
    "video_id": "HQz6prr9aFg",
    "url": "https://www.youtube.com/watch?v=HQz6prr9aFg",
    "title": "House AM Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 128,
    "summary": "Here is a summary of the Georgia House AM Meeting for Day 40 of the 2025 Session:\n\n**Overview**\nThe session featured a prayer by the chaplain emphasizing the challenges and burdens faced by the legislators during the 40-day legislative session, drawing parallels to biblical figures like Noah, Moses, and Jesus. The chaplain offered words of encouragement and an invitation to find rest and peace amidst the demands of the job.\n\n**Key Actions**\n* **HB 567**: Passed\n* **HB 582**: Passed\n* **HB 197**: Referred\n* **HR 328**: Passed\n* **HR 7**: Passed\n* **SB 218**: Passed\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\nThe chaplain's prayer provided a reflective and inspirational start to the legislative day, touching on the personal and professional challenges faced by the representatives.\n\n**Votes**\n* **HB 567, HB 582, HR 328, HR 7, SB 218**: Passed with votes\n* **HB 197**: Referred with no explicit vote mentioned\n\n**Attendance**\nThe speaker noted that all members were present and instructed them to vote to signify their presence.\n\n**Adjournment**\nThe session was held on the final, 40th day of the legislative session. The next session date was not provided."
  },
  {
    "video_id": "dxnXTuqyp5Y",
    "url": "https://www.youtube.com/watch?v=dxnXTuqyp5Y",
    "title": "House PM Meeting pt. 1 for Day 39 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 217,
    "summary": "Here is a structured markdown summary of the Georgia House PM Meeting pt. 1 for Day 39 of the 2025 Session:\n\n## Overview\nThe session focused on the discussion and presentation of Senate Bill 125, which aims to decouple the sequential order of the internship hours and the Professional Engineering (PE) exam for engineers in Georgia. The bill also includes provisions from House Bill 34 and House Bill 187 to address licensing issues and streamline regulations for various contractor professions.\n\n## Key Actions\n**SB 125**: Amends the code related to professional engineers and land surveyors to decouple the sequential order of internship hours and the PE exam, allowing engineers to take the exam after earning their degree while still requiring the 4-year internship before becoming licensed.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this portion of the session.\n\n## Notable Moments\n- Representative Lauren McDonald presented SB 125 and explained the rationale behind the bill, noting it would provide flexibility for engineers without compromising professional requirements.\n- There was discussion between representatives regarding the bill's impact on engineer competency and safety, with the bill's proponents arguing it would not compromise standards.\n- The co-chair of the Blue Ribbon Committee that worked on these licensing issues spoke in support of the legislation.\n- Representative Gabe McCoy, a registered engineer, expressed concerns about the bill potentially allowing unqualified people to become licensed engineers.\n\n## Votes\nNo recorded votes were taken during this portion of the session.\n\n## Attendance\nThe transcript indicates the Speaker called for all members to come to the floor, suggesting a quorum was present.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or when the next session would be held."
  },
  {
    "video_id": "d3lTPb-UR20",
    "url": "https://www.youtube.com/watch?v=d3lTPb-UR20",
    "title": "Senate AM Meeting for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 111,
    "summary": "Here is a summary of the Georgia Senate AM Meeting for Day 39 of the 2025 Session:\n\n**Overview**:\nThe session featured routine proceedings, including the reading of the journal, introduction of Senate bills and resolutions, and reports from standing committees. Notable was the devotion led by Reverend Elizabeth Mitchell Clement.\n\n**Key Actions**:\n**SR 487**: Applauding Senator Brennan Beach for exceptional service in the Georgia State Senate.\n\n**Bills Introduced (First Reading)**:\n- SB 368 by Senator Ginn\n- SB 369 by Senator Silver \n- SB 370 by Senator Dulles and others\n- SR 517 by Senator Dulles and others\n- SR 533 by Senator James\n\n**Notable Moments**:\n- Reverend Elizabeth Mitchell Clement provided the devotion, reflecting on the call to serve and make good choices.\n- Pages from across Georgia were recognized and welcomed to the chamber.\n\n**Votes**:\nNo recorded votes. Bills were reported out of committee with \"do pass\" recommendations.\n\n**Attendance**:\nSenators from the 50th, 26th, and 7th districts were excused.\n\n**Adjournment**:\nThe session adjourned. The next session date was not specified."
  },
  {
    "video_id": "YokT0eT5SB8",
    "url": "https://www.youtube.com/watch?v=YokT0eT5SB8",
    "title": "House AM Meeting for Day 39 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 119,
    "summary": "Overview:\n- This Georgia House AM meeting included a prayer by Rabbi Hershey Minkowitz and the Pledge of Allegiance, but no substantive legislative actions.\n\nKey Actions:\nNone.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- Rabbi Hershey Minkowitz gave a reflection on the significance of Passover and its connection to the spring season.\n\nVotes:\nNone recorded.\n\nAttendance: \n- A quorum was present, as all members voted to signify their presence.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or when the next session will be."
  },
  {
    "video_id": "PlLsDdnxG9E",
    "url": "https://www.youtube.com/watch?v=PlLsDdnxG9E",
    "title": "House Afternoon Session For Day 28 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 263,
    "summary": "Here is a structured markdown summary of the key points from the Georgia House Afternoon Session transcript:\n\n# Georgia House Afternoon Session - Day 28, 2025 Legislative Session\n\n## Overview\nThe session focused on discussing and debating Senate Bill 1, known as the \"Riley Gaines Act\", which aims to maintain fairness in female athletics by eliminating the potential for male advantage. There was extensive discussion of the bill's provisions and comparison to a previously passed House bill on the same topic.\n\n## Key Actions\n**SB 1**: Riley Gaines Act - Maintains fairness in female athletics by eliminating potential for male advantage and protecting female spaces during sporting events.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Extensive debate and questioning of the bill sponsor, Rep. Bonner, on the need for the legislation and comparisons to previous House bill.\n- Recognition of the work by various legislators, including Sen. Dolezal and Lt. Gov. Jones, in crafting the bill.\n- Speaker Burns praised for leadership on providing a level playing field for female athletes.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nTranscript does not indicate when the session adjourned or the date of the next session."
  },
  {
    "video_id": "5im_VrGZOoI",
    "url": "https://www.youtube.com/watch?v=5im_VrGZOoI",
    "title": "Senate Session for Day 38 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 134,
    "summary": "Here is a summary of the Georgia Senate session for Day 38 of the 2025 Session:\n\n**Overview**\nThis session focused on the discussion and passage of House Bill 268, which aims to improve school safety and security in Georgia in response to a tragic school shooting incident.\n\n**Key Actions**\n- **HB 268**: Bill to create the Office of Safe Schools, develop policies and procedures for threat management teams, and enhance school safety measures.\n\n**Bills Introduced (First Reading)**\n- None noted in the transcript.\n\n**Notable Moments**\n- Emotional speech by the Senator from the 46th district, whose district includes the site of the tragic school shooting that inspired this legislation. The Senator honored the victims and expressed the importance of passing this bill to prevent such tragedies in the future.\n- Bipartisan collaboration between the House and Senate referenced, with several Senators having previously passed related school safety bills that were incorporated into HB 268.\n\n**Votes**\n- HB 268 passed with unanimous support.\n\n**Attendance**\n- Senators from the 22nd and 26th/17th districts were excused.\n\n**Adjournment**\n- The transcript does not provide the time of adjournment or the date of the next session."
  },
  {
    "video_id": "AUevFXUpYts",
    "url": "https://www.youtube.com/watch?v=AUevFXUpYts",
    "title": "Senate Day 37 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 235,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 37 session:\n\n### Overview\nThe session featured the introduction of several new bills and resolutions, as well as committee recommendations on various pieces of legislation. Notable actions included committee recommendations on House Bills 127, 397, 97, 36, 268, 582, 618, 49, and 630, as well as several Senate resolutions.\n\n### Key Actions\n**HB 127**: Passed by substitute in Education and Youth Committee  \n**HB 397**: Passed by committee in Ethics Committee  \n**HB 97**: Passed by committee in Finance Committee  \n**HB 36, HB 268, HB 582, HB 618**: Passed by substitute in Judiciary Committee\n**HB 49, HB 630**: Passed by substitute in Regulated Industries and Utilities Committee\n**SR 255, SR 311, SR 393, SR 424, SR 427, SR 429, SR 444, SR 475**: Passed in Rules Committee\n\n### Bills Introduced (First Reading)\n- SB 362 by Senator Malo\n- SB 363 by Senator McLean \n- SB 364 by Senator Hatch\n- SB 365 by Senator Watson\n- SB 366 by Senator Moral\n- SR 476 by Senator Halpern\n- SR 480 by Senator Brass\n- SR 42 by Senator Beardroom\n- SR 43 by Senator McLean\n- SR 47 by Senator Summers\n- SR 49 by Senator Dix\n\n### Notable Moments\n- The Senate President recognized the student pages in attendance and thanked them for their help.\n- Several senators provided notice of intent to introduce minority reports on certain House bills.\n\n### Votes\nNo recorded votes were mentioned in the transcript.\n\n### Attendance\nThe transcript did not mention a quorum call or attendance issues.\n\n### Adjournment\nThe transcript did not specify when the session adjourned or the date of the next session."
  },
  {
    "video_id": "aa1CEC30gIg",
    "url": "https://www.youtube.com/watch?v=aa1CEC30gIg",
    "title": "Senate PM Meeting for Day 33 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 33,
    "video_date": null,
    "duration_minutes": 115,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting for Day 33 of the 2025 Session:\n\n# Georgia Senate PM Meeting - Day 33 (2025 Session)\n\n## Overview\nThe Senate session featured extended debate and discussion on House Bill 55, which would add a new judgeship to the Alapaha Judicial Circuit. Senators engaged in a lively back-and-forth, showcasing their legislative expertise and knowledge of Georgia history and trivia.\n\n## Key Actions\n**HB 55**: Bill to add a new judgeship to the Alapaha Judicial Circuit, passed by substitute.\n\n## Bills Introduced (First Reading)\n- HB 111\n- HB 1302 \n- HB 161\n- HB 111 (again)\n- HB 112\n- HB 1437\n\n## Notable Moments\n- Senators engaged in an entertaining exchange about the origins of the Alapaha River and blueberries.\n- Senators discussed historical references like the \"lean ox festival\" and Elvis leaving the building.\n- The Rules Committee Chairman was praised for his South Georgia roots and participation in local festivals.\n\n## Votes\n- HB 55 passed by a vote of 51-1.\n\n## Attendance\nA quorum was present, though some Senators briefly stepped away during the debate.\n\n## Adjournment\nThe session was adjourned. The next session will be held on a future date."
  },
  {
    "video_id": "u0XrMkBOzNc",
    "url": "https://www.youtube.com/watch?v=u0XrMkBOzNc",
    "title": "Senate Day 33 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 33,
    "video_date": null,
    "duration_minutes": 136,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 33 of the 2025 Session session:\n\n**Overview**\nThe session featured the introduction of several new bills and resolutions, as well as committee reports on previously introduced legislation. There was discussion of procedural matters and recognitions of visiting students and a congressman.\n\n**Key Actions**\n- **HB 111**: No description provided\n- **HB 111**: No description provided\n- **HR 42**: No description provided\n- **SB 1**: No description provided\n- **SB 331**: No description provided\n- **SR 311**: No description provided\n\n**Bills Introduced (First Reading)**\n- SB 340: To provide for a new charter for the city of Tybee Island\n- SB 341: No description provided\n- SB 342: Related to retirement\n- SB 343: To amend code section related to children and families\n- SB 344: Related to state government\n- SB 345: Related to state government\n- SB 346: Related to state government\n- SR 410: Resolution urging action on transportation\n- SR 413: Resolution, no description provided\n- SR 414: Resolution related to transportation\n- HB 637: Related to state and local government\n- HB 732: Related to state and local government \n- HB 734: Related to state and local government\n- HB 735: Related to state and local government\n- HB 737: Related to state government\n- HB 738: Related to state government\n- HB 739: Related to state government\n- HB 741: Related to state government\n\n**Notable Moments**\n- The Senate President recognized various visiting students and a congressman.\n- There was discussion of procedural matters, including dispensing with the reading of the journal.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum or attendance details provided.\n\n**Adjournment**\nThe transcript does not indicate when the session adjourned or the date of the next session."
  },
  {
    "video_id": "eXv9X9rLsGQ",
    "url": "https://www.youtube.com/watch?v=eXv9X9rLsGQ",
    "title": "Rules PM Meeting for Day 32 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 96,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 32 of the 2025 Session:\n\n## Overview\nThe meeting focused on discussing and considering Senate Bill 68, a tort reform legislation. The committee heard extensive testimony over the past few weeks and the sponsor, Senator Kennedy, provided his final comments on the bill.\n\n## Key Actions\n**SB 68**: Tort reform legislation\n\n## Bills Introduced (First Reading)\nNone mentioned\n\n## Notable Moments\n- Chairman Rob Leverd recognized Chairman Newton to give an opening prayer.\n- Senator Kennedy, the sponsor of SB 68, provided an overview of the bill's history and efforts to compromise with stakeholders.\n- Senator Kennedy discussed concerns raised about the bill, such as claims that it would lead to slumlords taking over the housing market or make Georgians less safe. He argued these claims do not accurately reflect what the bill aims to accomplish.\n- Senator Kennedy discussed the bill's provisions around premises liability and the need to address ambiguity in current case law.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nQuorum was present, with one member noted as running late.\n\n## Adjournment\nThe meeting adjourned, but no information was provided about the next session date."
  },
  {
    "video_id": "EMs9SHUc-Tg",
    "url": "https://www.youtube.com/watch?v=EMs9SHUc-Tg",
    "title": "Senate Day 32 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 268,
    "summary": "Overview:\nThe Georgia Senate session covered several bills and resolutions, including legislation related to retirement systems, study committees, midwife recognition, and various other policy areas. There were no major controversial votes or heated debates noted in the transcript.\n\nKey Actions:\n**HB 223**: Amends Chapter 2 of Title 47 related to the Employees' Retirement System of Georgia\n**HB 90**: Creates the Senate Study Committee on Artificial Intelligence, Digital Currency, and Other Purposes\n**HR 32**: Resolution recognizing March 14, 2025 as Black Midwives Health and Human Service Day\n**SR 148**: Resolution creating the Senate Study Committee on Improving Family Caregiver Services\n**SR 246**: Resolution creating the Senate Study Committee on Making Georgia the Number One State for Tourism\n\nBills Introduced (First Reading):\n- SB 339: Relates to the Employees' Retirement System of Georgia\n- SR 391: Creates the Senate Study Committee on Artificial Intelligence, Digital Currency\n- SR 393: Creates the Senate Study Committee on Improving Family Caregiver Services \n- SR 398: Recognizes March 14, 2025 as Black Midwives Health and Human Service Day\n\nNotable Moments:\n- Recognition of a group of pages from across the state, introduced by the Senator from the 8th district\n- Routine procedures such as dispensing with the journal reading and confirming the journal\n\nVotes: \nNo recorded votes noted in the transcript.\n\nAttendance:\nNo quorum issues or attendance notes mentioned.\n\nAdjournment:\nThe transcript does not provide an adjournment time or date for the next session."
  },
  {
    "video_id": "p4viBxmlPrg",
    "url": "https://www.youtube.com/watch?v=p4viBxmlPrg",
    "title": "House Day 32 for the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 118,
    "summary": "Overview:\nThe Georgia House session on this day featured the introduction and consideration of several bills, including HB 743, HB 744, HB 745, HB 746, HB 884, SB 145, and SB 88. The session began with a scripture reading and prayer by the guest chaplain, Pastor Powell Goodhard from Sherwood Baptist Church in Albany.\n\nKey Actions:\n**HB 743**: [Bill description]\n**HB 744**: [Bill description] \n**HB 745**: [Bill description]\n**HB 746**: [Bill description]\n**HB 884**: [Bill description]\n**SB 145**: [Bill description]\n**SB 88**: [Bill description]\n\nBills Introduced (First Reading):\n- [Bill 1]: [Description]\n- [Bill 2]: [Description]\n- [Bill 3]: [Description]\n\nNotable Moments:\n- Pastor Powell Goodhard delivered the opening prayer and spoke about the importance of wisdom from the Book of Proverbs for the legislators.\n\nVotes:\n- HB 743 was opposed by some members but ultimately passed.\n- SB 145 was passed unanimously.\n\nAttendance:\n- The Speaker called all members to the floor and conducted a roll call to ensure a quorum was present.\n\nAdjournment:\nThe session was adjourned. The next session will be held on [Date]."
  },
  {
    "video_id": "0RtSpYaIRGc",
    "url": "https://www.youtube.com/watch?v=0RtSpYaIRGc",
    "title": "Senate Day 31 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 155,
    "summary": "Overview:\nThe Georgia Senate session on Day 31 of the 2025 Session focused on introducing various bills and resolutions, as well as receiving committee reports on numerous pieces of legislation.\n\nKey Actions:\n**HB 167**: Unclear from the transcript\n**HB 647**: Unclear from the transcript\n\nBills Introduced (First Reading):\n- SB 330: Bill to borrow the home setting state logo government\n- SB 3301: Bill to borrow the home setting state logo government\n- SB 3302: Bill to amend an act regarding state logo government\n- SR 378: Resolution recognizing Mr. Judge Transformation\n- SR 381: Resolution regarding human services\n- SR 386: Resolution creating the Senate Safe\n- SR 388: Resolution congratulating, commending, and extending\n- SR 39D: Resolution recognizing and commending\n\nNotable Moments:\n- Introduction of legislative pages from across Georgia\n- Confirmation of the journal\n\nVotes:\nNo specific votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not mention quorum or attendance.\n\nAdjournment:\nThe transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "jtijv2-K37I",
    "url": "https://www.youtube.com/watch?v=jtijv2-K37I",
    "title": "House Day 30 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 30,
    "video_date": null,
    "duration_minutes": 119,
    "summary": "Here is a summary of the Georgia House Day 30 of the 2025 Session session:\n\n**Overview**: The session included a celebratory moment for Rep. Patty Stenson as she completed her last radiation treatment, as well as a prayer and scripture reading by the guest chaplain Rev. Stephen Taylor.\n\n**Key Actions**:\n- **HB 68**: No description provided\n- **SB 9**: No description provided\n\n**Bills Introduced (First Reading)**: No new bills were introduced.\n\n**Notable Moments**:\n- Rep. Patty Stenson announced she had completed her last radiation treatment, which was celebrated by the House.\n- Rev. Stephen Taylor delivered a prayer and scripture reading, emphasizing the importance of seeking wisdom from God when making decisions.\n\n**Votes**: No recorded votes were mentioned.\n\n**Attendance**: A quorum call was held to ensure all members were present in the chamber.\n\n**Adjournment**: The session details do not include an adjournment time or date for the next session."
  },
  {
    "video_id": "xP9pkgegeyo",
    "url": "https://www.youtube.com/watch?v=xP9pkgegeyo",
    "title": "Senate Day 30 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 30,
    "video_date": null,
    "duration_minutes": 109,
    "summary": "Here is a summary of the Georgia Senate Day 30 session in 2025:\n\n**Overview**\nThis session included standard procedural matters such as introducing bills, excusing absent senators, and a morning devotion. The session appeared focused on administrative tasks rather than substantive legislation.\n\n**Key Actions**\nNone noted.\n\n**Bills Introduced (First Reading)**\n- **SB 328**: Bill to amend the mean time elected amendment\n- **SB 329**: Bill by Senator Strickland\n- **SR 371**: Resolution honoring the life of investigator Eric Anthony Minks\n- **SR 372**: Resolution by Senator Patrick\n- **SR 376**: Resolution by Senator Parent\n\n**Notable Moments**\n- Senators sought unanimous consent to excuse absent colleagues for various reasons.\n- There was some light-hearted discussion about a duck hunting trip one senator had unexpectedly won at auction.\n- The session opened with recognitions of student page participants.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nQuorum was present, with senators excused for various reasons.\n\n**Adjournment**\nThe transcript does not contain information about when the session adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "df1YDXIfK_g",
    "url": "https://www.youtube.com/watch?v=df1YDXIfK_g",
    "title": "Senate Day 29 for the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 118,
    "summary": "Here is a summary of the Georgia Senate Day 29 for the 2025 Session:\n\n**Overview**:\nThe session included the introduction of several bills and resolutions, as well as the confirmation of appointments to the Judicial Qualifications Commission. The majority of the time was spent reading and referring House bills to various Senate committees.\n\n**Key Actions**:\n- **HB 147**: Bill to amend OCGA relating to handicapped persons\n- **HB 647**: Bill to amend OCGA relating to the number of judges\n\n**Bills Introduced (First Reading)**:\n- SB 326: Bill to amend OCGA relating to handicapped persons\n- SB 327: Bill to amend OCGA relating to the number of judges\n- SR 354: Resolution honoring the life and memory of Ms. Catherine Riles\n- SR 359: Resolution recognizing Mr. Tyler Perry and dedicating a transportation\n- SR 363: Resolution offering congratulations\n\n**Notable Moments**:\n- The Senate received a communication from the Supreme Court requesting confirmation of appointments to the Judicial Qualifications Commission.\n- The Senate President recognized a group of pages from across the state who were assisting in the legislative process.\n\n**Votes**: \nNo recorded votes mentioned in the transcript.\n\n**Attendance**:\nThe transcript does not mention the quorum or attendance.\n\n**Adjournment**:\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "dO6oam4zxKA",
    "url": "https://www.youtube.com/watch?v=dO6oam4zxKA",
    "title": "Senate AM Day 28 for the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 132,
    "summary": "Here is a structured markdown summary of the Georgia Senate AM Day 28 session for the 2025 Session:\n\n## Overview\nThe session featured a debate and vote on the reconsideration of Senate Bill 4, which deals with training and responsibilities of local school boards. There was discussion of the bill's provisions regarding board member training and interaction with legislators.\n\n## Key Actions\n**SB 259**: N/A\n**SB 33**: N/A\n\n## Bills Introduced (First Reading)\nNone noted\n\n## Notable Moments\n- Debate on the motion to reconsider SB 4, with arguments from the bill's sponsor and an opposing senator\n- Approval of unanimous consent to excuse senators from the 49th and 50th districts\n\n## Votes\n- Motion to reconsider SB 4 - Outcome not specified\n\n## Attendance\nQuorum was present, with a motion to excuse senators from the 42nd district.\n\n## Adjournment\nThe session adjourned. The next session date was not provided."
  },
  {
    "video_id": "0E9-3rjcKr0",
    "url": "https://www.youtube.com/watch?v=0E9-3rjcKr0",
    "title": "Senate PM Meeting 1 for Day 28 for the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 222,
    "summary": "Here is a summary of the key points from the Georgia Senate PM Meeting 1 for Day 28 of the 2025 Session:\n\n**Overview**\nThis session focused on debate and amendments to Senate Bill 220, which would expand Georgia's medical cannabis program by increasing THC limits, allowing vaping, and revising the list of qualifying conditions.\n\n**Key Actions**\n- **SB 220**: Bill to expand Georgia's medical cannabis program\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Senator Brass discussed his personal connection to the issue, as his mother has multiple sclerosis. \n- Debate centered around increasing THC limits from 5% to 50%, allowing vaping for certain conditions like epilepsy, and revising the list of qualifying conditions.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum notes provided.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "d8avYrkVlac",
    "url": "https://www.youtube.com/watch?v=d8avYrkVlac",
    "title": "House AM Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 124,
    "summary": "Here is a summary of the Georgia House AM Day 28 session in structured markdown format:\n\n## Overview\nThis session featured routine legislative procedures, including the introduction of several bills, committee reports, and a prayer led by a guest speaker. The focus was on moving bills forward in the legislative process rather than debating substantive legislation.\n\n## Key Actions\n- **HB 1015**: No description provided\n- **HB 111**: No description provided \n- **HB 1437**: No description provided\n- **HB 185**: No description provided\n- **HB1**: No description provided\n- **HB111**: No description provided\n- **HB12**: No description provided\n\n## Bills Introduced (First Reading)\n- HB 1015\n- HB 111\n- HB 1437 \n- HB 185\n- HB1\n- HB111\n- HB12\n\n## Notable Moments\n- A guest speaker, Pastor Carter, gave an inspirational speech about the power of community and second chances, using the story of a church ministry assistant named Sheila Barrett to illustrate his points.\n- The House recognized Representative Tarry England, the former chair of the Committee on Information and Audits, who was not present.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nThe transcript indicates that the House took an initial roll call, with members voting \"green to signify their presence.\" The Speaker also instructed the Clerk to \"ring the bell\" to call members to the floor.\n\n## Adjournment\nThe transcript does not explicitly state when the session adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "SsJTuDztmWY",
    "url": "https://www.youtube.com/watch?v=SsJTuDztmWY",
    "title": "Senate PM Meeting 3 for Day 28 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 138,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting 3 for Day 28 of the 2025 Session:\n\n## Overview\nThis session featured the advancement of several bills related to healthcare provider licensing and credentialing, as well as legislation granting adult adopted individuals access to their original birth certificates. There was some procedural debate but overall the session progressed through the agenda efficiently.\n\n## Key Actions\n- **SB 162**: Bill to implement an automated credentialing system for healthcare providers in Georgia, passed by substitute.\n- **SB 100**: Bill allowing adult adopted individuals to obtain copies of their original birth certificates, passed.\n- **SB 140**: Bill expanding the authority of optometrists to prescribe certain medications, passed.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Debate on SB 162 regarding the need to streamline healthcare provider credentialing in Georgia.\n- Senator from the 29th advocating for SB 100 to provide adopted children equal access to birth certificates as biological children.\n- Senator from the 27th highlighting the medical importance of the human eye in advocating for SB 140.\n\n## Votes\n- SB 162 passed by substitute with a vote of 53-0.\n- SB 100 passed with a vote of 55-0. \n- SB 140 passed with an unspecified vote.\n\n## Attendance\nA quorum was present, no issues noted.\n\n## Adjournment\nThe session adjourned at an unspecified time. The next Senate session will be held on a date not provided."
  },
  {
    "video_id": "GzAlySiPGPs",
    "url": "https://www.youtube.com/watch?v=GzAlySiPGPs",
    "title": "House PM Meeting 3 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 128,
    "summary": "Overview:\nThe Georgia House of Representatives held a legislative session with a focus on property tax transparency and school funding. The session featured debates over a bill (HB 370) that would require school districts opting out of a statewide homestead tax exemption to disclose their reserve funds on property tax bills.\n\nKey Actions:\n**HB 370**: Requires school districts that opt out of a statewide homestead tax exemption to disclose their reserve funds and the date/contact info for the opt-out decision on property tax bills.\n\nBills Introduced (First Reading):\nNone noted in the transcript.\n\nNotable Moments:\n- Rep. Houston Gaines presented HB 370, arguing it would increase transparency for taxpayers. \n- Rep. Erick Allen questioned the reserve fund disclosure provisions, noting districts need to maintain appropriate reserves.\n- Rep. Jenna Barry spoke in opposition to HB 370, arguing it unfairly targets underfunded school districts instead of addressing the root issue of inadequate state education funding.\n\nVotes:\n- HB 370 was adopted by the committee and passed by the full House.\n\nAttendance:\nNo quorum issues noted.\n\nAdjournment:\nThe session adjourned, but a next session date was not provided."
  },
  {
    "video_id": "qC-0HWRKD_8",
    "url": "https://www.youtube.com/watch?v=qC-0HWRKD_8",
    "title": "Rules Subcommittee Special Session for the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 153,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Rules Subcommittee Special Session transcript:\n\n**Overview**\nThe session focused on discussing and debating a bill related to jury selection and closing arguments in civil trials, with testimony from witnesses both in support and opposition of the bill.\n\n**Key Actions**\n- **HB 837**: Bill addressing issues around jury selection and closing arguments in civil trials\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Witness Pamela Lee, a litigator, provided testimony in support of the bill, focusing on how it would address issues around \"anchoring\" during jury selection and plaintiffs' counsel arguments on damages in closing.\n- There was some back-and-forth questioning from committee members to the witness on the role of the judge in instructing the jury on the law.\n\n**Votes**\nNo recorded votes mentioned\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nNo adjournment time or next session date mentioned"
  },
  {
    "video_id": "FDa1hBwjv10",
    "url": "https://www.youtube.com/watch?v=FDa1hBwjv10",
    "title": "Senate Day 27 of the 2025 PM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 181,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 27 of the 2025 PM Session session:\n\n**Overview**\nThe session primarily focused on the passage of Senate Bill 4, which made several revisions to the roles and training requirements for local boards of education in Georgia. There was some debate around the scope of training content, which was addressed through an amendment.\n\n**Key Actions**\n**SB 124**: Introduced and referred to committee\n\n**Bills Introduced (First Reading)**\n- SB 124 by Senator Isakson (48th) and others - Relating to certain tax credits\n\n**Notable Moments**\n- Debate and amendment of SB 4 to clarify restrictions on training content related to pending/future legislation affecting public schools\n- Discussion between senators on addressing concerns of local boards of education\n\n**Votes**\n- Amendment #1 to SB 4 proposed by Senator Dolezal (27th) - Passed\n- SB 4 as amended - Passed 36-11\n\n**Attendance**\nA quorum was present for the session.\n\n**Adjournment**\nThe session was adjourned. The next session will convene on the following day."
  },
  {
    "video_id": "stpXVVCPGqA",
    "url": "https://www.youtube.com/watch?v=stpXVVCPGqA",
    "title": "Senate AM Day 27 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 132,
    "summary": "Here is a summary of the Georgia Senate AM Day 27 of the 2025 Session session:\n\n**Overview**: The session featured a focus on legislation, with several bills introduced or referred to committees. There were also some notable moments, including an invocation by Dr. Torin Daily emphasizing the need for unity and bridge-building among senators.\n\n**Key Actions**:\n- **SB 36**: Not mentioned in transcript\n- **SB177**: Not mentioned in transcript \n- **SB199**: Not mentioned in transcript\n\n**Bills Introduced (First Reading)**:\n- Senate Resolution 246\n- Senate Resolution 262\n- Senate Resolution 282\n- Senate Resolution 309\n\n**Notable Moments**:\n- Invocation by Dr. Torin Daily, who called on senators to remember their shared purpose of serving constituents and to be \"agents of reconciliation\" despite political divisions.\n- Requests by various senators to excuse absences of other senators for business inside the Capitol.\n\n**Votes**:\n- No recorded votes mentioned, but some bills were said to have passed or been referred to committees.\n\n**Attendance**:\n- There were several requests to excuse absences of senators for business inside the Capitol, suggesting the Senate maintained a quorum.\n\n**Adjournment**:\n- The transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "SpBQ9E4kW3c",
    "url": "https://www.youtube.com/watch?v=SpBQ9E4kW3c",
    "title": "Day 26 of the Senate for the 2025 PM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 26,
    "video_date": null,
    "duration_minutes": 150,
    "summary": "Here is a summary of the Georgia Senate session based on the transcript provided:\n\n**Overview**\nThe session focused on discussing and debating Senate Bill 185, which aims to restrict certain gender-affirming treatments for inmates in the Georgia Department of Corrections. The bill appears to be a response to ongoing lawsuits related to these issues.\n\n**Key Actions**\n- **SB 185**: Prohibits the use of state funds or resources for sex reassignment surgeries, hormone replacement therapies, and cosmetic procedures for the purpose of altering sexual characteristics of state inmates, with limited exceptions.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- The senator sponsoring SB 185 provided a detailed explanation of the bill's provisions and rationale, including citing three ongoing lawsuits against the Department of Corrections related to this issue.\n- There was discussion about the bill potentially opening up more opportunities for legal challenges, with the sponsor stating he is \"fine with that\" as all legislation is subject to court evaluation.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum notes provided.\n\n**Adjournment**\nNo adjournment time or next session date mentioned."
  },
  {
    "video_id": "ZexbzAbOiJ4",
    "url": "https://www.youtube.com/watch?v=ZexbzAbOiJ4",
    "title": "House Day 26 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 26,
    "video_date": null,
    "duration_minutes": 121,
    "summary": "Here is a structured markdown summary of the key points from the Georgia House Day 26 session transcript:\n\n## Overview\nThis session focused on finalizing the state's fiscal year 2025 budget, with a significant portion dedicated to hurricane relief efforts and support for the Department of Corrections. Substantive legislation was passed, including appropriation bills and funding for various state agencies and programs.\n\n## Key Actions\n**HB 67**: Amended state budget for fiscal year 2025, including $862 million in hurricane relief and $345 million for the Department of Corrections.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Lengthy explanation by Chairman Hatchett on the details of the amended state budget (HB 67), including funding for hurricane relief, agricultural/timber support, community hospital assistance, and corrections/public safety.\n- Discussions around improving recruitment and retention of state law enforcement officers, including $20,000 salary increases for Department of Community Supervision officers.\n\n## Votes\n- The House agreed to the Senate's substitute of HB 67 as amended by the House.\n\n## Attendance\nA quorum was present, as all members were called to the floor for the key budget vote.\n\n## Adjournment\nThe session adjourned. The next session date was not provided."
  },
  {
    "video_id": "QXGTLdXuKgM",
    "url": "https://www.youtube.com/watch?v=QXGTLdXuKgM",
    "title": "Senate Day 25 for the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 25,
    "video_date": null,
    "duration_minutes": 131,
    "summary": "Here is a summary of the Georgia Senate Day 25 session for the 2025 Session:\n\n**Overview**:\nThe Georgia Senate had a busy day, with committee reports on a range of legislation and several bills introduced for first reading. Key actions included passing bills related to state codes, homestead exemptions, and Senate study committees.\n\n**Key Actions**:\n- **SB 293-SB 308**: Various bills to amend state codes\n- **SB 302**: Provide a homestead function\n- **SR 301**: Create the Senate Roosevelt School study committee\n\n**Bills Introduced (First Reading)**:\n- SB 293 - SB 308\n- SR 292, SR 301, SR 309\n- HB 94, HB 113, HB 143, HB 163, HB 169, HB 187, HB 227, HB 21, HB 254, HB 267, HB 329, HB 41, HB 428, HB 538, HB 553, HB 556A, HB 591, HB 592\n\n**Notable Moments**:\n- Recognition of retired AT&T employees\n- Introductions of student pages from across the state\n\n**Votes**:\n- SB 63, SB 124, SB 232 passed by substitute in the Education and Youth committee\n- SB 36, SB 132, SB 2072 passed in the Judiciary committee\n- SB 240, HB 167, HB 287 passed in the Natural Resources and Environment committee \n- SB 213, SB 254, SB 241 passed in the Regulated Industries and Utilities committee\n\n**Attendance**:\nNo mention of quorum issues.\n\n**Adjournment**:\nThe transcript does not indicate when the session adjourned. The next session date is not provided."
  },
  {
    "video_id": "Ufq-bEsxQT8",
    "url": "https://www.youtube.com/watch?v=Ufq-bEsxQT8",
    "title": "02/25/2025 Senate Committee on Regulated Industries & Utilities",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 139,
    "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Regulated Industries & Utilities session on 02/25/2025:\n\n## Overview\nThe session focused on Senate Bill 34, which aims to ensure that the costs of electricity incurred by data centers are paid for by the data centers themselves rather than being passed on to residential and small business customers. There was discussion around past practices of customers subsidizing the costs of large users like data centers, and whether the recent Public Service Commission (PSC) rulings adequately addressed this issue.\n\n## Key Actions\n**SB 34**: Requires that the costs of electricity incurred by data centers be paid for by the data centers, not residential and small business customers.\n\n## Bills Introduced (First Reading)\nNone.\n\n## Notable Moments\n- Senator Huffstettler presented the changes made to the committee substitute of SB 34, noting it aimed to codify that data center electricity costs should not be borne by residential and small business ratepayers.\n- There was discussion around past practices of customers subsidizing large users like data centers, and whether the recent PSC rulings adequately addressed this issue.\n- Senator Lucas questioned whether the data center electricity costs were actually appearing on customer utility bills.\n\n## Votes\nNone recorded.\n\n## Attendance\nQuorum was present, with some committee members noted as attending a Veterans Affairs meeting.\n\n## Adjournment\nThe committee adjourned, with the next session date unspecified."
  },
  {
    "video_id": "I9l8wO63nXU",
    "url": "https://www.youtube.com/watch?v=I9l8wO63nXU",
    "title": "House Day 39 of the 2025 Legislative PM 2 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 189,
    "summary": "Here is a summary of the key points from the Georgia House Day 39 of the 2025 Legislative PM 2 Session transcript:\n\n**Overview**:\nThe session focused on routine procedural matters, with the main action being the consideration and passage of a bill related to annexation dispute resolution procedures.\n\n**Key Actions**:\n- **HB 155**: Revised procedures for the selection and objection to arbitrators in annexation dispute resolutions. The House agreed to the Senate's substitute with a House amendment.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- There was some parliamentary inquiry and discussion around a local bill (HB 862) that was being reconsidered, with members questioning the voting procedures.\n- Discussions around the need for local delegation members to be provided copies of local bills prior to consideration on the floor.\n\n**Votes**:\n- HB 155: Passed the House 130-35 after agreeing to the Senate substitute with a House amendment.\n- Motion to reconsider HB 862: Failed 67-96.\n\n**Attendance**:\nNo specific quorum notes.\n\n**Adjournment**:\nThe transcript does not indicate when the session was adjourned. The next session date is not provided."
  },
  {
    "video_id": "VMqWa70o0gU",
    "url": "https://www.youtube.com/watch?v=VMqWa70o0gU",
    "title": "Senate Day 26 of the 2025 AM Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 26,
    "video_date": null,
    "duration_minutes": 220,
    "summary": "Here is a summary of the Georgia Senate Day 26 of the 2025 AM Session:\n\n**Overview**:\nThe session involved various legislative activity, including the introduction of new bills, committee reports, and procedural matters. Notable discussions centered around correcting a journal entry and the introduction of minority reports by several senators.\n\n**Key Actions**:\n- **HB 55**: Not mentioned\n- **HB 67**: Not mentioned \n- **SB 170**: Committee report corrected to reflect accurate action taken\n- **SB 175**: Not mentioned\n- **SB 20**: Not mentioned\n- **SB 30**: Not mentioned\n- **SB 31**: Not mentioned\n- **SB 46**: Not mentioned\n- **SB 55**: Not mentioned\n- **SB 74**: Not mentioned\n- **SB 85**: Not mentioned\n\n**Bills Introduced (First Reading)**:\n- SB 313-SB 317\n- SR 310-SR 311, SR 319-SR 320, SR 323\n- HB 66, HB 30, HB 370, HB 422-HB 423, HB 475, HB 495\n\n**Notable Moments**:\n- Correction of a journal entry regarding SB 170\n- Senators giving notice to introduce minority reports alongside majority committee reports for SB 65, SB 120, and SB 61\n\n**Votes**: \nNo recorded votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  }
]