[
  {
    "video_id": "4DwA2w7EdCI",
    "url": "https://www.youtube.com/watch?v=4DwA2w7EdCI",
    "title": "Appropriation Subcommittee Meetings for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 71,
    "summary": "Here is a summary of the Georgia Appropriation Subcommittee Meetings for Day 29 of the 2025 Session:\n\n**Overview**:\nThe subcommittee meetings focused on several key funding adjustments across the University System of Georgia, Student Finance Commission, Transportation, and Behavioral Health and Developmental Disabilities areas.\n\n**Key Actions**:\n- **HB 68**: Bill to establish a public school employee memorial grant program was discussed, with a $540,000 placeholder included.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- Discussions on reducing austerity at the Skidaway Institute of Oceanography, increasing funds for Georgia capital history publication, and adjusting the Zell/HOPE scholarship award amounts.\n- Proposals to increase airport aid funding, maintain rail program funding despite revenue losses, and request a report on the effectiveness of Atlanta Regional Transit.\n- Expansions of peer support for alcohol use disorder, citizen advocacy services, jail diversion programs, and homelessness services in the behavioral health area.\n\n**Votes**:\n- The subcommittee motions and votes to approve the funding changes were passed.\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: The subcommittee meetings were adjourned. The next session date was not specified."
  },
  {
    "video_id": "wOmDpc4T2UE",
    "url": "https://www.youtube.com/watch?v=wOmDpc4T2UE",
    "title": "Rules Meeting for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\n- The summary covers a Georgia legislative Rules Committee meeting, focusing on various funding and program initiatives related to education.\n\nKey Actions:\n- No specific bills were passed or referred.\n\nBills Introduced (First Reading):\n- None detected.\n\nNotable Moments:\n- Discussions around funding for agricultural education programs, STEM software, PSAT/AP exam support, literacy coaches, character education, school nutrition, school bus driver training, school safety initiatives, mental health providers, social workers, after-school programs, and heavy equipment simulators.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- No specific quorum notes provided.\n\nAdjournment:\n- The transcript does not indicate when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "XEKouvzGV14",
    "url": "https://www.youtube.com/watch?v=XEKouvzGV14",
    "title": "April 1st Rules Meeting for the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "# Georgia April 1st Rules Meeting for the 2025 Session\n\n## Overview\nThis session focused primarily on advancing several Senate bills, including SB 255 regarding the legislature's investigative powers and SB 125 related to plumbing work. The meeting was generally routine, with few notable moments beyond the standard bill considerations.\n\n## Key Actions\n**SB 255**: Bill regarding the legislature's investigative powers and subpoena authority\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this meeting.\n\n## Notable Moments\n- Prayer and opening remarks by the chair\n- Brief discussions on SB 291, SB 51, and SB 36\n\n## Votes\n- SB 125: Approved a rules substitute (LC 550644S) by unanimous vote\n- SB 5 (now HB 124): Adopted a rules substitute (LC 520855S) without opposition\n\n## Attendance\nQuorum was present, with no notes on attendance issues.\n\n## Adjournment\nThe meeting was adjourned. The next session is scheduled for April 2nd."
  },
  {
    "video_id": "HGEIOYhgS9E",
    "url": "https://www.youtube.com/watch?v=HGEIOYhgS9E",
    "title": "House Day 31 of the 2025 PM Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 86,
    "summary": "Here is a structured markdown summary of the Georgia House Day 31 of the 2025 PM Session session:\n\n**Overview**:\nThe session focused on passing various privileged resolutions honoring individuals and organizations, as well as the introduction and discussion of Senate Bill 144 related to liability for use of fertilizers and pesticides.\n\n**Key Actions**:\n**SB 144**: Clarifies that a manufacturer cannot be held liable for failing to warn consumers of health risks above those required by the EPA for fertilizers and pesticides.\n\n**Bills Introduced (First Reading)**: \nNone noted.\n\n**Notable Moments**:\n- Extensive discussion and defense of SB 144 by a representative, highlighting the importance of agricultural science and technology, the rigorous regulatory environment in the US compared to other countries, and the need to keep domestic chemical manufacturing viable.\n- Concerns raised about the timing of EPA regulatory changes and how that impacts Georgia farmers.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum present, all members called to the House floor.\n\n**Adjournment**:\nThe session details do not mention when the House adjourned or the date of the next scheduled session."
  },
  {
    "video_id": "4Qs2er5Zilo",
    "url": "https://www.youtube.com/watch?v=4Qs2er5Zilo",
    "title": "Appropriations Subcommittee Meeting for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 7,
    "summary": "Overview:\nThis transcript covers the Georgia Appropriations Subcommittee meeting for Day 29 of the 2025 legislative session. The subcommittee discussed several line items in the state budget related to the judicial branch, including increases in funding for judicial salaries, security initiatives, recruitment and retention efforts, legal fees, and new judgeships.\n\nKey Actions:\n- **HB199**: Bill carried by Vice Chairman Kelly that lowered funding for traditional security initiatives.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- Prayer led by Representative Matthew Gamble to start the meeting.\n- Discussion of various budget line items related to the judicial branch, including salary increases, legal fees, and new judgeships.\n\nVotes:\n- Motion to approve the subcommittee's decisions on the judicial budget line items passed.\n\nAttendance:\nNo explicit quorum notes.\n\nAdjournment:\nThe subcommittee adjourned after completing its business."
  },
  {
    "video_id": "iEvpoo6rKTQ",
    "url": "https://www.youtube.com/watch?v=iEvpoo6rKTQ",
    "title": "Rules PM Meeting for day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for day 28 of the 2025 Session:\n\n## Overview\nThe session covered several bills, including HB384 on standardizing police officer oaths, HB57 amending the Insist's Law, HB35 increasing pay for special prosecutors, HB471 on water safety for infants, HB704 transitioning to an annual reporting dashboard, HB675 creating an offense for terrorist financial attacks, HB133 allowing religious studies off school premises, HB101 mandating insurance company rebate reporting, and HB285 providing a process to remove involuntarily committed individuals from criminal background checks. The main focus was on a rule substitute for HB521 related to annexation.\n\n## Key Actions\n- **HB521**: Rule substitute LC 473531 passed, relating to annexation requirements.\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Discussion and passage of the rule substitute for HB521 on annexation.\n\n## Votes\n- HB521 rule substitute passed with no opposition.\n\n## Attendance\nNo quorum notes mentioned.\n\n## Adjournment\nNo adjournment or next session date provided."
  },
  {
    "video_id": "Rhm3Zlx0cdo",
    "url": "https://www.youtube.com/watch?v=Rhm3Zlx0cdo",
    "title": "Sen. Tillery Press Conference on Eliminating State Income Tax | 07-24-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "## Overview\nSen. Tillery announced his plan to introduce legislation in the 2026 legislative session to eliminate the Georgia state income tax. He will chair a study committee to determine how to responsibly achieve this goal while protecting the state's priorities. The senator emphasized this is not a debate about whether to eliminate the tax, but rather how to do it.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Sen. Tillery stated his commitment to eliminating the Georgia state income tax during the 2026 legislative session.\n- He will chair a study committee to determine the path forward, working closely with the Lieutenant Governor.\n- The senator argued that eliminating the state income tax is about competitiveness, economic freedom, and allowing Georgians to keep more of their money.\n- He pointed to 9 states that have already eliminated their state income tax as examples Georgia can learn from.\n\n## Votes\nNone detected\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment details provided."
  },
  {
    "video_id": "UNWjOGW0iks",
    "url": "https://www.youtube.com/watch?v=UNWjOGW0iks",
    "title": "Senate PM 5 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 1,
    "summary": "Here is a summary of the Georgia Senate PM 5 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis was a brief session focused on adjourning for the day. No substantive legislation was discussed.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\nThe majority leader moved to adjourn the session \"sine die\" (without setting a future date). There was some opposition voiced, but the motion ultimately passed.\n\n**Votes**\nA voice vote was held on the motion to adjourn sine die. The majority in favor was clear, despite some opposition.\n\n**Attendance**\nA quorum was present to conduct business.\n\n**Adjournment**\nThe Senate adjourned sine die, with no future session date set."
  },
  {
    "video_id": "xE822lYvzvg",
    "url": "https://www.youtube.com/watch?v=xE822lYvzvg",
    "title": "Rules PM Meeting for Day 40 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThe meeting had a cheerful atmosphere, with members dancing and singing as they arrived. The main focus was on procedural matters, including recognitions, presentations of legislation, and the approval of study committees.\n\n## Key Actions\n**SB 148**: Pilot program for development of outdoor learning spaces in schools, along with other education-related provisions.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Recognition of Erin Garland, an assistant from Elverton, who was attending the Rules Committee for the first time.\n- Presentation of a proposed rules committee substitute for SB 148, which combined several education-related bills.\n- Discussion and approval of 11 study committee requests, with the days reduced from five to three.\n- Discussion of House Resolution 887 regarding code cleanup.\n\n## Votes\n- SB 148 by Substitute LC 610264S was approved.\n- The 11 study committee requests were approved as a group.\n- A supplemental calendar was set, including several house resolutions and SB 148.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session."
  },
  {
    "video_id": "S9BR9KnnIIU",
    "url": "https://www.youtube.com/watch?v=S9BR9KnnIIU",
    "title": "Rules AM Meeting for Day 40 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 28,
    "summary": "Here is a structured markdown summary of the Georgia Rules AM Meeting for Day 40 of the 2025 Session:\n\n**Overview**\nThis meeting discussed House Resolution 885, which would establish a House Study Committee to examine Georgia's election procedures and policies. The discussion centered around the composition of the study committee and ensuring diverse perspectives are represented.\n\n**Key Actions**\n**HR 885**: Resolution to create a House Study Committee on Georgia election procedures\n\n**Bills Introduced (First Reading)**\nNone noted\n\n**Notable Moments**\n- Rep. Evans proposed amending the study committee to include non-legislative members such as election board chairs and election law experts.\n- Rep. Hughley requested the study not impose new election rules in an election year and that the minority party be equally represented on the committee.\n- Chairman Anderson stated the intent was to have a legislative-only committee that could hear testimony from outside experts, rather than directly including them on the committee.\n\n**Votes**\nNo recorded votes\n\n**Attendance**\nQuorum present, no issues noted.\n\n**Adjournment**\nMeeting adjourned. Next session date not provided."
  },
  {
    "video_id": "VDon2vYQnhA",
    "url": "https://www.youtube.com/watch?v=VDon2vYQnhA",
    "title": "Senate PM Meeting pt. 3 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 84,
    "summary": "Here is a summary of the Georgia Senate PM Meeting pt. 3 for Day 39 of the 2025 Session:\n\n**Overview:** The session featured debate and passage of a bill to establish a Georgia Music Office and promote the state's music industry. Senators highlighted Georgia's rich musical heritage and the need to support local musicians and the music economy.\n\n**Key Actions:**\n**HB 14:** Establishes the Georgia Music Office and Music Ready Communities Act to promote Georgia's music industry.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Sen. Hatcher (46th) gave an impassioned speech celebrating Georgia's musical legacy, from Otis Redding to R.E.M. to Usher, and called for greater state support for the music industry.\n- Sen. Hatcher reminisced about his own love of music, including buying 8-track tapes as a teenager.\n- Sen. Hatcher acknowledged bipartisan support for the bill and thanked Sen. Jones (39th) for her collaboration.\n- Sen. Smith (8th) playfully tested Sen. Hatcher's music knowledge by asking him to name the greatest solo recording artist of all time (Elvis Presley).\n\n**Votes:**\n- HB 14 passed with a unanimous vote.\n\n**Attendance:** Quorum present.\n\n**Adjournment:** The session adjourned. Next session date not specified."
  },
  {
    "video_id": "2zeUiLWlNsY",
    "url": "https://www.youtube.com/watch?v=2zeUiLWlNsY",
    "title": "House PM 4 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 54,
    "summary": "Here is a structured markdown summary of the key details from the Georgia House PM 4 Meeting for Day 40 of the 2025 Session:\n\n## Overview\nThis session focused on passing several notable bills and resolutions, including final action on HB 399 related to landlords and tenants, and HB 296 related to driver's licenses. The session also involved the recognition of various community members and organizations through privileged resolutions.\n\n## Key Actions\n**HB 399**: Bill to create accountability for hedge funds and out-of-state investors purchasing large numbers of single-family homes, passed by the House.\n**HB 296**: Bill to amend laws related to the issuance, expiration, and renewal of driver's licenses, including mobile driver's licenses.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- The House took up a large number of privileged resolutions recognizing and honoring various individuals and organizations for their contributions to the community.\n- There was a pause in the proceedings to ensure all members were present in the chamber.\n\n## Votes\n- HB 399 passed the House by a vote of 159-5.\n- HB 296 was agreed to by the House.\n\n## Attendance\nQuorum was present, with all members instructed to be seated in the chamber.\n\n## Adjournment\nThe session adjourned, with the next meeting date not specified."
  },
  {
    "video_id": "C7AXuXJ18x0",
    "url": "https://www.youtube.com/watch?v=C7AXuXJ18x0",
    "title": "Senate PM 3 Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Here is a summary of the Georgia Senate PM 3 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis session focused on the passage of SB 82, which aims to incentivize local charter school approval. Several new bills were also introduced for first reading.\n\n**Key Actions**\n**SB 82**: A bill to enact the Local Charter School Authorization and Support Act of 2025, providing incentives for local boards of education to approve new charter school petitions.\n\n**Bills Introduced (First Reading)**\n- SB 373: To amend Article 1 of Chapter 17, Title 45\n- SB 374: To amend Part 1 of Article 1 of Chapter 2 of Title 35 (Public Safety)  \n- SB 375: To amend Chapter 1\n- SB 376: By Senator Robertson\n- SB 377: By Senator Smith\n- SB 378: By Senator Smith\n\n**Notable Moments**\n- The Senate suspended certain rules to allow for the first reading and assignment of the new bills.\n- The chamber broke for dinner, which was provided by Copeland's restaurant.\n\n**Votes**\n- The Senate voted 44-10 to agree to the House substitute on SB 82.\n\n**Attendance**\n- A quorum was present.\n\n**Adjournment**\nThe Senate stood at ease for dinner and reconvened around 7:30pm. The session then adjourned for the day."
  },
  {
    "video_id": "BQYKI5_G8pc",
    "url": "https://www.youtube.com/watch?v=BQYKI5_G8pc",
    "title": "House PM 2 Meeting for Day 40 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 23,
    "summary": "Overview:\n- The Georgia House held a legislative session on Day 40 of the 2025 Session. The session focused on passing two bills related to the judicial system and public records.\n\nKey Actions:\n- **SB 218**: Moves the Prosecuting Attorney's Qualifications Commission (PAQC) from the Prosecuting Attorney's Council to the Administrative Office of the Courts, clarifies the appeals process, and modifies confidentiality related to District Attorneys and Solicitor Generals.\n- **SB 12**: Defines the custodian of public records and specifies that requests to view public records must go through the custodian. Also requires third parties with government records to provide them to the custodian upon request.\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Debate on whether SB 218 removed a requirement for sheriff's deputies in courthouses.\n- Confirmation that SB 12 reverted back to the original Senate-passed version with carefully vetted language.\n\nVotes:\n- SB 218 passed 149-18.\n- SB 12 passed 167-1.\n\nAttendance: Quorum present, no notes on attendance.\n\nAdjournment: No explicit mention of adjournment, but the session appears to have concluded."
  },
  {
    "video_id": "-LHjoc6G1HA",
    "url": "https://www.youtube.com/watch?v=-LHjoc6G1HA",
    "title": "Senate PM Day 40 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 40,
    "video_date": null,
    "duration_minutes": 71,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Day 40 of the 2025 Legislative Session:\n\n## Overview\nThe session included discussions on several bills, including HB 172 related to student loan forgiveness for veterinarians, HB 222 regarding bond information requirements, and amendments to other bills. There was some debate and procedural wrangling, but ultimately several bills were passed.\n\n## Key Actions\n**HB 172**: Provides for limits on student loan forgiveness program for veterinary education and other purposes.  \n**HB 222**: Amends Title 17 to revise certain bond holding requirements and require inclusion of contact information.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- There was a discussion about the need for large animal veterinarians in Georgia, with a Senator recounting a presentation he attended by an Alabama veterinarian.\n- An amendment was proposed to HB 222 to revise bond holding requirements, but a point of order was raised that it was a \"floor substitute\" and should be struck per the Senate rules.\n\n## Votes\n- HB 172 passed with a vote of 43-4.\n- The amendment to HB 222 was subject to a point of order challenging it as a \"floor substitute\".\n\n## Attendance\nA quorum was present, with one Senator excused for business outside the chamber.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "Z1tirjPBB7Q",
    "url": "https://www.youtube.com/watch?v=Z1tirjPBB7Q",
    "title": "Senate PM Meeting pt. 2 for Day 39 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n### Overview\nThe session focused on considering amendments to House Bill 54, which aims to authorize advanced practice registered nurses and physician assistants to order home health care services. Several amendments were proposed to address concerns around self-referrals and create a pathway for foreign-trained physicians to become licensed in Georgia.\n\n### Key Actions\n**HB 54**: Bill to authorize advanced practice registered nurses and physician assistants to order home health care services\n\n### Bills Introduced (First Reading)\nNone mentioned\n\n### Notable Moments\n- Debate and amendments around HB 54 to address self-referral concerns and create a pathway for foreign-trained physicians to practice in Georgia\n\n### Votes\n- HB 54 and amendments passed, but specific vote tallies not provided\n\n### Attendance\nNo quorum issues mentioned\n\n### Adjournment\nNo specific adjournment time or next session date provided"
  },
  {
    "video_id": "3d9T-dhAQlc",
    "url": "https://www.youtube.com/watch?v=3d9T-dhAQlc",
    "title": "Rules Meeting Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Overview:\n- The session focused on discussing several bills, including SB 102 related to cockfighting, SB 131 related to behavioral health parity, and other bills.\n- There was some debate and discussion around the details and implications of the bills.\n\nKey Actions:\n- **SB 102**: Bill to add language related to cockfighting, allowing local law enforcement to have jurisdiction over it.\n- **SB 131**: Substitute bill passed to add one member to the behavioral health and council, the insurance commissioner, and create a parity compliance review panel.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Discussion around SB 102 and concerns about impacts on those raising game fowl for purposes other than fighting.\n- Debate over whether the bill would effectively stop cockfighting or just drive it underground.\n\nVotes:\n- SB 131 substitute bill passed the committee.\n\nAttendance:\n- Quorum was present.\n\nAdjournment:\n- The meeting was adjourned. Next session date was not specified."
  },
  {
    "video_id": "tasmpNuw9fA",
    "url": "https://www.youtube.com/watch?v=tasmpNuw9fA",
    "title": "Rules Day 38 of the 2025 Legislature Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 24,
    "summary": "Overview:\nThe Georgia legislature session on Rules Day 38 of the 2025 session featured the introduction and discussion of several key bills related to elections and the justice system. Notable aspects include proposed changes to election rules and voter rolls, as well as legislation addressing prosecutorial misconduct and wrongful convictions.\n\nKey Actions:\n- **SB 10**: Quantifies procedures and practices for judicial officers, and incorporates language from HB 199 which passed the House unanimously\n- **SB 141**: Creates a grant program for rural hospitals to purchase generators, using SB 170 as the vehicle\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The session began with an opening prayer by Jim Williamson.\n- The legislature recognized several special guests, including Michael Boswell and Andrew Blitchington from Scriven County.\n- There was some discussion around Senator Goodman allowing his legislation to be used as a vehicle for other bills.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not mention quorum or attendance.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or when the next session will take place."
  },
  {
    "video_id": "q6QXhHME-1w",
    "url": "https://www.youtube.com/watch?v=q6QXhHME-1w",
    "title": "Appropriations Meeting for Day 29 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 29,
    "video_date": null,
    "duration_minutes": 4,
    "summary": "Overview:\nThe summary covers a Georgia Appropriations Subcommittee meeting, focusing on budget adjustments for various state agencies and programs. Notable aspects include salary adjustments, funding for new positions, and changes to existing programs.\n\nKey Actions:\nNo specific bills were passed or referred during this meeting.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The committee discussed salary adjustments and operational funding requests from the Department of Autos, an agency in the legislative branch.\n- Funds were provided to the Department of Labor to help with maintaining their legacy unemployment insurance system during a transition.\n- The committee adjusted funding for the Outdoor Stewardship Program, reducing the proposed 20% cut to 5% instead.\n- Funding was recommended for merit-based salary adjustments at the Georgia Access to Medical Cannabis Commission.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe quorum and attendance details were not provided.\n\nAdjournment:\nThe meeting was adjourned after a motion and voice vote."
  },
  {
    "video_id": "xOHGMjL6eRo",
    "url": "https://www.youtube.com/watch?v=xOHGMjL6eRo",
    "title": "Rules PM Meeting 3 for Day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Here is a summary of the Georgia Rules PM Meeting 3 for Day 28 of the 2025 Session:\n\n**Overview:** This session focused on passing various rule substitutes and resolutions, with no major legislation introduced or passed.\n\n**Key Actions:**\n- **HR 128:** Resolution to address compensation\n- **HB 397:** Rule Substitute to address election issues before 2026 election\n- **HB 529:** Rule Substitute to clarify automatic subscription renewal disclosures\n- **HB 270, HB 471, HB 266, HB 328:** Bills referred to supplemental calendar\n\n**Bills Introduced (First Reading):** None detected\n\n**Notable Moments:** The committee worked to find consensus on HB 397 before sending it to the Senate. Various rule substitutes and resolutions were explained and passed without opposition.\n\n**Votes:** All rule substitutes and resolutions passed without objection.\n\n**Attendance:** Quorum present, no notes on attendance.\n\n**Adjournment:** No explicit adjournment noted, but session appears to have concluded."
  },
  {
    "video_id": "Oj_RYaSpi4o",
    "url": "https://www.youtube.com/watch?v=Oj_RYaSpi4o",
    "title": "Rules PM Meeting pt. 2 for Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 38,
    "summary": "Here is a structured summary of the Georgia Rules PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n**Overview:** This meeting focused on discussing and explaining the details of a substitute version of Senate Bill 12, which deals with defining custodians for open records requests and expanding legislative privilege.\n\n**Key Actions:** None detected.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Chairman Anderson explained the key provisions of the substitute Senate Bill 12, including defining custodians for open records requests and expanding legislative privilege to cover communications between the legislative and executive branches.\n- There was a discussion around whether the expanded legislative privilege provisions were intended to hide information from the public, with concerns raised about protecting communications with private entities that may influence legislation.\n- The chairmen defended the changes as necessary to protect the ability to have candid conversations and receive accurate information, arguing that existing legislative privilege should extend to written records as well.\n\n**Votes:** No recorded votes detected.\n\n**Attendance:** Quorum was present to conduct the meeting.\n\n**Adjournment:** The meeting was adjourned. No information provided on the next scheduled session."
  },
  {
    "video_id": "9FVRC2Pei1w",
    "url": "https://www.youtube.com/watch?v=9FVRC2Pei1w",
    "title": "Rules PM Meeting for Day 39 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 39,
    "video_date": null,
    "duration_minutes": 15,
    "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 39 of the 2025 Session:\n\n## Overview\nThe meeting focused on a substitute for Senate Bill 59 regarding municipal sovereign immunity, as well as a discussion around Senate Bill 185 which would prohibit the Georgia Department of Corrections from using state funding for transgender surgeries for inmates. There was significant debate and opposition expressed around the necessity and prioritization of the transgender surgery bill.\n\n## Key Actions\n**SB 59**: Substitute bill providing liability limits for municipal governments\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Debate around the necessity and prioritization of SB 185 to prohibit transgender surgeries for inmates, with concerns raised about the bill addressing a non-existent problem while larger issues like healthcare access and teacher/prison staff shortages go unaddressed.\n- Questions around whether any transgender surgeries have actually been performed on inmates in Georgia's prisons.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nQuorum was present, though specific attendance numbers were not provided.\n\n## Adjournment\nThe meeting adjourned, but a specific time was not noted. The next session date was also not provided."
  },
  {
    "video_id": "d9fS5b4vmNM",
    "url": "https://www.youtube.com/watch?v=d9fS5b4vmNM",
    "title": "House Evening Session for Day 38 of the 2025 Legislative Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 86,
    "summary": "Here is a structured markdown summary of the Georgia House Evening Session for Day 38 of the 2025 Legislative Session:\n\n## Overview\nThe House session focused on passing key school safety legislation, including provisions from previous bills SB 17 (known as Ricky and Alyssa's Law) and incorporating new requirements around emergency communications, threat assessment plans, and mental health support for students. The session also included the introduction and passage of SB 199 related to campaign finance and transparency.\n\n## Key Actions\n**HB 268**: Amends education laws to require public schools to implement mobile panic alert systems, share digital mapping data with emergency responders, establish threat assessment plans, and create a student advocacy specialist position to coordinate mental health services.\n\n**SB 199**: Requires the State Ethics Commission to not accept or reject complaints against candidates within 60 days of an election, and streamlines campaign finance reporting requirements.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Rep. Persinger provided an overview of the changes made to HB 268 in the Senate substitute, highlighting the incorporation of Ricky and Alyssa's Law and new requirements around emergency communications, threat assessments, and mental health support.\n- Several representatives asked clarifying questions about the implementation and funding of the new school safety requirements in HB 268.\n- There was discussion about ensuring timely transfer of student disciplinary records between schools.\n\n## Votes\n- The House voted 154-12 to agree to the Senate's substitute for HB 268, passing the school safety legislation.\n\n## Attendance\nNo explicit quorum notes provided.\n\n## Adjournment\nThe transcript does not provide information about the time of adjournment or the date of the next session."
  },
  {
    "video_id": "wlCvTTFR8N8",
    "url": "https://www.youtube.com/watch?v=wlCvTTFR8N8",
    "title": "Rules Meeting for Day 36 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 25,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 36 of the 2025 Session:\n\n**Overview:**\nThe session focused on the consideration of several bills, including the Riley Gaines Act (SB 1) and a bill to allow optometrists to dispense and sell drugs they are authorized to prescribe (SB 140). There was discussion around the potential for litigation related to the Riley Gaines Act, as well as clarification on the bill's intent to protect student data from political campaigns.\n\n**Key Actions:**\n- **HR 347:** Passed\n\n**Bills Introduced (First Reading):**\nNone mentioned.\n\n**Notable Moments:**\n- Discussion around the Riley Gaines Act and whether there have been any confirmed instances of transgender student-athletes participating in public high school sports in Georgia.\n- Clarification provided on the bill's intent to protect student data from political campaigns while still allowing traditional voter registration activities.\n\n**Votes:**\n- HR 347 was passed.\n\n**Attendance:**\nNo specific quorum notes provided.\n\n**Adjournment:**\nThe transcript does not indicate when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "mGJfPi-p6vs",
    "url": "https://www.youtube.com/watch?v=mGJfPi-p6vs",
    "title": "Rules Meeting for Day 34 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 34,
    "video_date": null,
    "duration_minutes": 32,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 34 of the 2025 Session:\n\n**Overview**: The meeting covered a variety of bills, including legislation on deregulation, veterinary education, and academic integrity. Notable discussion centered around the impact and implementation of the proposed deregulation efforts.\n\n**Key Actions**:\n- **SB 208**: Lieutenant Governor's \"red tape rollback\" bill - Referred back to Ways and Means committee for changes\n- **SB 140**: Allows optometrists to dispense certain medications\n\n**Bills Introduced (First Reading)**:\n- SB 20: Provides loan program for veterinary students\n- SB 213: Bans commercial cheating services\n\n**Notable Moments**:\n- Discussion on balancing deregulation with necessary oversight, particularly for agencies like the Department of Banking and Finance\n- Concerns raised about agencies' capacity to handle increased review requirements under the deregulation bill\n\n**Votes**: No recorded votes\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: Meeting adjourned, next session scheduled for the following week."
  },
  {
    "video_id": "q9Y3YDWb1ec",
    "url": "https://www.youtube.com/watch?v=q9Y3YDWb1ec",
    "title": "Rules Day 38 of the 2025 Legislative PM Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 3,
    "summary": "# Georgia Rules Day 38 of the 2025 Legislative PM Session\n\n## Overview\nThe session focused on passing several bills with little substantive debate or notable moments. The main action was a substitute amendment to SB 298 that expanded legislative immunity and privilege.\n\n## Key Actions\n**SB 162**: Amended to clarify anesthesiologist supervision requirements\n**SB 298**: Substitute amendment added legislative immunity and privilege provisions\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Chairman Levitt explained the substitute amendment to SB 298, expanding legislative immunity and privilege\n\n## Votes\nNo recorded votes detected\n\n## Attendance\nQuorum was present, no attendance issues noted.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "MwHn68pVw-Q",
    "url": "https://www.youtube.com/watch?v=MwHn68pVw-Q",
    "title": "Senate Day 38 of the 2025 Legislative Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 38,
    "video_date": null,
    "duration_minutes": 83,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 38 session:\n\n# Overview\nThis session featured the introduction of several bills and resolutions, as well as procedural discussions and votes. The notable aspects include the introduction of HB 150 and a discussion around excusing certain senators from the session.\n\n# Key Actions\n**HB 150**: Motor vehicles - use of automated traffic enforcement safety devices in school zones\n\n# Bills Introduced (First Reading)\n- SR 431 by Sen. Harold - Study committee on social media/AI impact on children\n- SR 476 by Sen. Halperin - Study committee on local school system flexibility options  \n- SR 49 by Sen. Dixon - Study committee on inclusive educational settings for students with disabilities\n- HB 651 by Rep. Powell - Motor vehicles - use of automated traffic enforcement safety devices in school zones\n\n# Notable Moments\n- Prayer and Pledge of Allegiance led by Sen. Jones, who introduced his son Elim Jones as the guest pastor for the day.\n- Discussions around excusing absences of several senators.\n\n# Votes\nNo recorded votes mentioned in the transcript.\n\n# Attendance\nQuorum was present, with requests made to excuse several senators from the session.\n\n# Adjournment\nThe transcript does not explicitly state when the session adjourned or the date of the next session."
  },
  {
    "video_id": "qzBaIuQnWT4",
    "url": "https://www.youtube.com/watch?v=qzBaIuQnWT4",
    "title": "Senate Day 37 of the 2025 Legislative PM  Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 88,
    "summary": "Here is a structured markdown summary of the Georgia Senate Day 37 of the 2025 Legislative PM Session based on the provided transcript:\n\n## Overview\nThe session focused on insurance-related legislation, with the Senate considering amendments to House Bill 348 regarding captive insurance companies. There was some debate around proposed amendments that aimed to restrict insurance companies from easily leaving the state.\n\n## Key Actions\n**HB 348**: Bill to amend the Georgia code to expand the lines of insurance and reinsurance that limited-purpose subsidiary and captive insurance companies can engage in.\n\n## Bills Introduced (First Reading)\nNone mentioned in the transcript.\n\n## Notable Moments\n- Senator from the 20th spoke in favor of HB 348, arguing it would modernize Georgia's captive insurance laws.\n- Senator from the 2nd introduced two amendments to HB 348:\n    - Amendment 1 would prohibit insurance companies from leaving Georgia if they made a profit in at least 4 of the previous 5 years.\n    - Amendment 2 would prohibit insurers from transferring funds between affiliates with intent to mislead regarding profitability.\n- The Senator from the 20th spoke against both amendments, arguing they were anti-free enterprise and would restrict insurers' ability to manage their finances.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "mf-t6V44RRk",
    "url": "https://www.youtube.com/watch?v=mf-t6V44RRk",
    "title": "Rules Meeting for Day 37 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 37,
    "video_date": null,
    "duration_minutes": 12,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 37 of the 2025 Session:\n\n**Overview**\nThe meeting covered a variety of bills and resolutions, with a focus on issues related to addiction, visitation rights, insurance market reform, and the legislative branch's investigative powers.\n\n**Key Actions**\n- **HR 557**: Creates a study committee on Georgia's two investment funds.\n- **HR 512**: Creates the House Study Committee on Addiction, Epidemic, and Solutions for Recovery.\n- **SB 30**: Relates to puberty blockers, with careful restrictions around their use.\n- **SB 173**: Creates a simple procedure to expedite uncontested motions in state superior courts.\n\n**Bills Introduced (First Reading)**\n- HR 659: Creates a study committee on insurance market reform.\n- HR 72: Creates a study on increasing access to cancer care and screenings for minority populations.\n- HR 611: Creates a Health Study Committee on Abandoned Child Placement Following Hospital Discharge.\n- SB 131: Discussed, but details not provided.\n- SB 255: Deals with the investigative powers of the legislative branch, including the power to issue subpoenas and compel attendance of witnesses.\n\n**Notable Moments**\n- Debate on SB 30 (puberty blockers) and its potential impact on children's mental health and suicide risk.\n- Recognition of Chairman Jasper's leadership in bringing together first responders and veterans.\n\n**Votes**\nNo recorded votes mentioned in the transcript.\n\n**Attendance**\nThe transcript mentions a \"hard stop at 9:30\" to go into the chamber, indicating a quorum was present.\n\n**Adjournment**\nThe transcript does not explicitly state when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "KL-c9YzXVpA",
    "url": "https://www.youtube.com/watch?v=KL-c9YzXVpA",
    "title": "House Rules Session for day 35 for the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Here is a summary of the Georgia House Rules Session for day 35 of the 2025 Session:\n\n**Overview**:\nThe session focused on the introduction and discussion of several bills, including Senate Bill 79 (the \"FEAR Act\" for fentanyl eradication) and a rules substitute for Senate Bill 69 (part of the governor's lawsuit reform package). The committee approved the rules substitute for SB 69 with some minor changes.\n\n**Key Actions**:\n- **SB 69**: Rules substitute approved with changes to disclosure requirements and joint/several liability provisions.\n- **SB 79**: \"FEAR Act\" for fentanyl trafficking penalties discussed.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- Explanation of SB 79 \"FEAR Act\" by Senator Govind, highlighting the severity of the fentanyl epidemic.\n- Discussion of changes to SB 69 rules substitute, including exceptions for litigation financing investors and discretionary joint/several liability.\n\n**Votes**:\n- SB 69 rules substitute approved.\n- Supplemental calendar set for bills including SB 40, SB 56, SB 69, SB 79, and SB 105.\n\n**Attendance**:\nNo specific quorum notes provided.\n\n**Adjournment**:\nThe session adjourned, with a rooms meeting scheduled for 9am the next morning."
  },
  {
    "video_id": "K080F_w50gE",
    "url": "https://www.youtube.com/watch?v=K080F_w50gE",
    "title": "Appropriations Meeting for Day 36 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 36,
    "video_date": null,
    "duration_minutes": 47,
    "summary": "Here is a structured markdown summary of the Georgia Appropriations Meeting for Day 36 of the 2025 Session:\n\n## Overview\nThe session focused on the review and discussion of the state budget, House Bill 68, which outlines the allocation of approximately $36-37 billion in taxpayer funds over the next 12 months. The senators highlighted the challenges of the current economic climate and the need for fiscal responsibility, while also recognizing the efforts of the House and Senate budget committees in crafting the budget.\n\n## Key Actions\nNo specific bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- The session began with an invocation led by Senator Harverson.\n- The senators expressed gratitude to Director Don, Governor Kemp, House Chairman Hatchett, and the Senate budget analysts for their contributions to the budget process.\n- The senators discussed the national economic outlook, the end of the \"federal sugar high\" from COVID-19 spending, and the state's approach to maintaining a balanced budget and reducing tax rates.\n- The senators emphasized the need to carefully consider the fiscal impacts of bills passed by the General Assembly.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript does not provide any information about quorum or attendance.\n\n## Adjournment\nThe transcript does not explicitly state when the session was adjourned or when the next session would be held."
  },
  {
    "video_id": "EptpLhs51G8",
    "url": "https://www.youtube.com/watch?v=EptpLhs51G8",
    "title": "Rules Meeting for the 2025 Legislative Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 52,
    "summary": "Here is a structured markdown summary of the Georgia Rules Meeting session:\n\n**Overview**\nThe committee discussed Senate Bill 255, which would regulate litigation financing in Georgia. The bill went through several changes in committee, including clarifying disclosure requirements, adding an appeals process for denied applications, and adjusting the effective date to allow the Department of Banking and Finance more time to set up the new regulatory framework.\n\n**Key Actions**\n- **SB 255**: Regulates litigation financing in Georgia, establishing a registration and disclosure system overseen by the Department of Banking and Finance.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Committee Chairman Lebritt provided a detailed overview of the changes made to SB 255 in committee.\n- Representative Kim Williams raised a question about whether the Department of Banking and Finance has adequate staff and resources to effectively take on the new regulatory duties under the bill.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nQuorum was present to conduct business.\n\n**Adjournment**\nThe meeting adjourned, with no next session date provided."
  },
  {
    "video_id": "GK1-jwdMtp0",
    "url": "https://www.youtube.com/watch?v=GK1-jwdMtp0",
    "title": "Rules PM Meeting Part 2 for Day 35 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "Overview:\nThe Georgia Rules PM Meeting Part 2 for Day 35 of the 2025 Session focused on amending and passing a substitute bill through the subcommittee. There was some debate and a failed amendment proposed, but ultimately the substitute was passed with two other amendments.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\nNone detected\n\nNotable Moments:\n- The chair proposed two amendments to the substitute bill: 1) adding \"related to the litigation\" after \"services\" on line 267, and 2) striking the word \"regulated\" on line 384.\n- A member proposed an additional amendment to change \"shall\" to \"may\" on line 274, but this amendment failed.\n- There was some procedural discussion as the chair worked to properly manage the motions and amendments.\n\nVotes:\n- The amendments proposed by the chair were approved by voice vote.\n- The final motion to pass the substitute bill as amended was approved, with one no vote.\n\nAttendance:\nA quorum of members was present.\n\nAdjournment:\nThe subcommittee meeting was adjourned after completing its business."
  },
  {
    "video_id": "7mq_mSGSQXI",
    "url": "https://www.youtube.com/watch?v=7mq_mSGSQXI",
    "title": "Rules PM Meeting for day 35 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 68,
    "summary": "Here is a summary of the Georgia Rules PM Meeting for day 35 of the 2025 Session session:\n\n**Overview**:\nThis meeting focused on discussing and potentially taking action on Senate Bill 69, which aims to regulate the growing third-party litigation funding (TPLF) industry in Georgia. The bill was recently passed unanimously by the state Senate and is now being considered by this Rules subcommittee.\n\n**Key Actions**:\n**SB 69**: Bill to regulate third-party litigation funding in Georgia, including requirements for registration, prohibited practices, and penalties for violations.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- The subcommittee chair, Rep. Rob Belverin, provided an overview of the plan for the meeting, including hearing from the Senate sponsor and reviewing a substitute version of the bill.\n- Sen. Kim, the Senate sponsor, presented the bill in detail, highlighting how it aims to protect consumers and address foreign influence in the judicial system through TPLF.\n- The subcommittee discussed specific provisions of the substitute bill, including limits on returns for litigation funders and registration requirements.\n\n**Votes**: No votes taken, as this was a discussion and presentation of the bill.\n\n**Attendance**: Quorum present, with the subcommittee chair and Senate sponsor in attendance.\n\n**Adjournment**: The meeting adjourned, with no date provided for the next session."
  },
  {
    "video_id": "l7uV9GF9AY0",
    "url": "https://www.youtube.com/watch?v=l7uV9GF9AY0",
    "title": "Rules Meeting for Day 35 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 35,
    "video_date": null,
    "duration_minutes": 22,
    "summary": "Here is a structured summary of the key points from the Georgia Rules Meeting transcript:\n\n**Overview:**\nThis session covered a variety of bills, including creating a study committee on motor vehicle dealer regulation, addressing student chronic absenteeism, expediting appeals for municipal immunity cases, expanding support for military children in schools, improving teacher preparation for teaching reading, renaming a bridge for a fallen police officer, regulating human composting, and expanding medical marijuana access. The discussion focused on the substantive details and impacts of these legislative proposals.\n\n**Key Actions:**\n- **HR 558**: Creates a House Study Committee on the State Board of Registration of Used Motor Vehicle Dealers\n- **SB 220**: Expands access to medical marijuana\n- **SB 298**: Allows direct appeals for municipalities challenging immunity determinations\n- **SB 46**: Renames the Hulken Bridge and 400 interchange for Fallen Police Officer Jeremy Obonte\n- **SB 63**: Allows homeschool students to take AP and college placement tests at their residential public schools\n\n**Bills Introduced (First Reading):**\n- SB 236: Expands support for military school-aged children\n- SB 93: Ensures teacher prep programs teach the science of reading\n\n**Notable Moments:**\n- Discussion of using deceased persons' remains as compost, including for growing medical marijuana\n- Debate over whether homeschool students should be able to use public school testing facilities\n\n**Votes:** \nThe bills discussed were generally described as being passed or having unanimous support, though no specific vote counts were provided.\n\n**Attendance:**\nNo quorum issues were noted.\n\n**Adjournment:**\nThe transcript does not mention a specific time of adjournment or the date of the next session."
  },
  {
    "video_id": "a_ny6tHfbgg",
    "url": "https://www.youtube.com/watch?v=a_ny6tHfbgg",
    "title": "Rules Meeting for Day 33 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 33,
    "video_date": null,
    "duration_minutes": 20,
    "summary": "Overview:\nThe Georgia Rules Committee meeting discussed several notable bills, including ones related to development authorities, administrative burden reduction, property tax rates, gas pipeline infrastructure, healthcare workforce information, and adopted children's birth certificates. There was also discussion of a foster child grant scholarship program and an adult high school diploma program.\n\nKey Actions:\n**SB 100**: Allows adopted children to access their original birth certificates when they turn 18 years old.\n**SB 252**: Allows municipalities with populations over 300,000 (i.e. Atlanta) to transfer or convey property that has not been abandoned for public use.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this meeting.\n\nNotable Moments:\n- Senator Robertson expressed excitement about becoming a grandfather and the bill's impact on his adopted daughter's ability to access her original birth certificate.\n- There was some discussion around the healthcare workforce information bill (SB 131) and concerns about potential identification of individuals in smaller counties.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not provide any information about quorum or attendance.\n\nAdjournment:\nThe transcript does not mention when the meeting was adjourned or the date of the next session."
  },
  {
    "video_id": "vwFW_fLTrOo",
    "url": "https://www.youtube.com/watch?v=vwFW_fLTrOo",
    "title": "House PM Meeting 5 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 81,
    "summary": "Overview: The transcript provided does not contain any substantive legislative activity. It appears to be a presentation or discussion without any recorded bills, votes, or notable moments.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments: None detected.\n\nVotes: None detected.\n\nAttendance: No quorum details provided.\n\nAdjournment: No adjournment time or next session date mentioned."
  },
  {
    "video_id": "RTVLKi-WuQM",
    "url": "https://www.youtube.com/watch?v=RTVLKi-WuQM",
    "title": "Energy, Utilities and Telecommunications  Meeting Day 31 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 31,
    "video_date": null,
    "duration_minutes": 8,
    "summary": "Here is a structured markdown summary of the key points from the Georgia Energy, Utilities and Telecommunications Meeting Day 31 of the 2025 Session session:\n\n**Overview:**\nThe session focused on a discussion around a bill that aimed to provide certain protections for manufacturers regarding disclosures and warnings. There was debate around the extent of these protections and how they would impact the ability to bring claims against manufacturers.\n\n**Key Actions:** \nNo bills were passed or referred.\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- There was discussion around whether the bill would prevent claims for wrongful death or personal injury if the manufacturer was found to have knowingly withheld, concealed or misrepresented information about health risks.\n- An amendment was proposed to clarify that the bill would not eliminate common law negligent failure to warn claims, allowing consumers to hold manufacturers accountable if they failed to inform consumers of known issues even after reporting to the EPA. The amendment was not adopted.\n- There was debate around the timing of when manufacturers would be required to disclose information to consumers versus the government.\n\n**Votes:**\nNo recorded votes were taken.\n\n**Attendance:**\nNo quorum issues were noted.\n\n**Adjournment:**\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "8moE4jquGIg",
    "url": "https://www.youtube.com/watch?v=8moE4jquGIg",
    "title": "Senate PM meeting 2 for Day 28 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 59,
    "summary": "Here is a summary of the key points from the Georgia Senate PM meeting 2 for Day 28 of the 2025 Session:\n\n**Overview**\nThe debate centered around SB 82, a bill aimed at preventing discrimination against businesses based on their political beliefs. However, there were significant concerns raised about the bill's language and potential unintended consequences, particularly regarding the provisions related to fines and lawsuits against banks.\n\n**Key Actions**\n- No bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- No new bills were introduced.\n\n**Notable Moments**\n- There was extensive discussion about the potential issues with SB 82, including concerns about the $50,000 minimum fine for unintentional violations and the risk of opening the door to frivolous lawsuits against banks.\n- An amendment (Amendment #3) was proposed to address these concerns by having the Attorney General handle enforcement rather than allowing private lawsuits.\n\n**Votes**\n- No recorded votes were taken.\n\n**Attendance**\n- No quorum issues were noted.\n\n**Adjournment**\n- The session was adjourned. The next session date was not specified."
  },
  {
    "video_id": "7yOI3Y5gMNU",
    "url": "https://www.youtube.com/watch?v=7yOI3Y5gMNU",
    "title": "Lawmakers Day 28 2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 24,
    "summary": "Overview:\nThe Georgia legislature had a busy 28th day session, with a number of notable bills being passed or introduced. The session was marked by a bipartisan approach on some school safety measures, while more partisan debates emerged around a proposed income tax cut and a bill seeking to limit local firearm regulations.\n\nKey Actions:\n**SB 17**: Mandates mobile alert panic systems for schools and requires mapping of school properties to aid emergency response.\n**SB 61**: Adds new charges that students could be prosecuted for in superior court, including terroristic threats.\n**SB 179**: Requires sharing of student disciplinary history when transferring schools and holds parents legally responsible for not disclosing suspensions.\n**SB 163**: Rescinds local city and county laws over guns and weapons, entrusting regulation exclusively to the state.\n**HB 111**: Reduces the state's flat income tax rate from 5.39% to 5.19%.\n**HB 112**: Provides a one-time tax rebate of $250 for single taxpayers and $500 for married couples.\n**HB 657**: Annexes 45 small parcels of land into the newly formed city of Mulberry.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- Senator Colton Moore's impassioned speech advocating for his bill SB 163 to rescind local firearm regulations.\n- Debate between Republicans and Democrats over the merits of the income tax cut bill HB 111.\n\nVotes:\n- SB 17, SB 179 passed unanimously.\n- SB 61 passed 33-22 along party lines.\n- SB 163 passed 33-23 along party lines. \n- HB 111 passed 110-60, mostly along party lines.\n- HB 112 passed unanimously.\n- HB 657 passed 98-76, mostly along party lines.\n\nAttendance:\nThe session maintained a quorum throughout the proceedings.\n\nAdjournment:\nThe legislature adjourned for the day. The next session date was not specified."
  },
  {
    "video_id": "84hY111b-0I",
    "url": "https://www.youtube.com/watch?v=84hY111b-0I",
    "title": "Rules Meeting for Day 32 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 32,
    "video_date": null,
    "duration_minutes": 22,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 32 of the 2025 Session:\n\n**Overview:** The session included discussions on several bills, including ones related to military families, healthcare worker licensing, autoimmune disease awareness, judicial circuit expansions, Medicaid compliance, and wages for individuals with disabilities. There was some procedural discussion as well.\n\n**Key Actions:**\n- **SB 109:** Legislation to address insurance coverage issues for families of National Guard members killed in accidents\n- **SB 191:** Bill to streamline healthcare worker licensing and credentialing processes\n- **HR 463:** Resolution to designate March as Autoimmune Disease Awareness Month in Georgia\n- **SB 145:** Bill to add a 6th judge to the Augustus Judicial Circuit \n- **SB 276:** Agency bill to bring Georgia into compliance with federal Medicaid requirements\n- **SB 55:** \"Dignity of Pay Act\" to prohibit paying individuals with disabilities less than minimum wage\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Discussion of concerns over a proposed \"America First\" license plate\n- Procedural discussion around scheduling of a committee meeting at 6am\n\n**Votes:** No recorded votes mentioned.\n\n**Attendance:** Quorum present to conduct business.\n\n**Adjournment:** The transcript does not mention the time of adjournment or the date of the next session."
  },
  {
    "video_id": "GmRlqdKAKGQ",
    "url": "https://www.youtube.com/watch?v=GmRlqdKAKGQ",
    "title": "Rules Meeting Special Session for the 2025",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 16,
    "summary": "Here is a structured markdown summary of the Georgia Rules Meeting Special Session for the 2025 session:\n\n**Overview**:\nThe session focused on considering several Senate bills, including legislation related to organ transportation, drug testing equipment, and a dispute between Gwinnett County and the City of Mulberry. There was debate and discussion around these bills.\n\n**Key Actions**:\n- **SB 138**: Legislation to address Gwinnett County's refusal to enter into a service delivery agreement with the City of Mulberry, which was passed by the Senate.\n- **SB 81**: Bill to allow testing equipment for drugs like xylazine to be exempted from drug paraphernalia laws.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- Debate over SB 138 and the dispute between Gwinnett County and the City of Mulberry, with accusations of the county not cooperating with the city.\n- Discussion of the importance of SB 81 in allowing for testing of emerging drugs like xylazine.\n\n**Votes**:\nNo recorded votes mentioned, but SB 138 appears to have passed the Senate.\n\n**Attendance**:\nQuorum was present, with a \"slight crowd\" noted.\n\n**Adjournment**:\nThe meeting adjourned, with the next session date not specified."
  },
  {
    "video_id": "x4DOohZSJJk",
    "url": "https://www.youtube.com/watch?v=x4DOohZSJJk",
    "title": "Senate PM Meeting 4 for Day 28 of the 2025 Session",
    "chamber": "senate",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting 4 for Day 28 of the 2025 Session:\n\n**Overview:**\nThis session included the passage of two bills: SB 256, which requires certain disclosures by electric membership corporations, and SB 268, which creates a 25-foot \"halo\" safety zone around first responders conducting their duties. There was some discussion around the scope and application of SB 268.\n\n**Key Actions:**\n**SB 256:** Bill to amend laws regarding required disclosures by electric membership corporations and foreign electric cooperatives.\n**SB 268:** Bill to create a crime of interference with a first responder and establish a 25-foot safety zone around first responders.\n\n**Bills Introduced (First Reading):**\nNone detected.\n\n**Notable Moments:**\n- Discussion on the scope and application of the \"halo\" safety zone in SB 268, clarifying it applies to individuals outside of vehicles, not the move-over law for drivers.\n- Senators engaged in dialogue to ensure the bill did not inadvertently impact other laws or procedures.\n\n**Votes:**\n- SB 256 passed by substitute unanimously (51-0).\n- SB 268 passed (37-17).\n\n**Attendance:**\nQuorum was present, no issues noted.\n\n**Adjournment:**\nThe session adjourned. The next session date was not provided."
  },
  {
    "video_id": "mrNbMOV2hX4",
    "url": "https://www.youtube.com/watch?v=mrNbMOV2hX4",
    "title": "House PM Meeting 4 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 67,
    "summary": "Here is a structured summary of the Georgia House PM Meeting 4 for Day 28 of the 2025 Session:\n\n**Overview**:\nThis session featured the consideration and passage of several notable bills, including legislation to create a certification program for community health workers and require insurance coverage for necessary orthotic and prosthetic devices.\n\n**Key Actions**:\n- **HB 291**: Establishes a certification program for community health workers to serve underserved and rural areas\n- **HB 87**: Requires health insurance plans to cover medically necessary orthotic and prosthetic devices\n\n**Bills Introduced (First Reading)**:\n- HB 567\n- HB 677\n\n**Notable Moments**:\n- Debate on HB 87, which would expand insurance coverage for prosthetic and orthotic devices, highlighting personal stories of Georgians impacted\n- Presentation of HB 384 to standardize oaths taken by law enforcement officers statewide\n\n**Votes**:\n- HB 291 (Community Health Worker Certification Act) - Passed 169-4\n- HB 87 (Orthotic and Prosthetic Device Coverage) - Passed 171-2\n\n**Attendance**:\nThe session maintained a quorum, with all members present and voting.\n\n**Adjournment**:\nThe House adjourned after considering the bills, with the next session scheduled for the following day."
  },
  {
    "video_id": "6D0d0QRac0o",
    "url": "https://www.youtube.com/watch?v=6D0d0QRac0o",
    "title": "House PM Meeting 2 for Day 28 of the 2025 Session",
    "chamber": "house",
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 51,
    "summary": "Here is a structured markdown summary of the Georgia House PM Meeting 2 for Day 28 of the 2025 Session:\n\n## Overview\nThe session focused on passing several bills, including HB 579 to modernize professional licensing in Georgia, HB 549 to extend the reimbursement window for law enforcement training expenses, and HB 150 to require quarterly reports on foreign funding to state universities. There was some debate around the scope and approach of HB 150.\n\n## Key Actions\n**HB 579**: Provides better constituent services and modernizes professional licensing in Georgia.\n**HB 549**: Extends the reimbursement window for law enforcement training expenses from 15 to 36 months.\n**HB 150**: Requires the university system to report quarterly on funding received from \"foreign countries of concern.\"\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Debate on HB 150 regarding the scope of reporting on foreign funding to universities.\n- Questions raised about labeling individuals from \"foreign countries of concern\" as concerning.\n\n## Votes\n- HB 579 passed 158-2.\n- HB 549 passed unanimously 164-0.\n\n## Attendance\nA quorum was present, with all members voting on the bills.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified."
  },
  {
    "video_id": "PHp1Jfxf8l8",
    "url": "https://www.youtube.com/watch?v=PHp1Jfxf8l8",
    "title": "Rules PM Meeting 2 for Day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 6,
    "summary": "# Georgia Rules PM Meeting 2 for Day 28 of 2025 Session\n\n## Overview\nThis Rules Committee meeting focused on passing various resolutions and rules substitutes, with little apparent controversy or debate.\n\n## Key Actions\n**HR 128**: Room substitute for modified structure\n**HB 87**: Passed\n**HB 127**: Passed\n**HB 291**: Passed\n**HB 323**: Passed\n**HB 351**: Passed  \n**HB 384**: Passed\n**HB 430**: Passed\n**HB 483**: Passed\n**HB 506**: Passed\n**HB 531**: Passed\n**HB 555**: Rule substitute passed\n**HB 567**: Passed\n**HB 582**: Passed\n**HB 630**: Passed\n**HB 635**: Passed\n**HB 645**: Passed unanimously\n**HB 652**: Passed\n**HB 677**: Rule substitute passed\n**HB 686**: Passed\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Brief explanation provided for HB 555 rule substitute to correct drafting issues\n- HB 677 described as creating a process to address the issue of children with mental health issues languishing in hospitals\n\n## Votes\nAll bills/resolutions passed, with most appearing to be unanimous or near-unanimous.\n\n## Attendance\nQuorum present, no issues noted.\n\n## Adjournment\nNo specific adjournment time provided, but the meeting appears to have concluded."
  },
  {
    "video_id": "k1jcDUigMcI",
    "url": "https://www.youtube.com/watch?v=k1jcDUigMcI",
    "title": "Rules Meeting for Day 28 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 28,
    "video_date": null,
    "duration_minutes": 34,
    "summary": "Here is a summary of the Georgia Rules Meeting for Day 28 of the 2025 Session:\n\n**Overview**: This session featured a variety of bills being considered, including measures related to voting, Black women's history, age discrimination, recovery support services, student loan forgiveness for veterinary technicians, and enforcement of transit lanes in Atlanta.\n\n**Key Actions**:\n- **HB 502**: Allows parents with young children to go to the front of the line when voting.\n- **HB 146**: Designates April as Black Women's History Month.\n- **HB 10**: Removes arrest photos of those never convicted from \"Remove for Pay\" websites.\n- **HB 311**: Removes the age cap of 70 for working individuals.\n- **HB 657**: Certifies Peer Specialists and defines Recovery Community Organizations.\n- **HB 217**: Extends a dual achievement program allowing high school dropouts to earn diplomas and technical certificates.\n- **HB 88**: Provides student loan forgiveness for veterinary technicians.\n- **HB 638**: Allows MARTA to use cameras to enforce bus rapid transit lanes.\n- **HB 442**: Allows students 25 days of school absence for film industry work.\n\n**Bills Introduced (First Reading)**: No new bills were introduced during this session.\n\n**Notable Moments**:\n- The session opened with a prayer, acknowledging the \"busy, stressful\" day.\n- The chair reminded presenters to provide bill numbers and page locations to expedite the process.\n- Several bills were noted as having been perfected or recommended by the Speaker Pro Tem.\n\n**Votes**:\n- HB 502, HB 146, HB 10, HB 311, HB 657, HB 217, HB 88, HB 638, and HB 442 all passed with no recorded opposition.\n\n**Attendance**: Quorum was met, and the session proceeded without noted attendance issues.\n\n**Adjournment**: The session adjourned. The next session date was not specified."
  },
  {
    "video_id": "jz2RwuMi-TY",
    "url": "https://www.youtube.com/watch?v=jz2RwuMi-TY",
    "title": "Rules meeting day 26 2025 session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 41,
    "summary": "Here is a summary of the key points from the Georgia Rules meeting day 26 2025 session:\n\n**Overview**: This session featured discussions and progress on several bills, including measures related to property ownership, school infrastructure, disabled parking, autism alert systems, and school personnel benefits.\n\n**Key Actions**:\n- **HB 399**: Requires out-of-state property owners with more than 25 single-family homes to have a Georgia real estate broker or representative.\n- **HB 563**: Allows licensed physical therapists to verify individuals for disabled parking permits.\n- **HB 465**: Establishes a missing autism alert system through the GBI.\n- **HB 127**: Increases the number of personal days teachers can take from their sick days from 3 to 5.\n\n**Bills Introduced (First Reading)**: No new bills were explicitly mentioned as being introduced.\n\n**Notable Moments**: \n- Discussion around HB 647, which would annex 45 parcels into the city of Mulberry, with some disagreement between the representative and county commissioners on the level of local support.\n- Procedural discussions around the process and timeline for creating new cities.\n\n**Votes**: Bills HB 399, HB 563, HB 465, HB 127 were all described as having no questions and moving forward, implying they passed.\n\n**Attendance**: No specific quorum notes were provided.\n\n**Adjournment**: The transcript does not indicate when the session adjourned or the date of the next scheduled meeting."
  },
  {
    "video_id": "nYB_xuckTNg",
    "url": "https://www.youtube.com/watch?v=nYB_xuckTNg",
    "title": "Intragovernmental Coordination Meeting for Day 25 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 25,
    "video_date": null,
    "duration_minutes": 5,
    "summary": "Overview: This legislative session covered the passage of two bills - HB 593, which made the election for the Probate Judge of Baker County nonpartisan, and HB 647, which allowed the city of Mulberry to annex roughly 45 parcels in a representative's district, giving more local control over development decisions.\n\nKey Actions:\n**HB 593**: Provided that future elections for the Office of Probate Judge of Baker County shall be nonpartisan.\n**HB 647**: Allowed the city of Mulberry to expand into a representative's district, adding 45 parcels to the city limits.\n\nBills Introduced (First Reading): None mentioned.\n\nNotable Moments:\n- This was the representative's first time presenting a bill in committee.\n- The representative cited constituent concerns over growth and high-density development as motivation for the annexation bill.\n- There was some procedural discussion, including a motion to \"do pass\" on HB 647.\n\nVotes:\n- HB 593 passed unanimously.\n- HB 647 passed with one opposed vote.\n\nAttendance: A quorum was present.\n\nAdjournment: The meeting was adjourned, but the next session date was not provided."
  },
  {
    "video_id": "TzRnRlh3Aw4",
    "url": "https://www.youtube.com/watch?v=TzRnRlh3Aw4",
    "title": "12/18/2025 Joint Senate Judiciary Committee and House Judiciary Committee",
    "chamber": "senate",
    "session_type": "committee",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 42,
    "summary": "Overview: This appears to be a joint session of the Georgia Senate and House Judiciary Committees to consider nominations for the new Georgia Tax Court. The session focused on the qualifications of two candidates - Emily Youngo for the Clerk of the Business Court position, and Frank O'Connell for the Chief Judge of the Georgia Tax Court.\n\nKey Actions:\n- No specific bills were passed or referred.\n\nBills Introduced (First Reading): \n- None detected\n\nNotable Moments:\n- The session began with an opening prayer.\n- The committees heard presentations from the two candidates and asked them questions about their backgrounds and qualifications.\n- There was discussion about the importance of the new Georgia Tax Court and the need for qualified leadership.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- The committees noted they were waiting for a quorum on the Senate side before taking any action.\n\nAdjournment:\n- The transcript does not indicate when the session was adjourned or the date of the next session."
  },
  {
    "video_id": "-W2ibUsvmRA",
    "url": "https://www.youtube.com/watch?v=-W2ibUsvmRA",
    "title": "Rules Meeting Special Session of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 60,
    "summary": "Here is a summary of the Georgia Rules Meeting Special Session of the 2025 Session based on the transcript provided:\n\n**Overview**\nThe session focused on the introduction and consideration of several bills, primarily related to licensing requirements, venue regulations, homeowner associations, sexual assault kit retention, women's golf week designation, and rural hospital programs. There was some discussion and debate around one of the bills regarding potential discriminatory effects.\n\n**Key Actions**\n- **HB 512**: Caps fees charged by homeowner associations and provides for alternate dispute resolution before liens can be placed.\n- **HB 626**: Extends the retention period for sexual assault kits from 20 to 30 years.\n- **HB 718**: Designates the first week of April as Women's Golf Week in Georgia.\n- **HB 662**: Allows rural emergency hospitals to participate in the Georgia HEART program.\n- **HB 566**: Protects artists from AI-generated replicas of their work without permission.\n\n**Bills Introduced (First Reading)**\n- HB 185: Modernizes and streamlines licensing requirements for dieticians and nutritionists.\n- HB 671: Restricts minors from attending sexually explicit performances at venues.\n\n**Notable Moments**\n- There was a discussion around HB 671 and concerns about potential discriminatory effects on the LGBTQ+ community. The bill's sponsor agreed to work further on the legislation.\n\n**Votes**\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**\nThe transcript does not provide any information about quorum or attendance.\n\n**Adjournment**\nThe transcript does not mention when the session adjourned or the date of the next session."
  },
  {
    "video_id": "SX72y47ud5M",
    "url": "https://www.youtube.com/watch?v=SX72y47ud5M",
    "title": "Rules PM meeting for Day 27 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 29,
    "summary": "Here is a summary of the key points from the Georgia Rules PM meeting transcript for Day 27 of the 2025 Session:\n\n**Overview:** The meeting focused on discussing and passing a rules substitute for House Bill 268, a school safety bill, as well as reviewing a room substitute for House Bill 651 regarding school zone cameras.\n\n**Key Actions:**\n- **House Bill 268:** A rules substitute was passed, which adds provisions for generating reports on de-identified student records and coordinating mental health services and threat assessment teams in schools.\n- **House Bill 651:** A room substitute was presented, which addresses signage, speed detection, citation amounts, and other aspects of school zone cameras.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Discussions around the mental health coordinator positions in HB 268 and how they would be implemented based on school district size.\n- Clarification that the mental health coordinators would have a different focus from existing school counselors.\n- Debate around the 35% rule for revenue generation from school zone cameras in HB 651.\n\n**Votes:**\n- HB 268 rules substitute was passed out of the committee.\n- No recorded votes on other bills.\n\n**Attendance:** Quorum was present, as the meeting was able to proceed.\n\n**Adjournment:** The meeting adjourned, with no specific mention of the next session date."
  },
  {
    "video_id": "cHcbk3MdC1M",
    "url": "https://www.youtube.com/watch?v=cHcbk3MdC1M",
    "title": "Rules meeting for Day 27 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 20,
    "summary": "Here is a summary of the Georgia Rules meeting for Day 27 of the 2025 Session:\n\n**Overview:**\nThe Rules Committee heard presentations on several bills, including measures related to tax credits for workforce development programs, veteran license plates, and regulation of private water companies. The committee also discussed routine code revision and clean-up legislation.\n\n**Key Actions:**\n- **HB 7**: Provides a $4,000 income tax credit for graduates of workforce readiness programs employed in high-tech jobs in rural counties\n- **HB 583**: Allows totally disabled veterans or those with a high level of disability to obtain a second free license plate for their spouse or another vehicle\n- **HB 718**: Designates the first week of April as \"Women's Golf Week\" in Georgia\n- **HB 351**: Clarifies the permitting process for solid waste landfills to prevent future lawsuits\n- **HB 371**: Raises the maximum annual appropriation for capital outlay projects from $300 million to $375 million\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- Representatives advocated for their bills, highlighting the policy goals and need for the legislation.\n- The committee chair reminded members that bills not yet reported out of committee would need to be considered at a future meeting.\n\n**Votes:**\nAll bills discussed were recommended to pass, often with unanimous support.\n\n**Attendance:**\nA quorum was present, and the meeting proceeded without any notes on attendance.\n\n**Adjournment:**\nThe meeting adjourned. The next Rules Committee meeting was not specified."
  },
  {
    "video_id": "mueHu0E4XQo",
    "url": "https://www.youtube.com/watch?v=mueHu0E4XQo",
    "title": "Appropriations Meeting for Day 27 of the 2025 Session",
    "chamber": null,
    "session_type": "regular",
    "day_number": 27,
    "video_date": null,
    "duration_minutes": 11,
    "summary": "Here is a structured markdown summary of the Georgia Appropriations Meeting for Day 27 of the 2025 Session:\n\n## Overview\nThis session focused on considering resolutions to compensate individuals who were wrongfully incarcerated. Several cases involving issues like self-defense, manufactured evidence, and juror misconduct were discussed.\n\n## Key Actions\n**HR 119**: Resolution to compensate Mario Stinchcomb for 18 years of wrongful incarceration after he was exonerated by the Fulton Conviction Integrity Unit.  \n**HR 118**: Resolution to compensate Michael Woolfolk for wrongful incarceration after he was exonerated.  \n**HR 129**: Resolution to compensate Daryl Lee Clark for 25 years of wrongful incarceration due to issues like manufactured evidence and witness coercion.  \n**HR 128**: Resolution to compensate Joseph \"Joey\" Samuel Watkins for wrongful incarceration due to juror misconduct and buried exculpatory evidence.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Discussions of the tragic circumstances and injustices faced by the individuals who were wrongfully incarcerated.\n- Appreciation expressed for the previous support these resolutions received in the House.\n- Descriptions of the various issues that led to the wrongful convictions, including self-defense evidence, coerced testimony, and Brady violations.\n\n## Votes\n- HR 119 (Stinchcomb compensation): Passed\n- HR 118 (Woolfolk compensation): Passed  \n- HR 129 (Clark compensation): Passed\n- HR 128 (Watkins compensation): Not voted on\n\n## Attendance\nA quorum was present to conduct business.\n\n## Adjournment\nThe session adjourned, with the next session date not specified."
  },
  {
    "video_id": "K5p_QxnD30o",
    "url": "https://www.youtube.com/watch?v=K5p_QxnD30o",
    "title": "Press Conference with Senator Jones & Former Senator Jason Esteves | 12/8/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 21,
    "summary": "Here is a structured markdown summary of the key points from the Georgia legislature floor session transcript:\n\n## Overview\nThe transcript highlights a press conference with Senator Jones and former Senator Jason Estevez discussing the impending healthcare crisis in Georgia due to the expiration of federal ACA subsidies. They call on Republican leadership to take action to protect healthcare access and affordability for Georgians.\n\n## Key Actions\n**SB 192**: The Georgia Health Insurance Affordability and Consumer Protection Act, introduced by former Senator Estevez to address the healthcare coverage gap when federal subsidies expire.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced in this transcript.\n\n## Notable Moments\n- Senator Jones criticizes Republicans for refusing to address the healthcare affordability crisis and failing to pass solutions like SB 192.\n- Former Senator Estevez shares his personal experience seeing the impacts of the healthcare crisis as the husband of a nurse practitioner. He pledges that as a future leader, he will fight to expand Medicaid and lower insurance premiums.\n- Kiana Randi Gregory and her mother Marilyn share how the loss of healthcare subsidies has impacted their family.\n\n## Votes\nThe transcript indicates that SB 192 was introduced but not passed, implying it failed to receive enough votes.\n\n## Attendance\nNo specific quorum or attendance details provided.\n\n## Adjournment\nThe transcript does not mention the session adjourning or provide details on the next scheduled session."
  },
  {
    "video_id": "sPd1sU0tfXk",
    "url": "https://www.youtube.com/watch?v=sPd1sU0tfXk",
    "title": "Sen. Islam Parkes Press Conference on Expiring SNAP Benefits | 10/29/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 19,
    "summary": "Here is a structured markdown summary of the Georgia Sen. Islam Parkes Press Conference on Expiring SNAP Benefits | 10/29/2025 session:\n\n## Overview\nThis press conference addressed the impending expiration of SNAP (Supplemental Nutrition Assistance Program) benefits for nearly 1.4 million Georgians, including over 640,000 children. The speakers, including Sen. Nabila Islam Parkes, Rachel Kent (a single mother), and Alicia Rivera from the nonprofit Georgia Feeding Families, called on Governor Brian Kemp to declare a state of emergency and use the state's budget surplus to continue providing SNAP assistance to affected families.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Sen. Islam Parkes emphasized that food is not optional and this is a \"humanitarian crisis unfolding in real time.\" \n- Rachel Kent, a single mother, shared her personal struggles of relying on SNAP benefits to feed her son and called on Gov. Kemp to use the state's surplus to support families in need.\n- Alicia Rivera from Georgia Feeding Families discussed the increased demand for assistance at food banks and the need for urgent action to address the crisis.\n- Former state senator Jason Estevez, who is running for governor, expressed his support for the SNAP program and criticized the current leadership for not taking action to help Georgians in need.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum was present, as senators and community representatives participated in the press conference.\n\n## Adjournment\nNo formal adjournment, as this was a press conference rather than a legislative session."
  },
  {
    "video_id": "PHhO62yduPk",
    "url": "https://www.youtube.com/watch?v=PHhO62yduPk",
    "title": "Sen. Jones & Sen McLaurin Press Conference on Free Speech | 9/25/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 19,
    "summary": "Here is a structured markdown summary of the Georgia Senate Jones & McLaurin press conference on free speech from September 25, 2025:\n\n**Overview**\nSenators Jones and McLaurin, along with advocacy groups, condemned the Trump administration's ongoing attacks on free speech and the lack of action from Senate Republicans to defend the First Amendment. They highlighted specific cases of viewpoint discrimination, media censorship, and the targeting of activists and dissenting voices.\n\n**Key Actions**\nNo specific bills were mentioned.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Sen. Jones detailed how the Trump administration has \"weaponized the FCC\" against media outlets, sued law firms over clients they represent, and restricted discussion of topics like slavery.\n- CAIR representative Asuka Mahmoud described activists being \"abducted\" and detained by ICE for speaking out against the \"Palestinian genocide.\"\n- Sen. McLaurin contrasted the Biden administration's voluntary requests to social media companies to the Trump FCC's threats to force ABC affiliates to \"take action\" against Jimmy Kimmel for his free speech remarks.\n- McLaurin expressed optimism that the American people value free speech and will not \"take this repression by the Trump administration lying down.\"\n\n**Votes**\nNo votes mentioned.\n\n**Attendance**\nNo quorum notes.\n\n**Adjournment**\nNo adjournment details provided."
  },
  {
    "video_id": "UHYZ7_4dFdo",
    "url": "https://www.youtube.com/watch?v=UHYZ7_4dFdo",
    "title": "Sen. Josh McLaurin Press Conference | 9/19/2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 13,
    "summary": "Here is a structured summary of the key points from the Georgia Sen. Josh McLaurin press conference transcript:\n\n**Overview:**\n- Sen. McLaurin held a press conference to discuss the impending deportation of journalist Mario Guevara by the Trump administration's Board of Immigration Appeals (BIA), an executive agency. This is seen as part of a broader pattern of the administration's attacks on free speech and the press.\n\n**Key Actions:**\n- The BIA has issued an order to deport Mario Guevara, a journalist who has been legally residing in the US for decades, with no notice or explanation other than a 13-year-old deportation order that had been paused.\n- Guevara has an active federal court case seeking habeas relief, which the BIA is proceeding to ignore.\n\n**Bills Introduced (First Reading):** \n- None detected.\n\n**Notable Moments:**\n- Sen. McLaurin is joined by Richard Griffiths, a representative of the Georgia First Amendment Foundation and former immigrant journalist, who speaks about the troubling pattern of attacks on the press under the Trump administration.\n- Griffiths expresses how \"dispiriting\" it is to see a journalist thrown out of the country for doing their job.\n- There is an emergency hearing underway in federal court, with the ACLU and other organizations seeking a temporary restraining order to stop the deportation and allow Guevara's case to play out.\n\n**Votes:**\n- None detected.\n\n**Attendance:**\n- No quorum notes.\n\n**Adjournment:**\n- No adjournment information provided."
  },
  {
    "video_id": "pMKLBB-KsWw",
    "url": "https://www.youtube.com/watch?v=pMKLBB-KsWw",
    "title": "Sen. Wicks Press Conference on National Guard Deployments | 9-8-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a structured summary of the key points from the Georgia Sen. Wicks press conference on National Guard deployments:\n\n**Overview**\nThis press conference focused on the concerning issue of potential federal deployment of the National Guard in Georgia, which Sen. Wicks and other legislators condemned as unconstitutional and a threat to democracy. The speakers strongly opposed using the military against American citizens.\n\n**Notable Moments**\n- Sen. Wicks, a retired Army officer, passionately argued that the National Guard uniform should \"never be used to intimidate or divide\" and that its purpose is to \"protect and serve,\" not be misused against the people.\n- Rep. Bell compared the current situation to the dystopian FX series \"American Horror Story\" and urged the National Guard to \"come not with rifles but with rations\" to help the poor and suffering, not oppress them.\n- Rep. Jackson, another veteran, warned that using the National Guard for domestic law enforcement would violate the Posse Comitatus Act and disrespect the distinct roles of the military and law enforcement.\n\n**Opposition to Guard Deployments**\nThe legislators strongly condemned any potential federal deployment of the National Guard in Georgia, calling it unconstitutional, dangerous, and a violation of states' rights under the 10th Amendment. They called on the Governor and all Georgians to resist this \"federal overreach.\"\n\n**Conclusion**\nThe speakers passionately defended the principles of democracy, freedom, and the Constitution, urging resistance against any actions that would \"trample on the dignity of free men and women.\" They declared that \"this is not Nazi Germany\" and that Georgia must remain a \"beacon of democracy.\""
  },
  {
    "video_id": "8PB7mZygfEc",
    "url": "https://www.youtube.com/watch?v=8PB7mZygfEc",
    "title": "Sen  Parent Press Conference on CDC | 9-2-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 44,
    "summary": "Here is a summary of the key points from the Georgia Senate Parent Press Conference on the CDC on 9-2-2025:\n\n**Overview**: The press conference addressed the systemic attacks and dismantling of the Centers for Disease Control and Prevention (CDC) by the government. Several state representatives and former CDC officials spoke about the threats, harassment, and challenges faced by public health workers at the CDC.\n\n**Key Actions**: No specific bills or legislative actions were mentioned.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- Rep. Omari Crawford paid tribute to Officer David Rose, a Cobb County police officer who was killed while responding to a shooting near the CDC.\n- Several speakers, including Rep. Saira Draper, Dr. Deb Hauri, and Dr. Dan Jernigan, discussed the attacks, misinformation, and politically-motivated rhetoric directed at CDC employees, which they said was undermining the agency's ability to respond to health crises.\n- The speakers emphasized the importance of supporting and protecting the CDC's public health work, which impacts every Georgian and American.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The press conference concluded, but no specific adjournment time or next session date was given."
  },
  {
    "video_id": "asOV9DW3EY0",
    "url": "https://www.youtube.com/watch?v=asOV9DW3EY0",
    "title": "Sen. Kemp Federal Education Funding Press Conference | 7-14-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 18,
    "summary": "Here is a summary of the key points from the Georgia Sen. Kemp Federal Education Funding Press Conference on 7-14-2025:\n\n**Overview**:\nThis press conference addressed the Trump administration's decision to freeze $6.8 billion in federal education funding, including critical support for after-school programs, summer learning, teacher training, and services for migrant students and English language learners in Georgia. The freezing of these funds is having a significant impact on school districts and community programs across the state.\n\n**Key Actions**: \nNo bills were mentioned in the transcript.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Sen. Kemp and other state leaders strongly condemned the Trump administration's decision, calling it \"reckless and callous\" and stating that it is \"wreaking havoc and concern\" in Georgia.\n- Sen. Kemp emphasized that these programs are \"not radical\" but \"essential\" for students, families, and communities across the state.\n- Representatives from after-school programs like Wings for Kids and the Lilly's Foundation for Change spoke about the devastating impact the funding freeze will have on their ability to provide critical services to thousands of students.\n- A student advocate, Deishan Katron, spoke passionately about how these programs build opportunity and support for young people.\n\n**Votes**:\nNo votes were mentioned.\n\n**Attendance**:\nNo specific quorum notes were provided.\n\n**Adjournment**:\nThe press conference concluded, but no information was given about the next legislative session."
  },
  {
    "video_id": "fJt6AELQimI",
    "url": "https://www.youtube.com/watch?v=fJt6AELQimI",
    "title": "Sen. McLaurin's Press Conference on Mario Guevara's ICE Detention | 7-22-2025",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 50,
    "summary": "Here is a structured markdown summary of the Georgia Sen. McLaurin's Press Conference on Mario Guevara's ICE Detention | 7-22-2025 session:\n\n**Overview**\nThis press conference addressed the case of Mario Guevara, a journalist who has been detained by ICE for over a month despite having the charges against him dropped. The detention of a journalist exercising his First Amendment rights is seen as a troubling attack on press freedom.\n\n**Key Actions**\nNone detected\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Sen. Josh McLaren expressed concerns about the rapid expansion of ICE's budget and powers, which is creating fear in immigrant communities.\n- Jose Zamora from the Committee to Protect Journalists condemned Guevara's detention as retaliation for his journalism, making him the only journalist currently imprisoned in the U.S. for his reporting.\n- Lawyer Giovanni Diaz provided details on Guevara's case, including his legal status, the bond hearing, and efforts to secure his release.\n\n**Votes**\nNone detected\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nNo adjournment details provided"
  },
  {
    "video_id": "-2WMNWZ5V-U",
    "url": "https://www.youtube.com/watch?v=-2WMNWZ5V-U",
    "title": "6/24/2025 Democratic Press Conference on Reproductive Healthcare",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 10,
    "summary": "Here is a summary of the Georgia 6/24/2025 Democratic Press Conference on Reproductive Healthcare session:\n\n**Overview**\nThe session featured powerful testimony from Georgia women on the impacts of the state's restrictive abortion laws, particularly HB 481. However, the notable absence of the state Attorney General, who was invited but declined to attend, left many questions unanswered about the interpretation and implementation of these laws.\n\n**Key Actions**\n- **HB 481**: Georgia's \"heartbeat bill\" that bans most abortions after 6 weeks of pregnancy\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Testimony from Georgia women describing how the abortion restrictions have negatively impacted their lives and health\n- Criticism of the Attorney General for declining to attend and address questions about the laws\n- Calls for the state to prioritize the needs of women and families over politics\n\n**Votes**\nNone detected\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nThe session ended without a specific next meeting date mentioned."
  },
  {
    "video_id": "WFiNYICceNE",
    "url": "https://www.youtube.com/watch?v=WFiNYICceNE",
    "title": "5/29/2025 Sen. Islam Parkes Press Conference on Reproductive Rights in Georgia",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 19,
    "summary": "Here is a summary of the key points from the Georgia 5/29/2025 Sen. Islam Parkes Press Conference on Reproductive Rights in Georgia:\n\n**Overview:**\n- The press conference addressed the concerning situation of a brain-dead pregnant woman being kept on life support in Georgia, highlighting the ambiguity and potential harms caused by the state's restrictive abortion law.\n\n**Key Actions:**\n- **HB481**: Georgia's \"heartbeat\" abortion ban law, which is the subject of discussion and concern.\n\n**Bills Introduced (First Reading):**\n- No new bills were introduced during this press conference.\n\n**Notable Moments:**\n- Sen. Parkes called on Governor Camp to request a binding legal opinion from the Attorney General to clarify key questions about the abortion law's requirements and impacts.\n- Kasey Muroshak shared her personal story of facing barriers to care after a miscarriage due to the restrictive abortion law.\n- Speakers criticized the law for causing confusion, trauma, and harm to women and families, and called for the governor to provide clarity and leadership.\n\n**Votes:**\n- No votes were taken during this press conference.\n\n**Attendance:**\n- This was a press conference, so no quorum or attendance information was provided.\n\n**Adjournment:**\n- This was a press conference, not a legislative session, so there was no adjournment."
  },
  {
    "video_id": "owNh7YvZsvc",
    "url": "https://www.youtube.com/watch?v=owNh7YvZsvc",
    "title": "4/3/2025 | Sen. Merritt  GLBC Press Conference",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 43,
    "summary": "Here is a summary of the Georgia 4/3/2025 | Sen. Merritt GLBC Press Conference session:\n\n**Overview**: The Georgia Legislative Black Caucus (GLBC) held a press conference to address two pieces of \"unacceptable\" legislation (HB 127 and a bill impacting voting) and to stand in solidarity with the residents of Sparta who are facing eminent domain actions by a private railroad company.\n\n**Key Actions**:\n- **HB 127**: Described as an \"attack on DI programs in our state\"\n- **Bill impacting voting**: Works to reduce Black voter turnout\n\n**Bills Introduced (First Reading)**: None mentioned\n\n**Notable Moments**:\n- Rep. Al Williams gave a passionate speech condemning the eminent domain actions against Hancock County residents, drawing parallels to the civil rights movement.\n- Rep. Spencer Fry, an associate member of the GLBC, also spoke in support of the Sparta residents, highlighting the importance of generational land ownership.\n- Larry Raleigh of the Ados Advocacy Foundation spoke in solidarity with the Sparta landowners, decrying the history of land theft from Black families.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: No quorum notes provided.\n\n**Adjournment**: The transcript does not indicate when the press conference ended or the date of the next session."
  },
  {
    "video_id": "lJkwj4ScqJk",
    "url": "https://www.youtube.com/watch?v=lJkwj4ScqJk",
    "title": "4/3/2025 | Democratic Caucus Press Conference on HB127",
    "chamber": null,
    "session_type": "press",
    "day_number": null,
    "video_date": null,
    "duration_minutes": 9,
    "summary": "Here is a summary of the key points from the Georgia legislative session transcript on the Democratic Caucus press conference regarding HB 127:\n\n**Overview**:\nThe Democratic caucus strongly opposed HB 127, describing it as a bill that would take Georgia \"backwards\" on issues of race, discrimination, and civil rights. They accused the Republican Party of being \"afraid\" to condemn slavery and the Confederacy.\n\n**Key Actions**:\n- **HB 127**: A bill that was originally about providing extra sick days for teachers, but was amended by Republicans to include \"DEI\" (diversity, equity, and inclusion) provisions that the Democrats opposed.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- Democrats accused Republicans of trying to \"hide\" and \"sneak through\" the bill by bringing it up late at night.\n- Democrats said they were prepared to fight for \"5-6 hours\" to either defeat the bill or amend it, but were denied that opportunity.\n- Democrats criticized Republicans for not allowing amendments that would have affirmed that slavery was a cause of the Civil War and that evolution should be discussed.\n\n**Votes**:\nNo specific votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nNo adjournment time or next session date mentioned."
  }
]