{
  "video_id": "YfB6yA_MDMs",
  "url": "https://youtu.be/YfB6yA_MDMs?t=941",
  "title": "Georgia House - Day 6 (2026-01-27)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 6,
  "video_date": "2026-01-27",
  "duration_minutes": 90,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview:**\nThe session included discussion of the concept of \"GOAT\" (greatest of all time) and how true greatness is found in service to others, as exemplified by Jesus washing his disciples' feet. There was also some routine legislative business.\n\n**Key Actions:**\n**HB 1664:** No details provided\n**HB 30:** No details provided\n\n**Bills Introduced (First Reading):** \nNo new bills were introduced.\n\n**Notable Moments:**\n- Opening prayer and scripture reading by Pastor Billy Smith\n- Discussion of the meaning of being the \"GOAT\" (greatest of all time) in various contexts\n- Lesson from the Bible about Jesus exemplifying true greatness through serving others\n\n**Votes:**\nNo recorded votes mentioned.\n\n**Attendance:**\nQuorum was present, as all members voted to signify their presence.\n\n**Adjournment:**\nThe transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk will you unlock the machines. Yeah but I don't know if recognize or have immunisations and traditional flu relates or up to zero. Bernie. Well … … Have all members voted. I'll see a couple. have all members now voted themselves present. If so, Mr. Clerk, will you lock the machines? Will you keep us? Will you please close the doors and keep them closed? As is our custom, we will begin our day with scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain today is brought to us and will be introduced by the lady from the 135th House District, Beth Camp, chair-related camp. Thank you, Mr. Speaker. It's an honor to be here today to introduce Billy Smith. Billy Smith is a humble individual. He is the pastor of Christchapel Church in Zebulin, Georgia, which now has seven campuses. He is married to the lovely Tina, and they have four beautiful children, and their second to the youngest is here today, Max, and he's a guest here with his dad, and we're thankful for his presence here. In a world where a lot of people don't listen, I'm going to give Billy Smith a lot of credit. He listens to everyone. He is so kind and compassionate, and it's an honor to introduce him today. So, Pastor Billy Smith. Thank you, sir. Good morning. Thank you. It's an honor to be here once again to share some scripture and some thoughts for our morning devotion. Thank you, Representative Camp, and Mr. Speaker Burns. Thanks for the opportunity. In the English language, words change over time. It's something that meant something 25 years ago may mean something completely different now. And I'm learning that there's a generation behind me that uses words in a way that I completely don't understand. Maybe you have kids or grandkids, and they're saying stuff, and you're like, I don't know what you're talking about. But years ago, somebody would have called you a goat, or an old goat. That would not have been something that was very flattering. But the word has changed. You know, goat now is the greatest of all time, and for somebody that call you a goat is actually a wonderful thing. You know, so some of you guys, I'll give you a tip, go home and tell your old lady, hey, you're the goat, and see how that goes today. But explain to her, it means she's the greatest of all time, right? There's a controversy and conversations about goats and all kinds of different categories. If you're talking about basketball, then the current generation may say it's LeBron James or Steph Curry or a boo over here. If you're from my generation and watch basketball in the 80s and 90s, and then we would say it was definitely Michael Jordan is the goat. And if you're older than me, you watch Wilk Chamberlain. Maybe you're saying, no, young man, you don't know Wilk was the man. And soccer football around the world is what they call it. Maybe it's messy or Ronaldo. And in the business world, maybe people are considering the goats, people like Bill Gates or Warren Buffett. Jesus had some interesting things to say about people who wanted to be great. First of all, he didn't say it was wrong to want to be great. But he said there is some contingencies connected to greatness that your culture and your world are not going to teach you. And I want to read you a passage from Mark, chapter 10, verse 43. Jesus was speaking to his followers and he said, not so with you. Instead, whoever wants to be great among you must become a servant, must serve others. For even the Son of Man did not come to be served, but to serve others and to give his life as a ransom for many. It seems to me that Jesus is saying in the kingdom world, greatness is not determined by your status, but it's determined by your service, by what we give people. I would treat others. And Jesus didn't only teach this kind of servitude, but he lived it out often. It didn't take but a brief moment in the Gospels to see that Jesus was always looking for opportunities to help and serve other people. James and John got into a heated argument at the last supper. Maybe you're familiar with this. They wanted to know, could I sit on the left and he sit on the right when you take over Jesus? They thought he was going to have a earthly kingdom. That was not what he was here for. He was here for a bigger purpose to take care of our sin that humanity had created. I am so grateful for that today. But James and John were saying, hey, when you take over, we're the goat. Don't forget us. We're the elite. We want you to remember us. And Jesus, it's not in commentary, so I don't want you to think I'm mad in the scripture, but I can almost imagine his frustration after modeling servitude for so long. And here they are having the last supper. And James and John are fighting a Hoover who's the greatest. I think maybe Jesus probably shook his head and when these boys are never going to get it, they're just not going to figure it out. Jesus looked out there and what he saw when he looked at his followers at that supper was he saw proud hearts and dirty feet. There have been times in my life I didn't serve others because of my own pride and my arrogance, my self-importance. And Jesus is teaching us today that when we do it under the least of these, we do it under him. Jesus got up on that day when he saw dirty feet and he did what the other ones weren't willing to do. Everybody saw that their feet were dirty. It was custom in that culture that somebody would be positioned at the door to wash the feet of the disciples or whoever was entering the home. They had been traveling to make sure that their feet were clean and they were prepared and ready for the meal. And that detail had been overlooked. And Jesus saw that along with the other disciples but only one person stood up in that room and said, I will serve you today. Jesus got up from the meal. This is John, Chapter 13. Took off his outer clothing, wrapped the towel around his waist. After that, he poured water into a basin and began to wash the feet of the disciples, drying them with a towel that he had wrapped around him. What an amazing example. That the King of Glory, the God of the Universe, was looking for opportunities to serve others. I want to say this, you know, from just a citizen of the state of Georgia, I appreciate you guys serving our state. I think we got the best state in the United States. I believe that. And I think it's because of the people in this room. But I want to ask you, as I ask myself today, are we serving others the way that Jesus expects? A couple weeks ago, I watched a friend of mine take two days off from work to help another mutual friend who had recently gone through the tragedy of divorce. He took two days off of his job to help him move the contents of his home. I'm going to tell you something. You got to love somebody to help him move, kind of get an amen this morning, right? I don't know what had junk out there, but he served him. I watched a guy who lives in North Georgia who actually has a business in North Georgia in Canton, but he lives in Zabielin. He heard of the need of some middle school boys in our school who were missing some fathers. And they were making some bad decisions. And I watched a guy who's very busy and very successful. So you know what? I'll take two afternoons a month and come home early. I want to serve these boys. They have a future and we don't want to see it ruined. I recently have stood in front of my congregation and at other campuses that we have and asked people who attended the main service, the prime time service to say, hey, I want you to serve other people and go to a different service time. Of course we have people who are coming and they don't have seats and my family of five can't sit together. There's an expectation for us to prefer the other. And I watch people change their whole Sunday morning routine so they can serve other people and make sure that when they got the God's house they had a seat. I can do better in this regard. I think I could become a better server. I could look for needs. We have a staying at Christchoppe, find the need and meet it, find a hurt and heal it. I want to ask God to give us years to hear and I ask to see all the people around us that are hurting. Thank you for your time today. Would you stand and allow me to pray and after that we'll stay standing for the pledge. We'll go across this room or some really incredible leaders. People who have worked hard to find their place to help lead this wonderful state. I pray that today is a day that they make progress. I pray that this state becomes better than it's ever been. I believe in Georgia. I believe in the people in this room. And I pray that you honor them and bless their homes, their families, their businesses, their places where they worship. Would you bless them today? I pray those things in the wonderful name of Christ. Amen. Let's do the pledge. I pledge allegiance to the flag of the United States of America, to the Republic, to which it stands. We nation under God, indivisible, with liberty and justice for all. Thank you. You can be seated. Thank you, sir. Thank you, brother Billy. Thank you for that message. We thank you for your ministry. We thank you for your ministry at Christchoppe. We're going to take a photo. Thank you for what you're doing. Your success is evident. Doorkeepers, you may unlock the doors. Members, you can join brother Billy in the south any room for a photo and thank him for his message today. Thank you. Thank you. Members, our doctor of today is brought to us by a representative junior earhard of the 36th House District. Dr. Debbie Dalton, if you need any medical assistance, she's down in the medical aid station. Dr. Debbie Dalton, thank you, Dr. for being here today and taking care of these members. Thank you. Chairman Hilton, the chair of the Committee on Information and Audits, is recognized. Chairman Hilton. Good morning, Mr. Speaker. Rain, snow or sign. Today is a great day to be a Georgian. Your Committee on Information and Audits has read the journal the previous day and found it to be correct. Chairman Hilton, the chair of the Committee on Information and Audits, reports.\n\nThe court said the journal of the previous legislative day has been read and found to be correct. Is there any objection to dismiss with the reading of the journal? Chair, here's none. The reading the journal is dismissed with. Is there any objection to the confirmation of the journal? Chair, here's none. And the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Reptent of the administration of the 104th News following be established as the order of business under first part of the period unanimous consent, introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Hearing none, the resolution is adopted. First reading the bills and resolutions, the clerk will read. House bill 94 by Rubsan, the lump sum of the 12th Taylor, the 173rd Hawkins, the 27th Cooper, the 45th and Silcox, the 53rd. Bill B. Todd will act to amend chapter 24, title 33, the fiscal to Georgia and its editor, relating the insurance generally. Hilt. House bill 95 by Rubsan, a part of the 107th Jackson, 128th Griffin, a 149th Herring, and a 145th Clark, a 100th Nathan others. Bill B. Todd will act to amend chapter 7, a total of 48th, the fiscal to Georgia and its editor, relating the income taxes. Ways and means. House bill 96 by Rubsan, a part of the 107th Hewglie, and a 141st Iowa, the 50th Griffin, a 149th Clark, a 100th Nathan others. Bill B. Todd will act to amend chapter 11, a total of 48th, the fiscal to Georgia and its editor, relating the taxes on tobacco and vaping products. Ways and means. House bill 97 by Rubsan, a part of the 107th Griffin, a 149th Jackson, 128th and Herring and a 145th. Bill B. Todd will act to amend chapter 7, chapter 4, a total of 49, the fiscal to Georgia and its editor, relating the medical assistance generally. Public and community Hilt. House bill 98 by Rubsan, a Hewglie, the 141st Herring and a 145th Clark, a 100th Nathan, a part of the 149th Jackson, a hundred and eightth and others. Bill B. Todd will act to amend chapter 7, a total of 48th and the fiscal to Georgia and its editor, relating the income taxes. Ways and means. House bill 99 by Rubsan, a Hewglie, the 141st, a part of the 94th Buckner, the 137th Herring and a 145th Clark and a hundred and eightth and others. Bill B. Todd will act to amend chapter 7, a total of 48th and the fiscal to Georgia and its editor, relating the income taxes. Ways and means. House bill 100 by Representative Douglas, the 78th Hawkins, the 27th Hal, the 50th Prince of the 130th Second, the better than 94th and others. Bill B. Todd will act to amend chapter 24, a total of 33th and the fiscal to Georgia and its editor, relating the insurance generally. House bill 101 by Representative Douglas, the 78th Hawkins, the 27th Heavens, the 57th Kelly, the 16th Prince of the 130th Second and others. Bill B. Todd will act to amend part 1 of Article 1 of Chapter 18 and a total of 45 of the fiscal to Georgia and its editor, relating the state employees health insurance plan. House bill 102 by Representative Cooper, the 45th Newton, the 27th Silcox, the 53rd Hawkins, the 27th Hal, the 50th. Bill B. Todd will act to amend chapter 2, a total of 31 of the fiscal to Georgia and its editor, relating the apartment of the community health. Public and Community Health. House bill 103 by Representative Smith, the 138th Huttleson, the 72nd Buckner, the 137th. Bill B. Todd will act to amend and act to provide a homestead exemption for Troop County School District advalorem taxes. Intergovernmental coordination. House bill 104 by Representative Cox, the 28th, Jasper, the 11th, the 24th, Canada and the 172nd, NERWIN in the 32nd. Bill B. Todd will act to amend Article 6 of Chapter 2, a total of 20 of the fiscal to Georgia and its editor, the Quality Basic Education Act. Education. House bill 105 by Representative, the 9th, Gamble, the 15th, Haung, the 103rd, McDonald, the 3rd of the 26th, Erwin of the 32nd and others. Bill B. Todd will act to amend and act to code section 45, 9, 7, 80, the fiscal to Georgia and its editor, relating the payment of indemnification for death of disability. Education. House bill 106 by Representative Barnes, the 86th Westbrook of the 163rd, Alexander, the 66th, McClain and the 109th, left into the 83rd and others. Bill B. Todd will act to amend Article 6 of Chapter 2, a total of 20 of the fiscal to Georgia and its editor, relating the Quality Basic Education Act. Education. House bill 107 by Representative, the 147th, the 70th, Clark of the 100th, Jones to the 25th and Osteen to the 169th. Bill B. Todd will act to amend Chapter 1, a total of 43 of the fiscal to Georgia and its editor, relating the General Provisions, Professions and Businesses. Defense and Veterans Affairs. House bill 108 by Representative, the 73rd, Clark of the 100th, Prince of the 130th, Cannon in the 102nd, Hitchens in the 61st. Bill B. Todd will act to amend Part 2 of Article 15 to Chapter 1, a total of 10 of the official to Georgia and its editor, relating the Fair Businesses, Prats and the SACC of 1975. Defense and Veterans Affairs. House bill 109 by Representative Barnes, the 86th, Oliver, the 84th, Oliver, the 50th, Hutchinson to the 106th. Park of the 100th and 7th and others. Bill B. Todd will act to amend Title 37 of the official to Georgia and its editor, relating the Mental Health. Public and Community Health. House bill 110 by Representative, the 73rd, Palette of the 147th, Gull of the 19th, Clark of the 100th. Westbrook of the 163rd. Bill B. Todd will act to amend Part 5, Article 3, Chapter 12 of the Title 44 of the official to Georgia and its editor, relating the Pond Brokers. Defense and Veterans Affairs. House bill 111 by Representative, Pond of the 103rd, Gamble of the 15th, the Donald 3rd of the 26th. Way to the 9th, Williamson to the 112th and others. Bill B. Todd will act to amend Article 2, Chapter 7 of the Title 48 of the official to Georgia and its editor, relating the Impositionary Computation, Exemptions and Credits, relative to Income Taxes. Ways and Means. House bill 112 by Representative, Pond of the 3rd of the 26th, Hound of the 100th, Gamble of the 15th, Way to the 9th. Pond of the 33rd and others. Bill B. Todd will act to amend Chapter 7 of the Title 48 of the official to Georgia and its editor, relating to Income Taxes. Ways and Means. House bill 113 by Representative, Pond of the 3rd of the 26th, Hound of the 100th, Gamble of the 15th, Way to the 9th. Pond of the 33rd and others. Bill B. Todd will act to amend Title 50 of the official to Georgia and its editor, relating the State Government. Governmental Affairs. House bill 114 by Representative, Pond of the 3rd of the 26th, Crow of the 118th, Hits and Son of the 61st. Lofton to the 12th, Pair of the 24th. Bill B. Todd will act to amend Code Section 41-8 of the official to Georgia and its editor, relating the State Operations of Mortar Careers. Motor Vehicles. House bill 115 by Representative, Ptree of the 166th, Stevens the 164th. Franklin the 160th, Townsend the 179th. Deloge of the 167th and others. Bill B. Todd will act to amend Chapter 7 of the Title 52 of the official to Georgia and its editor, relating the Registration Operation and Sailor-Watercraft. Game, Vision, Parts. House bill 116 by Representative, Pond of the 3rd of the 26th. Crow of the 118th, Hits and Son of the 61st. Lofton to the 12th, Pair of the 24th. Bill B. Todd will act to amend our 5th Chapter 2 of Title 35 and Title 40 of the official to Georgia and its editor, relating the Motor Career Compliance Division. Motor Vehicles. House bill 117 by Representative, Ptree of the 166th, Williams the 168th, Townsend the 179th. Deloge the 167th and Franklin the 160th. Bill B. Todd will act to amend our 13th Chapter 2 of Title 26 of the official to Georgia and its editor, relating the Food Service Establishments. Agriculture and Consumer Affairs. House bill 118 by Representative, Townsend the 179th, Mithiac of the 82nd Hawkins, the 27th, Kelly the 16th, Newton the 127th and others. Bill B. Todd will act to amend Chapter 180, Title 20 of the official to Georgia and its editor, relating the Early Care and Learning. Education. House resolution 40 by Representative Douglas the 78th, Williams the 148th, Oklahoma the 101st, Taylor the 173rd, Hugley the 141st and others. Resolution creating House Study Committee on reassurance for essential industries. Special rules. House resolution 41 by Resolution of the 63rd, Mithiac of the 82nd, Jackson the 68th, Scott of the 67th, Davis of the 87th and others. Resolution urging Congress to reduce the waiting period for determination and approval. House resolution 42 by Resolution of the 15th, Long of the 100th, McDonald the 3rd, 26th, Wade of the 9th, Black men of the 146 and others. Resolution ratifying, Governor Brian P. Kimps executive orders number 10-1-24-02. Resolution 40 by Resolution of the 49th, Sanchez the 42nd, Canada the 58th, Roman of the 97th, Bill of the 75th, Parks of the 100th and 7th and others. Resolution recognized in January 18, 2025 as Manual Esteban Pays, Turan Day. Special rules. That completes First Readers. Second reading of bills and resolutions, the clerk will read House bill 67 by Representative Burns of the 159th, Jones of the 47th, Restoration of the 104th, hatch of the 150th, a bill to amend and act making and providing appropriations for State Physical Year beginning July 1, 2024, ending June 30, 2025. House bill 68 by Representative Burns of the 159, Jones of the 47th, Restoration of the 104th, hatch of the 150th, a bill to make and provide appropriations for the State Physical Year beginning July 1, 2025, ending June 30, 2026. House bill 69 by Representative Burns of the 159th, Jones of the 47th, Restoration of the 104th, a hatch of the 150th, a bill to amend and act, providing and making appropriations for the State Physical Year beginning July 1, 2024, ending June 30, 2025. House bill 69 says, M&D by Representative Burns of the 159th, Jones of the 47th, Restoration of the 104th, and hatch of the 150th, a bill to amend and act, making and providing appropriations for the State Physical Year beginning July 1, 2024, ending June 30, 2025. House bill 71 by Representative Burns of the 159th, Jones of the 47th, Restoration of the 104th, hatch of the 150th, a bill to make and provide appropriations for the State Physical Year beginning July 1, 2025, ending June 30, 2026. House bill 72 by Representative Burns of the 159th, Jones of the 47th, Restoration of the 104th, and hatch of the 150th, a bill to make and provide appropriations for the State Physical Year beginning July 1, 2025, ending June 30, 2026. House bill 73 by Representative Green of the 154th, a bill to amend and act, creating Board of Education of Seminal County. House bill 74 by Representative Powell, 33rd, Washington of the 144th, Chasper's of the 11th, Wilker's of the 38th, Oliver of the 84th and others, a bill to amend the Georgia Lottery for Education Act. House bill 75 by Representative Red leave the 22nd, Red leave the 6th, Horner of the 3rd, Tarvon of the 2nd, Chastain of the 7th and others, a bill relating to General Profissions Relative to Animal Protection. House bill 76 by Representative Evans of the 57th, Smith of the 138th, Barry of the 56th, a bill relating to development of Transportation Plans, Public Hearing, Approval of Plans by Board, Promulgation of Rules and Regulations by the Department of Transportation. House bill 97 by Representative Franklin of the 160th, Year to the 150th, Cameron of the 1st, Richardson of the 125th, Corb of the 174th, a bill relating to right away for operators of Motor Vehicles. House bill 78 by Representative Franklin of the 160th, Carsten of the 46th, Richardson of the 125th, Year to the 150th, Cameron of the 1st, a bill to amend the Public Retirement System Investment Authority Law. House bill 79 by Representative Newton of the 127th, Cooper of the 45th, Brains of the 99th, Hilton of the 48th, Stillcox of the 53rd and others, a bill relating to income taxes. House bill 80 by Representative Westbrook of the 163rd, Oliver of the 84th, Crawford of the 89th, Pairs of the 142nd, Stevens of the 164th, a bill relating to disposition of property seized. House bill 81 by Representative Ballard of the 147th, Irwin of the 32nd, Pounson of the 179th, Persinger of the 119th, Dubnick of the 29th and others, a bill relating to education compounds. House bill 82 by Representative Breeze of the 99th, Martinez of the 111th, Oliver of the 84th, Powell of the 33rd, Work Eyes of the 157th and others, a bill relating to labor and industrial relations. House bill 83 by Representative Owl of the 50th, Stevens of the 164th, Hawkins of the 27th, Green of the 154th, Buckner of the 137th, a bill relating to taxes on tobacco and vaping products. House bill 84 by Representative Owl of the 50th, Stevens of the 164th, Hawkins of the 27th, Green of the 154th, Buckner of the 137th, a bill relating to taxes. House bill 85 by Representative Lebron of the 123rd, F. 304th, Barchett of the 176th, Holling of the 103rd, Guntrods, 8th and others, a bill relating to general provisions concerning superior courts. House bill 86 by Representative Lebron of the 123rd, F. 304th, Barchett of the 176th, Holling of the 103rd, Guntrods, 8th and others, a bill relating to annual salaries of certain state officials and cost of living adjustments. House bill 87 by Representative Clark of the 100th, we now are the 121st, Mathiac of the 82nd, Williams of the 148th, Scoffield of the 63rd and others, a bill relating to insurance. House bill 88 by Representative Barnes of the 86th, Drener of the 85th, Clark of the 108th, Friday of the 120th, Bridal of the 77th and others, a bill relating to state veterinary education. House bill 89 by Representative Cooper of the 45th, Wade of the 9th, Gamble of the 15th, Holling of the 103rd, a bill relating to the Department of Public Health. House bill 90 by Representative Astration of the 104th, Dickey of the 134th, Hagen of the 156th, Barchett of the 137th, a bill relating to a preferential assessment for bona fide conservation use property and bona fide residential transitional property. House bill 91 by Representative Cooper of the 45th, Carpenter of the 4th, Jasper of the 11th, Dickey of the 134th, Camp of the 135th, a bill relating to licensing. House bill 92 by Representative Blackman of the 146th, Cali of the 16th, Williams of the 148th, Irwin of the 32nd, Washburn of the 144th, another is a bill relating to base year homestead exemption. House bill 93 by Representative Smith of the 18th, the bill relating to the number of judges of superior courts. House resolution 31 by Representative Levin of the 123rd, Powell of the 33rd, Resolution honoring the life of Mr. George R. This is our George Strickland Jr. dedicating a bridge in his memory. House resolution 32 by Representative Astration of the 104th, Dickey of the 134th, Hagen of the 156th, and Barchett of the 137th. The resolution proposing amendment to the Constitution so as to increase the maximum acreage to qualify for assessment taxation as a bona fide conservation use property through 2nd readers. Members, if you please take your seats, we're going to move on to morning orders. Members, please take your seats, have some important morning orders. We have some visitors in the gallery. We also want to recognize. Are you ready to represent Sanchez or are your folks here? Chair recognizes, Representative Sanchez for a morning order. I remember if you'll give the member in the well your attention. Yes, we have some visitors in the gallery. We're glad to have them here. Representative. Thank you so much, Mr. Speaker. Hello, everyone. I promise this one won't be as controversial, but today we have the Smirter Youth Council here today visiting us in the gallery and visiting the wonderful state legislature here. I will have to give a big welcome to them. It's so exciting to see so many young folks getting civically engaged because that's what we need for our community. So if you all will stand, please stand if you would like. Okay, help me give a big welcome. I hope you all enjoy your stay here. Thank you so much, Mr. Speaker. Are you the well? Thank you. It's good to have you all here with us today, young people. Appreciate you. President, the Chamber, and the Capitol. Representative Eric Bell. Representative Bell is recognized for a morning order. He has something for you. Thank you, Speaker, for our recommendation today. Members, colleagues, today on your desk, I dropped a book called Win with the Word. The book was written by my grandmother, Varianne, Doater of Georgia. During her time on this, she was an educator entrepreneur and worked in civil rights, particularly around teachers rights and the desecration of Brady Housepeel. But particularly this book, especially to me, because as we sit here, my grandmother is a Reverend, but I'm not. So I'm not going to quote scripture, but somewhere in the book, I mean, the great book, the Bible says, before there was all of this stuff, there was the Word. So remember, when we're writing bills, we're passing legislation, make sure we put in the Word first. And throughout, you can look on the table of context, and there's different things, regardless if it's here or in your life that you can go through. And particularly, I'd like to speak about warfare, because not only are we at spiritual warfare, we are economic warfare. We're at war against drugs, war against poverty, and even if they're at look across this world, we can see war across this earth. So before I go, I just want to leave you with a scripture. Romans, where is it? Sorry, speaker. Romans 10, 17. So then come, then faith comes by hearing and hearing by the Word of God. Thank you. I you're the will. Thank you, Representative. Representative Lisa Campbell is recognized for a morning order. Come on, come on, sad and bigger talking. Thank you, Mr. Speaker, and I welcome all friends. Yes. Yes. Thank you. Good morning, everyone. This morning marks the 35th anniversary of the implementation of the Georgia Planning Act, which you may know about. And it was established that the state of Georgia should maintain an essential public interest in protecting and preserving our natural resources, the environment, and vital areas of the state, as well as serve these interests through coordinated and comprehensive planning by all local governments. Today, today, we are recognizing six cities who have achieved this designation, and they are here in the capital over in Cap 230, if you'd like to meet with them. We are proud to recognize and honor the city of Acworth, the city of Alma, the city of Augusta, the city of Camilla, the city of Griffin, the city of Monroe, the city of Ticoa, and the city of Warner Robbins. If you are in the gallery, please stand up, and we'd like to recognize you. Great to see you, Warner Robbins. Thank you, everyone. Great recognition, cities from all over the state. Thank you, representatives. Representative Jones and representative Hugley, the minority leader, has a recognition. There are folks are here because they have such a large crowd, but we're going to recognize them and let them come. Speak to the morning order. Representative Jones and representative Hugley, and I thank some other friends who may join them as well. The lady is recognized. Thank you, Mr. Speaker. Ladies and gentlemen of the House. Today is AK Day at the Capitol, and we are hard to miss. As you move about, the Capitol, you will see pink and green everywhere. We have members from all over the state of Georgia here to meet and greet their legislators. We want to thank you all for the opportunity to come. We want to thank you in advance for greeting our members as they say hello to you and try and get you to know them. We want you to know. They want to get to know you. We also want you to know them because they are leaders in their communities all across Georgia. Thank you, Mr. Speaker, for the opportunity to recognize them. They're over in the Senate right now. But we're going to make sure you see them before they go. Thank you so much. Thank you, leader. We have an important day coming up. Is it today? Oh, look at this. Let's see that. Let's check it out. Oh, man. All right. Chairman Casey Carpenter is going to come speak to us. And then I'm going to really top that off. Oh, also Chairman Tarvan. Anyone else from for the for the Dalton day? General is recognized. Thank you, Mr. Speaker. All right, folks. You know what day it is, baby? Is rug day at the Capitol? Put your hands together. Rugs, not drugs. You know the drill. I've been saying that for seven eight years now. Rugs, not drugs, baby. The carpet industry, an eight billion dollar industry. Northwest Georgia provides over 50% of the world's carpet and rugs. 46,000 jobs this industry provides and hard surfaces now. So tonight, freight depot four to six. Come down. Have something to eat. Have something to drink. Come get your rugs. We appreciate you. And we just want to give a shout out to the industry. This made such such an impact on our community. We'll see you there tonight, folks. That's cool rug. Let me see it again. Home sweet home. Awesome. Good stuff. We appreciate that. Those are those are great rugs. I should have brought them to use at my house. Members of. Let me let me have your attention just for a moment. Your full attention. We have a member of this house. Chairman Tom Dixon, who's had a great career at public service. Hold it just a minute. Don't clap yet. I had a great career in public service as he served in this house. Any years you served on. You came in with the best class that's come into this house. An hour class. With. Chief of staff and Sheila Jones. Representative Jones. There she is. Right over there. We all came in together a few years back. He's gone on to continue serving his community as mayor. And is here of course today with GMA and doing great work with them. Chair at education appropriations when he was here. So a good, good man. Great service of George. Y'all stand with me and welcome a distinguished member of this house. Former member of this house, Tom Dixon. Tom. All former members don't get this opportunity, but I'm going to let this one do it cause he was so important this house, Tom. What I really wanted to say. First of all, it's always great to come back and see friends. I need to make some new friends because the old friends are leaving. But the other thing that I wanted to say, I have been eternally grateful that you elected this man as your speaker. You have a you made a wise choice. Thank you Tom. I appreciate you. Take care of yourself. We look forward to seeing you again soon. Don't be a stranger. That completes our morning orders and our recognitions. Thank you. Mr. Clerk, will you read the caps into a group of privileged resolutions? Honoring the life and memory of Marvin Gary Simmons. Honoring the life and memory of Emily L. Milner. Honoring several cities upon the designation is Georgia, planned first communities, congratulating Kristen Rip and Gavin Haslid in the 2024 Literary State Champions and dramatic interpretation. The United States is a capital. Commending AHIMSA and gun violence. Commending Mary DeSus' Sikara. Congratulations on the American Business Association of Atlanta upon its 32nd anniversary in recognizing commending the Chin Hung School of Kung Fu. The University of Georgia 4H program, Kingston Riles, Melanie Bearsmith and the 2024 2025 4H Leadership Teams and recognizing February 25th. 2025 is 4H.\n\nday at the State Capitol and commending Kia's vehicle manufacturing and impact on the state and recognizing January 28, 2025 as Kia Day at the State Capitol and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolution chair here is known and the resolutions are adopted? Members if you will return to your seats. If you take your seats we have a couple resolutions that we're going to consider now very, very important, very solemn. So, if members if you will return to your seats, cease conversations. Give you just a moment to return to your seats. Today is Holocaust Remembrance Day. Chair Lady Silcox has an afternoon order. We will begin my afternoon orders with my recognizing representative Silcox but first I'm going to ask the clerk if you'll read the caption to the resolution and then you're recognized representative. House resolution 50. The members will stand please. Yes. By representative Silcox the 53rd resolution recognizing January 27, 2025 as international Holocaust Remembrance Day and for other purposes. Representative Silcox is recognized. Thank you, Mr. Speaker. Ladies and gentlemen, I rise today in recognition of international Holocaust Remembrance Day. We are honored today to have some important guests with us. Council General Anat Sultan Dodan as well as the executive director of the Georgia Commission on the Holocaust Sally Levine as well as commission members Robert Weinstein, Manipiaco and David Burmberry. As a member of the Georgia Holocaust Commission on the Holocaust, I want to thank Speaker Burns and for all of the spotty for the passage of HB 30 a little over a year ago today. This bill defined anti-Semitism in Georgia so it can be prosecuted as part of a hate crime. I also thank God for the release of some of the hostages in Israel and I pray for the release of all the hostages. It is important today to remember the Holocaust. The world stood silently in the 1930s and 40s as millions of Jews were murdered. This should never ever happen again. The anti-Semitism that led to the Holocaust then is unfortunately alive and well today, especially given the attack on October 7, 2023 and acts against the Jewish people since then worldwide. Today is also remarkable because it is the 80th anniversary of the liberation of the constant-cretation camp Auschwitz-Burkenau. Please allow me to read the resolution that details this event. Whereas the Holocaust was a state-sponsored systematic persecution and annihilation of European Jews by Nazi Germany and its collaborators between 1933 and 1945, resulting in the murder of over 6 million Jews as well as the oppression and deaths of many others, including Roma, people with disabilities and Polish people. Whereas in 1998 HB 1664 was passed by the Georgia legislature establishing the Georgia Commission on the Holocaust as a permanent state agency charging it with creating educational programs for citizens and operating as a secular non-provisant partisan entity. Whereas the Georgia Commission on the Holocaust is tasked with preserving the memory of the Holocaust, promoting public understanding of its history and reminding citizens to remain vigilant against hatred, anti-Semitism, persecution, and genocide. Whereas January 27, the anniversary of the liberation of Auschwitz-Burkenau is observed as international Holocaust remembered day to memorialize these 6 million victims of the Holocaust and the others who were persecuted by the Nazis. Whereas January 27 marks the 80th anniversary of the liberation of Auschwitz, a critical time to honor the victims, survivors, and liberators while recognizing the lessons of Holocaust history missed an alarming global rise in anti-Semitism. Whereas located in German occupied Oppolun, Auschwitz consisted of three camps, including Burkenau, a killing center where over a million victims were systematically murdered by individuals and professionals involved in its operations. Whereas trains carrying Jews from Nazi occupied land and allied Europe regularly arrived at Auschwitz where its leadership and workers conduct in these systematic killings over nearly five years. Whereas in mid-45, Soviet forces approached Auschwitz, SS units forcefully evacuated nearly 60,000 prisoners on death marches under brutal winter conditions, resulting in thousands of deaths from starvation, exposure, and violence. Whereas the Soviet army liberated Auschwitz, freeing the remaining 7,000 prisoners, many of whom were sick and dying, ending the camp's operation. Whereas we, the people of Georgia, joined communities throughout the world today in commemorating this very special International Holocaust Remembrance Day and honoring the victims, survivors, and liberators of the Holocaust. I thank you, Mr. Speaker and members of the House for your attention. I yield well. Ladies, you will. Thank you members. Thank you members for this House for standing strong in support of our friends. Stories still to me told us soon forgotten, we must always tell the story of the Holocaust and how our greatest generation came together to stop out that evil, the midst of our world. And our thoughts and prayers still go out those survivors and their families. Thank you, Representative. We have another couple of remembrances of some lives that folks have gone on to be in a better place. So with that, I'm going to recognize Chairman Dickie. I'm going to ask the membership if you will stand again, please, for these next couple of. I like to ask you a Monroe County delegation. I don't see a Monroe County. We're here. Monroe County lost a longtime citizen last week and I just wanted to recognize the life of Benson Ham, a former legislator in this body for 10 years. But he grew up in a little small unincorporated place called Smarr in Monroe County and got his legal degree and grew up there and practiced all their entire life. But anything that went on in Monroe County for many years went through Benson Ham and he was a great friend to that community. He loved it. He loved agriculture. He served here as I said for 10 years, followed by son and law, I believe, Curtis Jenkins. But he's on the state board of elections for many years. Chairman of the Monroe County Board of Education for 13 years, guided it through desegregation and funding for New High School. And also so active in economic development during his term, Plant Chair, located there as well as Georgia Public Safety Training Center. That's the kind of man, Benson Ham was. He went on to serve later in electric rule electrification, chairman of Central Georgia Electric Membership, Corporative and President of the National Rule Utilities Finance Corporation. So Benson Ham as well as a director for Farm Bureau, his resume is a bit where he just went on and on and on and just wanted to say thank you, Benson, for all he worked, he did for Monroe County for 93 years and his entire family. He was a real star work of that community. So let's have a moment of silence if you would. Thank you, Mr. Speaker. Chairman Dick, if you're remaining in the well, I think you have a no-the-after-in-order. I think we could I do that another day. Another day, okay. Absolutely. If you're remaining standing, I'm going to recognize Representative Kelly for your remembrance. Thank you, Mr. Speaker, members of the House. Friday, just today, after his 90th birthday, the Polk County Community lost one of our most treasurer's citizens in the Pascale of Guy, Rutland. Mr. Rutland was married to his wife, Linda, for over 44 years, two children together, Ashley and Judd. Mr. Rutland was a remarkable individual. He was a teacher and coach for over 33 years. He graduated from Cedar Town High School, Jacksonville State University. He was really proud of his gamecots and got his master's from middle Tennessee State University. He was also a farmer and entrepreneur. He started Christmas Tree City, where he sold Christmas trees for over 47 years. After his career in teaching and coaching, he remained active in our community as a member of the Retired Teachers Association, our Catalyst Association, and was just beloved by all who knew him. I was honored to call him a friend and while our work today will keep me from attending his funeral, at the day I want his family to know that they're our thoughts and our prayers. If you'll please join me in a moment of silence from Mr. Guy Rutland. Thank you, Mr. Speaker. I yield the web. Thank you, Representative. And our thoughts and prayers do go out those, but also thank you all for recognizing these folks. Members, you can be seated for our lives well-lived. Thank you for your respect, members, as the members that came to the well-directed out of these families. Okay, we have another great honor. Chairman Martin comes coming down with some friends from the University of Georgia, UGA. Chairman Martin, so if you're a friend of University of Georgia, it'll be a good time for you to show up here. Representative Evans, I know you are as well. You're a double dog, aren't you? Yeah. Todd Jones is coming up. Come on down, brother. Oh, he's at least standing. You're about to get the full crowd down here, Chairman Martin. I thank you. It comes with Majority Leader. We need you down here, Majority Leader. I thank you for a dog fan as well. You've given the gentleman in the well, your attention. I think I have to announce that. Report of the announcement. Chairman Martin. Thank you, Mr. Speaker and members. After those solemn remembrances, I bring something that we can celebrate and something that I hope was a part of those folks' lives. Today, January 27th, 2025, is the 240th anniversary of the University of Georgia founded in 1785. The University of Georgia is chartered in 1785 as the birthplace of higher education in America, launching our nation's tradition of world-class education. The charter was established by the University of Georgia as the nation's first state or nation's first state university. Today, public education creates tens of millions of informed citizens. UGA is the number 16 public university in the country. It has over 50 Marshall and Rhodes Scholars and other prestigious postgraduate scholarship. It's the top five, in the top five universities for getting products to market. More than these things and more than a land and a building, UGA is tradition and it grows stronger every year with every student and every class asks you to give the University of Georgia on its 240th birthday a round of applause and our thanks for leading our state. Thank you, New York University. Go Dogg go dogg! Congratulations, Ca360. Fabulous land grant university. Thank you for that. Representative Chairman Martin. Representative Reese. Representative Teddy Reese. Members, if you'll give the gentleman about to be in the well, your attention. So, it's me and just for a second, sir, let me. Another important announcement. Representative Reese. Thank you, Mr. Speaker. Thank you so much for this opportunity to stay here today. Today, we recognize this weekend the celebration of a founding of a very important organization, especially for the growth and development of African American children. And that is Jack and Jill of America. Jack and Jill was founded in 1938 and Philadelphia, Pennsylvania, with initially 10 chapters. We now have 271 chapters across the United States of America representing 50,000 kids here in the United States. Last year, we were represented by an amazing president who served as from Columbus, Georgia. And this year, we are honored to be under the leadership of President Garline McGee, Winninton, right here from Atlanta, Georgia. So, Mr. Speaker, it is true. Some of the best leadership comes right here from the peace state. Thank you so much for your opportunity. Thank you so much for your opportunity. No doubt about that. We can all agree on that. Thanks for what Jack and Jill foundation is doing. That completes our afternoon orders. Now, we'll move on to announcements. We'll give you a couple of for you to be ready to be on deck. We're going to start with Representative Betsy Holland. Representative Hollins is up. Then Representative Henderson, Representative Clark and Representative Eftration are on deck. Representative Betsy Holland is recognized for an announcement. Thank you, Mr. Speaker. So, just a reminder for the House Atlanta delegation, we will be having a delegation meeting upon adjournment in room CLOB502, the Atlanta delegation. Thank you. Thank you, Representative. Representative Henderson, she was on deck. No doubt. Ladies recognized. Thank you, Mr. Speaker. Tuesday, February 4th is a very big day here at the Capitol. World Cancer Prevention Day at the Capitol. In recognition of breast cancer, survivors, and those that are going through treatment, and prostate cancer, survivors, and those that are going through treatment. We're asking women and notation of breast cancer to please wear a pink and men to please wear a blue and recognition of those that are going through prostate cancer. We thank you. We support you. We want them to know. We love them and we pray for them in Jesus' name. Remember them. Remember there is no hope for cancer, but early detection saved lives. Early detection saved my life. Thank you, Mr. Speaker. Thank you, Representative. And I hope everyone will heed those messages. We're glad you're early detected. Representative Jasmine Clark, is recognized for an announcement. Thank you, Mr. Speaker. I actually have a couple of announcements. Georgia Future Caucus. Tomorrow at noon, we will have the future caucus lunch. In case you're wondering who is the future caucus, it is any legislator, age 45 and under. Also tomorrow at noon, sorry, tomorrow at 1 o'clock, the Gwinnett delegation will meet as well. Thank you, Representative. Leader, the leader of the station is recognized for an announcement. Thank you, Mr. Speaker. The Committee Chairman's lunch is on Wednesday this week. If you're a chair of a committee, it's on Wednesday. And if you would just let my office know, if you will be attending, we would very much appreciate that. Thank you, Mr. Speaker. Representative David Clark, then we will have Representative Hilton, Cummings and Mix on Deck. Representative Clark. I wanted to invite all the House members tomorrow from 8 to 12 noon. Tomorrow we are supporting Georgia with prosthetic and orthotic health care challenges, knowing about how Georgia lim, loss and lim difference awareness at the Capitol. And we have two big superstars coming down. The first one we have, he will be here from 8, 30 to 9, 30 in the morning. Muhammad Masquat, he played for Georgia, Go Dogs, played NFL, and he lost a hand in ATV accident. So he will be here 8, 30 to 9, 30. Take pictures, meet him, he will be here. And we also have from 8, 8, 12 noon, a three time, Paralympian and bronze medal winner, Jared Wallace, he will be here. So we would love to have him come out. This event is known as so everybody can move, it will feature advocates, health care providers, university programs, hospitals, and most important to the patient. So please come out tomorrow 8, 8, 8, 30 to 9, 30, Muhammad Masquat, and the Olympian also. Thank you all. Excuse me, Representative, where will that be? It will be on these south steps, second floor. Thank you all. Thank you. Representative Hilton, chairman Hilton, recognize for announcement. Thank you, Mr. Speaker. Tomorrow intuitive surgical will be here on campus. Thanks to Georgia's friendly business environment, intuitive surgical recently moved their east-close global hub to Peachtree corners, bringing over a thousand jobs with them. Intuitive surgical operates, manufactures the DaVinci device. They will have their truck here tomorrow, where you will have a chance to actually use the DaVinci device. They allowed me to operate on pigs recently. I have no idea if we will have any livestock out there, but you will have a chance to use the DaVinci device. I get to know intuitive surgical. As a thanks to their visit, I know some of you are accident prone. We do have a little first aid kit here. Enjoy that over the next 40 days. And get out and visit. There will be on Mitchell Street right between CLOB and the Capitol. Thank you, Mr. Speaker. Representative Terry Cummins is recognized for announcement. The COB delegation will meet in CLOB 510 at 12 noon. Thank you. I am going to bring you back on the other one. I think it is Chairman Hitchens' favorite event to go to. I believe that is correct, Mr. Speaker. Ladies and gentlemen, last year some of you were disappointed when the Alma Bacon County delegation came up and did their annual cookout over the IBEW building because you missed it. Well, that will be tomorrow, January 28th, beginning at 5 o'clock until. Now, you have the invite on your desk. Looks like they have added a new couple of new things this year, including road keel and pine tar. So Colonel, I don't know what they will be putting it in, but I hope we will all come out and enjoy it. Ladies and gentlemen, please join Alma Bacon County, the blueberry capital of the world tomorrow, 5 o'clock until the IBEW building for their annual see-through cookout. Thank you. Did you say pine tar? It is what the menu ingredient says, yes sir. Well, I am looking forward to that one. Thank you, Mr. Chairman. Representative Gamble. There you are. Record eyes for the announcement. Thank you, Mr. Speaker. Tomorrow morning we will kick off the fellowship for the first time this year at 7 a.m. in the House Judiciary Committee Room, which is a capital 132 downstairs. And I want to invite all members that would like to pray and fellowship to be with us in the morning. It is a powerful group, and I think you will get a lot out of it. Thank you, Mr. Speaker. Pay attention to that group. Our representative cannon, representative Park Cannon, is recognized for an announcement. Give the lady your attention please. Thank you. Thank you, Mr. Speaker. Today the Fulton County delegation will meet. That is 22 of us here in the House. We have to have Quorum in order to do our elections and also to sign our rules to get them in. It will be at 4 o'clock in Capital Room 216. If you need a digital access link, please let representative Inga Willis know or representative Bryce Berry, or representative Makiya McQueen. The meeting should take no longer than 30 minutes. That is for the Fulton County House delegation and the Fulton County House board of education delegation. 22 members and 19 members. If you have any questions, please let me know. Thank you, Mr. Speaker. Thank you, Representative Cannon. Representative Beesbore, you need to come down to help. You're good. Thank you, Representative. You're good. You're good. Representative Beesbore is recognized for an announcement. Thank you, Mr. Speaker. Just a reminder to the City of South Fulton delegation, our meeting will be at 2 o'clock in Room 514. 2 o'clock, 514 and lunch will be provided. Thank you. Thank you, Representative. All right, members. As y'all know, we had a little bit of an inclement weather last week. So we are going to have to speed up the process. So we are going to have to begin some very important meetings, so I'm going to let the chairs of those subcommittees come up now. We'll start with Representative Gullett to come up and give you some information about the timing on his meetings. Representative Gullett. Thank you, Mr. Speaker. Today, the appropriations subcommittee on judicial will meet at 1 o'clock in the CLAB Room 406. Again, 1 o'clock CLAB for the subcommittee on judicial. Thank you, Mr. Speaker. 1 o'clock 406 LOP, judicial subcommittee. Got you. Chairman Meeks, you're recognized for an announcement. Thank you, Mr. Speaker. Your House subcommittee appropriations, the economic development will meet at 1 o'clock and 341 here in the capital. 1 o'clock 341, House subcommittee on the economic development. Thank you, Mr. Chairman. Representative Hitchens, you have an announcement. We're just going to talk about Alba Becken County. You can do both. Thank you, Mr. Speaker. The truth is, Alba Becken County is probably the best night. And so far as the roadkill concerned, I may have been taken through the years and a little bit of roadkill, but today I tell people I'm roadkill on the information highway. I'm so old, this computer generation is taking me back. Today at 1 o'clock, the public safety appropriations subcommittee will meet in room 415. Public safety appropriations room 415 CLLB at 1 o'clock. Representative Corbett has an announcement. Thank you, Mr. Speaker. The Motor Vehicles Committee will meet at 8 o'clock in the morning, room 606. We'll be adopting our committee rules and getting to update from DOR and DDS in the morning. Thank you all. I had you down for the appropriations announcement. You could be. You may want to be, huh? Be careful. Be careful what you ask for. It may come true. That completes our announcements. No more announcements. I don't think we have any birthdays, do we? Does anybody want to need to mess up? They have a birthday today. I don't think so. Majority Leader is recognized for emotion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Tuesday, January 28, 2025. Before I acknowledge the Majority Leader's motion, I want to remind all of the members tomorrow that we have a joint session with the Senate as we are here from the Chief Justice of the Supreme Court of Georgia, the gentleman who is a former member of this house, who swore us all in a couple of weeks ago, Chief Justice Boggs. So make sure you're here and you seats on time. All the motion to the Majority Leader's just house stand adjourned until Tuesday, January 28, at 10 a.m. All those in favor of that motion will say aye. You all live it here, don't you? All those opposed will say no. Yes. The eyes clearly have it. We're adjourned. Thank you all for your attention. Now, front, we do have pages a day. We have some page photos.\n\n",
  "updated_at": "2026-02-13T19:16:01.174975+00:00"
}