{
  "video_id": "YFYGJ2MOBuA",
  "url": "https://www.youtube.com/watch?v=YFYGJ2MOBuA",
  "title": "DBHDD Commissioner on Georgia's Mental Health Issues",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Overview:\nThe key highlights from this session with Georgia Department of Behavioral Health and Developmental Disabilities (DBHDD) Commissioner Kevin Tanner include the agency's role in forensic services, the challenges with limited state hospital beds, and new initiatives to address the needs of individuals with intellectual and developmental disabilities (IDD) who end up in emergency rooms.\n\nKey Actions:\nNo bills were discussed or passed in this session.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Commissioner Tanner explained DBHDD's responsibility for determining competency to stand trial and restoring competency for those found incompetent.\n- He noted the lack of state hospital beds, with nearly 800 individuals in jail waiting for a bed, and the long wait times of over a year on average.\n- Tanner discussed plans for a new 16-bed crisis stabilization and diagnostic center for the IDD population, which will provide comprehensive medical and psychiatric care.\n- He also mentioned opening pilot group homes to step down individuals from hospitals and getting approval from CMS for new Medicaid placement options for the \"hard to place\" IDD population.\n- Tanner highlighted workforce challenges, with DBHDD losing over 1,200 employees during COVID, and efforts to boost recruitment and retention, including partnerships with universities.\n\nVotes:\nNo votes were mentioned.\n\nAttendance:\nNo specific quorum notes were provided.\n\nAdjournment:\nNo adjournment information was given.",
  "transcript": "We're going to spend the show focusing on some of Georgia's most vulnerable citizens\nand the state agency working to make a difference in their lives.\nThe Georgia Department of Behavioral Health and Developmental Disabilities, DBHDD.\nI sat down with the man who heads DBHDD, Commissioner Kevin Tanner.\nWe talked about a range of topics, from ways to boost a workforce that shrank during\nthe pandemic to how the agency is looking to add more beds for people in crisis.\nWe began with the agency's role in forensic services.\nDBHDD receives court orders to determine\nif a person is competent to stand trial\nor can accept criminal responsibility\nunder an insanity defense.\nUnder the code, we're responsible\nfor the restoration work.\nAnd what that means is if someone's been charged\nwith a crime and their defense attorney\nor their family or the prosecutor brings to the judge\nand says, you know, I think that my client may have not\nbe competent.\nThey may not be able to help me participate in their\ncriminal defense because of a mental illness.\nThen the judge can sign an order that would require our\nagency to have a licensed clinical psychologist, a PhD\nlevel psychologist, do an evaluation.\nIf after doing that evaluation, it's determined that\nthe person is indeed not competent, then the\npsychologist will make a determination on whether they\nthey believe the person's restorable.\nIf they believe the person's restorable,\nthey're saying in their professional medical opinion\nthat the person could be with treatment restored to competency.\nAnd then typically what happens,\nthat reports given to the judge, the court,\nand then the judge will typically issue another order\nthat says your order to go to the state,\nto DBHDD, our agency, to be restored to competency.\nAnd once that happens, they go on a wait list.\nand we bring them to one of our hospitals.\nAnd when that happens,\nyou also don't have enough beds for all of that\nfor everybody who may need that help.\nTalk about that a little bit.\nYeah, that's what people often ask me\nwhat keeps me up at night in this role\nand that's definitely it.\nAnd it's because we have almost 800 individuals in jail\ntoday waiting on a state hospital bed.\nAnd it takes on average over a year now\nfor a male to come into the state hospital system\nonce we've received the order.\nNow, they could have been in jail\nfor some time waiting on the evaluation\nand then some time waiting on the order.\nBut once we've received it, it's taking a year or more.\nWe only have an entire state of Georgia.\nWe only have 641 forensic beds.\nNow, 60% roughly of those beds\nhave people who have been ordered to us\nnot guilty by reason of insanity.\nAnd what that is, that's different\nthan not being competent.\nThat's someone who's been charged with a crime.\nIt's often a serious crime.\nAnd the court has made the determination.\nThis person's not guilty because they have such a severe illness,\nsuch a severe mental illness,\nthey don't know the difference between right and wrong.\nAnd they're ordered by the court to come to us.\nThe average length of stay for that population is six years.\nWe have people who've been with us for 20 plus years\nat the state hospital.\nSo I only have about 300 beds in the entire state\nfor restoration services.\nand I have 800 people waiting on one of those beds.\nI want to talk a little bit about your making crisis\nstabilization and diagnostic center.\nThat's a project that I'm extremely excited about.\nIt's really getting a lot of national attention.\nSo we are also responsible for the intellectual\ndevelopment on disability population.\nAnd we run the now comp waiver services\nthrough the Medicaid waiver program.\nBut we have certain individuals who\nare what we call hard to place.\nThey end up being stuck in an emergency room.\nThey may have co-occurring IDD behavioral health illness.\nThey may have a behavioral issue.\nThey may have a physical element.\nBut for whatever reason, they end up\nfinding themselves in an emergency room.\nAnd we have a challenging time,\nsometimes finding a provider that will take the individual.\nSo we have a off-challenged Airste team and our staff\nand with the support of the General Assembly\nand the governor, we've identified some long-term solutions.\nOne of those is the facility that you just mentioned.\nAnd it will be a 16-bed, impatient,\ncross-estabilization facility for the IDD population.\nIt will have physical health, mental health,\ndoctors who are experts in treating an individual with IDD.\nIt'll also have things like OBGYN, dermatology.\nWhatever service is the individual may need,\nthey'll come there.\nSo they're stuck in an emergency room.\nwe'll bring them to this facility,\nthey'll be stabilized,\nand then they'll be able to step down\ninto a community-based service.\nThe other thing I'm really excited about at this facility,\nthough, is gonna have a very robust outpatient component.\nAnd we're contracting with Mercer Medical School,\nand Mercer Medical School is gonna run\nthe outpatient component.\nAnd why that's exciting is,\nthey're going to bring their docs\nwho are in training through this outpatient center,\nand they're gonna train those doctors.\nSo as they go out and rule parts, especially of the state,\nthey're going to know how to take care of sometimes\nthis challenging population to care for medically.\nSo it's a game changer for our system,\nand that's fully funded in the budget.\nAnd that should open toward the end of May of this year.\nIt's under construction now.\nThe other thing that we identified\nis we're going to have to have good places\nto step those individuals down into community settings.\nSo we've opened two pilot homes over in the Augusta area.\nthere are four beds each.\nAnd we have reduced the number of people in a hospital\nby over 33% in the last year.\nWe're also in the process of doing two additional homes\nin Macon.\nAnd the other thing that is exciting\nis we sent up a proposal to CMS,\nwhich is the Federal Medicaid Agency.\nAnd they've approved three types of placements\nthat we haven't had before.\nThat's more intense for the hard to place individual.\nAnd we're in the process of building out that network.\nSo my prediction is, in the next two years,\nby the end of the next two years,\nwe'll have no one stuck in an emergency room waiting on a bed.\nWe're gonna have a system in place\nto take care of that population.\nQuite a large workforce,\nbut I know that there are some vacancies\nyou'd like to see filled by qualified people.\nWe operate five state hospitals,\nand during COVID, we lost over 1,200 employees\nthat lay off the workforce and went somewhere else\nfor higher pay.\nAgain, thanks to the governor\nin the General Assembly and some targeted pay increases\nand some across the board, state employee pay increases.\nWe've been able to start, turn the tide on that.\nWe've brought back a lot of individuals and started,\nwe also have a department within our agency\nthat is laser focused on recruitment and retention,\nthe O-Cartidus tremendous job leading that effort for us\nand it's making a difference.\nWe also have a large number of partnerships\nthat we have forged with universities\nand technical schools to help turn out folks.\nI'm going to be having dinner with one of our university\npresidents here in a couple of weeks.\nAnd we're working closely with them\nto try to create a PhD-level psychology program\nfor someone who's actually working in the field today.\nThe only way I have 50 people that work for me\nwho's interested in getting a PhD\nto have a master-level psychology degree,\ntheir master-level psychologist.\nBut in order for them to be able to do the evaluations we\ntalked about to be able to testifies an expert in court,\nthey have to be a PhD level loss and psychologist.\nI have a 35% vacancy rate in that area.\nI have 50 people who would love to fill those roles.\nBut in order to get that education in Georgia,\nthey would have to quit their job and go to school full time.\nSo it's been done in some other areas around the state.\nIt's been done in law enforcement space\nwith the Georgia Law Enforcement Command College.\nIt's been done with public administration\nand some other areas.\nSo we're having some serious conversations\nas an agency about how can we partner\nwith the university system to create cohorts\nin a pathway to help with the workforce.\nI'm gonna be going to one of the medical schools soon\nto talk to their medical students about.\nNumber one, consider a field as a psychiatrist.\nConsider going into that.\nNumber two, consider the public sector.\nConsider coming to work for us.\nconsider the state. I tell young people all the time that you know I've got a\nstaff of over 4,500 employees in a large budget and a lot of stress and\nsometimes it can be challenging and frustrating and because some of the\nproblems are frustrating but all I have to do is pick a date and go to one of\nour hospitals spend time with our staff, our nurses, our doctors and our\npatients and to see the miracles that are being performed within the walls of\na hospital every day where they take an individual who is extremely sick that has a severe illness\nthat may be in a place where they're very difficult to even just handle but get them to a place\nwhere they're and I'm thinking about one in particular where the lady had been in that case,\nhad been only unit by herself because of how challenging she was and when I was there she was\nout in the courtyard reading a poem she had wrote about her recovery and her journey and she had\nhope because she had found the right medication regimen. She had found the right people to\nhelp her, to be with her, to walk with her. And for the first time, probably in a long\ntime, she had hope restored to her. So if I can get young people to be able to see that\nside of what we do every day, they get up and go to work every day, make having miracles,\nI think we'll be able to turn the tide and are staffing.\nYeah, my final question was going to be what, you know, you came in in 2022, so in this\nperiod of time, you look back on all you've accomplished, it sounds like you just told\nme that answer, like the things that make you feel really good about what has happened\nsince you've been commissioner of this department.\nYeah, you know, when Governor Camp reached out to me and asked me about taking this role,\nI wasn't seeking the job, I wasn't looking for a job.\nBut, you know, I called a person that I have great respect for and asked them what they\nthought.\nAnd they said, you know, Kevin, only a few opportunities will ever come along in your\nlife where you can truly make a difference.\nAnd when they come along, you have to take them.\nAnd so I took this role because I felt like that we needed to make a difference.\nAnd what I have found is we have a dedicated group of men and women across Georgia who are\nor D.B.H.D., who are now filling and powered to be creative and to create change in the\nsystem and their performance miracles every day.\nThe budget passed by the House today calls for more money for D.B.H.D., including to\nextend forensic services and to add a jail diversion program and outreach services for\nthose with severe mental illness.\nI want to thank Commissioner Tanner for talking to me.\n",
  "updated_at": "2026-02-12T01:31:20.756051+00:00"
}