{
  "video_id": "YjuqBk_K0SE",
  "url": "https://www.youtube.com/watch?v=YjuqBk_K0SE",
  "title": "1/22/2024 Senate Committee on Health and Human Services",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 79,
  "summary": "Based on the transcript provided, which does not contain any substantive legislative action, I can provide the following summary:\n\n**Overview**: This appears to be a routine meeting of the Georgia Senate Committee on Health and Human Services. The committee discussed a simple bill to change the time limit for pronouncement of death from 180 days to 60 days, but no other significant legislation was considered.\n\n**Key Actions**: None detected.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**: The committee discussed the reasoning behind the bill to change the death certificate time limit, noting it was part of a broader effort to address issues families face in obtaining death certificates in a timely manner.\n\n**Votes**: The bill to change the death certificate time limit was passed unanimously by the committee.\n\n**Attendance**: No specific quorum details provided.\n\n**Adjournment**: The transcript does not indicate when the meeting was adjourned or when the next session would be.\n\nOverall, this appears to have been a fairly routine committee meeting focused on a minor, technical bill related to death certificate procedures. No major legislative actions or notable moments were included in the transcript provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nmeeting to order, please.\nSenate Health and Human Services meeting.\nA few in mind opens up in our prayers, Senator Hodges.\nPlease, your own mic number two, number three.\nPray with me, please.\nI do have any further.\nThank you for the many blessings you've bestowed upon us,\nespecially the opportunity to be here today in this beautiful state and to attend\nto the affairs of this lady in the Senate. I'll lead us in God, it's an all we do.\nAnd we ask these things in Christ's name. Amen.\nThe volume was sort of low there, sorry about that, but thank you for your\nprayer. Senator Hodges, we have two bills today. We have a Senate Bill 340,\n38 in House Bill 181.\nWe're gonna go with the Senate this time,\nfirst time that we've heard this bill,\nbut it's pretty straightforward.\nSenator Williams, the floor's yours.\nHold on just a second, we got your mic going.\nYes, sir.\nThank you, Mr. Chairman.\nThis is probably gonna be the simplest bill.\nYou will see this year.\nthis session. Second page, line 37. We're changing the number 180 to 60. What this is is\na bill that refers to pronouncement of death and it changes the time limit. If someone\nhas been seen by their personal care physician, it has set up to 180 days but we're changing\nthat to 60 days. And this a lot can happen in a just a short amount of time. And a lot\nof times your personal care physician would not be aware of health changes. It might occur\nwithin just a short amount of time. So that's what this bill does. Big glad to answer any\nquestions.\nIf I could just give a little bit of background, Senator Williams and a few others, Senator\nKirkpatrick and a lot of stakeholders have been working on the death certificate and\nthe challenge many times that families have getting the death certificate.\nAnd the reason that Senator Williams has certainly explained well in those meetings is that\nthe death certificate allows not only a finality in the diagnosis and so forth that you get\nwith that, but it allows them to do practical things like whether it's closing bank accounts\nor closing, turning the cable off or Wi-Fi, whatever it is that they may be subscribed\nto.\nMany times it requires a death certificate to prove that.\nYou can probably elaborate that on more than I, but suffice it to say that it has been\nchallenge and we felt that this was part of the way to improve the ability to get the\ndesk to even get it done on a timely fashion.\nCan you help us out, help us out there a little bit more?\nYes, so that explains it very well.\nWe've had about 10 or 12 meetings regarding desk certificates and you and Senator Kirkpatrick\nboth have been there and we've trying to narrow down the issues faced with families on the\nobstacles of getting death certificates. A lot of times on an unattended death occurs out\nof a hospital. A lot of times you don't have an issue such as a corner. But in the metro areas,\nyou have the medical examiner systems and this where the confusion seems to come that if someone\none has been seen by their personal care physician within the last six months, then they feel\nlike they should not sign the death certificate that they should have seen them within 60 days.\nThat may be on YouTube later today, so I got that.\nThat was a good move.\nThat was good.\nI like that.\nAll right.\nFive.\nGot you.\nThank you.\nI'd appreciate your favourable consideration, big glad answer.\nWe'll answer questions.\nThank you.\nSenator Cessler has the first one.\nSenator, thanks for this.\nJust forgive me.\nI'm just trying to get up to speed on the thinking behind this.\nBecause the thinking behind there being a number in this, and the term deemed to have\ndied unattended by a physician, I mean if I was seeing a doctor regularly, I'd been\nin the doctor's office two days prior, there was a serious condition, obviously that gives\nyou the sense that you're being attended.\nIf I'd seen my doctor 50 days earlier, how does that change my circumstance, if I'd\ndie in bed, for example?\nWell, what's the legal, I guess, the second part of the question is, what's the legal\neffect of that versus, if I had seen my doctor, it was pretty much earlier?\nRight now you have some medical examiners, the corners, that are holding to this 190 days.\nSo there's an argument between the personal care physician who's saying, I've not seen\nthis patient in five months.\nI don't know what's been going on with this person.\nTheir health could have changed, they could have had the woulda maker, they could have had\na mild cardinal infarction and been immediately pronounced dead.\nSo just basically this is narrowing the scope and it's a starting point.\nAs one physician person made a comment, you know, I can see someone today in my office,\nThey may drop dead tomorrow without any warning and that still doesn't because I saw them\nyesterday doesn't mean I know what killed them.\nNow the other hand would be if someone is undergoing palliative care or they're in hospice\nand they've been treated for some terminal illness, pretty much know what the prognosis\ndiagnosis is going to be.\nFor example, if they had under this bill, in 60 days is the new threshold to understand\nthat can accelerate things.\nSo if 35 days before someone dies, they had a full physical with their family physician,\nfor example.\nThen the family physician would have an ability to just under the current law, has an\nability to speak into what the cause of death was as opposed to the coroner or medical\nexaminer.\nIs that the way to lower?\nYeah, it's kind of that way.\nWhat it's doing is telling the medical examiner that if this person has seen their personal\ncare physician within the last 60 days, then they need to consult with them.\nThey need to be consultation to figure out the cause of death.\nBut there again, what the misconception, a lot of times, is people think a death certificate\nIt's a legal document, it's not, it's just a scientific document, it's not a legal document.\nBut what it does do is give someone finality that they can proceed with filing life insurance,\nclosing bank accounts, setting up an estate, even the simple thing is cutting off a cell phone.\nI understand the benefits, I'm just trying to understand just for myself and members of\ncommittee the difference is if it's after 60 days in the medical examiner\npretty much has no option they've got to deal with it. They deal with\nthemselves if it's been within 60 days medical examiner in the position\ntalk they kind of come to a conclusion it's a two sort of a two-person\nconclusion as opposed to medical examiner by themselves. I brought them\nhere. Right. Any other questions from the committee or discussion?\nAll right well I guess we're ready for that. It sounds good. Senator Lucas for do pass and second by\nSenator Setsler and any further discussion all those in favor. Let's raise our hand. Okay I\nthink that's unanimous there. All right thank you. Thanks Senator Williams and I don't need to\nto ask you who's carrying it because you're a senator,\nyou'll be carrying it on the floor, so okay.\nThank you.\nYes, sir, thank you, Senator Ways.\nAnd again, I want to shout out, give them a shout out\nthat we've been working on this issue.\nAnd I think this is one of those,\na piece of the puzzle that's going to help\nwith timely death certificates.\nI think this is going to help.\nYes, sir.\nI think so, Tony, I thank you again for your assistance.\nCertainly, thank you.\nalready. So we are, we now have House Bill 181 by Senator Townsson and we had, we heard\nthis bill last year and it went to, we passed it and it went to rules and did not make it\nto the floor so this bill has already passed the House and is over for here for us to reconsider\nit.\nSo I hope that we don't need to go through the full discussion and testimony relating\nto that.\nWhat I plan to do is have Senator Chounson present the bill and if he has someone he wants\nto testify and then I think one other person wants to testify and maybe has an amendment.\nSo we're going to let the will of the committee rule here and we're going to discuss this if\nwe need to and vote on it if we get to that and Senator Townsend, the floor is yours.\nAnd you're welcome to sit here or go up there, whatever you'd like to do.\nOkay.\nYou're full of that microphone close to you and I think that would do.\nIs that better up there if that's you know if the the leaders want you up there has better so we're I'm good with that the other thing\nI want you to point out we did have a change\nthe\nThe summary of the bill which was in your folder just had a change in the date\nwe we we quickly made an adjustment and made the\nand passed out everybody.\nSo if you see, that's why we did the new summary.\nAnd it says this bill becomes effective on July 1, 2024,\nif it's passed.\nNow the bill itself, the summary,\nthe bill itself had the correct date.\nWe just had the incorrect date on the summary,\nbut we're all kosher now.\nOkay.\nThank you, Senator Watson.\nIt's a privilege to be here again.\nAgain, thank you for the last year.\nPass it in.\nAnd thank you, the rules, Senator Brass,\nyou guys passed it last year and just fell short on sunny die.\nBut when I'm back and appreciate being for this committee,\nbasically as you remember, I'll keep it short, I know.\nBut this is a constituent base bill down in Glen County.\nI live down on the coast.\nWe had two people affected by cratum.\nOne eventually ODed on it and committed and died.\nThe second one became psychotic,\none up in mental health institution.\nAnd so those two are constituents.\nAnd once I saw the bill, I'm a former educator.\nSo I didn't know much about it until I started doing the research.\nThen I saw some credible sources like Mayo, Cleveland Clinic and others who went out and spoke\nagainst it and had some real concerns about the safety of it.\nAnd the more we dived into it in the house, as you remember, we had 11 to 12 hours of hearings\non it.\nWas that freshman didn't realize there's going to be a long hearing like that, but over I think five different committee meetings we got out of the committee made some good compromises talk with the both sides, the American\nCredit Association and everybody else involved and made some where it's more of a regulation tight bill now instead of total banning it original intent was to ban it and then we started regulated and you will see the regulations in there that we all agreed to it one time.\nlast year and then we also decided to put some penalties on the manufacturers because there's some there's a law now\nBut it's no teeth into it. There's a you can't really enforce it so the manufacturers can do that what they want\nWe want to make sure Jordan's put something in their body and they know what they're getting to the highlight main thing is proper labeling and\nProper dosage that's that's the main part of the bill put it behind the counter make sure 21\nstory I stopped on the way home on the coast you know you get I-16 you have to\ndrink your diet coke at M&M's and just to stay awake in I-16. Stopped at\nShell Station and there was Reese's Cups, Skittles, and Cratham Cupcakes.\nCratham Cupcakes at the counter. Now I'm not saying the store attendant would have\nsold the kid or whoever wanted the Cratham but it was right there for the\ntaken and so it's like that's not good. So things that we've got in this bill\nnow will take care of that and I appreciate everybody agreeing to that and\nthere's some that's what the bill is. We went to multiple negotiations last year\nwe went in front of the Ledge Council agreed on everything and so I'm\npositive about the bill constituent based as you know you guys are senators and\nyou'll do anything for people back home if it's a problem so that's what we're\ndoing and supporting our community back home.\nSo that's the main part of the bill.\nI was approached this morning about trying something else.\nPersonally, I like this bill.\nHope we keep it the same way.\nBut I'm at the will of the committee.\nAnd I appreciate what you guys do.\nAnd I respect y'all very much, and I'll answer any questions.\nI know I do have one constituent here, not constituent,\nbut she's a Georgian, she, her husband was affected by\ncredit, and she'd like to talk if she could.\nAnd then Jeff Breedlove, and one of our recovery experts,\nif you have time, he'd like to speak as well for sure.\nBut that's up to the Will committee,\nand we'll go from there.\nBut any questions for me, I'll be glad to answer anything at all.\nI have a question, but I can wait for that.\nOK, we'll do that.\nWe'll sort of hold questions and start back.\nIt's probably the thing to do.\nOK, yes.\nThat'd be great.\nIf you wouldn't mind, go ahead and introduce yourself up at the podium, please, and thank\nyou for being here.\nCan you see me?\nGood, afternoon.\nLadies and gentlemen, this is Senate.\nThank you so much for being here today, and thank you for passing the first bill.\nThis is my former husband that passed away October 22nd, 2020, actually three years and\nthree months ago today.\nAnd I got a call on October 22nd and it was his work calling and they said Bill collapsed,\nit worked.\nAnd he told me he was taking a product that he had found that it was working, that he\nfelt like it was helping him sleep, it was great.\nwas under the false pretense now that it was to a health\nunder the health product, that it was natural.\nAnd so he took that and he took a drink of a energy drink.\nSo what cratum doesn't talk about the regulations,\nthey don't actually tell you what you can and cannot\ntake with cratum. They don't say you can't take an energy drink with cratum because it\nhas too much caffeine in it. They don't tell you that you can't take cratum with tea\nbecause it will kill you. They don't tell you that it's lethal when you mix a monster\ndrink with it and cratum at the same time. They don't tell you that. And that's the problem\nthat we have is nobody knows.\nEverybody's a guinea pig right now that's on cratum.\nThey're guinea pig because they don't know.\nThey could actually, I don't know if you guys heard,\nbut the panera bread, the whole thing about the panera bread,\nthese two young teenagers were killed\nbecause of the caffeine and the lemonade.\nSo if we don't know what's in that lemonade,\nhow are we gonna tell about cratum?\nSo I'm just trying to show you that.\nSo I got the call and I said,\nplease put me on FaceTime.\nSo I literally watched and my girlfriend worked for NBC\nand she got behind me.\nI said, I need you to video this FaceTime\nas the paramedics worked on my former husband\nwhile he was passing away from cratum.\nAnd when I tell you that had I not had my friends there,\nI don't know what I would have done\nAnd they took him away, though I watched the whole thing,\nI begged for his life.\nIt's all on video.\nAnd it was probably one of the worst moments of my life,\nbegging for his life, knowing what was going on.\nAnd at the time, I was trying to find jets to take me up\nto North Carolina where he was.\nI was trying to find all these things.\nAnd I was trying to get a hold of my daughter\nso that she could talk to her dad for the last time,\nnot knowing what was going on.\nAnd out of frustration, again, not knowing what was going on,\nI got a call.\nThey said that he had a stroke-like activity.\nAnd then he had a seizure-like activity, stroke.\nAnd then when the nurse called me, she said,\nI'm sorry, we lost him to cardiac arrest on the table.\nAnd I don't know about anybody in this room,\nbut if you ever had to tell your child\nthat their dad or mom is never coming home,\nno, if you have, it's awful.\nAnd I had to do that.\nAnd what she said when I got home, how's dad?\nHow is he?\nI said, baby, he didn't make it.\nHe didn't make it.\nSo I'm asking you today to make sure that no one else, no child, can be looked at\nat freedom.\nAnd by the way, there's a new freedom out called train wreck.\nIf that doesn't speak volumes to anybody in this room, train wreck, okay, I hope that\nit resonates with you all.\nUm, anyway, um,\nlet me share a appreciate that.\nDo you mind, uh, uh, uh,\nsharing us with your last\nstatement where you're from?\nUm, Peter Goughner,\nand I'm originally from here in Atlanta.\nOkay.\nYes.\nThank you.\nUh, I appreciate your, uh, testimony.\nThank you, sir.\nThank you.\nUm, uh, yes, uh, I'm sorry.\nYou have a question, uh,\nchairman Huff's set.\nThere is on.\nYes.\nThank you.\nAnd just a question that the cradle\nthat your husband took.\nWas that a synthetically altered?\nWas it have a certain brand name or?\nI cannot speak about the brand name right now.\nBut it was, I can tell you that it was the night before he\npassed away.\nHe switched from a capsule, some capsules\nto a powder form.\nOK.\nAny other questions?\nThank you.\nI'm sorry we're doing.\nThank you for being here today.\nThank you so much.\nYou know, in the last, gosh, the last two and a half years, I know you've put some\nDoug into this and understood this.\nIn your research, what have you found about the commonality of the frequency about someone\ntaking powder-based cratum or powder form, and then an energy drink and having a cardiac\nIs this something, is this, is this, would you represent this as kind of a one-off unusual circumstance in the literature and the data?\nIs this happening other places and share what you found with us if you could?\nSo I've been doing a lot of research.\nUm, late nights, early mornings, and I found that that is basically the order it goes in.\nIf somebody takes, like, for instance, there was a young man, I think it was Pennsylvania.\nHe was drinking tea, he put it in his tea.\nAnd the next 20 minutes later, he was on the ground,\nhaving like seizure-like activity.\nSo it kind of goes in that order seizure stroke cardiac arrest.\nBut in the end, it's cardiac arrest.\nSo to answer your question, it is kind of,\nit's those characteristics of the seizure-like activity.\nThe end.\nI'm sorry.\nI'm sorry.\nYou have a phone call.\nOh, I didn't know if you needed me to stop.\nNo, I had a follow-up question.\nI just was communicating with the chair.\nOh, no.\nSo anyway, that's what I've read, and that's\nwhat I've discovered in my research.\nAnd that is my opinion from my research.\nSo the concern is that there's a,\nwhereas you might have some data that suggests\nThis freedom is not serious, or I'm sure we're in here, someone say that it's a low\nlevel effect, no danger, perhaps we would hear that by itself.\nYour concern is when it's taken with other customary daily products, not some odd thing,\nbut something as simple as an energy drink or tea, you're saying it's the coming together\nof those things that makes it particularly dangerous in ways that public doesn't understand.\nI am saying that as well as saying that\nfreedom is dangerous one by itself.\nIf there's been studies done that say that\nyou can't even make it with freedom at all.\nSo, freedom by itself is lethal.\nAnd if you just Google freedom,\nyou'll find that as well, sir.\nOkay.\nThank you very much.\nThank you so much.\nThank you.\nYou should.\nSo, we have three people that have signed up.\nI didn't realize that we had those.\nI mean, Jeff Breedlove, Eli Kose, Kose or Cohen or Mac Hadal, I mean, if you, I think they\nmay have testified in the past, anything you did, you got some nods, the spread love\nyou did, is there, if there's anything further to add, then, you know, we had one more\nor to testify, I was keeping you in reserve,\nthen we're good to go.\nAnd Ms. Keen, you had a gentleman that you wanted to...\nNo, he did not testify.\nYeah.\nIs that Mr. Hadal?\nYes.\nOkay. Great.\nAll right.\nMr. Hadal, I had said that you would be able to testify.\nAnd if you would...\nSenior Fellow in Public Policy,\nAmerican Cradle Association.\nOkay. Is that it?\nThat's it.\nMr. Chairman, members of the committee, thank you for this opportunity.\nMy name is Matt Cato, Senior Fellow on Public Policy with the American Creative Association.\nWe represent the 15 million consumers plus in the United States who safely and responsibly\nconsume freedom.\nWe understand, I'm sorry, my apologies, thank you.\nWe support completely adequate and responsible labeling on products to assure that consumers\nwho purchase a cradum product are able to see the ingredients in that product and the\ndirections for safe use, serving sizes, the number of surveys be taken during the day,\nand this legislation goes a long way to expand that safety profile.\nIt is desperately needed in order to stop what we see with the current situation, but\nfor the ten other states that have passed what we call the Cradum Consumer Protection\nAct, it is unregulated throughout the United States.\nThe FDA did a rush to judgment back in 2012, based on a report of there being nine deaths\nin Sweden in a 12-month period, ostensibly from Cradle, and they ordered an import\nalert and that led to a 2016 request for scheduling under the Control Substances Act\nto make it a Schedule I substance.\nThat was denied by the Drug Enforcement Administration for lack of information.\nThey then submitted the second request in 2017 that was reviewed by the Assistant Secretary\nfor Health that was Dr. Brett Jawah in the Trump administration who rejected and withdrew\nthe FDA's second recommendation for scheduling, calling it embarrassingly poor evidence and\ndata.\nAgain, the FDA had rushed to judgment, calling Cratum dangerous.\nThey went to the World Health Organization to the UN Commission on Narcotic Drugs, of\nwhich the United States is a treaty partner, and they petitioned them to ban Cratum internationally\nat a much lower level or standard for doing so,\nand a 12-member group called the expert committee\non drug dependence, experts on substance abuse\nand addiction throughout the world unanimously agreed\nthere was insufficient evidence\nin order for credit to be scheduled.\nNow that doesn't mean the credit is 100% safe.\nIt means that it doesn't meet the criteria\nfor banning credit and we think\nthat consumers need to be protected.\nWe have petitioned because we represent consumers,\nnot the manufacturers.\n85 different companies and given them to the FTA with documentation on improper marketing\nof cratum. The FTA has refused over the last three years to prosecute a single one. There\nare products out there that are dangerously adulterated with synthesized alkaloids that\nincrease their power and they are causing problems. They need to be removed from the marketplace\nand this legislation will ban those kinds of products from being available on the marketplace.\nthose nine deaths in Sweden that started all this with the FDA.\nThey later ignored the fact that there was a peer reviewed published article done by\nresearchers in Sweden that found that, in fact, that cratum product that killed those\nnine people, called Krypton, sold throughout Europe on the internet, was laced with Odess\nMetal Tramadol, the powerful opioid that makes Tramadol, and that's what killed those people.\nNow you will hear reports of cratum deaths and sadly you heard the tragic circumstance\nhere.\nThere's a lot more that we need to know about this.\nI can assure you that if there were credible death cases\nthat could be attributed to Cratem alone,\nthat the FDA would be all over that,\nand they'd be making a third recommendation for scheduling.\nBut just last two weeks, the FDA was ordered\nin a federal court case in the state of California,\nwhere an importer of Cratem was indicted and pled guilty\nto falsely labeling the product,\nand the judge wanted to know from the FDA\nwhy they believe the credit is dangerous.\nAnd the response from the Assistant US Attorney\nto the judge, and he said, then I quote,\nthe FDA refused to come to provide us with witnesses\nor documents to support our position,\nas well as witnesses and documents\nthat might be inconsistent with our position.\nThe reason they, the FDA, gave was they have not yet\nmade a determination regarding whether\nthe credit is dangerous.\nI have that document to share with the committee\nif you'd like.\nThe important point here is that the FDA has just recently\nincluded a dose finding study on cratum.\nThey initiated that in 2021, take a little time\nto get there, spend a lot of our taxpayer money.\nThey've now determined and dozed humans with cratum\nthat it's safe now to do what's called a human abuse\npotential study.\nWe're going to determine what the addiction liability\nor dependence liability of cratum will be.\nThat will take a few years, but in the interim,\nwe need to protect consumers.\nAnd so we're asking you here today\nto actually accept this bill.\nNow, we had made a recommendation\nthat rather than criminalize a retailer,\nbecause we're already in this bill\nputting credit behind the counter,\nrather than criminalize a retailer,\nlet's make it administrative fine\nif they make a mistake in selling a product.\nWe hope you accept that.\nNew science, based on some of the data\nthat I've just suggested to you,\nhas shown that the level of seven hydroxymetrogenine,\nwhich is a metabolite because of the drying process\nand the plant should actually be 2%,\nrather than the 1% that was in the bill.\nScientists tell us that if you limit the amount\nof seven hydroxamotrogenine per serving,\nwhich this bill does,\nthat you will provide adequate safety for consumers.\nWe recommend this bill.\nWe think it's important.\nWe would like to see the amendments that I've suggested,\nbut freedom today is being consumed\nby millions of Americans.\nJohns Hopkins University documented it\nmany are using it to get off of opioids.\nIt's saving their lives.\nI've been in dozens of hearings around the country,\nheard from hundreds of freedom consumers\nwho've said exactly that.\nIt's saving my life.\nPeople that use freedom that's not adulterated,\nnot synthesized that is adequately labeled and that is properly packaged and processed\nit is helping people.\nThe fact that people use Cratum with another substance, the main Iraq, there is a system\nthat's available in the federal government called the MedWatch system.\nAny consumer or medical professional can report to the FTA any of those interactions.\nAnd when the FTA sees a cluster of those things, they identify it and they issue regulations\nto say that warnings have to be put on those products.\nWe support that system.\nAnd we think that the referrals should be made here.\nI'd welcome any questions.\nThank you.\nThank you, Ms. Hanna.\nI'm sure I'm glad you are supportive of this bill.\nSo anybody on this committee, besides Dr. Kirkpatrick, heard of the med watch system?\nWe've got, and we should have excluded, yes.\nAll right. So one, one non-health care, you know, the two, the three health care\npeople have, medwides. But I mean, I think that's the point. I've got some hands\nback there. But the, I'm glad you support it. And why don't we bring\nrepresentative Townsend? I think I had elevated you to the Senate. But sorry\nabout I apologized for that so I kind of like our local\nsenators if that's okay. I got you. He's no offense this\nroom. He has my favorite. He's looking for the votes on the\ncommittee. I got you. So we appreciate that. And I think\nwhy don't we have a we on you want to say something first\nrepresent Townsend. Well, you want to say that this will make\nsure we regulate it correctly. I think we have all the levels\nearned out last year, we went through multiple discussions,\nmultiple agreements, and then kept negotiating.\nI just want to make sure this isn't another delay.\nI got you.\nBut one thing too about the testing and like that,\nif we had time, Dr. Norman out of the University of Georgia\nPharmacy School supports this bill,\nactually supports banning what your committee kind of talked\nabout last year, of credit.\nHe's a research instead of Georgia,\nthat works for the state of UGA.\nThat's probably the best guy you can ask on credit.\nAnd so he would disagree with that argument we just heard.\nI got you.\nI don't want to get Mr. Breedlove upset.\nNo, no, no, no, he's giving me the live back thing.\nNo, no, no, no, no.\nDo you mind yielding the mic for?\nYes, sir.\nHow many minutes do you need, Mr. Breedlove?\nAnd he's two minutes.\nWe've got you on the clock.\nThere you go.\nAll right.\nJeffrey love for the Georgia Council for Recovery, person in long-term recovery.\nThis is a constituent issue statewide in every district.\nThere was 11, 12, 15, 20,000 hours of testimony last year.\nPeople from across the state came in good faith.\nFour moms came and testified.\nBusiness owners in Georgia testified.\nA diversity, a holistic voice was heard.\nAnd we all were working in good faith on the current language.\nNobody's come to any of those people with this new language.\nNobody has.\nSo you talk about consumers?\nWe all worked in good faith.\nIt's consumers that will buy the product in the store.\nThe GBI testified some 930 deaths\nthat the GBI, not the FDA, not the federal government,\nour government knows some 900 Georgians have died\nbecause of this stuff.\nI don't put my faith in the FDA.\nPut my faith in GBI.\nPut my faith in UGA who testified that they've not ever\ntested a product in the state where it was on the labeling\nmatched up with what the scientists found out.\nSo do respect.\nNothing should be done to delay what's\nin the best interest of consumers.\nPeople worked in good faith with you.\nAnd this language was agreed upon by a diversity\nof your constituents.\nNobody knows.\nThey're a good, faith, small and big\nand medium-sized business owners in Georgia\nwho are the backbone of our economy\nand are the backbone of our state.\nWe're not talking about the good guys.\nThe cratum cupcakes?\nI've been in all your districts.\nI've seen those products.\nAre you gonna play Russian roulette\nthat the bad actor who puts something out\nAnd it kills another Georgian.\nIt doesn't deserve the strongest penalties possible\nthat are in the current version that we've all agreed to.\nAll I want to say is you've had many, many Georgians\nget to the point where we are today to move forward\nin a positive, honorable, transparent manner.\nThis new language is not that.\nAnd we've got one question.\nYes, Ms. Briello.\nMs. Briello, thanks for being here.\nWhich LC version are you supporting specific?\nI'm trying to understand we've got a couple bills\nin our package.\nThe most recent version that was a, I'm sorry.\nLC 33, 9513S.\nIs that right?\nThat's not the...\nI'll yield to the author of the bill.\nYeah, that's correct.\nI'll see you get out of here.\nThere we go.\nHow about that?\nIs that a good answer?\nThere we go.\nAnd I do thank the committee for allowing me to have a minute.\nSo what we have in our packet is the original.\nAnd then we have this, the new date, you know,\nfrom that perspective.\nThe new date, you know, from that perspective.\nYou simply want to get more, more, more, more, more.\nI don't want it too urgent yet.\nCan you read that out?\nWe don't have a minute off of it.\nWait a second.\nWe have the substitute.\nIf I set a minimum set of substitutes, I apologize.\nOK.\nSo what we're going off of is LC 540306S.\nYes, sir.\nThat's the one that all the work was put on to,\nsir, by so many Georgians.\nThis is new to everybody, by everybody.\nI mean, everybody that came down and took time\nout of their lives and traveled from across Georgia\nto participate in the process,\nparticipate in the process for that language.\nLet me just clarify here, we're all clear\non the committee of the LC number, right?\nSo what he's referring to is an amendment that came up\nand that's what may be offered\nand I was gonna allow the amendment to be offered\nand discussed.\nThat's what he's referring to.\nThe committee will vote it up or vote it down\nand that's what he was alluding to.\nCorrect, sir?\nAnd we don't have that amendment.\nThat he's right.\nWe didn't have it. It was alluded to earlier. We don't have it yet, but we will. I presume.\nAnd I was going to thank you, Mr. Breedlow.\nYes, sir. Thank you, sir.\nRepresentative Townsend, do you have anything further?\nYes, sir.\nAll right. Let's go ahead with Senator Brass.\nOkay. Number two.\nOkay.\nThank you, Mr. Chairman.\nAll right.\nNow that the drum roll is over and the amendments coming out, I\nhave some questions first. So up on lines 26 through 28 processor. So right there\nyou're capturing pretty much everybody from the manufacturer to the\nretailer and everybody in between. Is that the manufacturer's got the\npenalties? He's got the manufacturer's got the Mr. Minter the first time.\nFirst time when I fell any of the second time what about the retailer the\nretailer got a misdemeanor yes sir the but the the retailer is grouped under\nprocessor according to this definition if I'm reading this correctly correct I\nneed to get a copy of my second yeah yeah and so you you've\ngroup under process or you've grouped manufacturers, distributors, retailers because they sell you've\ngrouped everybody in one lump sum and then under first offense is an aggravated misdemeanor which\nis pretty severe. I mean aggravated misdemeanor you're putting a lot of you're putting that on some\nyears crown. You're talking regarding the retailer, correct?\nRegarding the retailer, right. And to my knowledge, if you look at other industries where\nthe retailer is responsible for controlling the point of sale to underage or not, then\nI don't know of any other where else where we do that. And that's my concern is because\na lot of times at the retail level, you know, you're talking about an hourly employee who\nmost of the time they don't know what they're selling, they have a job to do and I sell.\nAnd we're going to put a requirement on them that, okay, you just don't sell it to somebody\nunder age, which is fine, but I just feel like an aggravated misdemeanor at the retail level\nis pretty severe.\nI understand that.\nThat's where my concern and, you know,\nyou're talking about locking up, you know,\nan hourly employee who may or may not\nhave a whole lot of education.\nAnd I just think if, I just think we ought\nto be consistent with other laws and other industries\nthat are out there, specifically at the retail level.\nAt the process or level, I've got no problem\nwith what you're trying to do here.\nAnd I fully support your bill.\nI just do feel like at the retail level\nthat I think we should back off that at least a little bit.\nI mean, you know, another industry\nthat you can compare to is the tobacco.\nYou sell tobacco, there's chance that you can lose your license\nand there's like a tiered system.\nAnd that might be a good model\nto look at at the retail level only.\nI respect that, Senator Brass, thank you.\nOne of the things we had in there,\nand maybe we didn't word it correctly,\nis willingly and knowingly.\nSo if a person purposely, even though they knew,\nthey'll see the liqueurs of the most dangerous kind,\nthe extracts, that's the kind that people get hurt from.\nYou don't know which pigeon your body,\nand that's what this bill's all about,\nis to make sure if a Georgia wants to put something\nin their body, at least know what they're putting in\nat a certain dose, give them a heads up.\nAnd so if a retailer purposely knows,\nsay this bottle of cratum is not labeled, it's just says\ncratum or whatever else, then that's why that part was in\nthere. I believe it's line 96, but that's where it goes\nthere. So if we need to change that, I totally\nunderstand, because we're not after the retailers, unless\nthey purposely violate the law and knowingly, purposely\nsaying the heck with right now, we're not allowed to look\nwhere it is. 106, I apologize.\nBut again, I've just felt you're grouping retailers with the distributors and the processors\nand the manufacturers.\nAnd I just, I think it's a totally, I think they're two totally separate groups, to be honest\nand I hate putting them.\nOkay.\nWell, there should be some penalty, and I mean-\nCan we lower the Mr. Mayor's fact?\nI mean, I'm, like I said, I'm not after the retailers unless they knowingly purposely\ndoing it.\nWell, so I guess, and maybe I got a question for ledge counsel.\nDo we need to define retailers?\nRetailer defined somewhere else in code?\nOr can we just simply say the person at the point of sale?\nI don't know how to word that exactly.\nBut I think they should fall under maybe the same laws\nthat we do with tobacco sales.\nwhich, if I remember correctly, is...\nWell, I think that's probably where we're going to have to do it\nunless it's defining code somewhere else.\nYeah, I mean, I agree.\nI think you're going to have to take out\non lines 26.\nYou would have to take out the word sales\nand you would have to take out the word selling.\nAnd then you would need to define it.\nAnd then we come down later on and put what penalties would occur to them and I'm and I'm okay with saying if they knowingly and if they knowingly sell it, then yeah, they should they should maybe get the full penalty look at line 45 D.\nThis is no purchase. I'll offer the sale Cravenestate unless such a product is behind the counter in the area accessible to the store employees or in a secured location, which is only accessible with the\nWith the intervention of a store employee again, I mean if that I don't I don't see how that protects the retailer\nI'm maybe I'm I mean, I'm certainly no lawyer, but\nThey're in the rules chairman. No, I respect that\nSo that's\nThank you Mr. Chairman, offer to the author, yes sir, I mean to frame this, you know if\nyou're selling smokes to cigarettes to some kid and that's a misdemeanor, we're talking\nabout something that has a life implication here, you have life and death involved in this.\nSo I would offer to the gentleman for the 28th, I mean the issue should perhaps be not\nto drop it down to a misdemeanor where the fund is no higher than $1,000, but frame it\nso that the language and the behavior is clarified.\nIf you violate it, you're committing a high aggregate misdemeanor.\nYou can handle it on the language knowingly, the level of the offense that leads to an\nhigh aggregate misdemeanor versus the act itself.\nIn my belief, the thinking behind making a high-nagra is a meeting with a $5,000 potential\nfine is appropriate because you have life and death here.\nIt's not just selling cigarettes or not just a status offense.\nWe have a person here who's husband died as a result of drinking it with an energy drink.\nSo in my view, leave the high-nagra at a misdemeanor in place, but make sure there's a knowingly\nelement that when you do these things and you cross that threshold, then you get into\nthat high and aggravated threshold.\nThere's two ways to handle this, the threshold,\nthere's a penalty.\nI think the seriousness of the heavier warrants\nthe high and aggravated,\nwe just get to make sure the language is right\nto get us there.\nAnd you said it better than I did.\nI'll show you a picture if you can see it.\nI'll be glad to pass the phone around.\nBasically that's a cratum with the red bull display.\nWell guys, so basically, if you know where I'm going,\nthank you, Representative Townsend.\nMs. Cretan, do you have the ability to make those changes on the fly or do we need to revisit\nthis issue on Wednesday?\nI think that's the question.\nI think I need to look up retail or retail or I think I'm going to go online with you\nor I think about retail.\nDo we need to, can we recess for say, well, we've got six minutes, can we read the\nDo you need 10 minutes or do you want us to come back on Wednesday?\nOkay, I think that's reasonable.\nYes.\nSo, as I said earlier, we will let the will of the committee,\nand we've got a little divergence of opinion here,\nand I'm certainly happy with that,\nbut I think that we can come to a reasonable way to get there.\nI can certainly see both sides from that standpoint.\nI think coming up with what Senator Sessler and Brass\nand you know what, we didn't get any of the lawyers\non the committee to weigh in.\nI'll tell you what, this has been a great day\nand we're going to finish before three o'clock.\nThank you, Mr. Chairman.\nSo we're going to come up with language\nthat I think we can all agree on.\nAnd then we're going to come back here on Wednesday\nand we'll try to do that first.\nSo if everybody can have their thinking caps on\nand sort of just touch base with me,\nI had a time if you have any questions all right you have some questions okay we're\ngoing to make some adjustments all right so if there's no further business meetings\nThis adjourn will revisit this on Wednesday.\nThank you.\nOkay.\n",
  "updated_at": "2026-02-12T19:41:20.086886+00:00"
}