{
  "video_id": "YokT0eT5SB8",
  "url": "https://www.youtube.com/watch?v=YokT0eT5SB8",
  "title": "House AM Meeting for Day 39 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 119,
  "summary": "Overview:\n- This Georgia House AM meeting included a prayer by Rabbi Hershey Minkowitz and the Pledge of Allegiance, but no substantive legislative actions.\n\nKey Actions:\nNone.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- Rabbi Hershey Minkowitz gave a reflection on the significance of Passover and its connection to the spring season.\n\nVotes:\nNone recorded.\n\nAttendance: \n- A quorum was present, as all members voted to signify their presence.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or when the next session will be.",
  "transcript": "All members, all members, please come to the floor. Good Wednesday morning. Good to see you all this morning because the hour, convening having arrived, all members will please come to the floor. All members come to the floor and take your seats. Mr. Clerk, will you ring the bell? The bell is ringing. The bell is ringing. The bell is ringing. The bell is ringing. Good morning again. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? All members voted. All members voted. All members voted. All members voted. Mr. Clerk, will you lock the machines? Doer keepers, will you please close the doors and keep them closed? As is our custom, we will begin our day with Scripture reading prayer by our chaplain, after which we will pledge allegiance to flag of our country. Our chaplain this morning will be introduced by the gentleman from the 48th House District, Representative Scott Hilton, Chairman Hilton. Thank you, Mr. Speaker. Your committee on information, sorry, I've got the wrong, that's the wrong thing. Hold on. Good morning, colleagues. God is good. Amen. The Hebrew word for peace is Shalom, and with two days remaining in the legislative session, there is no better person to bring us some Shalom than Rabbi Hershey Minkowitz. I'll say he shared with me in his house they have 11 children. So I'm guessing he has very little Shalom in his house, but he's going to bring some to this house today. In the summer of 1998, Rabbi Hershey Minkowitz was sent to Alfreda by the Chabad movement. Ladies from the 51st, I'm getting a thumbs up. Thank you. A subsection of the Orthodox Jews to establish a Jewish worship and educational center for growing Jewish community in North Fulton. Rabbi Hershey, as he's affectionately known, leads the Chabad of North Fulton until this day. Their center has become a primary address where Jews of all walks of life and religious backgrounds gather, for Jewish enrichment and inspiration. Colleagues, please join me in welcoming Rabbi Hershey. Thank you. Good morning. A friend of mine recently told me that he took one of those private space tours to go see the moon. And when he came back, he told me, would you believe it? They even have a restaurant out there. I asked him, how was the food? He said the food was delicious, but the atmosphere was terrible. I hope you won't mind if I'm going to give you a brief two-minute spiel about the moon. I'm not an astronomer. There was not in the bio that Representative Hilton just read. It's just that next weekend we're going to be celebrating Passover. On April 12th, the Jewish community is going to be celebrating Passover. Interestingly, last year in 2024, Passover began on April 24th, 12 days later than this year. And in 2023, Passover began on April 5th. So why does that so? Why does it fluctuate? In fact, let me just quickly tell you the last five years since 2020 and see if you can detect the pattern. 2020, Passover started on April 8th, March 27th, 22 April 15th, 23 April 5th, 24 April 24th, and this year, April 12th. Every year Passover gets 11 or 12 days earlier than the year before, and then every two or three years, it gets set back a month ahead. Why is that? Well, in the book of Exodus, chapter 12, just before the Jews were leaving Egypt, God told the Israelites that from that point forward, they would begin keeping their calendar based on the cycle of the moon. Every month when a new moon appears, it's a new moon appears, it's a new month. Passover is always going to be on the 15th day of the first month when the moon is the fullest. And then in Exodus, chapter 13, verse 4, as the Jews are leaving the shackles of bondage behind, God says to them, and I quote, today you are going out in the month of spring. Rather than focusing on the name of the month, God is focused on the season, the fact that we're going out in the spring. So much so that later in Deuteronomy, just before the Israelites are about to enter into the promised land, God gives them a very firm reminder about how important it is to keep the holiday of Passover in the month of spring. Deuteronomy 161, you shall keep the month of spring and make the Passover offering to the Lord your God, for in the month of spring, the Lord your God brought you out of Egypt. Sounds easy enough. However, to just one small problem, and that's why the holiday date varies every single year. You can see the lunar calendar, the calendar that goes according to the cycle of the moon has 354 days, 11 days less than a solar calendar of 365 days. So every year, Passover is going to get 11 days earlier and 11 days earlier. But hold on a second, God told the Jewish people that they have to keep the Passover in the spring. So it was that possible, if every year it gets 11 days earlier. So after a few months, Passover would end up being in the winter and then in the fall and then in the summer until it came back around again to the spring. Therefore, the Jewish calendar has a very complicated system where every few years we add a leap year, but not a leap year like in the regular calendar where it's one extra day, we add a full month. So we end up with a year that has 13 months in a leap year instead of 12. All for this one reason, because Passover always has to be in the spring. So the million dollar question, and that will be the entry point into our prayer today, is why? Why did God care so much that Passover should always fall in the spring? To the point that we tinker with our calendar to make sure that it stays in the spring, that the holiday of liberation should be always in the month of spring. Well, I'd like that ask you all to rise for prayer now as we pray and reflect on this idea of the spring. Mr. Speaker and the esteemed members of the Georgia State House, our father in heaven is teaching us something extremely important about freedom and liberty, the foundations upon which our great republic was founded. What does the spring represent? Honourable speaker and esteemed members of the house. As we gather today in this chamber, I offer a reflection rooted in the spirit of renewal and hope that comes with the season of spring and the observance of Passover. Passover, a time of remembrance and freedom, invites us to reflect on the journey of the Israelites from bondage to liberation. It is a season that marks not only the liberation of people, but also the renewal of life itself. Just as the plants awaken from their winter rest in the spring, blossoming into vibrant new growth, so too can we embrace the opportunity to renew our commitments to justice, peace, and the well-being of our people. Spring reminds us that from the coldest and darkest of times, life finds a way to bloom again. It is a time to sow seeds of kindness, compassion, and progress for the future. Just as the earth comes alive with new growth, let us also plant the seeds of positive changes in our hearts and in our work, nurturing them with wisdom and care. So let us pray that we in our roles as leaders and servants of the people, draw inspiration from the season of renewal, embracing the promise of new beginnings and the hope that each day offers. Let this time of Passover remind us of our shared humanity, our capacity for transformation, and our duty to lift up those in need. May our work in this house be guided by the spirit of liberation, renewal, and growth, and may it be your fruit for the prosperity and peace for all Georgians, amen. And now please join me in reciting the Pledge of Allegiance. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you. Thank you, Rabbi Hirschby. We appreciate your presence here with us and appreciate your service to your community and to the state. And thank you for that lesson this morning. We're all about history in this historical place here, and we're looking forward to a wonderful Passover. Doorkeepers, you may unlock the doors, memories you may join the Rabbi in the south any room for a photo. And thank you for his service to us here today. You You You You You You You You You You of the Bill B. Todd and Acta Men, Article 8A, and Chapter 1 and Title 10 of the Efficiency Code of Georgia and Intenta Related in Electric Vehicle Charging Stations. The Ways and Means. House Bill 884 by Representative Canada 58, scope field to 63, usually the 141st, spending the 94th, the Smith of the 18th, Bill B. Todd and Acta Men, Chapter 2A, Title 31 of the Efficiency Code of Georgia and Intenta Related in the Department of Public Health. Public and Community Health. House Bill 885 by Representative Canada and the 58, scope field to 63rd, Park, Lone, 7th Crawford of the 89th, Smith of the 18th. Bill B. Todd and Acta Men, Chapter 2A, of Title 31 of the Efficiency Code of Georgia and Intenta Related in the Department of Public Health. Public and Community Health. House Bill 886 by Representative Evans of the 57th, Bays, more of the 69th, Bill of the 62nd. scope field to 63rd, Canada 58th. Bill B. Todd and Acta Men, Chapter 1, Title 50 of the Efficiency Code of Georgia and Intenta Related in the General Provisions regarding State Government. Public and Community Health. House Bill 887 by Representative Stephens of the 164th, Saints of the 180th, Hitchett, Sonner of the 61st and Ballot of the 147th. Bill B. Todd and Acta Men, Chapter 14 in 41 of the Title 43 of the Efficiency Code of Georgia and Intenta Related in the Electrical Contractors. House Bill 886 by Representative Evans. The 57th, Bays, more of the 69th, Bill of the 62nd. scope field to 63rd, Canada 58th. Bill B. Todd and Acta Men, Chapter 1 of Title 50 in the Efficiency Code of Georgia and Intenta Related in the General Provisions regarding State Government. House Bill 886 by Representative Evans of the 57th, Bays, more of the 69th, Bill of the 62nd. scope field to 63rd, Canada 58th. Bill B. Todd and Acta Men, Chapter 1 of Title 50 in the Efficiency Code of Georgia and Intenta Related in the Legislative Council of the 17th and 17th. Bill B. Todd and Acta Men, Chapter 1 of Title 43, the Efficiency Code of Georgia and Intenta Related in the Electrical Contractors. Clumbers and air conditioner contractors. Regulated Industries. House Bill 88 by Representative Carper in the 4th and Bill of the 28th. Bill of the 28th. Bill of the 28th. Bill of the 28th. Bill of the 28th. Bill of the 28th. Bill of the 28th. Bill of the 28th. 20 of the fish go to Georgia and Tate relating to education. Higher education. House from the 889 by Ropes and of Sanchez in the 42nd park of the 107 Santos of the 117th. Barry the 56 and a Dino of the 110th and others. A bill be titled back to men chapter one of title 35 of the fish go to Georgia and Tate and religion of the visions regarding law enforcement officers. Public safety and homeland security. Public. House bill 890 by Ropes and of Carson the 46th mark to the 49th black man in the 146th. Bill B. Todd on act to men co-section 48. Eight three of the fish go to Georgia and Tate relating to exceptions for sales and use taxes. Ways and means. House 891 by Ropes and of Williams on 48th hatched on the 55th Carson the 46 meets the 178th rose on the 24th and others. Bill B. Todd on act to men article 10 of chapter two to title 47 of the fish go to Georgia and Tate related to Georgia Georgia state employees pension and savings plan. Retirement House bill 892 by Ropes and of Holcomb of the 101st Buckner on the 37th Miller of the 62nd evidence the 57th and the Barrett of the 24th. Bill B. Todd on act to men article one of chapter 24 a title 43 of the fish go to Georgia and Tate related massage therapy practice. Eregulated industries House bill 893 by Ropes and of Hilton in the 48 Jones the 47th dollar the 147th rice the 139th due to the 29th. Bill B. Todd on act to men title 20 the fish go to Georgia and Tate relating to education. Education House bill 894 by Ropes and of Holcomb of the 101st black one of the 146th. Bill B. Todd on act to men article one of chapter 10 of title 17. The fish go to Georgia and Tate relating to procedure for sentencing and imposition of punishment. Judiciary non civil hospital 895 by Ropes and of sins and 150th ability to act to men chapter 6 and title 47 of the fish go to Georgia and Tate relating the Georgia legislative retirement system. Retirement House resolution 882 by Ropes and of hatchet of the 150th the resolution proposing an amendment to the Constitution. Waves and means. Resolution 883 by Ropes and of Stephenson 164th gamble the 15th Seaball 34th. Clark the 100th Saints of the 180th and others. The resolution creating a house study committee on making Georgia the number one state for turrets. Economic development enterism House resolution 884 by Ropes and of gains to the 120th jazz versus the 11th Hilton of the 48th. Green in the 154th and empty the 13th. The resolution urging increased state autonomy to allow for certain creative creation of innovative solutions. Special rules. That completes first readers. Second reading the bills and resolutions. The clerk will read. House bill 874 by Ropes and of the 72nd. Chess chain of the 7th. Cleming of the 114th. Jones of the 25th. McCall on the 30th. A bill relating to general provisions relative to Agilorm taxation property. House bill 875 by Ropes and of the 74th. Howard of the 129th. Packels of the 96th. Sanchez of the 117th. Neal of the 79th and others. A bill relating to dispossessory proceedings. House bill 876 by Representative Florida of the 74th. Dawson of the 65th. Jones of the 143rd. Haring of the 145th. Prime of the 122nd. A bill relating to landlord and tenant. House bill 877 by Ropes and of the 68th. Base more of the 69th. Bonner of the 73rd. Matthewick of the 82nd. A bill to provide a new charter for the city of Fayetteville. House bill 878 by Ropes and of the 94th. Coggins of the 14th. Cugley of the 111st. Hawkins of the 27th. Cooper of the 45th and others. Bill relating to holidays and observances. House bill 879 by Ropes and Parsons of the 44th. Part of the 5th. McCollum of the 30th. Howell of the 33rd. Coggins of the 14th and others. A bill relating to duty of driver of the vehicle meeting or overtaking school bus reporting violations. Civil monetary penalty or violations captured by school bus camera. House bill 880 by Representative Black. One of the 146th. Kelly of the 16th. Stevens of the 164th. Newton of the 127th. Martin of the 49th and others. A bill relating to imposition rate. Computation exemptions. Credits relative income taxes. Management budgetary and financial affairs. House bill 881 by Representative Campbell of 35th. You leave the 141st. Jones of the 16th. Roberts of the 52nd. Mitchell of the 88th. Bill relating to holidays and observances. House bill 882 by Ropes and others. So the 72nd. Anderson of the 10th. Dickey of the 134th. Limb of the 98th. A bill relating to landscape architects. In that point. You'll have to. House bill 896 by Ropes and Clark of the 100th. Dubin of the 29th. Hawkins of the 27th. Cox of the 28th. Hong of the 103rd and others. A bill to authorize the governing authority. Paul County to let me an excise tax. House resolution 859 by Ropes and limit the 98th. Lumpkin of the 83rd. A resolution creating house study committee on inclusive educational settings for students with disabilities. Of resolution 885 by Ropes. Anderson of the 10th. Thomas of the 21st. Fleming of the 114th. Lover to the 123rd. Resolution creating the house study committee on election procedures. House resolution 886. By Ropes and Sains of the 180th. A resolution honoring life of Mr. Rachel Hodge. Dedicating an intersection in her memory. House resolution 887 by Ropes and the 1146. And everyone of the 32nd. Resolution creating the house study committee on reducing and prioritizing mandates for public school administration. Senate Bill 352 by Senator Williams of the 25th. Anderson of the 24th. A bill to provide a home study exemption from Jasper, County School District, Adlor and Taxes House Senate Bill 356 by Senator and Roxia of the 31st. A bill to provide a home study exemption from Polk County School District Adlor and Taxes Senate Bill 358 by Senator Jenzo of the 10th. Harold of the 40th. Mangan move to fit. Anderson of the 43rd. Parents of the 44th and others. A bill to amend and act for by the Superseeing, Solidane, Velocity relating to the governing authority of Jacob County and creating a chairman of Board of Commissioners for set county. Senate Bill 359 by Senator Jones of the 10th. Downward of the 17th. Straight under the 42nd. Williams of the 25th. A bill to amend and act to provide a new board of commissioners for Henry County through second readers. Okay members, if you'll come to your desk. We do have a local calendar this morning. But I guess we'll do commuter reports when we do a local calendar. Trying to get their attention, Mr. Plurk. Which has been a little bit difficult this morning.\n\nGood morning. Okay, Mr. Clerk, if you're ready, we'll have reports of standing committees. Mr. Clerk, will you read? Representative Chris Irwin, the 32nd District Chairman of the Committee of Education submitted the following report. But speak your committee on education. Has that under its consideration, following bills and resolutions of the House and Senate? Mr. Clerk, the same back. To the House with the following recommendations, House Resolution 887 to pass House Senate Bill 179 to pass by substitute House Resolution 711 to pass Senate Bill 152 to pass by substitute respectfully submitted. Representative Chris Irwin, the 32nd District Chairman. Representative Hawkins, the 27th District Chairman of Committee on Health submitted the following report. To speak your committee on health, it's at under its consideration, following bills and the senators, instructing me to report the same back to the House with the following recommendations. Senate Bill 91 to pass by substitute Senate Bill 39 to pass by substitute respectfully submitted. Representative Hawkins, the 27th District Chairman. Representative Jesse Petrie, the 166th District Chairman on the Committee on Human Relations and Aging submitted the following report. To speak your committee on human relations and aging. Has that under its consideration, following resolution of the House, is instructing me to report the same back to the House with the following recommendations. House Resolution 816 to pass by Committee substitute respectfully submitted. Representative Jesse Petrie, the 166th District Chairman. Representative Beth Camp, the 135th District Chairman of Committee on Intergovernmental Court Nation Local submitted the following report. To speak your committee on intergovernmental court nation, locals, head and ears, consideration of following bills in the House and the Senate. To instruct the meeting report, same back to the House with the following recommendations. House bill 825 to pass. Senate Bill 328 to pass. Senate Bill 329 to pass. Senate Bill 340 to pass. Senate Bill 344 to pass. Senate Bill 345 to pass. Senate Bill 347 to pass. Senate Bill 336 to pass. Senate Bill 355 to pass. Respectfully submitted, Representative Beth Camp, the 135th District Chairman. Representative Tyler Paul Smith, the 18th District Chairman of Committee on Judiciary Non-Sovil submitted the following report. To speak your committee on Judiciary Non-Sovil. Has that under its consideration, following bills in the Senate. To instruct the meeting report, same back to the House with the following recommendations. Senate Bill 218 to pass. By committee substitute, Senate Bill 268 to pass. By committee substitute, respectfully submitted, Representative Tyler Paul Smith, the 18th District Chairman. Representative Sharon Cooper, the 45th District Chairman of Committee on Public and Community Health submitted the following report. To speak your committee on Public and Community Health, and sat under its consideration. Following bills in resolutions, the House and the Senate. To instruct the meeting report, the same back to the House with the following recommendations. Resolution 304 to pass. House resolution 593 to pass. House resolution 847 to pass. By committee substitute, Senate Bill 101 to pass. By committee substitute, Senate Bill 185 to pass. Respectfully submitted, Representative Sharon Cooper, the 45th District Chairman. Representative Hagen in the 156th District Chairman of Committee on Rural Development submitted the following report. To speak your committee on Rural Development, has that under its consideration. To follow in resolution to the House. It is instructive meeting report, the same back to the House with the following recommendations. House resolution 753 to pass. Respectfully submitted, Representative Hagen in the 156th District Chairman. Representative Jones, the 25th District of Committee on Technology, Infrastructure, Innovation. Submitted the following report. To speak your committee on technology and infrastructure innovations. It is under its consideration. Following resolution to the House. It is instructive meeting report, the same back to the House with the following recommendations. House resolution 817 to pass. By committee substitute, respectfully submitted. Representative Jones, the 25th District Chairman. Representative Rick Chasper, the 11th District Chairman on Committee on Transportation submitted the following report. Mr. Speaker, your committee on transportation has had under its consideration. The following resolution to the Senate is instructive meeting report, the same back to the House with the following recommendations. Senate resolution 8 to pass. By committee substitute, Senate resolution 231 to pass. By committee substitute, respectfully submitted. Representative Rick Chasper, the 11th District Chairman. That completes the reading of the report's standing committees. Thank you. Thank you. Thank you. All right, members. You may want to get closer to your seats. We're going to take up the local calendar. We'll take up the local calendar. Okay, members. Two bills on the local calendar relate to home state exemption and will require a two-thirds roll call vote for passage. Third reading and passage of uncontested local bills. What purpose does Cheryl and Lady Camp rise? To make a motion. Stage a motion. I make a motion to remove from the local calendar Senate Bill 336 and Senate Bill 555 and send them back to the Intergovernmental Coordination Committee. Mr. Clerk, will you read the caption? Senate Bill 336 by Senator Moore, the 53rd date county. Senate Bill 355 by Senator Anna Navarre today is the 31st tallding county. On the ladies' motion, Senate Bill 336 and Senate Bill 355. The Senate Bill 355. Be recommitted to the Intergovernmental Coordination Committee as their objection hearing none of this ordered. What purpose does Cheryl and Crow rise? To make a motion. Stage a motion. I move that House Bill 825 be removed from the local calendar and voted on separately. Mr. Clerk, will you read the caption? House Bill 825 by Representative Washburn of the 144th Monroe County. On the Jimmers motion that we remove House Bill 825 that we can pool 825 from the local calendar and vote it separate. Here's the objection hearing none of this ordered. Mr. Clerk, we have a motion to remove House Bill 825 and vote it separately. That's the motion. For what purpose does Chairman Crow rise? Mr. Speaker, I'd like to withdraw my previous motion to remove House Bill 825 from the local calendar. The gentleman motion is so granted. He's withdrawn his motion to remove House Bill 825 from the local calendar. For what purpose does the chair lady can't rise? To make a motion. Stage a motion. I move to remove House Bill 825 from the local calendar and remit it back to the Intergovernmental Coordination Committee. Mr. Clerk, will you read the caption to House Bill 825? House Bill 825 by Representative Washburn of the 144th Monroe County. On the ladies' motion, the House Bill 825 be recommitted to the Intergovernmental Coordination Committee as their objection hearing none of this ordered. If there is no objection, we will vote on the local calendar as they hold with a recorded vote hearing none of this ordered. Mr. Clerk, let me get this quiet now just a little bit. This local calendar is imported to a few people in here. So if you have in conversation, you take it to the any room. Mr. Clerk, will you read the local calendar? Senate Bill 328 by Senator Strickland of the 42nd Henry County Senate Bill 329 by Senator Strickland of the 42nd Flint Judicial Circuit Senate Bill 340 by Senator Watson of the First City of Tybie Island Senate Bill 344 by Senator Kennedy the 18th Crawford County Senate Bill 345 by Senator Kennedy the 18th Crawford County Senate Bill 347 by Senator Hodges of the 3rd Glint County City of Brunswick. Okay members, some of you were not listening earlier so we pulled and sent back to committee Senate Bill 336, 355 and House Bill 825. Is there any objection to the previous question being ordered on the local calendar hearing none of the previous questions ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills hearing none of the report of the committee has agreed to. These bills now pass all those in favor of the passage of the bills on the local calendar. The answer to those three I just mentioned will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machines? Have all members voted? All members voted this so Mr. Clerk will you lock the machine? On the passage of the local calendar the yeas are 168 the nays or zero this vote is without House Bill 825 Senate Bill 336 and 355. These bills have received a requisite constitutional majority and they are therefore passed. Okay members we have a whole slew of morning orders. We could be here at the lunch time with morning orders but here's our posture. The red light won't be a warning the red light will be a cut off so I strongly encourage you to recognize these good people that in the gallery that are here celebrating with us today and welcome. We appreciate you all being here members you're going to have 45 seconds 45 seconds that's a big four big five 45 seconds red light will go off and then your microphone will go off. I'm going to give you the list a couple of folks representing Oliver you're recognized to begin our morning orders. We're going to be here at the same time. We're going to be here at the same time. Okay members that south any room is wide open so if you're on the floor and you need to have conversation. Take it out to the south any room or the front door or we're going to pause if lady will suspend until we get attention. We have guest here so let's give them the proper attention. Representative Oliver is recognized for a morning order. Thank you Mr. Speaker representative Crawford and I are happy to recognize Decatur Presbyterian Church that was founded in 1830, 1825, three years after the United States signed a treaty with the Indians. The founder of kindergarten, a founder of Sunday School for DeCab County it is a leading entity in our world of DeCab County. We're very grateful to have them with us today. Thank you for all your service including for the last 15 years a global village school for international teenage girls which initially was founded hundreds of years ago with Agnes Scott College. Thank you ladies and gentlemen. Great to have you with us and thank you for what you're doing in the community. Did they stand you wouldn't you all want to stand so we can recognize you. Here they are to the left. The replica scope. She can talk fast. She's formerly from New York but she's a Georgia now. Ladies and gentlemen friends. Keep it moving Kim. Thank you Mr. Speaker. Colleagues I rise today in honor of exemplary leadership in this chamber. I'm recognizing it with house resolution 738 contributions made by meteorologists and feature reporter Paul Milliken. Paul stand up as I talk about you. Paul is so dedicated every day to making sure that he's promoting Georgia businesses. Introducing beautiful Georgia's beautiful landscape parks. I learned music dance. Cultural things because of Paul. Paul you've made a great impact in our community and you will forever be known in Georgia history. That's what. Thank you everybody stand up and get Paul ahead. You see him every day on Good Day Atlanta. Thank you Mr. Speaker. All right my next one is thank you Mr. Speaker for that one. Colleagues I actually want to tell you just a little bit story about this. I'm going to have Mr. Eric Schrader from Atlanta W.A. Atlanta News First to stand up and be recognized. Several years ago I started a program called Pledge of Allegiance. And listen up because this is for you. I'm going to have a great time today on CBS Atlanta. We highlight elementary schools that are doing the Pledge of Atlanta three times in the morning. And I started this and we launched it in November and it's been going to the end of the year. So if you're interested in having your school, your students to recite the Pledge of Allegiance and it's featured on a TV, please let me know. Eric where are you? Eric thank you for you and your amazing team. We're going to have you out ethics. We talk about civil thank you Eric W.A. Atlanta News First. Thanks a lot meet me in the annenroom guys. Let's take some pictures. You did pretty good. Good to have you all you did good on that part. You didn't talk as fast some other people I know from New York but that's the ones. Reps. It's very is recognized now. I want you all to give the gentleman your special attention. Reps. Next and then represent the butter. All right. Thank you. Thank you, Mr. Speaker. You all know I'm no greater privileged than serving people at District 56. But my greatest honor that I have in this life is being a teacher. And it is my great great great pleasure to welcome the mighty mighty wolf Pat from young middle school. My class to the cap. Well today. That's my seven graders. They they are annoying. I have the things that they want to do. They are in my middle school. People are really hard to do. That's the best way to help them out. You know what I mean. But we love them. And I'm inviting everyone in here today to join us in Capitol 230 at round noon. For lunch with us. If you want to come down and meet my students, they're great. They won't bother you. I promise that you'll bother me. But thank you all for being here today. Excited. Hope you all be careful. Love you all. Thank you, Mr. Speaker. And Credients were hired to recognize for a morning order, you can do it. Tennessee Extension and this morning to recognize a gentleman who is always there, come rain, come shine, cold or warm. Gritting people, guiding them around and helping the elderly time go through the steps. And he always gives you a smile though you won't see it because he's so bearded. You don't see the smile. But ladies and gentlemen, where's Phil Lunyck? Can you please stand up? There's Phil and we're going to announce Phil. Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Thank you for your hard work. Thank you! Thank you. Thank you. Thank you, Mr. Speaker. On your desk, amongst all of the paper是 thank you note. It may be the only one you get today. So be sure you look for it. This came from the people in Warm Springs monarchadows, to do the infrastructure of the pools in the past. They could only be open on Memorial Day and on Labor Day. And now because they have been fixed, they will be able to be open from Memorial Day to Labor Day. So thank you, thank you, thank you for the public and private funding that helped give jobs to Georgia companies and Georgia workers to fix our very special historic pools and warm springs. Warm springs, warm place to be a beautiful place. Thanks to this House for supporting. Chairman Hilton, Director of Morning Order, then we're going to have Prochem Jones and her team. I'll name them off when they come up. Chairman Hilton. Thank you, Mr. Speaker. I rise to recognize head coach Keith Maloof, who recently retired after his retirement at nearly 40 years of head coaching. From 1999 to 2025, Coach Maloof was head coach at Norcross High School. Over the course, he never had a losing season. Him and his wife are up there in the gallery. Please recognize them. Give them a big round of applause. Keith Maloof, congratulations on your retirement. Come on down and join us for a picture. Thank you. Welcome to the People's House. Speaker Prochem Jones, Representative Neil, Yasmin Neil, Representative Cooper, Representative Stevens, Representative Al Williams for Resolution. Well, thank you. Well, thank you, Mr. Speaker. Please join us in honoring for the 25th legislative session, Wesley Nichols. It's his 25th year as a member of the Capitol Press Corps. He serves as lead Capitol photographer for Georgia Public Broadcasting Lawmakers and has helped countless of us with coverage on the formation of laws throughout the legislative process. He personally knows many of you from his two and a half decades of exclusive interviews, press conferences and live hits. And we are thrilled to honor Wes on his quarter century career milestone capturing Georgia politics in West. We'd love to ask you to meet us in the annual room so that we can have pictures with you. Thank you and congratulations. Congratulations. You're joined in the South Edited Reptility Trade Kelly, recognized for a morning order. Give the gentleman your attention, please. Thank you, Mr. Speaker. Colleagues, I'm honored to get to welcome back to the Capitol, the Citertown High School Game Day cheerleaders. We're having them back, Mr. Speaker, because they are the back to back state champions for Game Day cheerleading. They're here with their coaches, Shay Dyer and Shannon Allen. They're up in the gallery. We're so proud of them in Citertown. And so we just want to help welcome them to the Capitol, if y'all are staying to let us recognize you. Thank you. Thank you. Thank you, Mr. Speaker. Did you say state champions back to back? Congratulations. That's awesome. Proud of y'all. Thanks for being here with us. Representative Crawford has recognized for a morning order. And I think you have some friends with him. Representative Crawford. Thank you, Mr. Speaker. Friends, today I rise to support two different groups of athletes, as you know I love sports, because they bring communities together. But I'm here to represent people who have done amazing things breaking barriers. First, I'd like to acknowledge Drew Charter's School for being the first acknowledged Drew Charter School for being the first all black golf team to win a state championship in our state. Please stand to be recognized. Thank you, Mr. Chair. And I would also like to recognize the parents of Pilar King, who was the first to win a gold medal in swimming. First black and also the first from Southwestern Cap High School athlete. Thank you for breaking barriers. Guys, come and meet me in an anti-room, so we can take pictures. We're proud of you. Thank you. Thank you, Mr. Speaker, I yield the well. Thank you, Representative Crawford. That's quite extraordinary. Thank you all for being here. Appreciate it. Representative Adinia, do you recognize, do you have friends with you as well? Yes you do. Representative Adinia and friends, give the gentleman your attention, please. Thank you, Mr. Speaker. Mr. Speaker, please extend the women's month to this month, because there are so many women who have accomplished things. And we don't have enough months in the year. We want to recognize if she can please rise, Mrs. Ego Undoucue, who is the chief operating officer of another chance to customize services that provides disability services for people in our community. She also was on the governor's committee for disabilities. And she also provides a nonprofit in Nigeria that also provides support for people with disabilities. She is recognized and passionate about what she does. And I like to recognize her for this April month, women's month, and recognize her for the work she does. Thank you. Let's give her a big round of applause. Welcome to our house. Thank you, Mr. Speaker. Thank you. Welcome to the people's house. Representative Will Wade, representative Wade and friends. You do have friends. I'm surprised. I've got a couple. Yeah, you do. Gentlemen's recognized. Now they all went back to their seat, just kidding. Thank you, Mr. Speaker. Colleagues, if you'll all rise, we have the honor today to recognize our friend, I'd like her to go and stand up. The Georgia Teacher of the Year for 2025, Miss Holly Witcher, White County at Testantee Elementary School. She works with K through 2nd grade special needs children. And let me tell you, she loves being the teacher of the year to represent our state. It costs this country. But she told me, and I got to hear her tell our first lady and the governor, she can't wait to see those children back in August. But we welcome you to the house and congratulate you on your...\n\nExcellence in education God bless you. Thank you colleagues. Thank you mr. Speaker. Thank you Holly Congratulations what achievement Reps of Reese and the Columbus delegation representing Teddy Reese and the Columbus delegation I recognize for a morning order Thank you mr. Speaker Mr. Speaker we are excited to have with us today mr. Risha Lawrence if you was deep please stand wide While we acknowledge the music in entertainment council and we welcome to Columbus the inaugural Marfess this fest is in recognition of Marraini who is from Columbus, Georgia and will also recognize Other women within the historical perspective of our musical history right here in the state of Georgia We are very excited about Marfess We are excited about Miss Lawrence We're leading us on this venture in Columbus and we invite all of you to come to Columbus, Georgia May 10 through the 11 from Memphis where we are guaranteed to have a good time. Thank you mr. Speaker a year-to-wale Representative Kendrick and friends the lady is recognized for a morning order Morning colleagues. Thank you mr. Speaker. It is a great day in Georgia to recognize and commend the Atlantic Institute many of you may have went to their inner faith dinner that they had last month But let me tell you a little bit about them the Atlantic Institute is a Georgia-based nonprofit organization committed to fostering dialogue education and cultural Understanding and they promote mutual respect and peace by increasing public awareness of diverse cultures believe traditions and Perspectives and through their many initiatives the organization has had a significant and positive impact on this communities So if they will stand up or they're already standing up if you can stand up and give them a round of applause and thank them for the work that they're doing Here in the state of Georgia If you can come down to the anti-Rome so that we can take a picture with you will have your resolution, but thank you mr. Speaker A representative Holly is recognized and friends and represent you bail your next All right my hey my Henry County folks come on up here Henry County delegation Well mr. Speaker Days a day the Lord is made. We shall rejoice to be glad in it and have in our presence The wonderful students of Eagles landing Christian Academy and the gallery There we see go rise up Thank you. It is we are headmaster doctor curly as well as our region five athletics here Um my colleagues. I know you all are busy, but if you love the Lord Jesus Christ and the good that he's doing in Elk or can you arise and give a round of applause to these students Thank you Rebels in durin Carter Recognize for a morning order Rems and Carter Good morning. Thank you mr. Speaker. Good morning colleagues on Monday was the last day a women's history month Then we had some individuals that we wanted to honor and we Were not able to under the Monday, but we wanted to acknowledge them today if they're in the gallery We were asked Ms. Christine Conrado and Ms. J gives if you all will stand Okay, okay, they're over there. Yay So these ladies are part of the pocket book per gay what they do is empower and teach women About how to best use and grow their money Thank you ladies for being here. Thank you for what you do because you're out. No. I love financial education So if you guys would Members would you welcome the pocket book per gay to the Georgia State Capitol Thank you. I yield the well Reps any gains is recognized for a morning order Reptile Houston gains give the gentleman your attention, please members Thank you, mr. Speaker this morning Proud to recognize the North O'Coney Titans basketball team that's here. They're back-to-back class for a state champions Last two seasons have a record of 60 and five the beat pace academy 60 to 51 and this recent state championship But last two seasons two state titles two region titles We're honored to have the team as well as athletic director Their head coach and assistant coaches if y'all wouldn't mind wreck Stand up recognize as we can recognize you. Thanks so much for being here. Appreciate congratulations Thanks Reps. Eddie Park can and is recognized for a morning order Reps. Eddie can And Prince yes, yeah All right Thank you, mr. Seeker today is paranatal provider appreciation day We are honoring Michelle rigs if you will stand on your retirement of 25 years of service to well-star as a director of health As women's health education and patient and support services We're honoring dr. Paula on her work with the Spanish speaking communities Thank you for all that you do and dr. Bird for your studies on HPV and your expertise in minimally invasive gynecology Thank you to the small talk team that is also here for all you do to provide For little ones to hear good stories while in the womb It is also a mr. Day at the Capitol they have ambulances outside if you have not seen And I would love to ask you to stand Lance Chris Derek. Thank you so much for all that you and your workers do for the emergencies in Georgia Thank you to the birth responders Thank you to the group that is over here as well. Please go visit them outside and please come join us for a photo in the South Antirium Congratulations Thank you mr. Speaker I hope Thank you representative great to have y'all thanks for what you do Representative James Burchette And friends You have some Georgia Southern folks with your representative Burchette. Yes, sir We'll perchette Be joined by his Georgia Southern folks if you'll join them The representative Burchette the gentleman suspend Thank you mr. Speaker Uh, suspend just for a minute. Let's get some attention Thank you You have some friends from Georgia Southern who want to join y'all see one more coming down he forgot he graduated from Georgia Southern Dean green did you graduate from Georgia Southern come on down then It's been a day or two Gentlemen recognized thank you mr. Speaker colleagues. I have a great honor of introducing a Georgia Southern University Clay Target team who has For the fourth time one and the national championship in and five years this team has won National championship under the leadership of a close and person to me and my stepfather Marty Fisher Has taken this team to San Antonio for four years and completely dominated The American clay and mayor sport American sports or overall excuse me skit shooting championship. I will say that Out of 1200 students This team has had the opportunity to Set a overall high record I want to recognize some of these uh, these members on the team Tate skipper shot a 100 out of 100 in American skit Andrew Cook Cohen shot a hundred Out of 100 high overall skit champion Blake Reed shot a perfect score in American trap and miss Cheyenne Anderson shot Second overall and they're in the gallery with us I'd ask you all to stand up and be recognized for this high and great honor national champions four years in a row unprecedented and that's just uh, that's just fantastic very much appreciate you Thank you mr. Speaker. Thank you, Representative Birchette four years in a row Wow Way to go Georgia Southern y'all make us proud. We appreciate you and my dear friend childhood friend Marty Fisher Thanks for your great instruction and great leadership and your friendship over the years Appreciate you all Representative Bell This will complete our morning orders Representative bail is recognized for a morning order You General was a spend just for a moment Yeah Excuse me has some friends joining feels a spend just for a minute members But this is our last morning order and then we have an invite resolution. So members if you will come to the floor and For the conversations need to go to the any room Where's the bell Good morning colleagues It gives me a pleasure to announce that the more house college intercollegic boxing team is the first HBCU to everyone the national championship This This school the team was started by Jacobi Bell in In 2012 and the Purdue Hall lot Often he would get chastised for doing so until chief press Scott took it upon himself to be the first mentor and officially Charter the club Through these through the years of hard work and loyal dedication the more house boxing club has been able to compete in the 2025 you as I be a national championship last week Through the through a lot of adversity we were able to leave these two bills earned from the national champions from Caleb Hudson and Elijah McLean We are we'd like to thank the usb open. There's my time also we'd like to thank the members Evan Stevenson a Laliah Goliath Joshua Callahan Elijah McLean Effing Sofia and Breon debris if there are the chambers right now. Can you please rise and give them a round of applause They were here They're moving on low slow. Thank you mr. Speaker are you the well Congratulations to him quite their accomplishment members we have an invite resolution So have your attention For the gentleman. I'm getting ready to recognize mr. Clerk. Well you read their Caption to arrest to resolution house resolution eight seven eight hundred seventy eight mr. Clerk House resolution eight hundred and seventy eight by representative is Wade of the ninth stillcox the 53rd clifton and the hundred and thirty first willos the 55th Chastain in the seventh and others a resolution Commending the nine eight eight suicide and crisis lifeline Members this this has been a priority of this house Over a number of years Appreciate the house of support On this important issue and I form a member of this house Commission Tanner is here with us as well today, but I'm gonna let the Gentlemen's sponsor the resolution acknowledge all of our guests who are here representative will way Wade is recognized to speak to the resolution Thank you, thank you mr. Speaker. I appreciate that very much into my colleagues I think it'd be appropriate if we could rise because we have the honor today to welcome Georgia's first lady the best first lady in these United States Miss Marty camp Hey, man It's also my true honor to be able to recognize one of our colleagues our former member of this body my predecessor Kevin Tanner the commissioner and department of behavioral health and disability services I'm gonna read this briefly and then I want to just make a comment and then turn it over to our first lady So we are committing the nine eight suicide crisis lifeline Whereas behavioral health conditions including mental and substance use disorders or critical public health issues and nine eight Was established to improve access to crisis services in response to the country's growing suicide and mental health crisis Care needs Our first lady has led in this effort as so as Kevin Tanner and I also want to mention the efforts around human trafficking and sex trafficking The impact to children that is a contributor to mental health crisis as well And those those survivors have finally had a voice and I couldn't be more proud than to let you hear from our first lady Well Thank you so much. I appreciate all of you and thank you I want to personally thank you for passing the 10th piece of legislation for human traffickers not only to help them But to you know to have harsher penalties on the perpetrators and I was very honored that commissioner Tanner asked me to help But the word out on nine eight to to let everyone know it's okay to not be okay And I think that's what we would need to remind people Everywhere because these tough topics that are hard to talk about we need to talk about and every one of you has supported that and I want to tell you From the bottom of my heart. Thank you so much for helping so many hard work in Georgians. I appreciate all of you. Thank you Sorry turn it over to my great buddy commissioner Tanner Thank you representative Wade speaker First lady, you know, I just want to again echo the thanks for this body for the work that you've done over many years to make this possible We receive over 20,000 calls a month just in the state of Georgia to the nine eight center We dispatch over five thousand mobile crosses teams every single month in the state So and we have a disproportionate number of those calls coming from rural Georgia and from our agriculture community So this is something she used throughout the state In 2023 only 16% of Georgians had heard of 98 a poll that we did recently 84% of Georgians have now heard of 98 and a lot of that Is because of the work that the first lady's done helping us spread the word She's obviously very well known in our state and is really led on a lot of key issues But we're very thankful that she decided to engage on this and Georgians lives are gonna be saved as these as a result of these efforts So first lady, thank you. Thank you representative Wade and thank you to the Georgia General Assembly for all your work. Thank you I just want to echo first lady Marty Kemp Your dedication to the people of Georgia in so many different ways does not go and notice but especially on 98 98 Working along commissioner Tanner and the commitment from this house into mental health services the commitment of Governor Kemp We just can't thank you enough and have him pack all that is to every corner of this state Every light to say no matter what you zip code 98 988 is there and is it having making a difference so thank you House members Thank you all For always supporting these initiatives when it comes to mental health They couldn't do without us we couldn't do without them. So thank y'all for y'all's commitment as well Thanks for being here with us this morning You You Okay Members As we go through these last couple of days we just need to remind our friends Across the building of a couple of facts You want to come up here you going down there You're closer down here is whatever or you can probably bring your members easier easier down there So we have a little announcement to remind you of And remind the senate of So with that I'm going to recognize the finest golf team in America The house golf team right here so And the gentleman that uh The champion is our golf team and I think he's the uh I think he's the coach and the player your player coach, aren't you? You're a player coach chairman bowel Are you a player coach You're a player coach on the golf team? I think that's who's yes He's a player on about the coach, but he is so chairman Powell is recognized and our golf team from the house the gentleman's recognized ladies and gentlemen of the house We are proud to present to you the members The cup from the governor's cup That the house is now won for five consecutive years Just a just a brief history to this This was a tournament that was started back in the 90s And it was a senate versus the house versus the governor's office versus the engineers of Georgia And this believe been playing this continuously around the state in different golf courses Now when I say you should be proud of this Your house members and we all take sports very serious But we have won this this trophy more times than not And this says a lot for one of the greatest sports this ever been invented and that's the game of golf This is one of those uh one of those sports They can be played individually or as team play to be competition Or for nothing more than just get out into nature Because you're not playing against anybody in those people that I've included The golf is a game that you can cheat on your wife you can cheat on your taxes But you don't cheat it golf Because you're only cheating yourself About playing against par I think you need to get all the members of the house golf team Around of applause and for any of you members who play that would like to be put on the waiting list We'd like to know who you are And here's to the Senate the losers again Some things never change Kickball golf I won't do any further I didn't say I just said losers again Thank you uh members of our golf team appreciate y'all's uh dedication For bringing home the governor's cup again absolutely I know was a tough job. Y'all really hated to go in and play golf Thank you Thank you members for your attention and we'll move on to the rules calendar We will on to the rules calendar mr. Clirt where you read a caption to Senate bill five SB five Senate bill five by senator kapatric of the 32nd and others to be entitled act to amend chapter 46 the title 33 the official go to Georgia antenna relating certification to private review agents So it's a revived for health insurance to implement and maintain a program that allows for the selective application of reductions This bill ever for the committee on insurance that committee recommends this bill do pass by rules committee substitute We're representative Lee Hawkins chairman Hawkins is recognized to present Senate bill five Thank you mr. Speaker you have on your desk Senate bill five sub-stitutes rules substitute These are two bills that we've heard before and had passed through this house Last year we did what was term the gold card bill This is a bill that each insurer shall utilize a reduced requirement for prior approvals This is based on the history of the provider the second bill is the pens and panda bill Think you're all for me with this this requires insurance coverage for pens and panda which is a very terrifying Disease for our young children right now. Chilla is actually doing clinical studies on this issue I wish to give a shout out to them and also a shout out to Jesse Wethington who's a director of the health care Alliance of Georgia The Georgia Healthcare Association rather for his work in agreement with the words in these two bills Mr. Speaker the no questions. I will yield the well Gentlemen has no questions Wait you did have a question last I represent Lisa Campbell to your left if gentlemen will take a question Rimsley Campbell. Yes, thank you mr. Speaker does the gentleman yield he does I'm just trying to clarify you said we had a change on our desks for this bill now You had the spell on your desk rule substitute. Okay. Thank you. I misunderstood. Thank you Gentlemen has no further questions. Thank you sir Gentlemen is yielded the well Is there any objections to the previous question being ordered hearing none the previous questions ordered Is any objection to withdrawing the committee's substitute hearing none the committee's substitute Is withdrawn is there any objection to adopting the substitute offered by the committee on rules Hearing none the rules committee's substitute is adopted Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill Hearing none the report the committee's agreed to shall this bill now pass all in favor of the passage of the bill We'll vote yes those opposed we'll vote no and mr. Clerk will you unlock the machine You Have all members voted All members voted if so Mr. Clerk Will you lock the machine on the passage of senate bill five the yeas are 169 the nays or two this bill having to see the requisite Constitution majority is therefore passed Congratulations Congratulations, chairman scoggins. I know this meant a lot to you and thank for your work on this bill. It's very important bill Mr. Clerk or you read the caption to senate bill 173 173 Senate bill 173 by senator McClaurnd the 14th and others being titled knack to men are three chapter 11 title 9 Of the fish go to George annotated relating pleadings and motions So it's authorized move ants to file notices of uncontested motions and spirit courts and state courts This bill ever for the committee on judiciary that committee recommends to spill do pass by committee substitute Chairman stand gunther has recognized present Senate bill 173 Representative Gunther. Thank you mr. Speaker Senate bill 173 addresses judicial inefficiencies by creating a process to deal with uncontested motions Specifically if a proper pretrial motion is filed and no objection is filed within 60 days A notice of uncontested motion can be filed with the judge if the judge does not rule on that motion within seven days The motion shall be deemed granted and entered 173 allows a tolling of that mechanism if a hearing is scheduled by the judge And also allows the chief judge of the circuit to conduct a review if a judge In their circuit does not rule on multiple motions within a specific time frame Finally set sent bill 173 requires parties to provide copies of motions To courts as well as to require courts to provide instructions on how parties should provide those copies to the court That is the bill. I'll stand for any question gentleman has no questions. Thank you Gentlemen is yielded the well Here is any objection to the previous question being ordered here. He none the previous questions ordered Is any objection to adopting the committee substitute here? He none the committee substitute is adopted Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill here? In none the report the committee's agreed to Shall this bill now pass all of those in favor of the passage of the bill will vote yes all those opposed will vote no And miss clerk will you unlock the machine? You Have all members voted all members voted this so miss clerk\n\nyou a lot machine. All the passage of Senate Bill 173, the yeas are 168, the nays are zero. This bill haven't received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 1717? Senate Bill 17 by Senator Anna Vartey, the 31st and others to be entitled to amend Article 11 of Chapter 2, Title 20, and Article 10 of Chapter 3, Title 38, the fiscal to George Antony relating to public school property and facilities and statewide first responder building mapping information system. This bill I refer to the committee on education. That committee recommends this bill do pass by rules committee substitute. Representative Holt Persinger is recognized to present the bill. Representative Persinger. Thank you Mr. Speaker. This is a rule substitute on Senate Bill 17. I'm also known as Ricky's and Alyssa's Law. This is just clarifying language online 57 under the verification for accuracy for the mapping. We just added relevant public safety agencies, school safety personnel and school administrators on the list of people that can sign off on the accuracy annually so that they've just recently adopted mapping that they can go ahead and sign off on that again. That's the change in the bill. I just ask for your favorable consideration and I'll stand for questions. Representative Ramon up the Suner out to your left. Thank you Mr. Speaker. Does it gem in yield? I will. Thank you. Just really quickly have there been any providers of this kind of technology and how has it worked in other places? We currently have this in our school safety plans. This is just clearing up language to make sure that if they just recently adopted their mapping that they're using now that's required under our school safety plans. I believe we passed in 23 that the school administrators can sign off on that. If there's been no change in the building. Does it in the government for their yields? Yes. Just to clarify. Is it the same contractor provider for all of the schools or is it multiple and we're just trying to get them to talk to each other better? I believe the schools can hire different agencies depending on who they want to use. It's probably put out for our RFP. Got it. Thank you. The representative, Chairman Parsons to your left has recognized for a question. Thanks, Speaker. It's a gem in yield. I do. Yes, I want to ask you about section four. It says here that the, I said if I'm looking at this correctly, that the school systems, each school system will implement this mobile planning alert system capable of and it describes what it's capable of. And then, let's see, on the last page, if I can find it here. The last page that it has 74 through 80, it says that the local boards of education, the local school systems, local governments and agencies and it goes on saying, boys and school boards and education, boards of education, local school systems. And so one will be exempt, will be immune for many civil liability for any damages arising out of the creation of this. I'm just curious. I mean, how serious is it that we would have to provide immunity for them for I say even using it, using this mapping that has to be, that they are mandated to create? I think if there's any unidentified error in the mapping, it's just helping give coverage to if there's something that something's missing the error in the mapping. Okay. If I may ask one more question. Sure. On the section C part four, at, and later July 21st, 206, each public school shall implement the system. And it talks about then says, and the aim is this is alert and shall integrate with technology used in each public, each local public safety answering point included, including but not limited to next generation 911. I know that we passed legislation earlier this year that allows the state creates the ability for the state to use that, but it has not been actually designed. We haven't done anything in code to say exactly what that 911, the next generation 911 system actually is. We've got a study committee, I think that it's pending to be created for the summer, but it says it'll be, we don't even know what that is, how do we put that in code? It's going to integrate with that. If we haven't even described what it is yet. I think it's, I think this is just looking forward in case that passes or gets done that this will already be covered. All right. Well, thank you. Thank you for answering that. Gentlemen has one more question. Will part, did you have a question? Gentlemen's recognize for a question. Thank you, Mr. Speaker. Does gentleman yield? That do. To the author, I appreciate the intent of having a school mapping data. One question that did come to mind is how is this information going to be secured, just because we're creating critically important information, which if by a hacker, if they access that, could that then expose the school to additional vulnerability, speaking again to the immunity aspect of it? Can you provide any additional context with respect to how this information would be protected after it's compiled? It's already protected. You know, this is already, this, we passed this in this school safety bill. This is just the amendment and cleanup. But all that information is protected at the local agencies. By getting everything is vulnerable. You know, additional encryption requirements, things of that nature. That's not written into the bill. I'm sorry. I don't think it's written into the bill, but that's. This is currently happening from our school safety bill. The school safety plans would pass in 23. So whatever is in 23 would be what applies? Just a note there then, you know, perhaps again, to ensure that this information is protected, whether it's by rule regulation or additional legislation, that again, we are taking action to ensure that this information cannot be easily accessible. Well, I know it's not subject to open records request. Of course, thank you. But George Lee left, Straice has recognized for a question. Thank you Mr. Speakers, Jim and Neil. I do. Sir, is it not true that school records, particularly student records and school security records, are subject to protections already, which are implemented at the local level to ensure that data, that sensitive records that security information is secured to the extent that's possible under IT standards from hack or from falling into the wrong hands. Yes, I feel the correct. Thank you. And isn't it true that SB 17 is an effort to make sure that law enforcement and emergency personnel have the information that they need to effectively do their jobs? Bill, you know what he speaks. I've never heard their questions. Thank you. Gentlemen, is he old enough to see, take another question. Are you the one? Gentlemen, is he old to the well? We do have a speaker on the bill. Representative Betsy Highland has recognized to speak to the bill. Representative Holland, give the lady your attention please. Thank you Mr. Speaker. Colleagues, I rise today in support of SB 17. As most of you know, I have a middle schooler at home and many of you got to meet him on crossover day when he was living his best life as a page all the way to 11 o'clock when we got to go home. Having a middle schooler gives me a different perspective on school safety measures. Fire drills and tornado drills were the norm for most of us growing up. Active shooter drills and lockdowns have been the norm for him since kindergarten. I can't explain what the emotion is when you're on a group text with other school parents. And someone texts and says the school is on lockdown. Does anyone know why? And it doesn't feel like you breathe until somebody responds back and says it was a false alarm or I've heard the all clear. When the shooting happened, at Appalachia High School last fall, I waited a day or two before I asked my child if he had heard the news and asked him how it felt. I asked him if it made it feel scary or if it made him feel anxious. And he said no mom, that school only had one resource officer. Our school has two when an active shooter comes we're going to be better prepared. That was the day I realized that my child uses the word win, not if when he thinks about an active shooter coming to his school. I sometimes have heartburn about the details in the school safety bills but I've put that aside in hoping I can just tell my child that we will make sure his school is prepared as possible if a bad actor comes on campus. I wish with all my heart I could go home tonight and say what we did today was past meaningful gun safety reform to try to prevent school shootings in the first place. But we'll get there. We're just not there today. Instead I'll go home and say once again we did everything we could to try to make sure his school was safe if a bad actor should ever come on campus. I will be supporting this bill and I ask you and join me in doing the same. Thank you. Thank you. The lady is yielded the well. Is there any objection to the previous question in order? Here in none the previous question is ordered. Is there any objection to withdrawing the committee substitute? Here in none the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? Here in none the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none the report of the committee has agreed to. Shout this bill now pass all in favor of the passage of the bill. We'll vote yes all those opposed. We'll vote no and Mr. Clerk will you unlock the machine? All members voted. All members voted. If so Mr. Clerk will you lock the machine? All the passage of Senate Bill 17 that yeas are 171 to nays or zero this bill have received a requisite constitutional majority is therefore passed. Mr. Clerk will you read a caption to Senate Bill 131-131? The Senate Bill 131 by Senator Hodges the third. Nothis to be titled. Nacto men chapter 10 and title 49 of the fish go to Georgia and it's headed related to Georgia board of health care workforce. So it's a revive for the establishment of the Georgia health care professional status system. This bill amateurs for the committee on regulated industries that committee recommends this bill do pass by rules committee substitute. Chair lady Kati excuse me Kati I know you Kati Dips is recognized to present the bill. Ladies recognized. Thank you Mr. Speaker. You have on your desk rules substitute to Senate Bill 131 the language from the previous bill has been replaced. This is the exact language exact measure that we voted on on March the 3rd and passed this house by a vote of 170 to 2. It was house bill 612 which deals with parity a very important issue to this house always. It does two things basically. It will add the commissioner the insurance commissioner as a member of the behavioral health coordinator council and it will also establish a parity compliance review panel of 10 who will be able to help us move the ball forward on parity. There is great concern that reports are not reaching the place where we need them to be so it will serve as data collection and have the opportunity for this panel to develop the reporting system that will actually help them evaluate the reported concerns. Mr. Speaker that is what it does if there are any questions I will be glad to take them if not I will yield the well. The lady has a question will part to your left right in front. The gentleman is recognized. Thank you Mr. Speaker. Chair lady Dems I look forward to voting yes for this bill. Quick question then on lines 95 and 96 as I've been doing an additional review it says this new panel will have no authority to impose financial penalties. I recognize the effort to create an incentive to report as opposed to a penalty. However in the event that we continue to see a lack of reporting even with these sorts of incentives and efforts to encourage is there some sort of enforcement mechanism or a state agency that could proceed with enforcement if again parity is not being met. The panel will be under the auspices of the behavioral health system as I understand it they will be reviewing and trying to move that forward. I do not believe that they will they will establish the procedures and policies when they get started so that is how I understand the measure. Thank you. Lady Yule for another question. Yes sir. Representative Oliver to your left is recognized for question. Does it let you? Yes I certainly do. The purpose of this bill is to highlight and bring forward real data. We're not getting that data in a consistent way from the insurance commissioner as we mandated in 1013 so this is a good step forward isn't it true. To bring the data forward we can really understand who is going to compliance and who is not in compliance with true parity is required by law. The lady is correct and knows exactly of what she speaks. Thank you. Lady has no further questions. Thank you Mr. Speaker. I yield the well and ask for your favorable support once again to move this ball forward. The lady has yielded the well. Is any objection to the previous question being ordered hearing none of the previous questions is ordered is there any objection to withdrawing the committee substitute. Hearing none of the committee substituted withdrawn. Is there any objection to copying the mean substitute offered by the committee on rules hearing none of the rules committee substitute is adopted? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill here in the unreported committee to shall this bill now pass all those in favor of the passage of the bill will vote yes Those opposed will vote no and mr. Clerk will you unlock the machine You Have all members voted all Members voted if so mr. Clerk will you lock the machine all the passage of Senate bill 131 the yeas are 166 the nays are three this bill and receive the requisite constitutional majority is therefore passed Members out hope you'll help me welcome a former member of this house Reps. A friend Mallor. He did go to the dark side He did he did go to the dark side, but he's still a pretty good guy. So let's make let's make friend welcome back to the chamber He got he was initiating the end right here Hope reigns eternal He came back to his roots they're not about that. Let's see Members will take up a couple of um Agrees and disagrees this one would be an agree Representing McCollum is recognized for a motion Representing McCollum Thank you mr. Beger. I move that the house agree to the Senate substitute to hb 575 Mr. Clerk will you read a caption please house will 575 by represent McCollum with 30th to be entitled next to men title 32 the physical to Georgia antenna related highways Bridges and fairies those to authorize notice of certain public hearings both the Department of Transportation by electronic publication Representative McCollum is recognized to explain his motion and the Senate's substitute HB 575 is the exact bill that we passed out of the house except for they changed in committee lines 109 to 1 1 1 1 The the Senate decided to change the language which MP the flow of traffic is determined and Requests by the department the Department of Public Safety law enforcement and designated fire department personnel the department agreed I'll stand for any questions Gentlemen has no questions Mr. Speaker I just wanted to say I didn't have to get any help from the gallery this time our freeze up As I told you last time we're both the working progress. We're gonna get there and I yield the well Gentlemen's yielded the well good job On the gentleman's motion the House agreed to the Senate's substitute to house bill 575 All those in favor will vote yes all those opposed will vote no and mr. Clerk will you unlock the machines? Have all members voted all members voted If so mr. Clerk will you lock the machine on the gentleman's motion the yeas are 167 the nay is one and the House has agreed to the Senate's substitute the House bill 575 We're representative Lomston is recognized for a motion chairman Lomston Mr. Speaker I move that we agree to the Senate's substitute of House bill 94 That's clerk will you read the caption House bill 94 by refs that have lumpston to the 12th being titled back to men chapter 24 title 33 the fiscal to Georgia Antietta really the insurance generally so it's required coverage for certain expenses for standard fertility preservation services For representative Lomston is recognized to explain the Senate's substitute to House bill 94 Chairman Lomston Mr. Speaker members House bill 94 is a bill that we passed out prior to crossover It's the fertility preservation bill the only change that was made in the Senate was they removed all state plans From the coverage which we thought we had that covered when we send it over to them But there was something that was found there so the Senate substitute simply removed the coverage in the state plans Gentlemen yield I yield Will Park is recognized for a question Chairman Lomston can you thank you for explaining the change can you understand can you help me understand why State plans were removed For purposes of this health benefit generally when we are dealing with insurance Related coverage particularly as it as it pertains to the state of Georgia the cost to the state of Georgia That had not been worked out so the private plans are okay with this So all this is doing is applying to the private plans will work on that part of it as we go into the next session Thank you, sir Repel any still cox your lady still cox right up the center out on your right is right now for a question does the gentleman yield I do Isn't it true that this will allow him and who have suffered terribly from all kinds of cancer to still Have children yes, that's the entire purpose. Thank you so much. I appreciate you bringing the bill. Mr. Speaker. I yield will You had one more question would you yield represent the aisle Dr. Owls represents ours recognize for question you're left in the back. Yes Thank you. Does the gentleman yield I did this is a clarification to the whoops question So you said that the bill is amended by the Senate no longer manages state Health benefit plans it only applies to private Insurance plans correct in my understanding of how a whistle law works. Do we have the power to regulate private Private non-a-risk plans Non-risk plans. Okay. Thank you How you're the way gentleman's yielded the well On the gentleman's motion that the House agreed to the Senate substitute to house bill 94 all those in favor We'll vote yes, those opposed will vote no mr. Clerk. Were you in lock the machine? All Now all members voted All members voted yes so this clerk were you lock the machines? All the gentleman's motion the yeas are one hundred sixty two then days are three and the House has agreed to the Senate Substitute the House bill 94 The representative Lomston is recognized for a motion Speak mr. Speaker I move that the House agreed to the Senate substitute of House bill 182 is amended by the House Mr. Clerk will you read the caption House for 182 by reps that have lump sum of the 12 to be titled and act to amend chapter 25 Title 33 the Fisher go to Georgia annotated relating life insurance is to prohibit a policy a group life insurance from excluding or Restricting liability for certain deaths occurring well individuals on active duty Who represent the blumston is recognized to explain the Senate substitute and the House amendment gentlemen recognized Mr. Speaker House bill 182 is Is the same as House bill 410 which is a Department of insurance cleanup bill This is a bill that we passed out unanimously a few weeks ago 164 to zero We removed the portion of the original portion of 182 and the amendment Is the same as House bill 410 And The only change that in the amendment was surrounding the language around the confidentiality draft report Simply inserts language that was approved by the National Association of Insurance Commissioners model law. So those were the changes, sir I'm sure you're favorable consideration. General you have a question Yes Representative Jasmine Clark to your left is recognized for a question Thank you, Mr. Speaker to the gentleman you yes, so is it my understanding that the original House bill 182 Which we did vote out that dealt with life insurance is no longer none of that language is in this New version of House bill 182 that is not in this bill But there was an identical bill to 182 that was introduced in the Senate House Senate bill 209 Which we passed out of this chamber Several weeks ago, so it's already on the governor's desk ready for signature. Thank you Gentlemen has a further questions. Thank you, sir You'll the way gentleman's yielded the well. Thank you for the explanation Is any objection to adoption of the House amendment? Here in the House amendment is adopted on the gentleman's motion that the House agreed to the Senate substitute the House bill 182 as amended by the House all those in favor will vote yes all those opposed will vote no Mr. Clerk will you unlock the machines? Have all members voted for what purposes represented Bernal rise She weighs all members voted if so Mr. Clerk will you lock the machines on the gentleman's motion the yeas are 166 the nays are two and the House has agreed to the Senate Substitute to House bill 182 as amended by the House Members if you have pages Join me now in front with your pages. We're going to take a little lunch break here. I'm getting hungry We have a couple of a couple of announcements before we recess for lunch Members if you have pages join us down front chairman Corbett Excuse me end of date Chairman Parish is this now at the end of the day Well, that's now then I'm ready Chairman of rules recognized for an announcement. Thank you, miss speaker I'd like to ask for the members of the rules committee to meet me in room 341 at 130 130 room 341. Thank you You Members this House will stand in recess until 2 p.m. 2 p.m House will stand in recess until 2 p.m. Thank you members",
  "updated_at": "2026-02-13T13:20:25.346007+00:00"
}