{
  "video_id": "yqhQclWf8xI",
  "url": "https://youtu.be/yqhQclWf8xI?t=2579",
  "title": "Georgia House - Day 15 (2026-02-11)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 15,
  "video_date": "2026-02-11",
  "duration_minutes": 170,
  "summary": "Here is a summary of the Georgia House session from 2026-02-11:\n\n**Overview**\nThe session was relatively uneventful, with no substantive legislation discussed or voted on. The main focus was on a devotional message from Pastor Cecil Barden and the routine confirmation of the previous legislative day's journal.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\n- **HB 1300**: Act to amend the law creating the Jasper County Water and Sewer Authority.\n\n**Notable Moments**\n- Pastor Cecil Barden delivered a devotional message emphasizing the importance of seeking wisdom from God.\n- The House confirmed the journal from the previous legislative day without incident.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum was present, as the session proceeded without any issues raised.\n\n**Adjournment**\nThe session adjourned, with the next session date unspecified in the transcript.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Thank you for speaking. Good morning colleagues. It's my privilege and honor this morning to introduce Pastor Cecil Barden. Pastor Barden is from Eastman Dodge County. He's a company today by his wife of 27 years. Miss Joyce, she's out in the halls there. He has two children. A daughter, Alora, is a senior at UGA. Gold dog. Gold dog, he says. And his son, Aaron, is a senior at the Dodge County High School. Pastor Barden is a graduate from Mercer with a criminal justice. He also has a master's of divinity from New Orleans Theology Seminary. And he's working on his doctorate right now. He's also a member of or a served in the US Army also with the Gold Four. So we appreciate his service from that point. And he'll be serving us up a little bit of wisdom today. Wisdom will be the topic. So Pastor Barden, please come and share with us. It is a privilege and honor to stand before you today to speak of Ralston and all the members of the Georgia House of Representatives. Greetings from Faith and Action about his church in Eastman Georgia. And a special thanks to Representative Robert Pruitt for inviting me to be the chaplain of the day. I heard a story the other day that exemplifies what I want to talk about today. There is this young man and he couldn't unclog his sink. And finally he came to the point where he had exhausted all his avenues. He had tried drain all kind of chemical things chemicals. He tried to unclog it. He decided to call a plumber and the plumber shows up and he shows him where the clog is at. And he opens the cabinets upon the kitchen sink and he sees those are metal pipes. And the plumber says I need to go back to the truck right quick and I'll be right back. And so he heads out and he goes out to his truck and about a couple of minutes he comes back in and he opens the bottle of those doors on the kitchen sink and he takes that metal hammer and he bam! Wow! The clog just shot through. And then he said he looked at the young guy and he said that would be $75. The young man said $75. All you did was hit the pipe with the hammer. The plumber looked at it and he says but I know where to hit. So you a lot of times we pay for wisdom and that's what I want to talk about today. We all need wisdom. In fact in this time of pandemic and in these times of financial upheaval and these uncertain days we all need the thing we call wisdom. The Bible says in wisdom the Bible teaches in wisdom wisdom in Proverbs 9 and 10 how do you get wisdom it says the fear of the Lord. Let me say that one more time. The fear of the Lord is the beginning of wisdom and knowledge of the Holy One is understanding. In James chapter 1 verse 5 he says if any of you lacks wisdom guess what you should do the Bible says you should ask God that gives you generously without finding fault and it will be given to you two things we need to do to obtain wisdom first. We must fear God not an unhealthy fear but a reverential fear. What do you mean pastor I'm glad you ask? We stand in awe. We ought to stand in reverence of God. We are to admire the almighty El Shadya God the El Elion the most high God we are to fear him and it will lead to wisdom. I'm about ready shout of a henna man. Secondly we are to axe God for wisdom and that what James says he says you are to axe God for wisdom if any of you lacks wisdom axe God. So if we are going to have wisdom we must axe God we must be humble enough to axe. I'm not going to be before you long I'm going to close with this last story. I was a youth minister before I became a pastor and I was outside one time and we were having this fellowship with a lot of our teenagers and one of the teenagers name is Justin he was a real low key young man and he didn't like to talk and I was eating some bar peanuts some I say bar peanuts and I was eating those bar peanuts. And Justin was coming closer and closer I could see him out of my peripheral vision and he kept getting closer and close I almost feel the breath on my hair and breathing on my neck. And I missed around it turn around too quick almost kids just. What you doing man he wouldn't say anything but I knew what he really wanted he wouldn't ask for the ball peanuts for so finally you know what I did I said do you want some peanuts Justin. Let me tell you what I did I wanted to give him the peanuts but Justin wasn't ready to ask and finally I said do you really want some Justin he said yes that's how he said yes I took the whole bag and I gave him all of the ball peanuts you know why I did that because he asked. Well the Bible says if you want wisdom you must fear God you must ax God and God will give it to you generously without finding fault. So here's the last thing I want to say don't be a Justin be humble enough to ax for wisdom. Amen. Let's stand together and we'll pray Lord we come before you and give you praise you are the omnipotent all power for the omniscient all knowing the omnipresent everywhere God of the universe you are ready to give us wisdom Lord if we fear you and if we ax you. So Lord we fear you today and we actually right now to continually give us wisdom that we might make the right decisions and be wise enough to make the great decisions that will glorify your name and bless the resonance of the state of Georgia and I ask this in the wonderful the powerful and the strong name of Jesus Christ the only risen savior and all the God's people said amen amen and amen will you pledge with us. To the flag of the United States of America and to the Republic for which is stand one nation indivisible with liberty and justice for all. I tried to give it to you doorkeepers are unlocked the doors. you members may greet the chaplain in the south any room. Chair recognizes chairman hogan the chair of the committee on information and all it's thank you mr. Speaker you committee on information all this has read the journal of the previous legislative day and the found it to be correct and further more mr. Speaker I can't change the direction of the win but I can adjust my sales and always reach my destination. chairman hogan the chair of the committee on information and audits reports that the journal the previous legislative day has been read and found to be correct is there any objection to the confirmation of the journal the chair here's not in the journal is confirmed the clerk will read the resolution establishing the order of business for the day. mr. Burns on 59th Miss following me establishes the order business in her first part of the period unanimous concerns introduction of bills and resolutions first reading and reference of house bills and resolutions. Second reading of bills and resolutions reports of standing committees third reading and passage of uncontested local bills and resolutions first reading and reference of Senate bills and resolutions morning orders. is there any objection to the adoption of the resolution establishing the order of business for the day the chair here's not in the resolution is adopted first reading of bills and resolutions the court. resolution is a clerk or read House bill 1300 by reps and homes 120 ninth bill of the total act of men and that created Jasper County Water and sewer authority. is there any objection to the order of business for the day the chair here's not in the resolution is a clerk or read House bill 1300 by reps and homes 120 ninth bill of the total act of men and that created a motion of 45th or one of the 20th Bentley the 139th and others will be titled an act of men part 3, Article 6 of chapter 2 entitled 20th the physical Georgia and Teta relating to educational programs. Education House bill 1304 by reps and apartments the 27th jacks and 128th Cooper the 43rd embassy 13th gains 117th and others will be titled an act to amend title 31 of the physical the Georgia and Teta relating the health. Health and Human Services. Hospital 1305 by Representative Neal of 74th and Mallow of 163rd. Bill B. Toddl and Acto Men, Article 2, Chapter 7, Title 48. The physical of Georgia annotated relating the impositionary computation exemptions and credits from state income tax. Ways and means. Hospital 1306 by Representative Hugley, the 136th of 133rd, Spirory on 35th. Williams of the 168th Buckner, 137th. Bill B. Toddl and Acto Men, Article 1, Chapter 5, Title 49. The physical of Georgia annotated relating the children and youth service. Juvenile Justice. Hospital 1307 by Representative Houston of the 170th. Bill B. Toddl and Acto Men, Title 25. The physical of Georgia annotated relating the file protection and safety. Energy, utilities and telecommunications. Hospital 1305 by Representative Williams, 148th. Taylor, 173rd, Gamble of the 15th, House of the 170th. Jones, the 25th and others. Bill B. Toddl and Acto Men, Chapter 24, Title 33. The physical of Georgia annotated relating the insurance generally. Insurance. Hospital 1309 by Representative Thomas of the 65th. Skullfield of the 60th, Lemon of the 99th. And Lewis Ward of the 109th. Bill B. Toddl and Acto Men, Title 2. The physical of Georgia annotated relating the agriculture. Agriculture and consumer affairs. Hospital 1310 by Representative Dunnohu, the 30th bird of the 20th, Gamble of the 15th, Gilligan of the 24th, and Cantrell of the 22nd. Bill to be entitled to amend Chapter 32, Title 33. The physical of Georgia annotated relating the property insurance. Insurance. Hospital 1316 by Representative Neal of the 74th and Taylor of the 173rd. Bill to be titled to amend Title 33, the physical of Georgia annotated relating the insurance. Insurance. Hospital 1317 by Representative Barr, the 103rd, way to the 9th. Bob DeHon of the 17th, part, no the 5th. Dunnohu, the 30th and others. Bill to be titled to amend Chapter 2, Title 21 of the physical of Georgia annotated relating the elections and primaries generally. Special Committee on Election Integrity. Hospital 1318 by Representative Carter, the 92nd, Beverly of the 143rd, mentally 88th, Holcomb of the 81st. Bruce the 61st and others. Bill to be titled to amend part 11 of the 21st, Title 21 of the physical of Georgia annotated relating the general provisions regarding preparation for and conduct of. Primaries and elections. Special Committee on Election Integrity. Hospital 1319 by Representative Workies, the 157th, Weed Hour, the 119th, Gaines, and the 117th, Kelly, the 16th, Green, and the 151st and others.\n\nBill Bittado, an act of men, part three, bar number seven, chapter three, a total 20 of the E. Fischkullo, Georgia, Anatede, relating the Georgia Student Finds authority. Higher education. House Bill 1320, my reps of 90, the hundred and thirtieth black, one of the hundred and forty six, Williamson in the hundred and fifteen. Bill Bittado, an act of men, title forty eight, Fischkullo, Georgia, Anatede, relating to revenue and taxation. Ways and Maines. House Bill 1321, my reps of the Perchetta, the hundred and seventy six, Dempsey in the thirteenth hitches on under sixty first, Evans in the fifty seventh and others. Bill Bittado, an act of men, title ten of the E. Fischkullo, Georgia, Anatede, relating to commerce. Judiciary. House Bill 1322, my reps of the Apollo, the thirty second, John's the twenty fifth, John's the eleventh, Mitchell the eighty eighth, Buckner the hundred and thirty seventh, and others, Bill Bittado, an act to amend, title forty six, Fischkullo, Georgia, Anatede, relating to public utilities and public transportation. Energy utilities and telecommunication. House Bill 1323, my reps of the camp, with the hundred and thirty first, Bill Bittado, an act to provide a homestead exemption from Upsen County, Added to Lorm taxes. Intergovernmental coordination. House Bill 1324, my reps of the camp, with the hundred and thirty first, Hawkins the twenty seventh, new, no twenty third, Taylor, hundred seventy third, Lumpston the twelfth and others. Bill Bittado, an act to amend, chapter eleven, title thirty one, and title thirty three, the Fischkullo, Georgia, Anatede, relating to emergency medical services and insurance. Insurance. House Bill 1325, bribes of camp, hundred and thirty first, Bill Bittado, an act to provide a homestead exemption from Upsen County, Added to Lorm taxes. Intergovernmental coordination. House Bill 1326, viele retention of camp, hundred and thirty first, Bill Bittado, an act to provide a homestead exemption from Upsen County, add to Lorm taxes. Intergovernmental coordination. House Bill 1327, my reps錤, Class Bittado, an act to provide a homestead exemption from Upsen County, Add Valorum Taxes. Intergovernmental Accordination. SBL 1328, our Resolution of Camp, 131st Bill, be Totted Act of Menden Act, ride a homestead exemption of $10,000 for all, Ups and County, Add Valorum Taxes. Intergovernmental Accordination. House Resolution 757, by the way. Chokus 138th Resolution, honoring the life of Sheriff, Horace Irving Snyder, and dedicating a mile of road and his memory. Transportation. House Resolution 758, by the way, is a Neil 74th Resolution encouraging all employers in Georgia to adopt street line job application processes. Industry and labor. House Resolution 759, by the Resolution, Neil 74th and Gilear to the 160th second. Resolution urging local law enforcement agencies to establish public safety and passenger units. Public safety and homeland security. Senate Bill 231 by Senator Anand of Arte, 31st, paying to the 54th. Pairing to the 42nd, albers, the 56th, Halpern of the 39th and others. Will be titled an Act of a Mench, Chapter 2, Title 20, the Fisher go to Georgia, and Tate relating the elementary and secondary education. Education. Senate Bill 277, by Senator Mullis, the 53rd Harper of the 7th, Huffstead, with the 52nd, getting to the 47th. Will be titled an Act of a Mench, Part III of Arc, 4th Chapter 11, the Title 16, with the Fisher go to Georgia, and Tate relating to carrying and possession of firearms. Public safety and homeland security. Senate Bill 340 by Representative Kirkpatrick, of the 32nd, Watson, the 1st, Burke of the 11th, Dugan of the 30th, Iowa of the 38th and others. Will be titled an Act of a Mench, Code Section 317, 95, of the Fisher go to Georgia, and Tate relating to funding of medical education. Health and Human Services. Senate Bill 358 by Senator Kirkpatrick, and 32nd, Thompson, the 14th, Harvest of the 15th, Robertson, 29th, Anand of Arte, 31st and others. Will be titled an Act of a Mench, Code Section 3555, with the Fisher go to Georgia, and Tate relating to Georgia Public Safety Training, Public Safety and Homeland Security. Senate Bill 361 by Senator Walker, the 20th Harvest of the 15th, Mulles of the 53rd, Cousins of the 46, Alvers of the 56th and others. Will be titled an Act to amend, Chapter 7, the Title 48, the Fisher go to Georgia, and Tate relating to income taxes. Ways and Means. Senate Bill 453 by Senator Kennedy, the 18th, and Will be titled an Act of Mellon Act, known as the Making Water Authority Act. The Intergovernmental Coordinating Nation. Senate Bill 457 by Senator Burns, the 23rd, Anderson, the 24th, Bill be titled an Act to amend, and act providing for the consolidation of Richmond County in the city of Augusta. Governor Lafayr's. Senate Bill 458 by Senator Burns, the 23rd, Anderson, the 24th, Bill be titled an Act to amend, and act to regulate, and public instruction for the County of Richmond. Governor Lafayr's. Senate Bill 462 by Senator Sumner, so the 13th, Bill be titled an Act to amend, and act reconstituting the Board of Education, the Lee County. Intergovernmental Coordinating Nation. That completes first readers. Mm-hm. Second reading of bills and resolutions, the clerk will read. House Bill 1288 by Representative Taylor, with 173rd Williams, the 145th, Bentley of the 13th, Dempsey of the 13th Collins of the 68th, and others that Bill would like to state employees, the Sherens Department, House Bill 1289 by Representative Taylor, the 173rd Stevens, with 164th, Petrie of the 166th, Hogan of the 179th, Black Jam, the 137th, and others, the Bill would like to serve as mining, House Bill 1290 by Representative Corbett of the 174th, the hood of the 175th, Marshant of the 176th, Watson of the 172nd, Roads of the 120th, the Bill would like to exemptions from sales and use taxes. House Bill 1291 by Representative Smith, of the 133rd Williams, with 148th, with hour of 119th Williams, and of the 115th, 518th, the Bill would like to exemptions from sales and use tax, House Bill 1292 by Representative Jasper's of the 11th, Athens of the 144th, Irwin of the 28th, England of the 116th, Perkle of the 155th, a Bill would like to education House Bill 1293, by Representative Lim of the 99th, Wynn of the 89th, Byrd of the 20th, and Park of the 101st, to Bill would like to general provisions of state government, House Bill 1294 by Representative Corbett of the 174th, Roads of the 120th, the Ricky of the 169th, but hood of the 175th, Bradley of the 6th, a Bill would like to government agent to access a band-in mobile home, lean on intact mobile home, barrel like mobile homes, notice and governmental immunity, House Bill 1295 by Representative Corbett of the 174th, Irwin of the 28th, Wade of the 9th, Dominic of the 29th, a Bill would like to employment under the Quality Basic Education Act, House Bill 1296 by Representative Kinner, to the 102nd, a Bill would like to general provisions of wills, trusted administration of the states, House Bill 1297 by Representative Gamble of the 155th, the 118th, Red Hour of the 119th, Washburn of the 111st, Bar of the 133rd, and others, a Bill would like to property insurance, House Bill 1298 by Representative Gamble, the 15th, Matthewick of the 73rd Green, of the 111st Williams of the 145th, Sewell of the 34th, a Bill relating to leans of hospitals, and nursing homes, House Bill 1299 by Representative Levin of the 33rd, a Bill to provide that the judge of the probate, Court of Elbert County, shall serve as the Chief Magistrate Judge of the Magistrate Court of Elbert County, House Bill 1311 by Representative Levin, of the 176th, a Bill to authorize the assessment and collection of technology fee by the probate court of the Nier County, House Bill 1212 by Representative Houston of the 170th, a Bill to amend and act, to creating the Board of Education of Barian County, House Bill 1313 by Representative Rechadot 176th, a Bill to amend and act creating the Office of Commissioner, of Roads and Revenues of the County of Atkinson, House Bill 1314 by Representative Camp of the 131st, a Bill to amend and act to provide for the merger, in consolidation of the existing Upton County School System, and the existing City of Thomas, independent school system, into a single county wide school system, House Bill 1315 by Representative Rechadot 176th, a Bill to amend and act, constitute the Board of Education of Atkinson County. House Resolution 756 by Representative Rechadot the 33rd, evens of the 164th, made the 139th, five of the 118th, black men of the 146th, and others, a resolution proposing amendment to the Constitution, so as to provide that the qualified low income building projects may be classified as a separate class of property for Agilor and property tax purposes, Senate Bill 370 by Senator Calzard of the 46th, House debt load of the 52nd pane of the 54th judge, the second and the 22nd, the parade of the 40th second, and others, a Bill relating to income taxes, House Bill Senate Bill 406 by Senator Hickman of the 4th, a Bill to amend and act reconstituting Board of Education of Effingham County, Senate Bill 407 by Senator Hickman of the 4th, a Bill to amend and act green, the Board of Commissioners of Effingham County. Senate Bill 409 by Senator Payne of the 54th, a Bill to revise and restate the law relating to Whitfield County Board of Education, Senate Bill 4010 by Senator Payne of the 54th, House debt load of the 52nd, a Bill to amend and act, create a Board of New Board of Education for Gordon County, Senate Bill 411 by Senator Ann Varte of the 31st, a Bill to amend and act to provide for the election and the members of the Board of Education of Harrison County, Senate Bill 412 by Senator Ann Varte of the 31st, a Bill to amend and act, creating the Board of Commissioners of Renahmenus in and for the County of compute. Senate Bill 413 by Kathryn Valay. And in and of rt of 31st, a Bill to amend and act larv into Board of Education for the County, Senate Bill 414 by Senator celebrates number 19 in an blt, a Bill to amend and ahí, and install grant grateful commissioners of Long County, Senate Bill 14 by Senator<|km|>, flea from the adults to child court in Tuberto HSBNow in service of Pu�� it is heading to B� Sc Fontaine Country A reports from a三 countries of Clench County, cooker eight, Fresh Israel City of DWB police in senator Berns in Melbourne, sentence wearing in advanced citizen training, that turn thirdvs three, because of the 26th and Jones of the 25th of Elton, made an act to provide for the restructuring of the city of Macon, city of Payne City, and Bibb County. Senate Bill 437, vice-centered, offers of the 56th Beech of the 21st, Patrick of the 32nd, brass of the 28th, built to amend an act creating board of commissioners of Fulton County. Senate Bill 446, vice-centered, burns of the 23rd of Elton, made an act to be constituted in board of education of Warren County, Senate Bill 447, vice-centered, burns of the 23rd of Elton, made an act creating board of commissioners of Glasgow County. Senate Bill 450, vice-centered, strictly end of the 17th, and Anderson of the 43rd of Elton, made an act to reestablish the board of commissioners of Newton County. Senate Bill 451, vice-centered, strictly end of the 17th, and Anderson of the 43rd of Elton, to amend an act providing a new board of education for Newton County, through 2nd readers. Reports are standing committees, the clerk will read. Upside of the channel, hooded the 175th district chairman of the committee on game-fishing parks and then a consideration of following bills in the house. Instructed me to report the same back to the house, the following recommendations, House Bill 1147, do pass, House Bill 1148, do pass. House Bill 1233, do pass by substitute, respectfully submitted, John Mahood of the 175th district chairman. Representative Stration of the 104th district chairman on committee on judiciary, submitted the following report. Respect your committee on judiciary, is added on consideration following bills of the house. Instructed me to report the same back to the house with the following recommendations. House Bill 974, do pass by substitute. House Bill 1137, do pass, House Bill 1271, do pass by substitute. House Bill 1274, do pass. House Bill 1275, do pass by substitute, respectfully submitted, Representative Stration of the 104th district chairman. Representative Schraublackman, the 146th district chairman on committee on ways and means, submitted the five-year-old, the follow and report. The speaker committee on ways and means, is added on consideration following bills of the house in the Senate. Instructed me to report the same back to the house with the following recommendations, House Bill 1223, do pass, Senate Bill 87, do pass by substitute. Respectfully submitted, Representative Schraublackman and the 146th district chairman. Representative Jan Tamkursley, 160th district chairman on committee and an intercom of coordination locals, submit the following report, Speaker Committee on an intergovernmental coordination local Senate and consideration Following bills of the House and Senate and its objective meeting report to same back to the House and following recommendations House bill 1226 do pass House bill 1227 do pass House bill 1229 do pass House bill 1235 do pass House bill 1212 1245 do pass House bill 1264 do pass House bill 1284 do pass House bill 1285 do pass House bill 1286 do pass House bill 1287 do pass Centrel bill 384 do pass Senate bill 385, do pass Senate Bill 391 do pass by Committee substitute Senate Bill 392 do pass Senate bill 399 do pass Senate Bill 400 do pass bluff'll forever one new path Senate bill 402 do pass Senate bullet 430, do pass Senate bill 431 do pass House Bill 1228 to pass House Bill 1230 to pass respectfully submitted, I just have Jan Taker, so the 160th District Chairman. That completes the reading of the Report to Standing Committees. All right, we're going on now to the local calendar. House will come to order. Third reading and passage of uncontested local bills. That we have both a local calendar. We have both a local calendar and a supplemental local calendar. There's no objection. The chair is going to direct the clerk to read them together and they will be voted on together. The local calendar and the supplemental calendar are being considered together. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing no objection, it is so ordered. Clerk will read the local calendar. House Bill 1234 by resident per cent of the 176 where county? House Bill 1284 by resident Jackson, 128th Washington County. House Bill 1285 by resident spire 135th Muscogee County. House Bill 1286 by resident Jackson, 128th Washington County. House Bill 1287 by resident camp of the 131st Upsen County. Senate Bill 384 by senator Anderson, 24th Columbia County. Senate Bill 391 by substitute by senator chillery, 19th Jeff Davis County. Senate Bill 392 by senator chillery, 19th Jeff Davis County. Senate Bill 399 by senator Burns. The 23rd Mcduffie County. Senate Bill 400 by senator Burns. The 23rd Mcduffie County. Senate Bill 401 by senator Burns. The 23rd Jefferson County. Senate Bill 402 by senator Burns. The 23rd Jefferson County. Senate Bill 430 by senator summers of the 13th Worth County. Senate Bill 431 by senator summers of the 13th Worth County. House Bill 1228 by resident camp of the 131st Lamar County. House Bill 1230 by resident camp of the 131st Lamar County. Senate Bill 401 by senator jimmy. Senate Bill 401 by senator jimmy. Is there any objection to the previous question being ordered on the local calendar? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar and the supplemental local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Senator straying will approve the design. May the Clerk signate for today settings to judge of the zrobi with performance Arkansas Gore turn. May his proposed background beomerHHHHd corrode andre anxious option. Commet cheesy have all members voted. If so, the clerk will lock the machines on the passage of the bills on the local calendar and the supplemental local calendar. The eyes are 144, the days are seven. These bills having received the requisite constitutional majority are therefore passed. What purpose does Chairman Tancersley rise? Mr. Speaker, I rise to make a motion. State your motion. I move. We immediately transmit the local and supplemental calendars to the Senate. Chairman Tancersley has moved for immediate transmittal of both the local and supplemental local calendars to the state Senate. Is there objection? Is there objection? Chair, here's none and it is so ordered. All right. We're going on now to morning orders. Morning orders. Let's see. Let's see. We're going to have two minutes each of morning orders today. They recognize this for a morning order representative Bentley. Thank you, Mr. Speaker and happy Friday colleagues. Today is a special day here in the state of Georgia because today I come forward to recognize the great works of Kelly Jackson down in Macon County, Georgia. Kelly Jackson is a counselor at the Macon County middle school and she was featured in the January, February issue of the professional association Georgia's Educators Magazine, page one. In the feature educators from the cross state were interview and effort to document how they sustained hope and resilience the past two years of COVID-19. Jackson is playing in the article that social isolation hit hard. She went into initial year of COVID. She added that she really enjoys what she does as a counselor. She realized that there are trials in this life and just because it's raining today that the sun won't shine tomorrow. Jackson is a native of Montezuma, Georgia. She holds bachelor's degrees and master's degrees from Georgia Southern University, Albany State University and of course Fort Valley State University. She has been a counselor in Macon County since 2011. She's been an educator for 17 years. She's a member of the professional association of Georgia and a member of Delta Sigma Theta Sororats Incorporated. She's the daughter of Mary Helen Jackson in the late Charlie Jackson senior and she has one sister Debbie Jackson Walker and one brother Charlie Jackson Jr. Today is Kelly Jackson Day at the state capital and we just want to congratulate her for being an educator for 17 years in the state of Georgia. Thank you Mr. Speaker and colleagues for joining me in acknowledging Kelly Jackson. To recognize this representative Benton for a morning order. Thank you Mr. Speaker. I want to call attention to the members of the House about two birthdays, one today, one tomorrow. Today, February 11th is Jackson County's birthday. That is my home county. The day Jackson County is 226 years old. It was carved out for Franklin County. It was named in honor of General James Jackson. The county was originally 1800 square miles. In 1801, the general assembly granted 40,000 acres of land in the county for a state college, Franklin College. Classes began that year. The same year the town of Athens was developed around the school and a new county was created, Clark from Jackson County. Other counties created from Jackson were Madison, Walton, Gweneh, Hall, Banks and Barrow. It was a little older birthday, tomorrow is Georgia's birthday. February 12th, 1733. That makes Georgia 289 years old. It was founded by English colonists. They were led by James Oglethorpe. They sailed up the Savannah River and landed at Yamacral Bluff and founded the town of Savannah, the first permanent English settlement in Georgia. There were four reasons for Georgia. It was stated in the charter, trade, defense of South Carolina, religious freedom, home for debtors. It was only successful at defense of South Carolina and religious freedom. They were not able to develop the type of trade that they were wanting in wine and silk and no debt or ever came to Georgia. Thank you, Mr. Speaker. I'll yield the oil. Representative, I thought you were going to tell them who else is birthdays tomorrow. You knew who else has a birthday tomorrow? Abraham Lincoln. Chair recognizes representative Scofield for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. As we are well aware, February is Black History Month, a time to celebrate, acknowledge, and reflect on the contributions made by African-Americans from past, present, and future. As a proud African-American woman whose lineage is traced back to Senegal, I like many of my colleagues come from a family of doctors, lawyers, architects, tradesmen, business owners, teachers, artists, white and blue collar workers, all who have contributed to this nation and ways often overlooked. My history was taught to me by my parents, my teachers, my pastors, my colleagues, and each day that God allows me to open my eyes, my life contributions will become somebody's history. As a member of this collective body, our history, whether good, bad, or ugly, has been shaped, has shaped the foundational and fundamental core values of who we are. My history is longer than the 28 days allotted and deeper than words and books. No one can deny, devalue, diminish, or disrespect my history because I am my history. We are our history. And in this moment, we are making history. Thank you, I yield to well. Chair recognizes Representative Carter for a morning order. Thank you, Speaker Rostin. Good morning, everyone. I wanted to take a moment to ask you all to stand with me as, remember Mrs. Martha Calloway. She was the executive director for the Latonia House and Authority. She passed away on January 22nd. She had been there, like I have been in the city of Latonia over 20 years. She has been there that long and she had worked really, really hard on our community. Mrs. Martha was a Delta Sigma Theta. She was a member of the Red Hat Society and she and her husband resided in making Georgia and she would drive almost every day from making to Latonia to do her job. So if you would just take a moment of silence as we remember her. Thank you. The other way. Chair here recognizes Representative Jasmine Clark for a morning order. Thank you, Mr. Speaker. The neighborhood is graded D because of its concentration of Negroes but the section may improve to a third class area as this element is forced out. Wow. That is an exer. That exer is an example of a description of a black neighborhood that had been redlined. What is redlining? After the Great Depression, FDR instituted the new deal to try to restore prosperity in America. One way to do this was through access to home ownership. In 1933 and 34, the FHA and the homeowner's loan corporation were created in order to provide federally insured home loans. There were exceptions though. The FHA would ensure mortgages except for those in or even near black neighborhoods. This was based on the assumption that black people moving in would reduce property values. The HLLC created residential security maps which color coded and graded neighborhoods. All black neighborhoods were red with a grade of D. White neighborhoods deemed too close to black people were yellow or a C. While the practice of redlining is illegal now, the remnants of this government back segregation and dim discrimination are still apparent today. The limitations on black home ownership for the three decades these policies were in place led to an inability for many black families to take advantage of the racial wealth, take advantage of a major contributor, sorry, take advantage of the equity appreciation and is a major contributor to the racial wealth gap today. Additionally, 75% are previously redlined districts struggle economically today. Just like a necrotizing fasciitis or flesh eating bacteria, simply removing the parasite does not remove the damage that was caused. Let's address the damage. Thank you, Mr. Speaker. To recognize as a representative Hutchinson for a morning order. Good morning colleagues. Today I bring to you 13-year-old Jameer. Jameer is an energetic, fun loving, thoughtful, creative boy who likes to draw, skate, and run. He also enjoys listening to hip-hop music. He likes playing the game of life, computer games, football, and watching the movie roll bounce and football games. Jameer is one of the hundreds of children who are available for adoption in the state of Georgia. This one is very special, so I hope that you look at him and find him a family because\n\nI just fell in love with him last night. Thank you, Mr. Speaker. I'll yield the well. Chair recognizes representative Wilton from morning order. Thank you, Mr. Speaker. Colleagues, the big day is here. Chairman England, I'm not talking about the budget vote in the House today, but it's super bold weekend. I know a lot of people will be tuning in to the game to watch the game this weekend and probably just as many will be tuned in to watch the commercials. And you know the ones I'm talking about, they spend all year long putting together these commercials and best millions of dollars into them and it shows because they're really funny. They're really good. But there's one industry that does this better than all the others. The auto insurance industry has perfected the art of the super bowl commercial. So I'm sure this weekend we're going to hear from Flow and Jake and the get co and the Emu will be running around and I can't wait to see what the latest Mr. Mayhem has gotten himself into. But colleagues, I think every Georgian deserves to know that we are paying for those ads because in this state the auto insurance companies are allowed to build those commercials back to their customers. So they are allowed to take out the most expensive air time all year long to sell their products and then turn around and build back the people who have already paid for their products and that's legal in this state. If you believe that that is outrageously unfair to Georgia consumers as I do, please come talk to me and let's do something about it. Thank you. Chair recognizes representative Matthew Gamble for a morning order. Thank you Mr. Speaker. I rise today on a very sad occasion. Gentlemen, let's suspend. Give the gentleman near attention please. I rise today on a very sad occasion a family that lives around the corner from me in my neighborhood suffered a tragic loss last night in a fire. Life is short and a young little 10-year-old boy didn't make it out of this fire. It's a family that I know well. He's a friend of my sons and we wanted to come up here today and ask this body to please keep this family and your prayers and I'd like for a representative gravely to say a few words. This morning I was asked to pray for a family in caucus meeting and we do most caucuses ask for prayer request and I heard it immediately I thought oh my gosh what a tragedy. I didn't know that it was a very dear friend of mine that I was praying for. So I would urge everyone this this weekend to take your family and your children, your love them, hug them and when you pray and you ask the Lord you go into that communication with our Father you never know who you're lifting up and that moment you never know who needs you. Y'all join us in a moment of silence for this family. Amen thank you. We are about to go on to the rules calendar. Members of the House will please take your seats and come to order. Forkerydecaption to House Bill 1011. House Bill 1011 by Representative Kogan 179th and others to be titled an act to amend chapter 8 and 1040 the fiscal to Georgia and tentative relating equipment and inspection of motor vehicles still is exempt low-speed vehicles from providing requirements relating to amber strobe lights or emergency vehicle designation. This bill ever further committee on motor vehicles that committee recommends that this bill do pass. Chair recognizes chairman Don Hogan for to present the bill. Thank you Mr. Speaker and members of the House. I have a very very simple simple bill today which exempts low-speed vehicles from having to get a permit for a strobe light. They're required to carry a strobe light on top of the vehicle that will reach out to warn other travelers coming in their direction for at least 500 feet. So this is to exempt them from having to have a permit for the strobe light. They're required by state law to have that. And I think it's just a consumer bill and does very well to our constituents out there who have low-speed vehicles. That's the bill and I welcome your vote positively for this bill because it's a good bill. Do you yield for any questions? I'll yield for a couple. Chair recognizes Representative Jasmine Clark. Do you're left for a question? Thank you Mr. Speaker. Does it gentlemen yield? I yield. Thank you very much for this presentation. I just want to be clear. So if I for example have a tractor and I'm cleaning up on the side of the road or something I can have the strobe light but no one so any person could just be on the side of the road with a low-speed vehicle and attach an amber strobe light to the top without there being any I guess list of the people who are permitted to do this. They're required if they're low-speed vehicle they're required to have a strobe light and public property and on public roads up to 35 miles an hour. If they're a 45 mile an hour roadway they're not allowed on that roadway. Thank you. You have no further questions. Thank you Mr. Speaker and I ask for your favor consideration and I yield a while. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines. Mr. Chairman looks like you need a new set of friends. Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of House Bill 1011 the eyes are 152 the nasors zero. This bill having received the requisite constitutional majority is therefore passed. What purpose does Chairman Martin rise? Parliamentary requirements. In the true Mr. Speaker that his friends over there Chairman Hogan's friends just weren't up to speed on this bill. We'll take them a while to vote. He runs with a pretty fast crowd I don't know what purpose is representative Rick Williams rise. Parliamentary. The State Chair inquiry. Does this also create a mayor seat on the island down itself Georgia that representative Hogan represents? I'm sure hope not we've had enough of those this session. I haven't even teased him about it this session. All right. Go continuing on the rules calendar. The clerk will read the caption to House Bill 910. House Bill 910. The roll is on the 7th. The 47th burns 159. I think Linda 116 to be taught on act to amend and act making and providing appropriations for the State fiscal year beginning July 1st, 2021 and ending June 30th, 2022 known as the General Appropriations Act. This bill I'm referred to the committee on appropriations that committee recommends that this bill do pass by committee substitute. Ladies and gentlemen of the House the chair now resolves the House into a committee of the whole House for the purpose of considering House Bill 910 which is the supplemental appropriations bill. The chair appoints the gentleman from the 159th district the majority leader of this House leader burns as chairman to preside over the committee of the whole House. Well good morning colleagues. It's a good Friday right? All Fridays are good. So we have a little bit to attend to this morning so at this time the chair will recognize the gentleman looks like he's ready. We'll recognize the gentleman from the 116th district representative England to present the bill House Bill 910. Mr. Chairman. Thank you Mr. Chairman. Good morning everyone. Well I've already put you to sleep. Good morning everyone. Thank you. That's better. That's better. One house keeping thing real quick if you will look on your desk and you'll see the budget highlights that have been printed out and placed on your desk as well just kind of gives you a synopsis on that on what we'll be taking up here in just a few minutes. But thank you to all of you and thank you for all of you that have worked so hard through this process on this amended budget over the last couple of three weeks. I've been many hours put in by committee members and by our subcommittee chairs and everyone that's part of this budget process. But we also need I also need to thank a few special people and one of those director Kelly Farrett OPP we have worked all summer and and have it feels like we've worked together constantly almost hour by hour over the last two and a half years as we have addressed many of the issues that have come up during this pandemic. And I just want to thank he and his staff there at OPP for the work that they've put in into the document that we started with. And of course we've taken a little bit further because they of course have to lock their budget down in December. Also this part armor setting up here on the front row. I don't think everybody's here with us this morning. But the House budget research office staff Martha and Christine and all of our family that works over there. An incredible group of people you've all worked with them on various issues and it's not just budgetary issues we all work with them on many other issues. But without them none of this would be possible for us to be here today taking up this budget and to operate quite frankly year round because it's one of those things they have a job that while we're here for for three months and then we're back home nine months working and helping constituents they're here day in and day out asking answering our questions or asking of the agencies the questions we may have that that that they're seeking answers for. And one that I've gotten in trouble for not thanking as I think so many other people and that would be my bride at home Cindy she she's one that puts up with me being gone a lot awful lot just like many of your spouses do the same thing we're all on the road we've got things to to go do people to see and meet and to be in and all those things and they hold hold the fort down at home and you know I've been blessed now for over 30 years to call her my bride and I just want to tell her thank you as well as you look at the tracking document before you today and the and the version of the bill there are three significant taking ways in this amended budget education employees and infrastructure you know the the one thing that we do in the amended budget every year is address education we address the midterm adjustment for those students that have shown up halfway through the year and so you'll see that take care of in this budget and we adjust that for those local systems to hold them harmless this year's mid-year adjustments ninety three million dollars to provide for almost twelve thousand more students that have shown up beyond the mid-year adjustment however governor camp had proposed and we're agreeing to fully fund QBE formula if you'll recall during the pandemic the worst part of the pandemic we were just not sure what what was going to happen to state revenues and unfortunately we had to make cuts across the board with everyone but we've gone back to backfill that cut and that's about three hundred eighty three million dollars going back to those local school systems and remember that will also be fully funded in the twenty three budget so if you look at a snapshot in time of the last five years four of those five years we have fully funded QBE there are another five million dollars in related expenses toward K-12 education programming and supports such as preschool disability services and our friends at the recess that do so much work to support our school systems around the state the most talked about issue in our subcommittees and in the media and you've been hearing it back home relates to our workforce at the dinner tables of our Georgia public school teachers and state supported school personnel and across the campuses of our universities and technical colleges and that topic is raises the pay package in this amended budget includes another two thousand dollars to complete the governor's promised and now fulfilled five thousand dollar pay raise to our school teachers K-12 school teachers that then will also be reflected in the twenty three budget when we get to it but also on top of that you have another five thousand dollar cost of living adjustment from all the other state associated salaries effective April 1st of this year this is the first here me here the first cost of living adjustment that we as a state have been in the fiscal condition to be able to give to our employees in over fourteen years we've done merit give yourself a hand on that we've we've been able to do merit increases over the years but this is the first time that we've been able to adequately adjust and pay for these coals it's no one's fault it's the it's the creature or the the the the basis of our economy if the economy's not doing good we're not doing good and so it handicaps us for being able to recognize that but we are taking care of that at this point for the months prior to April 1st and the coals kicking in then in their paychecks for the remainder of that quarter the five thousand dollar year increase is treated as a one-time supplement earned for each pay period of employment beginning from the July 1st start of the 22 budget up until the March 31st last pay period up to that so those will be paid as a one-time bonus up to that point and it'll be three three three seven hundred and fifty dollars so for an employee that has been on the payroll since July 1st of last year they will see a one-time supplement payment of thirty seven hundred fifty dollars and then the remainder of the twelve hundred and fifty will be added to their paycheck for that last quarter for employees that were hired after July 15th the supplement is commensurate with the number of pay periods from their hard day for an employer hired on March the first of this year for an example has two qualifying pay periods during that supplement and we receive around four hundred and fifteen four hundred and sixteen dollars as a supplement to them but then again as I said it will be added then into their paycheck for the remainder of that quarter is important to note that the chairs and our members of our subcommittees have been doing this an awful long time we've got a lot a lot of institutional knowledge among our committee and among our staff and knowing that as we were continuing to look through all of this and recognizing our state employees but we realize that there are another twenty thousand state employees out there that are paid from other fund sources maybe federal grants it could be from fees it could be from a lot of different payer sources they're not provided for our paid for directly out of the state budget so we understand that those individuals deserve that same recognition their state employee they're benefit eligible and they deserve the same recognition as those because many times they don't realize that their payer source may not be the actual state treasury the funds flow through but they may not realize when they see their check it doesn't say paid far with federal funds so their state employee we're recognizing those twenty thousand individuals also with the same supplement you know normally we adjust in adjustments like this this is something we we've really never done in the state before never done in an amended budget before but usually when these these kind of things are done there's usually headroom within budgets to be able to do that however with us doing it now and with basically one quarter being left for this to take effect that's the reason that you see what we're doing in the budget as it relates to that so for instance for two inspectors say act Department of Ag inspectors that are out there inspecting food products for us one maybe either other other funds or federal fund paid the other one maybe a state employee but they're a state funded employee but they're both state employees they don't necessarily know where their pay pay stream is coming from but they're both state employees and they both deserve to be recognized it should not matter to them whether it's a state funded position or other funded position you know as we move through this we also see a lot of our our human infrastructure that relates to how we service our constituents and those sorts of things and so we've we've also in some of those human service agencies and human services pieces we have also made sure that those people are also recognized and you'll see that as we go through the budget here in a little bit but we also remember that we have individuals at home in our local school systems that are helping make the atmosphere in that school building warm and inviting and safe for those individuals so we've also made sure that our custodians our school nutrition workers our bus drivers all of those individuals while they're state or not state employees they are local employees but also providing a $1,000 one-time supplement to them for what they've put up with and what they've had to deal with over this last year so moving on into physical infrastructure the third big takeaway from House Bill 19 is also tops around $900 million for what we're doing dealing with infrastructure many of these are one-time expenses most of these are one-time such as 32.3 million to replace 789 vehicles vans and buses as well as 193 million to replace 1747 school buses that are at or past their useful life the ability of the revenue and the budget also allows us to do significant infrastructure projects that are all are often done with bonds 1886.9 million for equipment technology replacement and furnishing for construction projects nearing completion as well as 106.6 million for regular maintenance repairs and construction design and exciting advancements for the future through the property transformations most notably safer prisons and a safer capital hill for for the agencies that serve here in our employees these transformations are about $481 million while these are three categories will take away from the amended $29.9 billion budget it is also always worth reminding ourselves that their exceptional programs and policy initiatives in the underlying bill and the process will continue and earnest as we work with our colleagues in the Senate and the executive branch to continue our strong tradition of using our collective experiences and inputs to bring the most value to every tax dollar for our citizens now if you'll flip to your tracking sheet we'll walk through it those of you that were in the committee yesterday I'm sorry that you're going to hear much of the same thing but it is time for our fellow members of the House to to hear the same stuff too so I'm not going to go through every change you can say thank you amen whatever I'm not going to go through every change because a lot of the changes you trip on a sea are related either to the $5,000 supplement for our state employees or the $5,000 supplement to our other funded employees so a lot of agencies you'll see changes there but that's all tied back to those things I will point out some of the bond and cash items that we did pull forward out of the 23 budget to take care of that are all one-time expenditures so in the state Senate no changes in the House of Representative Section 2 you'll see the adjustment there and truing up of the number at 2.1.1 for our state employees employees here of the General Assembly Section 3 General offices or joint offices of the General Assembly you'll see at 3.1.2 the legislative services services committee back in the fall meant to consider some technology upgrades for this building and for the CLLB and what you'll see there is the money to start addressing many of those upgrades and out of date equipment that needs to be addressed in this building. Department of Audits and Accounts of course Department of Audits and Accounts is a legislative agency but you'll see there the adjustments that I mentioned on the statewide changes as well. Court of Appeals at 5.2 the statewide business court you'll see some adjustments starting at 5.2.2 is a true up for an actual the actual cost or actual payout 5.2.3.4.5. are just saying no to a proposal that they had for paying increases but since the 5,000 is addressing it's not necessary. Moving on to Judicial Council at 6.1.3 a restoration to some of the funds that we had to cut in 21 because of COVID. Section 7 juvenile courts when the Cobb Judicial Circuit added a judge they became eligible for an additional grant as it deals with juvenile courts and you'll see that 12,500 added for that additional judge ship. Under prosecuting attorneys you'll see some adjustments starting at 8.2.6 for actual start dates just capturing some savings there also at 8.3.6 some of the trainings that they had planned on doing have been delayed so we're just they're not going to be able to get all of those in between now and July 1st and then at 8.3.7 just an adjustment for what the actuals are superior courts just one small change down at 9.3.5 dealing with the start dates of some new positions there supreme court no changes state office of accounting look down at 11.5.2 under the government transparency and campaign finance commission they've had several more hearings over the last year than what they traditionally had so they've had some increased expenses as it relates to administrative law judges that do those hearings under DOES at 12.6.3 just want to highlight there another was a little bit of a discussion the other day during the subsequent injury trust fund debate about this 150 million dollars for settling of these state workers comp claims there is a differentiation the subsequent injury trust fund deals with outside public sector employers this is related specifically and only to those workers comp claims that we have had as a state some of these claims are as old as go back as far as 1980 or 1982 this will allow for them to settle up to about 700 of those outstanding claims and give sure to those families that were impacted and also give some predictability for us going forward section 13 Department of Ag chair lady howston is is pretty much a bulldog when it comes to folks on starting dates for new positions and and she has gone through the Department of Ag as it relates to those positions and start dates so you'll see some deductions there you will see an ad at 13.3.3 as it relates to the Department of Ag science lab that they have testing lab down at Tifton the we've pulled forward a bind to take care of a HVAC replacement roof replacement for them down there moving on over to 13.6.2 as the Georgia Ag exposition authority otherwise known to all of us as the fairgrounds down at Perry you'll see a binder request there it's not the full request but it does put some money in there for them to to prioritize their needs as most of those original buildings are now at the 30 year mark and needing upgrades on HVAC roofs and several other pieces there as well and then a capture of some savings under soil and water conservation at 13.7.4 banking and finance no changes moving on over to section 15 dbxd 15.2.3 you'll see an ad there for one of the state's partners called Georgia options based over in Athens they work with people not just in the Athens area but statewide to support people developmental disabilities so they can remain in their homes and in their communities. COVID and funding streams and their ability to raise private funds have greatly diminished over the\n\nyear or so and it's put them in quite a quandary but they have been a very good partner of hours over the years and actually we helped invest in them to get them started up. Then you'll see a reduction at 15 to four as it relates to a delayed contract implementation there. 15 for three, $310,000 for the 988 number that will stand up on July the 16th. I know Chair Lady Dempsey and I am and many other people are very excited about that crisis line coming online and being active and live to help individuals across this state. 1563, you'll see there a small ad for the Matthew's Reardon Center for Autism down in Savannah. They're one of our two statewide autism partners. They and the Marcus Center here in Atlanta and again COVID has greatly impacted them as well and so again when your partners with folks you hold hands and help one another walk when one stumbles. Under direct care support services at 1510-2 pulling forward a cash item from the 23 budget for repairs and maintenance and upgrades to some of the facilities that DBHCD has around the state as well. Department of Community Affairs. Don't believe. Nope excuse me there is one change at 1614-3 just capturing the funds for the savings of the delayed hire for a grants administrator in one Georgia. Section 17 Department of Community Health. If you'll flip over to Section 17.7 you'll see some adjustments as I mentioned in my open comments. OPB has to lock their budget down in December and as of December we did not know whether or not the federal state of public health emergency would be continued another quarter or not and since then we have since found that it will be so you'll see a capture of some savings at 17.2. Then at 17.7.9 you'll see where our friends our partners again in the nursing home industry that have taken such a such a hit over the the past two years as it relates to COVID on hiring retention and all those things to make sure that that our elderly that are in those centers are taking cure off. You'll see an additional $10 per patient day add on there that actually totals out with the federal match at $79 million. 17.7.10 just the clarification of some language that we had included in the original 22 budget as it relates to professional liability and property liability insurance. Moving on down to 17.8.2 again a greater savings there based on the extension of that F-Mount bump that we're seeing. Moving over then to 17.8.6 and the Peach Care program. You'll see a reduction there but it actually moves down into the section below it at 17.9.3 and it's just truing up for expected expenditures there and then the savings at 17.9.2 as it relates to Peach Care based on the extension of the public health state of emergency. Under state health benefit plan the governor recommended almost $180 million to go into yet to go into the reserve there that that helps us make sure that we're able to maintain the health insurance rates for our state employees. We've added some additional funds there as well to further maintain that and to ensure that as well. 17.10.2 just language instructing DCH and the SHBP program to provide the FDA approved medications for the treatment of obesity something again cheerleading, DEMPSE and several of you have worked on over the last several years. 17.12.1 you'll see that add there 1.7 million for residency slides. We had to take a break in 21 is it related to residency slides and we're not able to fund them at that point in time. So what we're now trying to do is catch back up on the partnership with our hospitals and our medical colleges around the state as it relates to that. 17.13.1 we'd added money kind of late in the process last year as we were trying to stand up and make sure that some forensic pathologists were across the state not just here in Atlanta we partner with Mercher and with with GBI on doing that however they have not been able to find any of those individuals to fill those positions not going to be able to between now in the end of the of the fiscal year so we're capturing those savings. We'll again discuss that as we go forward in the 23 budget. 17.41 our partnership with the Morehouse School of Medicine we all know and understand the need for nursing staff across the state and Morehouse and and Dr. Montgomery Rice over there are very excited and I am too about a program that they're working on to help recruit retain and train nurses for ruling underserved areas going forward. Section 18 Department of Community Supervision you'll see no changes there. Department of Corrections Section 19 no changes. Section 20 Department of Defense have no changes there other than the statewide changes. Department of Driver Services only one change at 21.2.4 and just pulling one of the projected expenditures for the 23 back into the 22 and that's the repaying of the carousel at the Dalton customer service center for CDL training. We all know what a what a shortage we have in truck drivers and and lights it sure for those truck drivers so we want to make sure that we're able to make make those wheels turn so to speak but up bumps. I'm just seeing if anybody's awake just seeing if anybody's awake still over into decals section 22 22 23 2 you'll see there the recognition of decal using the the Corona Coronavirus response relief supplemental appropriations money and ARP money and American Rescue Plan money to provide two one-time salary supplements for those decal employees out in the childcare centers doing pre-care around the state of $1,000 a piece and then down at 22.3.3 you'll hire some existing funds for summer transition program that they want to stand up to help children with learning loss issues because of COVID. Section 23 under Department of Economic Development again Sheryl Lady Houston and Herse of Committee go after those vacant positions and those positions that had different start dates so you'll see reductions through the document as it relates to that then down at 23 9.3 under tourism you know the George Royal Congress Center here in Atlanta is one of our biggest assets quite frankly across the state that building itself some of the original parts that building are well over 40 years old and if not had roof replacements done only patches done and so we over the last few years have been been biting that off a little bit at a time and we have the ability right now with with some cash dollars to go ahead and fund that roof replacement for the remainder of the Royal Congress Center and you'll see that add there of 28.8 million dollars for that moving on into education section 24 looking at the capital equipment funds for ag education you'll see an add there 4.2 million and what we would normally do is bond that in the 23 budget but we're able to capture some of those bond items and pull them back into the 22 and do with cash that's what we're doing there 24 6 3 you'll see a reduction there for the Royal coding program that never got implemented there they're they're still working on that there've been some changes at the Cyber Center in Augusta and so as soon as they're ready to go we're ready to go on that as well again some savings at 24 11 2 then you'll see an adjustment 24 12 2 as it relates to our school nutrition workers just going in and making sure all the $5 were included in that and so that number is a true up 24 14 3 you'll see a 5 million dollar add there to help school systems purchase alternative fuel vehicles those can either be electric they can be propane anything that's cleaner than diesel or gasoline powered buses that becomes an issue when buses are setting in traffic and those fumes are coming into the the cab with the children we just want to make sure that we're trying to protect the youngest among us as well 24 16 under QBE local 5 mil share you'll see a couple of items there that are true again later information from when OPB was finishing up and then under QBE you'll see of course the the add there of 382 million for the QBE restoration to fully fund QBE then the other adjustments there you see in that section are truly formula true ups until you get down to 24 17 10 where we're also capturing the school custodians that I mentioned a little bit earlier about 7889 custodial staff across our school buildings across the state 24 18 2 just to update for a contract there with the recess the other statewide changes we'd mentioned earlier then down at 24.22.4 chairman Jones and his subcommittee and others have been working with the heavy construction industry here in the state and trying to create a pathway within CTE critical education to train these students to be able to operate heavy equipment and kind of the idea here is it would not just be high school students but it would also be opened up to adult students as well there's some very good very high paying jobs in the industry of pushing dirt moving dirt hauling dirt and yet there's a huge disparity in the number of individuals that we have qualified and exemplar abuse sometimes before has been you know as a contract they're doing a job they can't afford to put someone on them on a three-quarters of a million dollar piece of equipment that has no idea how to operate it then pay them the expenses of learning how to operate it on the job this will allow them to have people coming out of school qualified to operate this this equipment so i'm excited about that particular program section 25 employee retirement system no changes there moving on to section 26 state forestry commission you'll see there just a true up of the bid on some equipment replacement there from the bids in in december until the latest true up on those bids you'll see the difference it's about a hundred fifty thousand dollars difference in in how much that equipment is increased in price since then governors office one changed there and office is child advocate just some funds for some technology upgrades there of seventy five thousand dollars under dhs department of human services again with the temporary bump of six point two percent on the federal f map has allowed us to capture savings there at twenty eight point one point two then it look at after school care you'll see the delayed implementation of a of a program that we put in for them to start last year they've not gotten it up and going yet but but are getting it up and going so we've not pulled back all of the money that we put in there just a portion of what we put in there last year moving on over into their admin 28.7.2 again some updated amounts therefore what the actual b at twenty eight seven two twenty eight seven three is taking capturing some of the savings like we've done in other agencies from vacancies and delayed hires this is not a program programmatic cut to any program but this is purely a reduction there on dhs admin and then at twenty eight seven four a little bit of a change up there dealing with their future foster care but we we'd added six point seven million in the twenty two budget they've not been able to fully implement what they're wanting to do but they are starting to get that project rolling this deal some with the whole hotel issue many of you may have heard about as it relates to foster care children moving on down to twenty eight point nine point two there is a state required match and a local required match for many of our area area agencies on aging and so what we're doing here is just saying utilize some state state out of about one point five million partially cover that local match that they were not prepared to match moving on then to section twenty eight still in section twenty eight but under voc rehab at twenty eight point two four point three Georgia Radio reading services this restores a portion of the reduction that we had to apply there in twenty one and then the same with the state wide independent living council of Georgia a restoration for some of what we had to cut in twenty one as well office of the insurance commissioner twenty nine point four point two you'll see a reduction there in state funds but the authorization for them to use some of the fees that they collect for the job that they do around the state under gbi section thirty you'll see a few changes there some of these are reductions on account of start dates and you'll see the first one of those at thirty point one point two but if you look at thirty point one point three and then down at thirty point four point two you'll see those two numbers net out and it was just a matter of putting the vehicles there are some of the vehicles that were supposed to go into bureau administration and not remain in in the regional investigative services thirty point one point four as part of the speakers law enforcement package and this is going to help with some of the security issues and updates that they need at their headquarters then down at thirty point three point three I mentioned a little bit ago about forensic pathologist and this is where we're capturing some of the dollars that we put in last year who we've not been able to implement that expansion at thirty point four point three in regional investigative services you'll see a slight addition there actually making all of those positions mean four full-time positions for elections investigations going forward thirty point five point three under the criminal justice coordinating council you'll see there where we're telling them to use some additional unutilized funds within that program of about one point eight million dollars as it relates to that fund that compensate victims of crime there was a an issue over the last year or so probation is not being able to fully collect on what they're supposed to be able to collect so we're just trying to make sure that those victims are taken care of section thirty one juvenile justice moving forward from the governor's recommendation in twenty three at thirty one point three point three and then down at thirty one point four point five so much need to repairs and maintenance at the YDCs and at the RYDCs section thirty two department of labor no changes department of law section thirty three no changes section thirty four department of natural resources you'll see a couple of changes other than the statewide changes I've mentioned one at thirty four point seven point three and that is the public safety complex that is needing to be constructed at jackal island those of you that have been down there or have friends and neighbors and constituents that have been down there have been just amazed I've been amazed at the work that they've done in improving the island over the last few years this is one of kind of those final pieces to finish putting that puzzle together thirty four point seven point four as people have been cooped up at home and looking for somewhere to go they've been going to our state parks and that's a good thing but many of our state parks we've had quite a bit of deferred maintenance through the years on those and so what we're doing here is taking an attempt taking a step toward taking a big bite out of that deferred maintenance and you'll see that add there fourteen point nine million dollars as it relates to those parts and parole no changes state properties commission section thirty six we did bring forward from the twenty three budget a cash funded item and that is the mitigation plan or the migration plan I should say to get our our employees out of two peach tree any of you that have been over there relies the condition of that facility we do have quite a bit of empty space now on Capitol Hill both at the twin towers and both back over here beside and behind the CLOB so that's something that we've been working on actually for a couple years to get to the point that we can actually migrate those employees back here to Capitol Hill public defenders counts on those changes other state wide changes department of public health section thirty eight no changes there section thirty nine department of public safety at thirty nine point three point three and three point four you'll see a couple of things that we brought forward from the bond package to go ahead and do here some savings that were realized at thirty nine point four point three I think we'll all understand that chairman Hitchens probably knows DPS better than just about anybody else in this room and so he went for those calls savings as well that related to those true two trooper classes they start out with a hundred but never end up with a hundred one of those classes finished with seventy the other one finished with forty six and so we were able to capture some savings from that and thirty nine point four point four some major repairs or renovations that were needing to be done at three of the field offices across the state thirty nine point five point two part of the savings we were able to realize up there in the trooper schools will be using for the 10% pace supplement for the troop C that crime suppression unit used here in Atlanta it's a voluntary basis for those troopers to come from around the state and by doing so because they're working here on weekends they're working all night when they're here on weekends they do deserve to see a bump there under firefighter standards and training council at thirty nine point seven point three you'll see the funds there for the replacement of two inoperable vehicles and then at thirty nine point seven point four for the standing up of a database to handle the online testing that we stood up last year then down at thirty nine point nine the public safety training center down at Forsyth again some major repairs or renovations needing to be done there we will be cash funding in this budget moving over to section 40 the public service commission at forty point one point three some additional funds for ongoing litigation involving the commissions election districts and then at forty point one point four just a truing up of that actual need there section forty one board of regents you'll roll through there down into the medical college of Georgia and its hospitals and the I want to point out that here in in regents is where a large portion of those other funded positions are that we are going in and taking care of in this budget but you'll see at forty one point thirteen point two again one of those things that we thought we would be able to get stood up and going but COVID had other ideas over the last year so we're capturing some savings there for some programs that they were not able to implement forty one point fourteen point four our public libraries we have made it a practice now for several years to put money in the bond package to help with major repairs or renovations at many of the small libraries around the state a lot of times these are liqueur roofs their ADA compliance issues those kind of things and so we'll be doing that with cash funding for this coming year are for the rest of this year forty one point eighteen point thirteen going ahead and kick starting a couple of design projects that are needed that are in the pipeline one of those that the research tile for Georgia state here in downtown the other one at the University of North Georgia then on down at the public telecommunications commission at forty one twenty four point six this kind of feels the last gap that they have in their transmission blanket across the state by providing that tower and then at forty one twenty four point seven is an innovative tool that they came up with themselves a couple of years ago and really didn't know that COVID was coming but COVID wound up among us and the the program is working incredibly well to help steal some of that learning loss and among our student statewide so we're partnering with them to increase that program and put more applications out there that students can use department of revenue section forty two you'll see just a language change at forty two point ten point two as it relates to the refund the one point six billion for the refund just clarifying that that will be done upon the approval of the general assembly for that change in tax policy section forty three secretary of state you'll see there many of you probably heard from your county folks about the precinct cars have to be sent out ACCG and others as they worked many many of our small counties do not have even the the small amount of necessary funds to mail out those eight or nine million cards around the state that two and a half million dollars there's one of those things that we wind up doing every ten years for that forty three point two point three is just a language authorizing the implementation of the new voter registration system and just asking for an update on where they stand on the remaining funds for the purchase of the voting machines a few years ago under student finance section forty four under dual enrollment and under the engineering scholarship you'll see a true up of both of those numbers for actuals then at forty four fifteen one going ahead here and and seeding the ten million dollars for the service council loans for those individuals going into the mental health field we've taught many years about that's one of our bigger issues uh and one of the reasons we've not been able to address many of the issues that we've had across the state is we don't have enough people in that pipeline so we felt like that we could kind of get on the front end of that especially with students that are finishing up their high school careers and maybe weighing two or three different options as to what they want to go into but if they realize there's there's a way here that they really want to go into that field but couldn't figure out how to pay for it now there's a way for them to pay for it for it section forty five TRS no changes technical college system of Georgia no changes under section forty seven the Department of Transportation you'll see what looks like a lot of changes and chairman percol I reckon I should show off his Georgia Tech degree or something other by just moving stuff around but in all truthfulness most of what you see here in the changes are related to the required federal match for the federal infrastructure bill that's coming free up state funds and motor fuel funds to be able to go into that that required match and not doing so in a way that would happen for any current construction projects or are planned and committed projects going forward one of the changes that you will see at forty seven point six point three it also corresponds to forty seven six point five and six point six and what it is is just saying that those transit funds from the rideshare fees this is how we're saying those will be spent and so that's what you're seeing throughout the DOT budget and you'll also one other thing let me back up to intermodal one of the things coming out of the Royal Development Council over the last several years has been the need to address the state on rail lines and get those state on rail lines up to a class two standard with a minimum speed of 25 miles per hour and so those those are owned by state we lease them to operators but we do have an obligation as it as it relates to the maintenance of that line as well and so what we're doing there is about a ten million dollar ad that goes about a third takes about a third of the remaining need there for those improvements under veteran services you'll see three different changes at forty one excuse me forty eight one three two two and down at four three they're just capturing capturing some savings far some workforce efficiencies and then a corrected caption at forty eight point three point two state board of workers compensation no changes there and that pretty much walks you through all of those changes and uh Mr. Chairman okay you still awake make there yes sir just making sure with that uh Mr. Chairman I I hope we've I hope I have any any shortcomings on explanations are truly mine and no one else's but I'll be glad to take a couple of questions if anyone has one chairman England a very thorough job is usual um I wasn't concerned until you said you needed to back up there and I was one how far you going back up so thank goodness it wasn't too far just a little bit just an observation and I know how wonderful your staff is but I'm sure all the members of this chamber understand that when they've I've reached out to you over the when they reach out to you and have reached out to you over the years when we're not in this capital in session I don't know many days I've talked to you that you not been at work on this budget preparing this budget and working with the staff and those interested in the budget and how it impacts all Jordan so I can only say thank you for your dedication to this budgetary process and making sure that we um have a complete document that addresses so many needs for our state so my personal gratitude to you my appreciation to you and I'm sure I speak for all of our colleagues when I say that so thank you Mr chairman thank you Mr chairman and as as I've said many times there there is a person that the individual one of these dollars and this budget touches individuals and citizens of this great state no matter social stature no matter financial status there's something in this budget that every individual living in the state has some type of expectation of this state providing for them whether it's safety whether it's a driver's license whether it's a state park to to go enjoy with their families are just a road that's not full of pot holes those things are the things we address in this budget so thank you Mr chairman and just one comment on your budget chairman England and and just in line what you just said this is a tremendous investment into the into the human capital of Georgia but also that human capital is well served because our investment in the infrastructure of Georgia and without both we can't be successful so thank you we will um at this time with the gentleman you for a couple of questions I will for a couple let's see in the gallery I will recognize um the lady from the from district from the 48th district uh representative wrote a shot thank you sir does the gentleman knew yes I did and I would concur this is an amazing um investment in the human capital of Georgia from our teachers to our state employees to everyone involved um but but I had one specific question under the community health um division line 17.6.1 under the indigent care trust fund that I see there we get a normally we get a 14 to 1 match for state\n\ninvested funds. For this budget, we're only getting a three to one match for state investment for those hospitals that, you know, we're hit so hard with people who do not have insurance. Could you explain, is there a difference? Are we matching, I'm sorry, maximizing federal funding? Yes, this, again, this is an amended budget and the, and the function of an amended budget is to true up on what actual expenditures and actually what the actual matches would be for the, for the remainder of this year. And so not always is the match the same. And it depends on which bucket is, it's necessarily going into because there are buckets that the matches smaller and there are buckets within the injured care trust fund that are larger. You know, our hospital provide a fee that our hospitals put into and then receive back from it's about a three to one match on the end. So there are different, different rates on depending on what section of, or what bucket that those funds are going to go into. Does the gentleman further you? Yes, ma'am. So I guess my question, obviously, that we're spending this much money as a state on indigent care. So people who do not have insurance and my question would be, have we done the analysis what the differentiation would be for full Medicaid expansion for bringing more people on to some form of health insurance? Well, I think that becomes a discussion for the actual for the 23 budget. That would not be something that we would do in an amended budget. Thank you, sir. Yes, ma'am. Gentlemen, you have for another question? Yes, sir. I'll yield for one more. I know folks are, a lot of our, our members here have a long way to go to, to be home with their sweethearts for Valentine's Day weekend. So I'll take one more. And by the way, all the best of your sweethearts. Thank you. She's been in our prayers. Mr. Chairman, I'll see the gentleman from the 25th, Chairman Jones to your left. That's a question. Yes, sir. Thank you, Mr. Chair. Mr. Chair, do you yield? I do. Is that a red and black tie that you have on today? This is from the Ronald Reagan Museum in California, so I'm proud to wear it. Okay. Thank you. Yes, sir, I yield. Thank you. Isn't it true that the amended 22 budget addresses two key healthcare areas. First, that it provides for a significant investment to accommodate for targeted, Medicaid programs and second, that it provides for targeted investments and mental health initiatives? Absolutely. The gentleman knows of which he speaks and what we often forget about in an amended budget are the things that we put into place in the budget the prior year that we're amending here. So there are a lot of times that things that we're thinking about and I've had several items come to me this year that we had addressed in the 22 budget that folks thought we needed to address or had never been addressed. And we're trying to address here, but you're exactly correct. We're not only addressing and firm up some of those things in this budget and expand a few areas, but certainly, yes, sir. Thank you, Mr. Chairman. Yes, sir. Mr. Chairman, I know there may be other questions. We've had the document on the desk now for over 24 hours and we have answered numerous questions not only myself, our subcommittee chairs and everybody involved in the process. And that said, Mr. Chairman, I will yield the well and go to my seat to make a motion. And gentlemen, as yielded the well, there are some other questions, but I'll encourage those members to get with some of the subcommittee chairs or the chairman and have their questions answered when we finish this work. At this time, the chair will recognize Chairman England for a motion. Yes, sir, Mr. Chair. I move the House bill 19, do pass my committee substitute. Chairman, the motion is there that this House bill 19, do pass by committee substitute. Is there a second chair recognizes the gentleman from the 155th House District, Chairman Perkel? Thank you. I would like the second in motion, please. The motion has been made and the motion has been seconded by Chairman Perkel. At this time, we will call the question on House bill 19. All in favor will say aye. All opposed say no. Very clearly the eyes have it and House bill 1910 passes by committee substitute. Chair now recognizes the gentleman from the 116th House District, Chairman England, Mr. Chair. As chairman of the committee of the whole House, you are instructed to report the action of the committee of the whole House to the House. The chair recognizes the majority leader of the House, leader Burns. Thank you, Mr. Speaker. Mr. Speaker, the committee of the whole House has had under consideration House bill 19. It has instructed me as its chairman to report the same back to the House with the recommendation that the House bill 19 do pass by committee substitute. The report of the chairman of the committee of the whole House is received. The committee of the whole House has had under consideration House bill 19 and has reported the same back to the House with the recommendation that House bill 19 do pass by committee substitute. The committee of the whole House is hereby dissolved. All right. Mr. Clark, you want to ring the bell? Is there any objection to the previous question being ordered on House bill 19? The chair here is none of the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does Representative McLeod rise? Parliamentary inquiry. Is it not Ms. Leiden to say that the QBE formalized fully funded since the last time it was funded was 1987 and a study was done in 2015 that clearly states that that formula needs to be updated? I'm going to recognize the chairman of the committee for a parliamentary inquiry. Miss Speaker, parliamentary inquiry. Is it not true that the QBE funding formula is actually a formula and the budget you have before you today in this house is based on that formula and is fully funded based on that formula. There have been reviews of the QBE funding formula. I've served on two of those committees over the years where we've always came back to the idea and the understanding that the way that QBE works while it may be almost 30 years old is still actually one of the best ways of funding education in the United States. Many other states across this country use this formula when it was created in 1985 and have updated it similar to what we have updated it through the years for technology and textbooks and many other things that have been included. Is it not true that in this budget today you're voting for a budget that fully funds QBE just as it has been for two of the previous three years and we'll be doing the same thing in the 23 years we'll go far? The gentleman so states I know he works year round on the budget and does a great job doing that. What purpose does Representative McLaren rise? Parliamentary agreement, Miss Speaker. Thank you, Mr. Speaker. Is it not true that despite the governor's intention to invest in a state workforce to this degree and of course the great work of the committee that does the budget in a budget office that the theme that prevailed during the budget hearings was really that the retention investment and workforce issue is really overdue and the reason that a lot of agency heads felt free to talk about retention is because we are making some movement but Mr. Speaker is it not true that what the state really needs is a sustained serious study of state workforce issues so that over the long run we can stay competitive with the private sector and run the state the way it deserves to be run? If the gentleman so states sounds like he's given some thought to the matter. What purpose does Representative Wade rise? Is it not true if you also consider the COVID relief funds from the federal government which is derived from Georgia taxpayers that actually exceeds the amount of the cuts that we experienced during COVID-19 and actually for the last five years under Republican leadership we have fully funded education in this state. If the gentleman so states I rely on the chairman of the committee. What purpose does Representative Jasmine Clark rise? Thank you Mr. Speaker, Parliament drinkery. State your inquiry. Is it not true that I wanted to ask the chairman of appropriations before he yielded the well because I got this question from my constituents whether or not the raise for teachers is a one time raise or if that raise was a continued raise because I think that if it's a one time raise we would actually describe that as a bonus so that's my inquiry. Thank you. Okay I'll give you a couple of minutes if you don't come over here and ask him. Chair recognizes Representative Eric Atomis or what purpose do you rise? Parliamentary inquiry. Is it not true that in this budget we are giving over $42 million to the foster care system to help a lot of the foster children that are now in hotels is it's not true? It's my understanding that we are. Thank you. All right we're going to go ahead now is that all members voted have all members voted. If so, the clerk will lock the machines on the passage of House Bill 910. The eyes are 152 the nays are four and this House has approved the supplemental budget in set fourth in House Bill 910. House Bill 961 will be postponed to the next legislative day. What purpose does Representative Maynard rise? Thank you Mr. Speaker. I move that House Bill 1-0-0-4 be moved from the committee on higher education to the committee on public safety and Homeland Security both chairman are in agreement. Representative Maynard has moved that House Bill 1-0-0-4 be moved from higher education to public safety and Homeland Security the clerk will read the caption. House Bill 1-0-0-4 members are in May and are in 56 and others to be titled an act to amend Title 20 that fiscal to Georgia and it's interrelated education. This is a bride for the establishment. Unified campus police forces through agreement centered into bi colleges and universities. On the ladies' motion that House Bill 10-0-4 be recommitted from the higher education committee to public safety and Homeland Security is their objection is their objection to chair here's none and it is so ordered. What purpose does chairman Blackman rise make a motion? State your motion. I move that Senate Bill 330 be moved from the insurance committee to the ways the means committee both chairs are in accordance with that movement. Clerk will read the caption. Senate Bill 330 by Senator Albers 56, do the 30th and others to be titled an act to amend Title 33 the fiscal to Georgia annotated relating insurance those prohibit insurance from canceling modifying coverage or refusing to issue. On the motion of chairman Blackman Senate Bill 330 be recommitted from the insurance committee to the ways and means committee is their objection is their objection chair here's none and it is so ordered. The clerk will now read the caption to a group of privilege resolutions. Commending Miss Maggie Reese Hines of Carroll to Georgia the UGA Redco Marching Band, Cooperative Section Leader and UGA Battle Him Solest. Recognizing February 16, 2022 as sex trafficking awareness date state capital. Recognizing February 16, 2022. Commending Miranda Cologne and Emily Kaylick the Georgia Department of Education 2020 Georgia scholars. Recognizing commending Emily Diggby on earning the title of 8, 6A Player of the Year. Recognizing commending Liam McCarthy for winning the Gwyneth County Girls High School Diving Championship Recognizing commending. congratulating the Mill Creek High School's wrestling team for winning the 2021 2022 Region 8 class 7A Dools Championships. congratulating the Mill Creek High School Boys Cross Country team for winning the 2021 2022 GHSA class 7A Cross Country State Championships. congratulating Greenville Middle Lady Patriots for winning the Region 5 Middle School Girls Basketball Championship. Recognizing commending arc temporary staffing. Commending the building owners and managers association of Georgia and recognizing February 22, 2022 as Bulma Georgia Day at the State Capitol. congratulating Macintosh Chiefs. Commending Jenna Daniel Bowdoin High School's 2022 Star Student. Commending Stephanie Norton Bowdoin School's 2022 Star Teacher. Commending the Cherokee Veterans Community for five years of unwavering service to local veterans. Honoring the 151st anniversary Saint James Lodge and recognizing commending Master Jerry Black and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolution? The chair here is none and the resolutions are adopted. We don't have many announcements. Chair recognizes Representative Holland for an announcement. Thank you, Mr. Speaker. The City of Atlanta delegation will meet immediately upon adjournment via Zoom. I think our Senate colleagues are already there waiting for us. Thank you. Okay, we have, if I could have your attention please. We have one birthday which I'm going to recognize in a moment but we've just gotten word up here that Chairman Bonnie Rich is at the emergency room with her husband. The ass that all members of the house please keep them in their prayers. Chairman Rich. Today's the birthday of Representative Mandice Chautamas. Representative Thomas. Happy birthday to you. All right. Time to go home for the weekend and Super Bowl Sunday with a Georgia Bulldog quarterbacking the LA Rams. Chair recognizes the majority leader of this house for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this house stand adjourned until 1 p.m. Monday, February the 14th, Valentine's Day, 2022. One p.m. Mr. Speaker. The majority leader has moved that this house stand adjourned until Monday, February 14th, Valentine's Day at 1 o'clock p.m. This Monday at 1 p.m. All those in favor of the motion will please say aye. Those opposed will say no. The eyes have it in this house will be adjourned until Monday, February 14th at 1 p.m. All right. Thank you.",
  "updated_at": "2026-02-13T07:29:54.571015+00:00"
}