{
  "video_id": "YqvcHC29R2Y",
  "url": "https://youtu.be/YqvcHC29R2Y",
  "title": "Georgia House - Day 2 (2026-01-12)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": "2026-01-12",
  "duration_minutes": 39,
  "summary": "Here is a summary of the Georgia House session from January 12, 2026:\n\n**Overview:** The session began with a focus on COVID-19 precautions, as the Speaker noted that 74 members had failed to get tested as required. The remainder of the session was largely routine, with the reading of the previous day's journal, establishment of the order of business, and introduction of new bills.\n\n**Key Actions:**\n- No significant legislation was passed or referred during this session.\n\n**Bills Introduced (First Reading):**\n- No new bills were introduced.\n\n**Notable Moments:**\n- The Speaker scolded members for failing to get tested for COVID-19 as required, emphasizing the need to keep themselves and others safe.\n- Bishop Frederick Williams of Albany delivered the opening prayer, sharing his personal experience with the pandemic's impact on his church community.\n\n**Votes:** \n- No recorded votes took place.\n\n**Attendance:**\n- The Speaker noted concerns about quorum, indicating that some members had not reported to the floor as required.\n\n**Adjournment:**\n- The session adjourned, with no specific next session date provided.",
  "transcript": "of convening, having arrived, all members of the House will please report to the floor\nand take your seats.\nAll members will report to the floor of the House.\nAll members, the clerk will ring the bell.\nAll right, we're about to have the morning roll call or the afternoon roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nI'm authorizing the clerk to vote the machine\nof representative Duke's who is up here at the podium.\nHave all members voted?\nDid we not hear the bell up there?\nHave all members now voted?\nI'm almost afraid to ask again, but let's try it.\nhave all members now voted. Who has not voted?\nRepresentative Sains is voting president who else any others all right\nMr. Clerk let's lock the machines\nThe doorkeepers will please close the doors and keep them closed.\nWe'll get after them.\nBefore we start our business, I want them.\nThe majority leader may talk about this later.\nI don't know if y'all were aware, but we're in the middle of a pandemic.\nAnd we sent out before we got here yesterday, last week, and I think even the week before,\nmultiple emails, advising of two things.\nOne that members were required to be tested every Monday and Thursday, and that testing\nwould be available here in the capital, as it was yesterday.\nImagine how I felt when I came in today and found out that yesterday, 74, I want to repeat\nthat, 74 members of this body did not get tested, that were present in the building.\nAnd that's a bipartisan camp, by the way.\nSo you know, we're doing everything we possibly can to keep you safe, but it takes a little\nbit of initiative on your part in following the rules because if you don't want to keep\nyourself safe, I'd like for you to keep your neighbor safe and me safe and those around\nyou safe. So with that I hope you have a very calming message, Bishop. We will now begin\nour day with Scripture reading and prayer by the chaplain after which we will pledge allegiance\nto the flag of our country. Our chaplain today will be introduced by the gentleman from\nthe 154th House District Representative Winford Dukes,\nRepresentative Dukes.\nThank you, Mr. Speaker.\nGood morning.\nI want you to know really just how glad I am to see each\nand every one of you.\nBecause doing these turbulent times,\nI have truly been praying for you and your families\nas I'm sure many of you have been praying for mine\nas we all have been praying for Georgia\nand these United States of America.\nAs many of you know, all been, it was the epicenter\nfor the pandemic here in the state of Georgia.\nAnd it was widely reported\nthat the virus actually started\nin two of our churches doing a funeral here in Albany.\nThey didn't tell you that we also had thousands\nof people to come and run an American coming from all\nover the world.\nBut one of those ministers succumbed to the virus\nAnd one of them didn't, this morning we have with you want the minister that did not.\nHe is married to Felicia.\nThey have six kids.\nHe attended the theological training at Moore House.\nHe's a master Mason.\nHe has received awards throughout Florida and Georgia.\nHe is the founder and the senior pastor at the Gacinemy Worship International in Albany.\nA church he started with only nine members and now they have over 1500.\nOn behalf of Chairman Green and Representative Camilla Hopkins, I ask that you receive\nthis anointed man of God, a mighty warrior, bishop,\nwith the Frederick Williams of Albany.\nGood afternoon.\nTo the speaker.\nTo the House of Representatives and to all of you.\nThank you.\nRepresentative Duke for that intro.\nI want to say that it is an honor to be here, to stand here, and don't take it likely.\nAs representative Duke had said, one week we were walking in Normandy and without any\nwarning our lives were changed.\nOur church was in the center of this pandemic, and we were forced to make rapid change.\nAt one minute and two days later, 40 of us from the church were sick, 20 was on ventilators,\n10 died within two weeks.\nI, my wife, for my children and their husbands,\nwere all stricken with COVID-19\nand which some of my children are principals and vice-principients.\nWe were at a place of total maze,\nbut I want to share with you today\nthat in all being the Georgia,\nThere are some courageous people that help us get through this most difficult time.\nThe word I would share with you today is found in Proverbs 4 and verse 7.\nIt speaks to the very heart and soul as to how to survive and to adjust to swift transitions\nfor life is fear which swift transitions.\nBefore you opt out in the future,\nbefore you give up, before you throw in the towel,\nit suggests in our daily devotion to get wisdom.\nI wanna drop that today to tell you wisdom\nis the beginning of knowledge and understanding.\nAnd verse seven says, a new living version,\nGetting wisdom is the wisest thing that you can ever do.\nGetting an understanding as to what is happening,\nas to your responsibilities, as to your heart.\nAnd what others expect of you proves\nto make you a valuable person.\nIn the beginning of my life,\nmy mother, who is not 88 years old,\nspoke a word of wisdom to me.\nShe said, son, the people are dependent on you.\nDon't let them down.\nI wanted to rebuttal and say, mama,\nthey should depend on God and not me.\nBut I realized what she was saying.\nHow do I deal with that?\nAnd how do I become the best that she wanted for me?\nIt's through study and wisdom.\nWisdom is powerful.\nAnd I would say it has caused us an all-bending to overcome great challenges after losing\n10 people within a week or two your faith and everything about you is shaken, everything\nthat you once knew is shaken, but God.\nIt gave me wisdom enough to first pride, to secondly understand what is going on, and\nto be a good steward over that which I had charged.\nBefore I pray now, I want to leave with you this morning,\nproverbs four, seven, be wise.\nIn this 2021 year, be wise and use that wisdom\nto better the lives and the surroundings of those around you.\nI want to give you, I want to put the hex on you,\nmama put on me, the people are depending on you.\nDon't let them down. Don't let them down. Shall we stand for prayer?\nFather God, we come today thanking you for our House of Representatives\nof the State of Georgia. We thank you for the opportunity to stand and assure you your men\nin your women that as they stand and plan that you are with them. Father, we\npray for our nation, our leaders, and of course our government. That you would\nrestore us, bridges above our current situations. United us for a common\ngood, a mankind. We pray for this house of rep, safety and unselfish labor of love. We\nthank you now in Jesus' name. Amen.\nAmen.\nLet us pledge allegiance to the flag of the United States of America and to the Republic\nof which it stands,\none nation, under God,\nin the living, with liberty and justice for all.\nThank you.\nOkay?\nDoorkeepers, may I unlock the doors?\nYou\nThe Chair recognizes for the first time this session.\nChairman Hogan, the chair of the Committee on Information and Audits, we have all waited\nsince the end of June for a report.\nThat makes me feel so good, Mr. Speaker.\nYour Committee on Information and Audits read the proceedings of the previous legislative\nday and found them to be correct.\nAnd furthermore, Mr. Speaker, a smart person knows what to see.\na wise person who knows whether to say it or not,\nDalai Lama.\nOkay.\nChairman Hogan, the chair of the committee\non information and audits reports\nthat the journal of the previous legislative day\nhas been read and found to be correct.\nIs there any objection to the confirmation\nof the journal the chair here's none\nand the journal is confirmed?\nThe clerk will read the resolution establishing\nthe order of business for the day.\nMr. Burns, on their 59th moves,\nfiling B establishes the order of business\nand the first part of the period unanimous concerns.\nIntroduction of bills and resolutions.\nFirst reading and reference of house bills\nand resolutions.\nMorning orders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day? The chair here's none in the resolution is adopted. First reading\nof bills and resolutions, the clerk will read. House bill 43 by Representative Cantrell\nof the 22nd, Jones of the 47th.\nNext to the 69th, Martin of the 49th,\nmountain town of the 17th and others.\nBill B. Tonnell, act to amend code section 42,\n26th, the fish go to Georgia annotated\nrelating to form and cost.\nMurder vehicles.\nHouse bill 44 by Representative Cantrell\nof the 22nd, green and 150 first bar,\nthe 103rd, work eyes of the 57th,\ngamble of the 15th and others.\nBill B. Tonnell, act to amend chapter one\nand title 50, the fish go to Georgia annotated\nrelating to general provisions relative to state government.\nState planning and community affairs House bill 56 by represent of Cantrell of the 22nd bill be titled act to amend code section 156 to the fiscal to Georgia annotate early in the number of judges of the court's\nJudiciary we're going to suspend just remote Mr. Clark\nMay proceed.\nHouse Bill 59 by Rose F. Cantrell, the 22nd clerk of the hour and 47th, the rich of the\n97th, the one of the 89th, Wilson of the 80th and others, Bill Bitton, back to men.\nChapter 2 with Title 21 of the Fisher go to George Anand City relating to elections\nand primaries generally.\ncommittee on the election integrity. House Bill 60 by\nrepresent can trail of the 22nd carpenter of the 4th\nJasper's the 11th Clark of the 147th Fleming on 21st\nand others will be titled act to amend title 20 of the\nofficial go to Georgia annotated relating to education.\nEducation House bill 61 by represent of carpenter of the\n4th, Tarvern of the 2nd, Ridley the 6th, will be titled\nact all thrice Woodfield County, Georgia Decks to exercise\nall redevelopment of the powers under the Georgia Constitution.\nThe Intergovernmental Accordination House of Resolution by Reservant Cantrell of the 22nd\nResolution proposing a amendment to the Constitution so as to revive the members of the Senate shall\nserve four-year terms of office.\nGovernmental Affairs House of Resolution 11 by Reservant Cantrell of the 22nd, green\nto the 151st, Carpenter of the 4th, Anestration of the 104th, Resolution Creating\nnow study committee on innovative ways to maximize global talent and\nGeorgia. Small business development that completes first readers. All right\nwe're going on now to morning orders. Morning orders. If you have signed up for a\nmorning order please make your way to the front of the chamber. The chair would\nask you to limit your remarks to not more than two minutes and the chair\nrecognizes Chairman Bill Workhizer for a morning order.\nThank you, Mr. Chairman.\nMr. Speaker, yesterday when you were being nominated, it spoke about your love of history\nand wanted to share something that took a lot of work to find out.\nThis afternoon, like every session you end, you will call on the majority later to make\na motion to adjourn us and then you'll call for the question and it is an overwhelming\nno.\nYou always ignore that and adjourn us and so I found out why, way back in the 1850s, a couple\nlegislators had a bill that made it out of committee, made it out of rules, but yet\nthe speaker would not ever call the bill.\nSo Simon Die came and as the clock ticked, their bill never got called, so when the speaker\nasked for that motion, everyone said yes and said for those two legislators who screamed\nno.\nAnd so as they came back the next year, became a tradition for a different reason than just\nto be funny, it's a statement that we are here to do the people's work, don't send us\nhome.\nAnd so just keep that in mind as we, like most traditions, now the Senate does it, most\ngreat traditions in the state begin in the house.\njust remember that when the speaker asked for us to adjourn that we are here to work\nand we're always ready to work. Thank you, Mr. Speaker.\nI'm envious that you found that out before I did, Mr. Chairman. That's a great story.\nChair recognizes Representative Jasmine Clark for a morning order.\nThank you, Mr. Speaker.\nColleagues, today I come to you of tragic news\nthat the Gwinnett County Public School System\nand the Rock Springs Elementary School families\nhave lost a beloved member of their community.\nMod Jones, who was a paraprofessional at Rock Springs Elementary,\nsadly lost her life due to COVID-19 on January 4th\nafter being hospitalized on December 16th.\nThis is after she had just completed her paperwork\nto retire on December 18th due to concerns\nabout working in the building\nunder threat of contracting COVID-19.\nAs we take a brief moment of silence in her honor,\nlet us please remember the very real\nand potentially ultimate sacrifice.\nWe unfairly ask of each person that enters a school building during this pandemic.\nThank you, Mr. Speaker.\n...\nThe clerk...\n...\nOkay, we have some announcements, I want you to listen up, Chair recognizes Representative\nKimberly Alexander for an announcement.\nShe waves.\nChair recognizes the majority leader of the house\nfor an announcement.\nThank you, Ms. Speaker, good afternoon, y'all.\nLet's some revisit our surveillance testing\njust for a moment.\nFirst thing I'll tell you, if you're still\nhaving a concern or a problem getting into the portal,\ncertainly you can reach out to Georgia Tech,\nbut the minority leader and I stand ready to help anyone from either side of the aisle\nto assist in that effort to make sure that we can be tested, everyone can be tested\non Thursday, Thursday morning from 7 until 11.\nNow as we talked about this yesterday, this is something we've worked on on a bipartisan\nmanner to make sure we're trying to protect the health and safety of every member of this\nbody and every staff member. So we need your cooperation. We know there's some of you\nthat also there's some other circumstances where some folks may have tested in other locations\non Monday. But what we've agreed to and what we need to do to make sure we have an ongoing\nrecord of our members is that we need to test here on Mondays with the Georgia Tech Surveillance\nteam on Mondays and Thursdays. Let's be clear on something else when we come back after\nnext week when we're all for appropriations hearings in the Martin Luther King holiday\nholiday testing will be on Tuesday and if we're in it will be on Thursday of that week\nTuesday and Thursday of that week. So we need to test on those days. It's almost a\nSo a painless test, y'all, I can spit on a tube, a PCR test, so that works out as a proven\ntechnology and we need to take advantage of it to protect each other.\nSo we encourage you, thank you Keith, and I was, need to make sure I say that.\nNext week also the week that we're here for appropriations hearings, the ones that are\nhere or if you need to be tested, we will be testing again on Tuesday and Thursday of next week.\nSo the following two weeks we will be testing on Tuesdays and Thursdays. Now you don't need to\ndrive in from South Georgia to North Georgia somewhere else next week to be tested on Tuesdays and\nThursdays. But you will need, as I'm also we discussed earlier, if you are not here next week to\nto be tested by Georgia Tech, you will need to test before you come back. You will need\nto test before you come back. If you participate virtually on the appropriations hearings\nnext week, as we're going to be encouraged to do, you need to test next week at a different\nlocation. But if you're here in this building and you're participating on this floor,\nyou need to test on Tuesdays and Thursdays, as we've just discussed, or back we'll get\non the schedules of Mondays and Thuristies.\nI see, I think we all get that, now we need to take advantage of that.\nAnd I've touched on the two things, reach out to the leader or myself.\nIf you have a concern about anything with the portal, we'll be glad to assist with that\nand help make sure you're ready for Thursday.\nAs the pastor said this morning, we need to depend on God and not ourselves, but we certainly\nneed to do our part.\nAnd this is the part we can do to help in this pandemic and help be good stewards of our\nneighbor's health and our own.\nThank you, Mr. Speaker.\nI yield the will.\nDo you yield for questions?\nYes, sir.\nI yield for questions.\nChair recognizes in room 341, Representative Anderson for a question.\nWell, maybe not.\nHe waves off.\nOkay.\nChair recognizes representative Bruce to your right for a question.\nFor the gentleman you yield to my friend.\nThank you, sir.\nof foreign clarification, when we were in session last go around, we took a vote on being\nable to conduct our business remotely.\nWhatever happened to that, you know, because we're here and we're telling everybody else\nto stay home, we're telling everybody else in the state to stay home and not gather,\nbut we're gathering it.\nSo what happened with that legislation?\nWell, we are taking all the safety precautions, the distance scene, the different gallery,\n341, that is laid out as far as the protocol from the public health and from CDC.\nWe also will allow our committee meetings, we'll certainly follow the same rules, and\nCertainly we adopted the rules for this session,\n21, 21, 22 session, which are most of them are very similar.\nBut we think that the protocol we have in place\nto additional safety surveillance\ncertainly ensures the safety of our members.\nWell, and certainly, I think you're aware of this,\nbut certainly as far as this of us here\ndoing our businesses on the floor and passing legislation\nthis out, it's mandated by the Constitution\nthat we do it this way,\nuntil there's some sort of change made in our Constitution.\nI thought that's what we did during the last session\nis that we allowed ourselves to be able to conduct\nour business remotely.\nI thought that's what that was.\nAnd you're right about that.\nWe did that, but the Senate did not follow suit,\nRepresentative Bruce.\nThank you.\nSo obviously, as you know, we can't take\nin a lateral action here and have that effect\nwithout the Senate following seat.\nThank you for the question.\nYou have one more question if you care to you.\nI have one more, Miss Smith.\nChair recognizes representative Drenner\nto your left for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI yield to the lady.\nThank you, Mr. Leader, for all of your efforts\nsurrounding keeping us safe.\nCan you just, would you mind repeating the results section\nof how those will be communicated?\nI do not have the exact language in front of me,\nbut I can tell you what it will be.\nThe results come back to our HR director\nand then those results are communicated out\nfrom the HR director or from the speakers office.\nIf you're if you're a positive, if you're a negative result,\nyou will not going to call, but you'll be notified by 7 a.m.\nThe next morning will be the latest.\nYou'll be notified.\nIf you need to be notified, you have no further questions.\nThank you, Miss Speaker and members, we appreciate\neveryone cooperating to keep each other safe\nas we look forward to continuing this session\nin our productive work.\nThank you, Miss Speaker, I yield the will.\nHer recognizes Chairman England for an announcement.\nThank you, Miss Speaker. Good afternoon, everyone.\nI know that we're everyone's anxious about next week in the budget hearings,\nthe joint budget hearings with our friends in the Senate.\nJust to give you a little bit of a heads up, it's going to be a lot different\nthis year than what we've what we've done in the past.\nWe are going to have a virtual option for the members of the committee\nto be able to log in through and into Zoom,\nthanks to Betsy's help and the help of a lot of other folks.\nBut the committee members will be sending out an email\nas soon as we know who all comprises the committees,\nhopefully later this week, to the committee members\nthat will be an exclusive Zoom link\nfor you to be able to log in,\nwhich will help you access the chat box\nto be able to ask questions that way.\nWe're strongly encouraging everyone to do it virtual.\nWe have a very limited number of seats in 341\nthat we'll be using.\nSeveral of our presenters will be virtual.\nSome will be in person as well.\nChairman Tillery and myself and some of our staff\nwill be in there to kind of orchestrate things\nand make sure everything flows as best as possible.\nBut again, we certainly ask everyone\nif you would to do that virtually.\nDon't mind if you come in, but just know\nthat if the doorkeeper tells you you can't,\nit just means there's not an open seat at that particular time\nwhen you're trying to come in.\nSo don't be offended, don't get angry at those folks.\nThey're just doing their job.\nThose of you that are not on the committee\nthat want to watch the proceedings,\nthere will also be an email that goes out\nexplaining how to get on the live stream\nto be able to watch the presentations\nand hear the questions being asked by the committee members.\nSo just give us another day or so\nuntil we get everything nailed down completely,\nbut I just want to give you a heads up\nbecause several of you have asked me about that.\nThank you.\nIf I could have your attention, please,\nbefore we finish today,\nI became aware when we came in just a little bit ago\nthat one of our most beloved members here in this body\nof representative, Patty Bentley,\nwho has had such a struggle with her husband,\nas you know, for I guess a year and a half,\nhour, two years, has even a newer and tougher challenge. She and I have talked about that.\nI ask her if it would be with her approval if we as a body before we adjourned today, lifted\nher and her family and her husband up in prayer. She would welcome that very much. I have\nask representative Mac Jackson to come to the well to lead us in prayer for\nPatty and her husband. Thank you, the speaker. It would just by his please. Heavenly\nFather, we come before you right now in the name of Jesus. We just ask you to\nwrap your loving arms around, represented Patty Bentley, her family father,\nWrap your arms around them and comfort them, Lord God.\nWe call on you right now in the name of Jesus.\nFather, we just thank you for your love, your mercy, and your grace right now.\nAnd as Paul said in his words, your grace is sufficient.\nSo bestow your grace and your mercy upon the family of represented patty Bentley right now, Father.\nWipe the tears from the eyes, Lord, and comfort them and give them peace in this hour\nin the name of Jesus Father, but you don't only help,\nwe know in this hour, and we call upon you right now\nin Jesus' name, amen.\nAmen.\nI think that representative Bentley would have me ask\nthat you keep her and her husband and their family\nin your prayers when we leave here today,\nas you can't get in to see you.\nPlease join me in wishing a happy birthday to Chairman Jan Tancersley today. Happy birthday,\nChairman Tancers. And the chair recognizes the majority leader of the house for a motion.\nI give a speaker.\nMiss speaker, I moved at this house,\nstand adjourned until 10 a.m.\nWednesday, January the 13th, 2021.\nThe majority leader has moved.\nKeep in mind the education lesson\nyou had from Chairman Workhizer now.\nOn the majority leader has moved\nthat this house be adjourned until 10 a.m.\nWednesday, January 13th, 2021.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes clearly habit in this house will be adjourned\nuntil Wednesday, January 13th at 10 o'clock a.m.\nThank you very much.\n",
  "updated_at": "2026-02-12T16:50:42.787392+00:00"
}