{
  "video_id": "yS7g9Ghc_cI",
  "url": "https://www.youtube.com/watch?v=yS7g9Ghc_cI",
  "title": "Capitol Report Day 34 03/21/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 34,
  "video_date": null,
  "duration_minutes": 2,
  "summary": "## Overview\n\nThe Georgia legislature session focused on the debate and passage of Senate Bill 68, a controversial tort reform bill that included an exception for victims of human trafficking. The session featured a failed amendment to extend protections to children and the elderly, as well as concerns raised by a Republican senator about the bill being an \"insurance company bailout.\"\n\n## Key Actions\n\n**SB 68**: Tort reform bill, passed 34-21.\n\n## Bills Introduced (First Reading)\n\nNo new bills were introduced.\n\n## Notable Moments\n\n- Attempted amendment to extend protections to children and the elderly failed.\n- Senator Colton Moore, a Republican, criticized the bill as an \"insurance company bailout\" with no guarantees of lower rates.\n- Governor Brian Kemp praised the legislature's work on the \"tough issue.\"\n\n## Votes\n\n**SB 68**: Passed 34-21.\n\n## Attendance\n\nNo quorum issues noted.\n\n## Adjournment\n\nLawmakers will return on Tuesday for day 35 of the session.",
  "transcript": "Good evening, I'm Sarah Callis with the Lawmaker's Capitol Report.\nSenate Bill 68, the controversial tort reform bill, was back in the Senate today after changes\nwere made in the House, the carved out an exception for victims of human trafficking.\ntried to add an amendment before the debate started that would give children an elderly\nplaintiffs the same protections as people who have been trafficked.\nSo let's stand with kids, let's stand with the elderly. Why should they not have the same\nrights? If they're abused, if they're raped, then people who have been sex trafficked.\nWhy should they not have the same rights?\" That amendment failed.\nSenator John Kennedy, who sponsored the bill, said that current laws still provide\nmany of those protections and weren't needed in the bill.\nall of the other causes of actions in Georgia law are remain untouched that folks have\navailable to them. Democrats also found an unexpected ally in Republican Senator Colton Moore,\nwho said that while he was all for the premises liabilities addressed in the bill.\nBecause everything else in this piece of legislation is nothing more than an insurance\ncompany bailout. There's no guarantees whatsoever that insurance companies are going to lower their\nrates. I think any good business man in the insurance company. Now that they've got\nthis bell out, what are they going to do? They're going to pocket that money, not return it\nback to their customers.\nSB 68 was passed mostly along party lines, 34 to 21. Governor Brian Kemp spoke afterwards.\nI've seen a lot of good legislating around this building over the years on really tough\nissues and this rank is right up there with them. It's a great job.\nLawmakers return on Tuesday for day 35.\nFor G-PV News, I'm Sarah Callis at the State Capitol.\n",
  "updated_at": "2026-02-12T01:23:40.739574+00:00"
}