{
  "video_id": "Z1tirjPBB7Q",
  "url": "https://www.youtube.com/watch?v=Z1tirjPBB7Q",
  "title": "Senate PM Meeting pt. 2 for Day 39 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 29,
  "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n### Overview\nThe session focused on considering amendments to House Bill 54, which aims to authorize advanced practice registered nurses and physician assistants to order home health care services. Several amendments were proposed to address concerns around self-referrals and create a pathway for foreign-trained physicians to become licensed in Georgia.\n\n### Key Actions\n**HB 54**: Bill to authorize advanced practice registered nurses and physician assistants to order home health care services\n\n### Bills Introduced (First Reading)\nNone mentioned\n\n### Notable Moments\n- Debate and amendments around HB 54 to address self-referral concerns and create a pathway for foreign-trained physicians to practice in Georgia\n\n### Votes\n- HB 54 and amendments passed, but specific vote tallies not provided\n\n### Attendance\nNo quorum issues mentioned\n\n### Adjournment\nNo specific adjournment time or next session date provided",
  "transcript": "You\n...\n6-8-3, House Bill 84.\nHouse Bill 54, Representative Clark,\nother 100th and others.\nBill Twin, tell an active men title 16-3-143.\nI just got a Georgia annotated with you crimes and offenses, health and revisions and businesses respectfully.\nSo I was to authorize advanced practice, registered nurses and physician assistants to order home health care services to patients of licensed health home agencies,\nsurvivor definitions, survivor of the approval of continued education regarding death certificates for certain physician assistants by the Georgetown Botza Medical Board and for certain advanced practice, registered nurses by the Georgia Board of Nursing to our related matters for building and looking laws and for other purposes.\nMr. President, the Senate command regulate industries and utilities recommends this bill to pass by substitute respectfully submitted to our Couser chairman\nMr. President, the Senate command regulate industries and utilities offers to following substitute to House Bill 54 built to mean title and act to men title 16\n31 43 and 48 of the CGA will judge the crimes and offenses health\nImpressions and businesses and remember the taxation respectfully to authorize position assistance to order home health care services to patients of home health agencies\nto write for definitions, to write for the approval of continued education regarding death certificates, to write for authorizing job descriptions, to write for text credits, to qualify caregiver expenses, and for other purposes.\nMr. President, Senator Brass, the six and others offer the following amendment number one, to men house bill 54 by adding advance practice registered nurses and before physician assistance, on lines three and six, by inserting in advance practice register nurse, acting pursuant to authority code section 43-34-25 before or a physician assistant on line 17.\n13, 30, 39, and 40, 63, and 64, 80, and 178,\nby inserting between lines 46 and 47,\nthe following, 0.5.\nAdvanced practice, register, certain norres,\nhas the same, meaning a set fourth and code second,\n43, actual, inject, S3, and for other purposes.\nMr. President, Senator Kampagic,\n30 second, and others, offer the following amendment,\nnumber one, eight, to amend amendment one,\nto house bill 54, by inserting on line four,\nafter on a position assistant,\nprovided that the individual,\nparticularly the home health heart services does not have an ownership intent and an entity to which they are refining.\nMr. President, Senator Jackson, the 41st and others offered the following amendment number two to amend House Bill 54 by inserting between lines 162 and 163, the following section 6a, said titles furtherment by adding a new code section to read as follows 43-34-34.1a as used in the code section term.\nSection 1. Institution means a hospital license by the Department of Community Health and its affiliated clinics\nThey board approved medical school or a federally qualified health center for that such institution and for other purposes.\nMr. President, I complete the order.\ncouple minutes before stemming\nat\nsenator from the\nThank you, Mr. President, we're chugging along, we only got 78 more bills to go.\nLadies and gentlemen, I bring to you HB 54, simple bill.\nIt allows PAs, also known as physician assistance under direction of a doctor or a physician\nto write home health care orders.\nThat is the underlying bill and it's simplest for them.\nAnd brought amendment one, which will allow\nadvanced practice registered nurses to do the same,\nalso under the direction of a doctor or physician.\nIt's something we did for three years under executive order\nthat the governor had signed off on.\nIt's been done where my understanding is we are the last\nstate that would be allowing these APRNs to write the home health care.\nWe've got Amendment 1A brought by the Dr. Caucus and this simply is going to mirror federal\nlanguage or may not mirror it but it goes along with federal language that says you can't\nwrite that home health care if you own or have any interest in a company that does home\nhealth care. So you can't essentially, you can't refer someone to yourself. So you can\nrefer the home health care, the PA, the APRN, or the doctor. They can refer someone to\nhome health care. They just can't refer them to their own company or any company for\nthat matter. And then there's an amendment too. I haven't had a chance to read it, so\nI can't speak to it with that all yield for questions.\nSenator from the first question.\nThank you, Mr. President, to Senator Gild.\nSenator I yield for the chairman of the Dr. Caucus.\nCoach, chairman of the Dr. Caucus.\nThank you, Mr. Chairman, rules.\nWe're certainly, it's one of them.\nI'll reiterate, you know, a amendment one, a, or is something that I think is appropriate\nnurse practitioners and PAs, it is correct with positions and PAs can't refer to something\nthat they own, so that's why the second amendment, and I think we're all on board with that.\nAnd I would hope that the second amendment would be withdrawn, but I will leave that up\nto the author.\nThank you very much.\nI don't know if I can get that in the form of a question.\nBut yes, that is true.\nI yield the well.\nYou have no more questions.\nThe center is yielding.\nDid any of the senator wish to speak for or against it?\nAs soon as from the 30 second you'd like to speak to your amendment\nAs soon as from the 30 second your amendment\nThank you, Mr. President.\nThe rules chairman did a very good job of explaining Amendment 1A.\nBasically, physicians are bound by federal law about self-referrals so that you don't refer\nto an entity in which you have a financial interest and so the MM is just to make it clear\nthat the same would apply to anyone that's making that referral.\nHappy to answer any questions.\nYou have no questions, Senator.\nThank you.\nThank you.\nWe're going to send it from the 41st.\nMr. President, colleagues, I rise today here with amendment number two, and I would ask\ncan invite you to consider this amendment.\nAnd I want to start by telling you where it comes from.\nFirst and foremost, I had the great privilege\nof being on a study committee where we went around rural Georgia\nand we talked about a rural health care shortage.\nAnd over the course of time, that study committee\nput together a committee report.\nAnd one of the things we said that we needed to do\nwas to consider the people who live in our state today\nwho are already trained as physicians who are trained\nnationally and to create a pathway for them to become licensed. And so this is\nwhat this amendment does. It creates a pathway because we have hundreds of\ndoctors who live in Georgia today right now who are trained and worked as\nphysicians in their home countries who've now made Georgia home and right now\nare not able to practice. I'm also bringing this bill to you today because I have\nfamily who live in rural Georgia. A father-in-law with a chronic illness who\nfought in Vietnam who worked and served this country and who has to travel miles and miles\nbecause there's no doctor nearby.\nAnd I know that this is true for many of the people in this room.\nThere are 143 counties in our great state in which there is a clear and true shortage\nof physicians.\nEvery one of us sitting in this room has an obligation to our constituents to do everything\nthat we can possible to deliver health care to them and when you have doctors who are\nalready trained here in the States, but we don't create a pathway for them to be able\nto work, well I think that we're filling our people.\nThe reality is I have worked incredibly hard and in good faith with physicians and with\na whole lot of people to create a pathway so that people who are trained, people who served\nin the military and worked as physicians there, people who worked hard as physicians who\nbring great expertise can be able to bring that practice here to Georgia. But I want to\nbe clear what I'm trying to do here is not new. This isn't something that I just made up or\ncame out of the air. Let me tell you the states that have already done this. Arizona, Arkansas,\nColorado, Virginia, Florida, Utah, Illinois, Idaho, Iowa, Tennessee, Washington, and Wisconsin\nhave all said, you know what, we have a shortage.\nWe have a physician shortage, particularly in our rural areas.\nAnd we need to create a pathway for people who are internationally trained\nto be able to practice in our states.\nThey are doing that, and they are doing that today\nto try to begin to address the shortage.\nFriends, I want to be clear.\nPeople in rural Georgia today are not well\nbecause they don't have access to a physician.\nPeople in rural Georgia today are burning up gas,\nspending extra time and energy having their loved ones\nto other counties, because they simply\ndon't have access to a physician.\nThis bill helps to begin to fill that gap.\nNow, some will say, well, are you sure\nthat they're going to be able to care for us well?\nWell, in this amendment, we've made sure we require\nthat they take all of the examinations\nthat anyone who was trained in the US would take.\nStep one, step two, step three.\nWe require that they would have to be supervised\nby a physician in a facility where they were hired.\nWe have put lots of guardrails in this bill,\nand I will tell you, somebody's probably\nalready got a text message from the composite board.\nAnd the composite board will say,\nwell, we don't agree with this bill.\nBut I want you to just take a moment and look at line 48.\nIn line 48, we tell the board that any other criteria\nthat the board may require, they are able to come up with.\nLine 65, once again, we say to the board,\nany other criteria that you decide is necessary\nto ensure the safety of these positions you can come up with.\nAnd we say it again in line 73.\nAny license can be granted or denied\nat the discretion of the board.\nWe have given the composite board a significant amount\nway, to make sure that they implement rules and promulgate all the things that\nare necessary to protect all Georgians when it comes to being having access to a\nphysician who is trained in nationally. But fundamentally, this is about bringing\nmore doctors online. It is about making sure that wherever you are, whether it's\nbecause you have family in rural Georgia or you yourself live in rural Georgia or\nyou happen to go on vacation and find yourself in need of a doctor in rural\nGeorgia. This is about making sure that those doctors are available. So I hear and I know\nthat there are some concerns because the medical composite board isn't online. Well, sometimes we\nhave to tell the medical composite board to figure out the rules. But we've given you some framework\nand we've given the medical composite board the space to fill in any rules that they might fill\nare necessary. But at the end of the day this amendment, this vehicle will make sure that we have\nmore doctors, doctors who are trained, who have been working as physicians in other countries,\nwe are making sure that they can come and serve here, just like 13 other states around\nthis have already done, and with that I will yield for questions.\nYeah, no questions Senator. Thank you.\nWe're going to ask the senator from the first.\nI just speak to the manager.\nThank you, Mr. President.\nI certainly agree with the senator\nthat there is a significant shortage of physicians,\nbut I must point out that we have been working with her,\nand, literally, we've agreed with the composite board\nof medical examiners that we will work on that issue\noff-section this summer and so that everyone is in agreement\nwith allowing foreign medical graduates\nto practice here in the state of Georgia.\nThey do now, they're allowed to now,\nbut they must complete a residency.\nThe issue is whether or not they've completed a residency\nand approved accredited from somewhere around the world.\nSo all residency programs are not equal.\nAs a matter of fact, let me just point out\nthat online 40, that it says you must complete,\nhave completed a formal postgraduate training outside\nof the United States.\nWell, listen, after I finished medical school,\nI could have gone to France and done a month's long\npostgraduate education and come back.\nI don't think that definition really fits\ninto a formal residency program that you have in mind.\nAnd it goes on and on with that.\nThere are some minor changes that we have asked her to make,\nbut not the changes that everyone is comfortable with,\nbecause the bottom line is a quality physician leading\nleading the team and taking care of patients in a safe manner.\nI am fully on board with having foreign medical graduates in the United States\nand in Georgia, they are practicing.\nI have a partner and partners who have practiced outside of the United States,\nbut they have met every criteria.\nThese that she is carving out is not appropriate right now with these rules that she has proposed.\nAnd that's why I would say, let's give us some time,\nlet's get everybody on board,\nlet's get everybody in full agreement,\nbecause quality and safety is important.\nMr. President, I'll be happy to answer questions,\nif not, I'll yield the will.\nThank you.\nWe're gonna have Senator from the 22nd.\nThank you, Mr. President. I rise in support of the amendment. One of the things we have\nrealized is the headlines in Georgia couldn't be clearer why this amendment isn't necessary.\nAnd although there may be some work to do, now is the time to actually pass this amendment.\nThe headlines say things like half of Georgia rules, hospitals, struggle financially.\nhealth care is in crisis. 18-30 rural hospitals are in danger of closing. Local leaders highlight\nGeorgia rule health care crisis. And these headlines can go on and on. I can name more and more\nand expand different years and also different localities. It made no mistake that Georgia really\nis a rural state in the sense that but almost 120 of our hundred and 59 counties are actually\nclassified as rural. This amendment addresses that particular issue. And these folks are there\nwhere there's rule or in a underserved population because remember this amendment actually affects\nunderserved areas but also underserved populations. These people right now need help today. They're\nactually suffering. They actually need this healthcare access. And we also want to remind ourselves\nthat the persons that come in under this amendment, they still would have to be hired. They still\nwould have to be interviewed. They still are going to go through the same kind of protocols to make\nsure that they're doing the right thing once they are hired. They're still going to have to satisfy\nother patients, everything that any other physician would do, they will also be\nsubject to that. The question becomes, we realize that the need is there, now is\nthe time, not wait another year, and then possibly there's other restrictions\nthat we come up with, other things that need to be done. Now is the time to help\nour citizens of Georgia and to solve this rule and underserved population\ncrisis for health care that we have in Georgia. Thank you and I yield well.\nThank you, Mr. President, I'll be brief.\nI've had a good conversation with the author of the amendment and the author of the bill.\nI have my name on this man, but I'm going to be voting against this.\nI think this is a longer conversation that needs to be had in the off season and ask for you out of stick with me and yield the well.\nSenator from the 30 second, do you have something you'd like to add?\nCome on up.\nThank you, Mr. President.\nIt's absolutely true that we have been working with the Senator to try to get this right.\nI don't feel we're there yet.\nLine 40, for example, doesn't really define what is an acceptable postgraduate training\nprogram outside the United States.\n1662 talks about institutions that are not accredited and the person being supervised by one fully licensed physician in this state\nWhat does that mean? I don't think we want to create a two tiered system and although we do have shortages\nWe want to be sure that the people that are coming in to practice are qualified. So with that I am not in support of the amendment\nNumber two. Thank you. All right Senators yielded right about center for the fifth\nThank you Mr. President, I was inclined to speak, but I just want to mention, my elder sister\nis a doctor, she was in this country a number of years ago, and she led to take care of\nmy uncle, was a dentist, passed away in New York, so I have multiple folks in my family,\nthey are doctors.\nI just want you to know, we have, you know, last number of years, I know multiple doctors\nthey graduated from England, from Japan, from Afghanistan, from Bangladesh and India.\nA lot of them left the state.\nThey're United States citizens.\nThey came in this country with the residency, become U.S. citizen, spend all this time\nover here, couldn't get a residency.\nI know they went to New York, they went to Missouri, multiple other states.\nSo we need to do we have folks they're qualified they're not coming in on the third world country\nThat you think you know, so we need to do something we need to please I've been hearing this a number of years\nThat we will do something we can do what you know we can work\nPlease do something\nWe got to do something we can do better\nWe should not have\nCounty in a state of Georgia that we don't have any doctors. We have multiple counties in the state of Georgia\ndoesn't have any doctors. We need to carve out or do something so people don't have to go\nother state to practice or get residency. I appreciate. Thank you, Mr. President, I yield\nthe word.\nSenators Yildes, any other concern which speak for against measure? This is a gentleman\nfrom the six which to close debate. He waves.\nThis is on the adoption of Amendment 1A.\nOh, Amendment 1A authored by the Senator from the 32nd.\nHis abjection to 1A, not abjection 1A, is amended.\nNow I'll move on to Amendment 1, as amended, authored by, I'm not sure who authored it.\nSenator from the 50th neighborhood?\nThe 6th, authored by the senator who is carrying the bill,\nSenator from the Is there objection?\nThis is 1.\nOn the amendment number 2, we have objection.\nAll right.\nAmendment number two, authored by the senator from the 41st.\nAll those in favor of amendment two,\nwill vote yeh, all pose nay, secretary,\nand lock the machine.\nYou\nYou\nOn the adoption of amendment two, the A's are 23 and the A's are 30 and so this amendment\nhas failed.\nQuestions on the adoption of the committee substitute as amended?\nIs there objection to the adoption of the committee substitute as amended?\nHearing none, the committee substitute as amended is adopted.\nIs there objection to agreeing to the Board of Committee which is favorable to the passage\nof the bill?\nChair here is done.\nBoard of the committee has agreed to is there objectives the main question being ordered to here's none of the main question is ordered questions on the\nFancy's of the bill by substitute all those in favor of up. Yeah, I'll pose nay secretary will unlock machine\nYou\nAll the passes of the bill, the A's are 54, and the A's are 1, and this bill has received\nreccent constitutional majority and therefore is passed by substitute.\nThank you, Mr. President, I ask unanimous consent that Senate rules 3-1.2 and 4-2.\n0.1A be suspended to allow for bill to be read for the first time and assigned to committee\nSecretary the captions\nSenate bill 372 by Senator Walker the 20th and others built to be entitled back to men are to co-on to chapter one\nTitle seven of the physical George annotated will it to the Department of being in a finance and financial institution generally says to provide for the removal of references to\nreputational risk from any department of thinking and financial guidance rule examination manual or similar document to prohibit the department from considering\nreputational risk when regulating financial institutions to write for a court detailing any policy change whether to made by the department as there's all this act to write for definitions,\nwrite for laid of matters for bills and looking laws and for other purposes.\nWe'll sign in the banking.\nYou should have a supplemental local consent calendar.\nWhat we read earlier today should have that on your desk.\nIs there objections? Do you have anything on the local consent calendar?\nDid you hear that?\nYou got it.\nthe\n",
  "updated_at": "2026-02-12T17:13:14.152017+00:00"
}