{
  "video_id": "z2_lEMy15Z4",
  "url": "https://www.youtube.com/watch?v=z2_lEMy15Z4",
  "title": "11/29/2023 Senate Committee on Reapportionment and Redistricting",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 71,
  "summary": "Here is a structured markdown summary of the Georgia 11/29/2023 Senate Committee on Reapportionment and Redistricting session:\n\n## Overview\nThe session focused on the process of redrawing Senate district maps to comply with a court order requiring the creation of two additional majority-Black districts in South Metro Atlanta. The committee chairs discussed their approach of meeting with affected senators, following traditional redistricting principles, and minimizing changes to existing districts as much as possible.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Committee chair Senator Shelley Eckles thanked various individuals for their work and participation in the redistricting process.\n- Vice Chair Senator Hatchett discussed the challenges of balancing the court order with senators' desires to keep their districts unchanged.\n- The committee adopted the same rules and guidelines used in the 2023 legislative session.\n- Senator Butler indicated he would present his redistricting proposal to the committee the following day.\n\n## Votes\nThe committee unanimously voted to:\n- Re-adopt the committee rules from the 2023 legislative session\n- Adopt the 2023-24 guidelines for the Senate reapportionment and redistricting committee\n\n## Attendance\nQuorum was present, though the transcript did not provide specific attendance numbers.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled meeting.",
  "transcript": "I am Senator Shelley Eckles, and I would like to thank you all for attending the reapportionment and redistricting committee meeting today.\nI will now call this meeting in order, and I would like to ask our pro-TEM if he would open this meeting as we do all of our Senate meetings with order prayer.\nWe have it too. Thank you.\nWhat number are you?\nNumber nine.\nThank you, Madam Chair, and if everyone, if you would, now with me.\nHeavenly Father, we've come to the Capitol today to begin a process of doing the work for\nthe people that we represent.\nThank you for giving us that privilege.\nPlease be with each of us individually and collectively as we make important decisions\nfor our own constituents and the state as a whole.\nPlease forgive us of our sins and help all those that are less fortunate and those that\nare in need.\nIn Christ's name, amen.\nFirst of all, I'd like to thank some people for the work they've done to help prepare\nthis map.\nOur state map drawer, Gina Wright, thank you so much.\nShe spent a tremendous amount of time with me and vice chair Hatchet.\nexpertise and wealth of knowledge have been invaluable. Thank you to\nVice Chair Hatchett. We've made some trips to Atlanta and we've spent a lot of\ntime together and I've appreciated your help and assistance and it's been a\npleasure working with you. Thank you to this committee for your\ndedication. We have a few long days ahead of us and I want to thank you for\nyour willingness to serve. Thank you to the senators who have given their time\nto meet with me to discuss your districts. I learned so much about your\ndistricts in those meetings and I appreciate your willingness to have open\nconversations with me about the process. Thank you to the public who have\nchosen to attend this meeting today. Your participation in the hearing is\nvital and I appreciate your attendance and participation. In your folder\nmembers you will find a few documents. The first thing we need to do just\nBecause we're in a special session,\nI'd like to re-adopt our committee rules.\nSo I'll enter, it's the same rules\nthat we adopted last time,\njust like to re-adopt those for this special session.\nMadam Chair, that was fine.\nI think that's entirely in order.\nAnd I would like to make the motion\nthat we adopt the rules as you have proposed\nin the folder and the same ones that we had from session\nin 2023 to be the rules governing us\nduring the special session for this committee.\nOkay, thank you.\nI have a motion in a second.\nThank you.\nOkay, so we'll vote on those rules all in favor.\nRaise your hand.\nAll of those opposed, raise your hand.\nThank you.\nThe next order of business is to adopt our guidelines\nand you find a copy of those in your packet as well.\nThese are the 2023-24 guidelines\nfor the Senate reapportionment and redistricting committee.\nAnd this just lays out the process\nthat we have followed in drawing these maps.\nAnd it's the same set of guidelines\nthat the House reapportionment and redistricting committee\nwill be approving as well.\nAnd at this point, if there is emotion,\nI would entertain that.\nSo many.\nWe have emotion in a second.\nAll of those in favor of adopting these guidelines,\nplease raise your hand.\nAll of those opposed.\nThank you.\nAll right, Leader Butler, I just wanted to confirm that you want to present your bill\ntomorrow.\nIs that correct?\nAnd what number are you?\nYes.\n12.\n12.\nYou said that is correct.\nThat's correct.\nOkay, so tomorrow we will hear your presentation of your map that you would like to present\nto the committee.\nThank you.\nThank you.\nAll right.\nA little bit of history about the map drawing process.\nWe began by carefully reviewing Judge Jones's order.\nThe order was very specific about what needs to be done in the Senate.\nAnd to quote page 509 of his order, the remedy involves two additional majority-black Senate\ndistricts in South Metro, Atlanta.\nJudge Jones also noted that the district's drawn by the various plaintiff experts overlapped\nin some areas. Shortly after Governor Camp called for a special legislative session, I sent\nout emails to every senator from the affected areas to meet because of the short amount\nof time that we had to prepare for this session. I allocated several days to be at the capital\nand even more days to meet virtually. I met with one member at 730 in the morning\nat the Capitol. I talked to one member while I was at a EGA football game. My husband wasn't\nso happy about that. I would like to thank Senator's Dugan, Strickland,\nSay, Anderson, Harbin, James, Davenport, Jones, and Rhett for taking the time to talk and\nmeet with me. Your discussions were very helpful, especially when I found out that one member\nhad moved and we didn't have their correct address. We consulted with legal\ncounsel and began drawing districts with Gina Wright in her office. Now by\nchairman Hatchet I'll turn it over to you if you would like to make any comments.\nThank you Madam Chair. I just wanted to welcome you all. Thank you guys for\ncoming and being a part of this process. As the Madam Chair said earlier this\nThis has been a process, and when we first sat down to draw the maps, there were several\nthings that we considered.\nNumber one, obviously, is the judge's order.\nAnd because we had maps previously drawn, we didn't have to start from square one.\nWe had an order to go by.\nWe made sure to comply with his order, the Boating Rights Act, the traditional redistricting\nprinciples and then we met with Senate members whose districts would be impacted on both\nsides of the aisle. It was eye-opening to me every member that we met with had the same\nrequest. Keep my district exactly the way it is. I like the way my district is drawn.\nAnd so we have the judges order on one hand telling us we've got to redraw these and members\non the other hand, saying, keep my district the same.\nSo it was a challenge, but in response\nto those conversations, in response\nto the judge's order and our traditional principles,\nwe believe we drew a map that affected\nas few districts as possible.\nAnd I look forward to hearing public comment\nabout this map and seeing this map through the process.\nThank you, Madam Chair.\nAfter meeting with those members, we first drew with Gina Wright in her office the new\nmajority black districts that were required by the order in South Metro, Atlanta.\nThose districts are 28 and 17 on the plan in front of you members.\nWith that configuration, almost all of the black voters covered by the areas in the Planets\nExperts districts in those areas are included in a majority black state senate districts.\nThe only area not included is Griffin, but that area wasn't included in the majority\nlight district for one of the plain experts plans either.\nPlacing districts in south part of Metro Atlanta meant that other districts had to move north,\nyou can think of that as a simple ripple effect of moving districts.\nAs a result, majority white senate district 42 moved from the northern part of the cab\nto Eastern Metro Atlanta and Majority White Senate District 6 moved from the northern\npart of Fulton County to Western Metro Atlanta.\nIn the proposed Senate plan, the Senate plan involves changes to 15 districts and all\nof those are in Metro Atlanta.\nThe second page of your packet includes a plan where the only districts displayed are\nthe districts that are changed.\nSo if a district doesn't appear on that page, it didn't change.\nOur primary goal in creating this district plan is to comply with Judge Jones' order\nin every respect.\nI told every member that I met with that my primary goal is simply to comply with the\nGeorgia's order.\nAfter drawing the districts required by the court order, we then followed our existing\ntraditional redistricting principles to work on the remaining districts.\nThese principles included maintaining district populations so that deviations from the ideal\ndistrict size are less than 1% to comply with the U.S. Constitution requirement of one person\none vote.\nLimiting additional split counties by only adding one additional county split.\nDrawing the new districts utilizing the most recent precincts from county governments.\nSome counties that they voted their voter precincts this summer and these maps recognize\nthose new county voting precincts. Ensuring all districts are contiguous. Ensuring all districts\nare reasonably compact in shape. Ensuring communities of interest are protected as far as possible.\nMany of you described these in our meetings. Your input was invaluable in with that.\nWe also made sure to avoid the unnecessary pairing of incumbents by ensuring that every incumbent\nthat Senator of both parties is not paired.\nAs part of our efforts to ensure every incumbent Senator\nhad a district to run in and to win in,\nwe also work to maintain the continuity\nof representation as much as possible,\nwhich involved partisan political considerations\nto ensure that the Senate plan remained balanced\nbetween political parties as it was in 2021.\nThis means we also used extensive partisan data,\nincluding election returns from 2018, 2020 and 2022.\nSo I'm going to discuss now the two districts\nthat had the most change.\nSenate District 17 is one of the new majority black districts\nrequired by the court order.\nIt's located at almost exactly the same location\nas the plaintiff's experts districts in this area.\nAnd I have a map of one of the exhibits,\nof both of the exhibits over here behind the committee.\nThe district contains the Panhandle\nand Southern part of Clayton County\ncombined with most of Stockbridge and McDonough.\nThe district includes all of Hampton as well.\nJudge Jones relied on the inclusion\nof most of McDonough, Locust Grove and Hampton\nin the same district for this area in his order\non pages 285, 286, and 316.\nThe district boundary of district 17\nMatch those communities centered on McDonough.\nThis district boundary has only a single incumbent\nand that is Senator Davenport.\nSenate District 28 is the other new majority black district\nrequired by the court order.\nThe plaintiffs experts drew this district\nin two different places.\nOne expert anchored the district in South Fulton\nas we have done here.\nThe other expert utilized populations\nfrom district 16 and district 34,\nwhich resulted in higher black voting age population\npercentages in adjoining districts.\nDistrict 28, as proposed, is anchored in South Fulton County\nwhere one of the plaintiffs districts was\nand ensures that black voters in Fulton, Fayette,\nand Clayton counties are all in majority black districts.\nDistrict 28 also relies on some of the same highways\nand healthcare system Judge Jones relied on\nat pages 325 and 326 of the order.\nThe district includes part of the city of South Fulton and moves north into\nall-stale. All areas that Judge Jones found to share strong connections at\npages 190 and 191 of his order. The district connects a number of suburbs around\nMetro Atlanta that are all experiencing growth and our diverse communities.\nThis configuration also limited the number of adjoining districts that had to\nbe touched. The district has a single incumbent and that is Senator James.\nSo, now before we talk about all of the other district changes, moving to those adjustments\naround the majority-black districts, I'll explain those changes, there are a few things\nto note about those remaining districts.\nFirst, both plaintiffs' experts testified that they did not know a lot of details about\nGeorgia geography.\nOur process was informed by Miss Wright's extensive knowledge of Georgia and my meetings\nwith senators about their areas.\nWe believe we've reached a plan that is far better than those produced by the plaintiffs\nwhile also complying with everything the judge requires.\nSecond, it's important to note that the ripple effect is real when drawing plans.\nWhen new districts are located in the southern part of Metro Atlanta, nearby population has\nto be adjusted.\nThose changes then ripple out, primarily north until they are resolved.\nThird, the 15 change districts here are less than those proposed by the plaintiffs' experts.\nSo we were able to maintain district cores in a better way than their experts did.\nMr. Esselton changed 22 of the enacted senate districts and Mr. Cooper changed 35 of the enacted\nsenate districts on their proposed plans and we changed 15.\nFourth, we took into account the work on county election officials who have to update the\nthe voter registration database.\nBy drawing the map this way,\nwe are working to minimize the amount of work\nrequired before the 2024 elections.\nFifth, the plan does not eliminate\nany existing minority opportunity districts.\nJudge Jones was very clear on page 510 of the order\nthat we cannot eliminate any existing minority\nopportunity districts.\nWhile he doesn't define that term,\nit's clear that he's referring\nto existing majority-black districts.\nOn page 511, he refers to whether\nThe plan provides black voters with additional opportunity districts.\nThere are also references to opportunity districts that clearly refer to black voters on pages\n106, 145 to 146, 268, 417 to 20 and 427.\nThis senate plan does not eliminate any existing majority black districts and it takes two\nexisting majority white districts, that's district 17 and 28 and converts them to majority\nblack districts. Sixth is important to remember that we believe our 2021 Senate\nplan complies with the Voting Rights Act and are pursuing an appeal of the\njudge's order. That's why you will see language in this order that reversed the\n2021 plan if the appeal is successful. This mirrors language used by\nDemocratic majority in 2002 when the state Senate plan was not pre-cleared in\ntime for use in that election. But if anyone is upset with how a district is\nconfigured. Remember we did not draw these districts this way in 2021\noriginally and we did not want to redraw these districts now. We're doing this\nbecause we were sued by democratically affiliated groups. Now I will walk\nthrough the remaining changed districts. I'll start on the east and work my\nway west so Senate District 25 stays largely the same with slight adjustments in\nthe Locust Grove area to accommodate the addition of District 17. This ensures that voters\nin this district will largely maintain existing representation.\nSenator Williams will remain the senator in this district.\nNext is Senate District 42. Because of the ripple effects of moving districts north,\nSenate District 42 was previously a majority-white district into cab county and is now a majority-white\ndistrict in eastern Metro Atlanta. It has much of the territory of the prior\ndistrict 17 which has become a majority black district. It includes areas with\nstrong connections like Newton, Morgan and Walton counties and growing areas\nof Henry County. The boundaries include many rural areas and areas where people\nare moving from Henry County into as they get older. This configuration also\nensures more of Newton County stays together. Senator Strickland will be the\nonly incumbent of this district. Next is Senate District 43. In order to make\nroom for District 17 District 43 moves north into Gwinnett County similar to\nthe configuration of the existing District 55. Otherwise this district is\nlargely unchanged with all of Rockdale Importions of Newton and Dakab and\nall suburban areas. This district shares connections through I-20 and into\ngrowing areas of Gwinnett County. Senator Anderson remains the incumbent for this district.\nNext is Senate District 55. Senate District 55 also ripples north, taking in Tucker in some areas\nthat were previously in Senate District 41. It remains in both DeCab and Gwinnett counties and\nincludes areas along I-285 on the eastern portion of the city. Although Tucker is not whole,\nit includes almost all of the city along with areas of stone crest. Senator Butler remains the\nincumbent of this district. Next is Senate District 41. As part of the ripple effects around this\narea, District 41 shifts to the west, taking in all of Clarkson and moving over north of Decatur.\nThis district previously ran from stone crest to Clarkson, so it includes a number of areas\nthat were previously in it. This configuration enables the district to stay\nmajority black while moving north because of the locating of district 17 to\nthe south. Senator Jackson remains the incumbent in this district. Senate\ndistrict 10 is directly affected by the creation of district 17 because it\npreviously ran through that part of South Henry County now included in\ndistrict 17. As a result the district shifts north to include areas around\nDecatur. The district previously included stock bridge with portions of stone\ncrest and will continue to do so but with less of stock bridge included. The\ndistrict remains majority black even as it ships north. Senator Jones remains\nthe incumbent in this district. Senate District 44. Like District 10, District\n44 has to give up population in the southern portion of the district to\nto create district 17, so it moves north as well.\nAnd so doing, it takes indicator,\nensuring that we included portions of Decatur\nthat were excluded in 2021\nbecause the boundaries had not been updated.\nThe district includes all of Decatur\nand most of the Avondella states,\nareas that were previously in district 42\nwhile keeping those communities whole.\nThe district remains majority black,\neven as it ships north.\nSenator Parent remains the incumbent in this district.\nSenate District 39, moving over to the other side of Metro Atlanta, the next set of districts\nare the changes necessary to add to other new majority-black districts in South\nMetro Atlanta.\nThere are some blank spaces here because no changes were needed to Districts 36, 34,\nand 16.\nDistrict 39 maintains its current north-south orientation, shifting to the west slightly\nto accommodate the changes to our district 28 as the new majority black district.\nThe north south orientation has been consistent with how this district has existed for several\ncycles of redistricting.\nSenator Halpern remains the incumbent in this district.\nSenate district 38 ships east and north to accommodate the addition of district 28 in\nthe south.\nIt exits Cobb County and now will be holy within Fulton County connecting areas from\nfrom Palmetto and Union City,\nwhich stay whole to areas of Buckhead.\nThere's a strong community in Fulton County\nin the district maintains its majority-blikes status,\neven as it shifts north.\nSenator Tate remains the incumbent in this district.\nSenate District 35.\nThis district shifts significantly to the north\nto accommodate the new majority-blike district,\n28 in South Metro Atlanta.\nInstead of running south,\nIt now runs from South Fulton to the Smurna area\nwhile maintaining its majority black status.\nThese areas are connected as growing suburbs\nlocated primarily along the 285 corridor on the west side\nand sharing a number of common interests as growing areas.\nSenator Estevez is the incumbent of this district.\nSenate District 33, in order to accommodate\nthe shifts of adding district 28,\nDistrict 33 shifts north and east,\ntaking in areas toward East Cobb.\nThe district maintains its primary East West orientation,\nconnecting powder springs with Marietta as it did previously.\nThe district is holy within Cobb County\nand keeps powder springs whole.\nSenator Rhett remains the incumbent in this district.\nSenate District 6, in the process of creating District 28,\nthere was significant population left\nwhere District 6 is now located.\nThis district keeps Kaueda and Hurd County's whole,\navoiding a split of Kaueda County.\nIn order to come out to the population needed,\nit moves into the southern part of Carroll County\nwhere district 28 previously connected Kaueda,\nheard and parts of Carroll in the map,\nprior to the 2021 districts.\nDistrict six connects the University of West Georgia\nwith New Nguyen, where there are a strong growing communities\nand ensures that small areas in rural Carroll County which share a strong similarity with her county can remain in a district that is similar.\nSenator Brass is the incumbent in this district.\nSenate District 30, District 30 remains largely the same with the same boundaries in Harrelson and Paulting it previously had.\nThe district previously included a portion of Douglas County and now takes more of the western part of Douglas.\nIn an area that is very similar to Carol, including Villarica, which is a city that straddles the county line.\nThe district includes most of Carrollton and Carroll County\nremains the largest county in the district. This district shifts east to help accommodate the creation of the new majority-white district 28.\nSenator Dugan remains the incumbent in this district.\nAnd that concludes my presentation of the map in the districts.\nAt this point, I'm going to open up the public comment.\nAnd so we had a sign-up.\nWho is not on the sign-up who would like to be added to the sign-up?\nWell, that changes things a little bit, we will allow more people to sign up.\nI want everyone's voice to be heard, but I will, because there are so many people who\nwould like to sign up now, I will limit your comments to five minutes.\nIf you would be respectful of that time limit, everyone should be able to get your point\nacross in five minutes, but I do want people's voice to be heard in this. So Lillian will\nbring the sign-up sheet around. Who's the first name and we'll go ahead and get started.\nWe're going to get started with David Garcia and hold on one second and I will get your\nMic up.\nYou get to do it.\nHold on just one minute and we'll get started.\nHere, take this one.\nTake that.\nAfter Mr. Garcia, we've got Dr. Jones.\nIf you want to be on deck, we'll get started with you as soon as his comments are concluded.\nFive minutes.\nAll right, so we're going to set a timer.\nYou'll hear it go off at five minutes and I'll give you a couple of seconds to wrap it\nup at that point.\nOkay.\nThank you.\nThank you, Chairwoman and Committee for having us here.\nI'm David Garcia.\nI work for an advocacy organization named Galileo Impact Fund and we advocate for the Hispanic\ncommunity throughout Georgia.\nI'm here today because the proposed Senate plan fails to adequately remedy the substantive\nand procedural failings of the last maps.\nOne district is particularly concerning, Senate District 6, and the prior Senate District\n6, voters of color, including Latinx voters, band together with some white voters to elect\nSenator Jason Estevez, a Latinx candidate.\nIn the proposed map, even though Senate District 6 was not implicated in any way by Judge\nas Jones's decision, the legislature cracked the district\nincreasing the white voting age population\nfrom approximately 56% to approximately 72%\nand ensuring that voters of color\ncan no longer elect candidates of choice.\nThe targeting of Senator Jason Estevez\nis emblematic of the legislature,\ntargeting legislators of color,\na continuation of what the legislature did\nto Michelle Owl and Lucy McBath\nduring the 2020 process.\nSenator Estevez was a public school teacher\nand was the first Latinx candidate elected\nto the school board in Georgia.\nHe was only sworn in as a state senator\nfor Senate District 6 in January 2023,\nless than a year ago,\nand the legislature has already drawn him out of his district.\nAdditionally, the legislature did not seek adequate input\nfrom the affected communities,\nand provided the draft senate maps\nonly 48 hours before the opportunity to comment.\nThis is a continuation of practices\nand lack of transparency that previously led the legislature\nto enact legally deficient maps.\nThe Senate and House committees are apparently\nalso holding hearings at the same time,\nfurther making it more difficult for Georgians to comment.\nThank you.\nThank you.\nDr. Jens.\nGood afternoon.\nMy name is Dr. Yashanda Jones.\nI'm a community advocate in the Gryffman-Spotten County area.\nAnd today, I stand before you to address the need\nfor a fair redistricting, particularly\nwhere I live in Senate District 16, which\nwas found to be a violation of the Voting Rights Act,\nbut remains unchanged.\nWe must confront the start reality\nthat black citizens, a vital and integral part of our community,\nhave often been marginalized in the political process.\nMaps must reflect the true voices of the people.\nFair redistricting is not a political issue.\nIt's a matter of justice and representation.\nThe lines on the map should not be manipulated\nto favor one party.\nRather, they should be drawn to ensure\nthat every citizen's vote carries equal weight.\nIn the pursuit of fair representation,\nwe must prioritize our communities over political calculations.\nThat begins with creating districts\nthat mirror the diverse makeup of the population in our state.\nBy doing so, we empower citizens to elect leaders\nto genuinely understand and advocate for their needs.\nIt is our collective responsibility as citizens\nto champion transparency in the redistricting process.\nWe are asking you to ensure that the lines drawn\non these maps are a reflection of the people's will\nnot the interest of a slight few.\nWe demand accountability and openness\nin this crucial aspect of our Democratic foundation.\nFair representation is not a luxury.\nIt is a fundamental right.\nSenate District 16 and others must be drawn with equity in mind\nensuring that black citizens have a meaningful voice\nin shaping the future of our communities.\nDenying any group fair representation\nundermines the principles we hold dear.\nPrinciples that advocate for justice and equal opportunity for all.\nBy drawing districts fairly, we bridge historical divides\nthat have silenced black voices for far too long.\nIt is an opportunity to rectify the imbalances of the past\nempowering black citizens to elect representatives\nwho truly understand and champion their unique needs\nconcerns and aspirations.\nTo make any decision otherwise, or to create any maps\nthat you not have the goal of the parameters above,\nwould surely deem this body to be morally bankrupt\nin the eyes of the citizens of Georgia.\nThank you.\nThank you.\nNext row, I'm going to marry you.\nI don't want to miss your name.\nIt's your honor to do it.\nYes, thank you, thank you for that.\nNo problem.\nAnd then next we have Niles Franick.\nFrancis, thank you, thank you.\nYou'll be up on deck next.\nOK, go ahead.\nGood afternoon, Chair Nichols and members of the committee.\nMy name is Rahul Garabado.\nI'm the senior voting rights staff attorney\nat the ACLU of Georgia, and one of the lead counsel\nin the case Alpha Phi Alpha versus Raffinsberger,\na case challenging state legislative districts\npassed by this body in 2021 and one of the cases that is subject to the federal court's\norder issued on October 26, 2023.\nBefore our case was filed in 2021, I along with my colleagues at the ACLU of Georgia testified\nat every town hall across the state and during the 2021 legislative session advocating for\nfair maps.\nI'm here today to raise concerns with this committee about the chair's maps produced on\nMonday, November 27th, 2023.\nWe put out a letter last night outlining these concerns that can be found at ACLUGeorgia.org.\nBut I want to talk to you all today about some of those concerns and urge this committee\nto take a look at a proposed set of remedial maps that we put out last night as well that\ncan also be found at ACLUGA.org.\nI want to talk about the issues that we have by framing what the order says, and there\nare two really important aspects of the order issued by the Federal Court on October 26th.\nThe first one that you mentioned, Chair Nichols, is the number of additional Black Majority\ndistricts that need to be in a redrawn plan.\nhave new Black Majority State House districts\nand two additional Black Majority State Senate districts.\nI think everyone understands that,\nand this plan technically complies with that piece\nof the puzzle.\nBut the second important aspect of the order\nis about where the court found violations to be happening\nin the state of Georgia.\nFor the State Senate maps, for example,\nthe court says that there is a 10 district area\nwhere the current maps violate the Voting Rights Act.\nThat's Senate District 10, 16, 17, 25, 28, 30,\n34, 35, 43, and 44, and those can be found\non page 514 of the order.\nAnd that's the piece of the order\nthat the current Senate proposal ignores.\nThe vast majority of black voters who\nare it newly placed in black majority districts\nare from outside the 10 district area\nthat the court identified in its order.\nFurthermore, there are specific districts\nwithin the 10 district area that the court found unlawful\nlike Senate District 16 that remained virtually unchanged\nand leave some of our clients\nstill in a district where they cannot\nselect candidates of choice.\nNow, I mentioned that our letter also includes a proposed\nremedial state senate and a state house plan.\nAnd we urge this committee to take a look at those plans\nbecause those plans adequately address both pieces\nof the order that we're really concerned with.\nThey make sure that the vote delusion area that the court\nidentified is adequately remedied and it makes sure to make as few changes as possible\nto other areas of the map that the courts order does not address.\nThose maps can be found at ACLUGA.org and those include the technical files associated\nwith it to the block equivalency files.\nWe urge this committee to take a look at this so that we're not back in court after this\nprocess and so that Georgians have fair maps.\nThank you very much.\nThank you. Niles, Francis.\nGood afternoon, my name is Niles Francis.\nI am a resident of Mableton, which is now in Senate District 28.\nI'm here to speak about the cinema that was unveiled on Monday.\nJudge Jones instructed this committee to draw to a redraw 10 Senate districts.\nSenator Eckles, you said that the map redraws 15. Most of those 15 districts were not redrawn in this map here.\nAnd two of those districts that were ordered to be redrawn, Senate districts 16 and 34 were not even touched as part of this new map.\nI would implore this committee to re-draw these maps in a way that complies with Judge\nJones's order because I know not a single member of this committee wants these maps back\nin court.\nSo I would implore to re-draw these maps in a way that complies with the Judge's order.\nAnd I would like to talk a little bit about Senate District 28, which I am now a resident\nof, as of this new map.\nSenator Eckles, you said that the two districts that were re-drawing to be majority black were\ndrawn in the vicinity of the, um, we're drawing the vicinity of the plaintiffs from\nmedia maps. Um, Senate District 28 was not. Senate District 28, um, on the\nthe media map that was drafted by the plaintiffs includes parts of Fletzen and\nFayette County's and I believe parts of Clayton County as well and, um,\nCal Reda County. Um, the region and Senate District 28 that we're looking at\ntoday includes parts of Cobb, Douglas and Fletzen Counties.\nSo I would just implore you out to reconsider these maps\nand reach revenue in a way that complies\nwith Judge Jones' order.\nThank you.\nThank you.\nOK, I think you want to what?\nI don't have the next sign up.\nShe really is collecting it.\nSo do you think she went to here?\nOK.\nI'm waiting on the sign-up sheet.\nSorry.\nAll right, next up we have Ken Lawler.\nHello again, members of the committee. I think I know most of you. I'm Ken Lawler. I coach\nyour fair district's Georgia. We are a nonpartisan all volunteer organization. I think we're\nkind of like the redistricting nerds in the room among many pro folks. I'm happy to be\nback here justifying today. With me today we have several of our volunteer crew who came\ndown to attend both the House and the Senate hearing. So thank you again for the opportunity\nspeak to you. Our principles for looking at the maps really focus on what's the objective\nof this session. The session in our view should be about two things. Number one is drawing\nthe new black majority districts as required by the court. That's number one. The second\nthing we're looking for is we don't want to see districts changed aside from those necessary\nto comply with the court order for partisan purposes. We don't want to see any partisan takebacks\ngiven that you had to draw a new district\nto allow black voters to have representation.\nSo we're scoring the maps based on those two criteria.\nDo the maps comply with the court order?\nAnd secondly, are there other changes being made\nthat appear to be for partisan purposes?\nNow, we have developed score cards on these maps.\nThose score cards are being delivered to your offices\nthis afternoon.\nI don't believe we have delivered those\nto the committee in here, but they're also on our website.\nBut you will have two score cards in your office\nthis afternoon, one for the map being considered today and one for the map that is being offered\npotentially tomorrow by the Democratic Caucus.\nYou'll have both of those score cards available.\nSo let me just brief you on how we're looking at this.\nSo we're looking at a, we're scoring the maps on a two-part pass-fail test.\nNumber one, does it add the Black Majority Districts and number two does it have any other\npartisan genius?\nSo, with respect to the Black Majority Districts, we do a simple analysis which it says count\nthe number of districts and other additional black and\ndirty districts.\nAs Mr. Gravity mentioned, that the map does pass that test.\nAs Mr. Gravity mentioned, there are other considerations\nin the judges order that are more technical in nature.\nOur group does not look at those, but the plaintiffs, for\nexample, in the case will be assessing those for your benefit.\nThe one comment I'll make about a black opportunity or\nblack influence district is that UMAP has an issue with Senate\nDistrict 33.\nSenate District 33 decreased black population\nfrom 43% to 35%.\nThe reason that's important is that research\nthat we have available shows that 37% is like a magic number\nwhen you have a community of voters of color\nthat exceed 37% in a given district.\nThat allows those voters to influence the vote.\nThey're not the majority, but that gives them the power\nto strongly influence the vote in that district.\nSo in this case, the map has an issue of concern in our view\nin that Senate District 33 has decreased\nin its black population from 43% to 35%.\nSo that's a potential weakness.\nHowever, given that the map does implement\nthe two black majority districts requested,\nwe give the map a pass on that part of the test.\nIt's okay.\nWhen we look at the partisan side, however, we see issues, okay?\nClearly, the two new districts that were added\nSenate District 17 and 33 are not new Democratic districts as one might expect\nto construct them from primarily black voters.\nHowever, we know that Senate District 1642 will basically uprooted and pushed elsewhere.\nYou say it's a result of a ripple effect.\nWe believe that ripple effect is an excess.\nAnd as a result, you have flipped back two districts back to the Republican column\nafter making those changes.\nWe think that's inappropriate.\nAgain, this exercise should not be about\nmaintaining any powers and bounds from near the other.\nThe exercise should be implement the black majority\ndistricts as requested and leave the rest of the map alone.\nAnd so our objection to the map, and the reason\nmakes sure that the map fails, the parsing test,\nis that you have basically repurposed six and 42\ninto Republican districts.\nAnd we view that as a person take back\nto try to even the score, which we think\nis completely inappropriate at this point in time.\nSo we say that the map fails the test on the person basis,\nbut it passes the test from a Black majority perspective.\nAgain, our analysis on the Black majority\nis very simple.\nI mean, analysis does not take into account\nthe nuances that Mr. Gravity just mentioned\naround how the district were constructed.\nThe other thing we mentioned is that this map changes\na lot of population and moves around 14%\npopulation around we believe that's excessive and in fact of that 14% of the\npopulation about a quarter of it is being moved strictly due to the\nupgrading of districts 6 and 42 so again that to us indicates excessive\nchange and for partisan purposes which we believe should not happen we know\nit's legal to do it we just think it's wrong and that's what that's what our\nadvocacy says here we will be prepared tomorrow to discuss the the if the\nDemocratic map is often we will also be prepared to discuss our issues with that.\nThank you.\nThank you very much.\nAny questions?\nI'm happy to take a good question.\nOkay.\nWe're not asking.\nOkay.\nI think it's Carolyn Hargrave.\nI apologize if I'm you don't you don't want to okay Julie Bowlin.\nAnd then after Julie Bowlin is Jordan Madden.\nHey there, thank you.\nGood afternoon, Madam Chairwoman and Committee members.\nI'm Julie Bowlin, the redistricting chair\nfor the League of Women Voters of Georgia.\nThe league has been at the forefront\nof the fight for democracy for over a hundred years.\nWe continue to ask that changes to the maps\nlimited to those required to address the remedy ordered by the court.\nThe committee should reject any and all attempts by members of either party to incorporate\nother changes for partisan political purposes.\nThe maps offered by the Senate have failed both of these basic fair monitors as outlined\nby the Fair District Georgia's report.\nSecondly, we request that the committee chairs in both the House and Senate ensure that there's language access by translating public-facing materials\nsuch as the comment portal into a minimum set of languages required to reach diverse Georgian citizens.\nGeorgians deserve a redistricting process that inspires trust and confidence from all Georgians. Thank you.\nThank you.\nNext is Jordan Madden, and after Jordan will be Brian Ramirez.\nGood afternoon.\nI am Jordan Madden, a student member with the Georgia Justice Coalition.\nThank you guys for being here.\nAs a black voter in the state, I recognize the importance of voting.\nHowever, I'm really relying on our elected officials to create district maps, and that\ncount my community fairly. Young Georgians deserve district maps that\naccurately represent our communities and redistricting processes that inspire\ntrust and confidence as we begin to engage in the democratic process. So we're\nhere to tell our elected officials all of you guys in this room that representation\ndoesn't matter and democracy means we as the voters get to choose our legislators\nnot the other way around. More fair and accurate maps help us to reinvigorate\nmore young black and brown voters to get engaged and motivate them as they let their\nvoices be heard.\nTo you all here in this room, it is your job to prioritize fair and accurate maps so\nthat we can get this job done.\nThe future generation of black and brown voters in Georgia are counting on it.\nWe know that this fight is not over, unfortunately, but this is the beginning to a long battle\nto ensure maps are equitable.\nAnd we'll be right here fighting for those maps a long way.\nThank you.\nis Brian here. After Brian is Zena Mohamed and if you want to come on up and\nwait against the wall that way we can quickly get through it'll take less time\nbetween thank you. Good afternoon committee my name is Brian I'm a student at\nGeorgia State University and a member of the Georgia Youth Justice Coalition.\nGeorgia State University consistently ranks first in degrees of\nawarded to African Americans and over the last few years,\npoliticians have sent a message that black, brown,\nand young people aren't worth the exact representation\npromise to all.\nYoung Georgians deserve district maps\nthat accurately represent our communities\nin a redistricting process that inspires trust\nand confidence as we engage in the democratic process.\nRight now, I'm a Fairburn resident,\ndistrict 38 on the proposed senate maps,\nand might soon become an area that disproportionately\nrepresents very different communities all the way\nfrom Palmetto to Buckhead, both of which\ncompletely different communities.\nThis just doesn't make any sense.\nWe need fair districts that can make sure\nthat every person feels represented by their elected officials\nand that their priorities will get heard\ninstead of district representatives\nthat intently only focus on one demographic over the other.\nFair maps can do this.\nThank you.\nThank you.\nOn deck is Anna Dennis.\nIf you want to come up again to the wall, that's perfect.\nThank you.\nHello, my name is Zina, I'm a student at the University\nof Georgia, and I'm also a member of the Georgia Justice\nCoalition.\nI just wanted to give a quick personal statement.\nI voted for first time in 2020,\nand I remember feeling so empowered\nto do something that black activists\nhave fought for through generations.\nHowever, today I feel very discouraged\nabout the actual power of my vote.\nOver the last few years, I've seen unfair maps dilute\nthe strength of Black youth voters, like myself,\neven after a federal judge ruled that Georgia's districts\nwere gerrymandered so aggressively\nthat he would not allow another election\nwithout redistricting.\nI'm still seeing that we're continuing\nto make this process as difficult and inaccessible\nas possible.\nI think that this is a chance for Congress\nto redeem themselves, but unfortunately,\nwe have yet to see that most student or young person\nliving in Georgia should feel discouraged from voting.\nAnd if that's the case, and our democracy is jeopardized,\nto confront the challenges Jordan's face,\nwe must have a government where all voices\nare heard equally, where the public interests,\nnot special interests, guides decision-making,\nand where we can put faith in our leaders.\nBut I do have a strong sense of Georgia pride,\nand I am confident that our representatives\nwill do the right thing for states, thank you.\nThank you.\nNext, we have Anna, and then on deck is Vivian Moore,\nI apologize if I've mispronounced her name.\nNo worries, Gaffer Nguyen-Yah, Gaffer Nguyen Chair and Committee.\nI'm Anna Dennis.\nI'm the Executive Director of Common Cause, Georgia.\nWe are a pro-democracy organization that\nhas been challenging, redistricting across the country,\nand particularly in the state for many decades.\nBut there are some things that we are definitely concerned about.\nWe are a part of see for coalitions and also see\nthrough coalitions of the Georgia redistricting alliance.\nWe are concerned about the creation\nof the two additional majority black districts\nof Senate District 17 and Senate District 28.\nIt does not comply with the judges' order.\nWe would like for this committee\nto actually follow the judges' order\nand comply with the maps that need to be drawn.\nWith these maps, it reduces the number\nof black influence districts from two to one\nand Senate District 42 was, sorry, 51% white\nAnd now it's 59% white.\nAnd what's moved to the outskirts\nof the Metro Atlanta area to basically rural Georgia.\nCD6 had the similar fate.\nThis proposal does not do what it needs to do\nand it does not create more representation for black voters.\nI am a person who is a native of Georgia.\nI am a native of the South Metro area,\nborn and raised.\nHappy to say I am from Clayton County.\nSo this is definitely a concern for me\nand definitely a concern of my family, my community members,\nand all the folks who are definitely in this room\nwho are speaking up to say that they want\nfair redistricting practices,\nand they would like their voices to be heard.\nAnd so we would like for you all to do that\nby honoring what the judge has said to do in the order\nby following the rules and not creating different processes.\nThank you.\nThank you.\nNext we have Vivian Moore, and on deck is Mindy Sieger.\nThank you, I'm Vivian Moore, I'm with the Georgia NAACP and I'm here today just to let\nyou know our concerns and our recommendations.\nOne of the things that we're concerned about is not having enough time for public access\nso that we can have our voices heard.\nAnother thing is that we want to make sure that the maps are drawn fairly.\nthe maps have just divided us as black folks we are divided now and what\nwill happen is we'd have less people going to the polls to vote precincts have\nbeen moved things that we think that will hurt the black community is what we\nwant to make sure that we have a voice that we can actually let you all know\nthat we need to be a part of that when you start drawing your rejoin the\ndistricts so a part of what we wanted to do is to make sure that we have fair\nvery fair maps. Number one, when you talk about fair, it's a fact that over the\nyears it's been discriminated. So when we talk about fairness, we need to talk\nabout all fairness. So when we talk about all people and the people that really\nreally need to get to these polls and precincts, when you redraw the maps,\nconsider all of that. Don't just consider that we'd risk redrawing the map to\nmake sure that it's what we think the court won't. Let's have a voice about\nhearing the people and knowing what we need. I've been around in Georgia now\nalmost 40 years and I can tell you from my time that I've been here they used\nto be something they call red lining. I call it no lining because we didn't\nget what we needed when you start drawing the line. You not only took away\nbusinesses, you took away precincts. Now we had drop boxes. Drop boxes went from\n30 to 5. Things and those things are real concern and we want to make sure\nthat we have the timeline to give you our input.\nSo again, I'm Vivian Moore,\nI'm with the Georgia NAACP,\nand we represent 130 of us in terms of county.\nSo thank you so very much.\nThank you.\nNext, we have Mindy Seeger and on deck is Hannah Joy.\nGood afternoon, Chairwoman Committee.\nMy name is Mindy Seeger.\nI'm a resident of Cobb County.\nI also am the advocacy director for which it stands,\nwhich is a nonpartisan organization\nthat employs people to have local control\nand live local voices.\nWe are here because this body passed maps\nthat were graded in F in the case of the Senate maps\nand found to be in violation by the court of Section 2\nof the VRA.\nI attended a couple of days of testimony as I was able,\nand the overwhelming impression I got in court\nwas that the maps overall do not represent\nThe population growth changes in Georgia, of which all growth is due to any part black\npopulations and any decreases were attributed to non-Hispanic white populations that was\noverwhelming every day in court.\nWe the people understand and ask for fair maps that reflect the trapestry of Georgia, competitive\nor possible, and are compliant with the court in the VRA.\nLet's talk a little bit about what that means.\nmeans that this body, as a whole, should represent and reflect\nbe a mirror of its constituency.\nThe only way that's possible is if voters have an opportunity\nto vote for their elected candidates of choice,\nit has to be a reflection of the constituency.\nCompetitive, we talk about this a lot.\nIt breeds excellence.\nIt allows voters to feel like they have a real chance\nof electing their candidates of choice.\nOtherwise, why would they show up at all?\nIt helps confront partisan extremes\nthat plague our political process\non both ends of the political spectrum.\nThe court vary compliance.\nWe have to get this done because we don't want\nto be back in court, you don't want to be back in court.\nVoters want to know where their districts are,\nwho they will be voting for,\nso they can start evaluating candidates.\nCandidates can know where they're qualifying\nand we can get on with the business of the election\nthat is coming upon us in 2024.\nBut I wanna talk about something we haven't talked about yet.\nIt is absolute fiscal irresponsibility\nto enact the maps that you enacted\nthat you were warned with flawed,\ncost us tens of thousands of dollars a day,\nand legal defense, continuing legal defense,\nand the session we're engaged in right now.\nWe want you to do right by the voters\nand get it right this time so we can stay out of court\nand we can have maps that we can rely on.\nMany of the groups and advocates in this very room and across this state will take up\nthe mantle and responsibility of educating voters of these changes because that's what\nwe do.\nThis state has a robust surplus and I request that this body consider funding these impacted\ncounties board of elections to launch appropriate PSA campaigns to notify these voters of district\nchanges so they know where they are voting and who they are voting for.\nThat would be a good case of taxpayer funds, many in Georgia will support, but this continued\nwaste of dollars to keep us in court and to continue to have us in a special session\nand keep rehashing the same things over and over again is a waste of time and a waste\nof money that could easily be avoided.\nSo I am asking you on behalf of voters across Georgia to get it right this time.\nThank you.\nThank you.\nAre you Hannah?\nYes.\nHannah, I have Ann Duncan.\nGood afternoon chair and all committee members.\nMy name is Hannah Geber-Salassi, and I'm the executive director\nof Protective Vote GA, which is a nonpartisan organization\nthat works to mobilize voters and protect voting rights\nhere in Georgia.\nWe focus on the Metro Atlanta area,\nand I was also raised in Atlanta and the Metro area,\ngrowing up in both the cab and Gwinnett counties.\nAnd over the years, I've seen how much more diverse\nthese communities have become.\nAnd right now, we have an opportunity\nto meet these communities where they are,\nbecause they're no longer what they were 30 years ago.\nI'm here today standing in solidarity with Black voters matter\nand many other of our colleagues from across the state\nto further raise concerns that have been shared regarding the maps.\nIt has been made clear by a federal judge\nwho ruled that the current maps legally\ndilute the power of Black voters, such as myself.\nAnd that is unacceptable.\nI along with many others today am concerned about the proposed maps\nand that they will not increase representation\nof black voters here in Georgia\nas requested by the federal judge.\nWe urge you to draw the maps that represent equity\nand fair representation of the diverse voices\nin our Georgia community.\nBy doing so, we can ensure that maintaining public trust\nand accountability is a priority.\nI encourage you ought to lean on the expertise\nof experts who have spoken here today,\nsuch as Georgia Redistricting Alliance,\nFair Districts Georgia, ACLU of Georgia, Galeo,\nCommon cause, Georgia Youth Justice Coalition, League of Women Voters, and so many others that\nare here represented.\nWe also echo the concerns of removing barriers to language access on the website as someone\nwho grew up in a first-generation household with parents whose first language was not English.\nIt's really important to make sure we are incorporating multi-lingual features on the\nwebsite to support people who do want to submit testimony or public comment.\nThank you for your time.\nThank you.\nAnn Duncan and Isabel Philip is on deck please.\nGood afternoon Madam Chairman and members of the committee.\nMy name is Ann Duncan I'm just an ordinary voter from North Fulton County that believes\nin democracy and distracting is the foundation of democracy so that all of our voices\ncan be heard equally. And I am here today because I am really concerned about\nequity for black and brown folks in our community. And I just want to know that\nI can count on you on this committee to make sure that the maps that you\nrecommend are in compliance with what the judge has ordered you to do. We need\nto focus the changes on the areas that the judge identified where black\nvoices need more representation. Thank you so very much. Thank you. Is Isabel?\nAfter her, we'll have Senator James.\nHi, everyone.\nMy name is Isabelle Philip.\nI'm a UGA student and a resident of Athens, Georgia.\nOur city is full of young folks for whom the upcoming elections will be some of the\nfirst they've taken part in.\nOur city is also cracked to the point that many of us question whether votes have any\npower at all.\nAs the agency noted in 2021, Athens is sliced into political pieces and as we move based\non the current maps, which specifically sought to diminish the power of black voters, that\nisn't unique to Athens.\nThe legacy of racial, gender, and Georgia is something that we need to confront together.\nI hope to see the proposed maps redrawn fairly now and I hope to see cities like Athens\ndrawn fairly in the future, because Georgians, especially young black Georgians, most affected,\ndeserve district maps that accurately represent our communities, and to be district in process\nthat inspires trust and confidence as we first begin to engage in the democratic process.\nI love UGA, I love Athens, and I love Georgia, and I want to be here for a long time.\nSo I really hope to see my elected officials fight for myself, my classmates, and a fair\nand just future for our state.\nThank you very much.\nThank you.\nAfter Senator James, I think Stephanie,\nAli, you'll be up after and you'll be the last.\nThank you.\nThank you.\nMadam Chair, Senators, I've done Zola James.\nof former right now in the 35th district,\nbut soon to be if this passes in the 28th district.\nNew district.\nWell, Judge Jones ordered that the Senate\nredraw the maps to remedy discrimination\nagainst black voters in 10 specific districts.\nAnd the courts specifically found that black voters\nin these, those 10 districts,\ndid not have an equal opportunity\nto elect candidates of their choice.\nInstead of focusing on those 10 districts,\nthe Republican proposal makes the vast majority\nof its changes in districts not identified\nby the court order as not having enough minorities.\nSo instead of focusing on those districts,\nthe vast majority of its changes are in districts\nthat's not identified by the court order.\nAnd then the districts identify by the court,\nthe Republican proposal changes district numbers\nInstead, including mine, for no apparent reason, it appears to be a smoke and mirrors and\npartisan gamemanship.\nAnd I ask that this map be rejected and a map be adopted that complies with the Voting\nRights Act.\nThis act does not do that.\nAnd maybe you can add a few specifics, I want to add some specifics about my district.\nFirst of all, I got elected in 93 to feel the unexpired term of Arthur Langford.\nAnd I still live in that same house that we had just built that year, my late husband\nand I.\nI wanted to do things to help my community.\nSo I was the end up being the second African-American female\nin history to come into the state senate\nin the 35th district.\nAnd I was proud and honored to serve all those years.\nAnd in 2002, I left the senate to allow other people\nto run.\nBut in 2009, my community asked me to run again\nbecause they never stopped calling on me.\nThey needed a person that would listen to them\nand could strengthen the community of interests.\nAnd that's what I have attempted to do all these years.\nSo in 2009, I ran again when the seat was vacated again\nthis time by Cassine Reed in the middle of the term.\nI won overwhelmingly, and I've continued to do that because I trust the people that\npeople trust me, and I work with them, I go throughout my community, I go to all of\nthe events, and we work together, just like many of the other senators who are being\naffected right now.\nThis morning, one of my colleagues got up for a personal point of privilege, and that's\nthe senator from the 44th who is also going to be changed out of her district to the 17th\nwhich is supposed to be the other new district that people are saying is supposed to satisfy\nthe judges orders.\nI disagree that it does that because I had a 79% black district yes and I knew it was\ngoing to change because it was too packed. So I didn't mind that, but to be taken completely\nout of the district and just my house, even some of the people who live on my street or\nthe next street are not in the new 28th. So I don't even recognize the old 35th district\nfrom this map, and I cannot even understand why Senator, I know we're supposed to call\nnumbers, but I'm at 38th, how she could have Cobb County in the part that I have now,\nif this new map passes, how her scenic could come all the way around and get my district,\nAnd then I go all the way around the other way and get her district.\nIt's musical chairs.\nWhat is it?\nI don't understand.\nSo please, please take a look at rejecting this map or looking at the mere fact that it\ndoes not satisfy the court orders.\nThank you.\nAnd I appreciate it.\nAnd I had a picture of the Vomit Rights Act being signed and I wanted to bring it up\nhere.\nto be and I was going to show you why I ran for office in the first place. I\nwouldn't have even been able to be the second African-American in history to be\nin the Senate. Had it not been for that voting rights act and that's what we're\ntrying to comply with now. So I thank you for allowing me to speak and I hope\nthat you will look at this map. Thank you. Thank you. All right Stephanie\nWell, thank you so much. If I had known I would have definitely wanted to go before the\nGood Senator because that's a hard exit follow, but my name is Stephanie Ali. I am the policy\ndirector at New Georgia Project Action Fund and while everyone's shared their Atlanta\nBonafidious, I will say that don't hold it against me, but I'm originally from Alabama,\nwhich means, which means my people have been through this just recently. My folks are\nfrom the new congressional district in South Alabama that took multiple cycles to make happen.\nfolks are in the new majority black district in South Alabama. And that is\nbecause Alabama's, Alabama's, sorry legislative system were refused to follow\njudges orders. And I told my mama over Thanksgiving I was like luckily we got\nbetter leadership in Georgia. And now I'm sitting here thinking I'm gonna have to\ncall my mama back. Because this is not better than Alabama. It's more subtle. I'll\nI'll say that, it's more subtle.\nBut changing number 28 up here to Senator James,\nwhere Senator James currently sits over to Matt Brass\ndoes not make a new black majority district.\nIt just changes the number of one that already was.\nTaking district 17 from one place to another\ndoes not create a new black district.\nIt just changes the number of one that was.\nNothing is new here for black voters.\nThey're just in new numbers, they've got to learn.\nAnd a lot of new people are gonna have to learn a new rep,\na new senator, a new number, a new polling place.\nSo it's a lot of extra work for folks like us\nwho do voter education, for folks like Ms. Vivian\nwho do voter education, but it ain't gonna help build\nblack power, which is what the judge ordered.\nBut frankly, I know that just because I,\nlike I said, my folks just been through this.\nThe idea isn't complying with the judges order.\nidea is running down the clock because we are coming up on the 2024 elections and voter\nconfusion only helps to break turnout and we don't deserve that. We deserve a better\nclass of leadership because I believe in Georgia. Like I said, I held it up to my family\nand said, now we're going to do better. I can't wait for these maps. We're going to do better.\nThis is not a new black district. It's just under a new name. This is not a majority black\ndistrict that was created. This is a rebrand. This is a flipping of numbers. We\nshould be doing just as the folks who have come here saying, we should be\nlooking at Spalding at Fayette, at the rest of McDonough, where these places\nreally are, where black communities live and are underrepresented as they are.\nso I thank you again for your time and I thank you again for your service. I know\nwe all want to get out of here but there's no reason to do this right now and\ncome back to the court and come back and draw it again because I really do\nthink we're better. Thank you. Thank you and that concludes the public comment\nportion of our hearing today. We will be meeting tomorrow morning at 9am in this\nsame room. Tomorrow we'll be hearing the minority leaders plan and we'll be\ntaking action and so I invite you to come back then. Do I need a motion to\nSo moved second, all right, we all in favor of adjourning.\nThank you all for coming.\n",
  "updated_at": "2026-02-12T20:16:04.861081+00:00"
}