{
  "video_id": "Z31drXMGR30",
  "url": "https://youtu.be/Z31drXMGR30?t=789",
  "title": "Georgia House - Day 8 (2026-01-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": "2026-01-26",
  "duration_minutes": 61,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview**\nThe session was focused on the opening prayer and remarks by Chaplain Leland Jones. No substantive legislative actions were detected in the transcript.\n\n**Key Actions**\nNo bills were passed, referred, or introduced.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Chaplain Leland Jones gave the opening prayer and remarks, focusing on the importance of perseverance and encouraging oneself during difficult times.\n- Chaplain Jones spoke about aligning with \"strange partners\" when common ground can be found, and the need for legislators to make a difference for their constituents and the state of Georgia.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe transcript indicates a quorum was present, with all members voting to signify their presence.\n\n**Adjournment**\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nOkay, here we go.\nToo bad.\nGood morning, well all members please take your seats.\nhave a great day with some wonderful guests on the floor and in the balcony so\nif members will take your seats the hour for convening having arrived all\nmembers please take your seats clerk mr. clerk will you please ring the bell\nWe're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber.\nPresident Scofield, will you please vote,\nRepresentative Davis's?\nPlease.\nThank you.\nMr. Client, will you unlock the machines, please?\nI have all members voted, have all members voted, if so, the clerk will lock the\nmachines. We have a good crowd today. Thank y'all for being here.\nDoorkeepers, please close the doors and keep them closed. As our\ncustomers, we will begin our day with Scripture reading and prayer by\nthe chaplain, after which we will pledge allegiance to the flag of\nour country. Our chaplain this morning will be introduced by the\nThe lady from the 87th House District representing Viola Davis, representing Davis and a veteran\nof the armed forces of these United States.\nCome please do the job today.\nThank you Mr. Speaker.\nI take great honor in introducing the chaplain of the day as a veteran to have a chaplain\nsuch as this great man, I'll tell you to read his bio,\nI had to take a second, you know how they tell you\nto be brief.\nBut sometimes what people do in life outweigh\nwhat their bio says.\nTo work in recruitment and retention\nand work with recruiters and their families,\nespecially doing COVID, imagine that.\nChaplain, Leland Jones is our chaplain of the day.\nHe is the one that has worked with veterans such as myself and work with recruiters.\nSince 2003, he is the senior pastor of Greater New Life Missionary Baptist Church in Atlanta, Georgia.\nHe is a chaplain that works often in community service.\nservice. He's also did entertainment. I am here to say to you that he currently serves\non the National Advisory Board of the NIH, that's the National Institutes of Health. He's\nalso on the Community Advisory Board of the Morehouse College School of Medicine. Now,\nI ask you to welcome me.\nWell, help me welcome Chaplin, Leland Jones.\nThe morning, sir, pleasure's mind, sir.\nThank you for the introduction.\nThank you for allowing me to feel welcome in this space.\nAnd now for a moment that matters more importantly\nthan anything else.\nWho I am is very minor, but what I have to say, we pray, makes a major difference.\nIf there is a scripture that reads to this particular moment, it simply would be 1 Samuel,\nchapter number 30, verse 6, where it says, and David was greatly distressed for the people\nspeak of stoning him because the soul of all the people was grieved, every man for his sons\nand for his daughters.\nBut David encouraged himself in the Lord his God.\nMaster, give me guidance.\nSo if there were words for consideration,\nit would simply be encourage yourself.\nLooking at this particular story,\nwe find where David is now being hunted by Saul.\nSaul has gotten to the point where his spirit has changed.\nAnd David, who was a Psalmist, for Saul is now turned.\nDavid was raised with Saul's son Jonathan.\nThey're like brothers, you know.\nBut when someone's heart turns against you,\nsometimes you've simply got to go.\nHere we find where Saul and his troops\nare not only dealing with trying to hunt down David,\nbut they are also battling of the forces.\nDavid knowing this.\nHas now had the reality of his life knowing\nthat I'm the one who beheaded Goliath and the Philistines\nrespect him, but guess what?\nIn this particular text, David to protect himself\nhas aligned himself with the Philistines.\nMan by the name of Akish is the king,\nand they join with other Philistines\nto get ready to go to battle against the Israelites.\nThe other Philistines said, he might work with you,\nbut he's not going to work with us.\nAnd so David and those few warriors that were with him\nhad to go back home and when they went back home\nthey found that where they lived was the land of Ziglaq.\nThe problem was in the south that the Amalakites had come\nand had burned their camp, burned their small city,\ntook their children and their wives.\nAt that moment when they returned they were crestfallen,\nthey were hurting and here we find\nwhere David has men who he served with\nwho are ready to stone him\nbecause they've lost everything.\nMy friends, there would be moments in your place\nwhere you might have to stand alone.\nAnd David in our text did one thing.\nHe encouraged himself in the Lord.\nThat being said, let's look at just three points\nand then yes, I am through.\nThe first thing is, in difficult times,\nyou might have to align yourself with strange partners\nthat when the common ground has been found,\ninvest in working together.\nOh my goodness, I hope you can see the power\nand the wealth that comes when you get on common ground.\nBut ultimately, David worked with those\nwho actually feared him with the Philistines.\nOh, please align yourself, but whatever you do,\ndo not abandon your purpose.\nSo my first point is partnership.\nPartnership does matter.\nThe second thing that matters is also perseverance,\nbecause even when we find ourselves in difficult situations,\ndon't allow temporary challenges\nto become permanent impediments.\nYes, distress will come.\nYes, the storms will blow.\nYes, frustrations will occur.\nBut whatever you do, do not give up.\nBecause we as a state need you to stay focused on your path.\nYou've been elected for that particular understanding,\nperseverance.\nThe last thing is, also with perseverance to dovetail is press on.\nGuess what?\nWe need each of you to lead.\nWe need each of you to not only reach the point to where you're serving your constituents,\nbut we need you to make a difference for those of us who serve in different capacities.\nWe all have our challenges.\nAnd so I simply say, every once in a while, like David,\nyou're going to feel like no one cares.\ngoing to feel like no one understands, but you're going to have to encourage yourself.\nThe suicide rates show us that people are sometimes disaffected by life.\nAnd that's a reality we have to face.\nI'm saying encourage yourself.\nSometimes when people get an argument over little things, it might be just little.\nYou don't have to get to the point to where you go to blows.\nWhy do we bring out guns whenever someone steps on my blue suede shoes?\nEncourage yourself.\nI want you to know, my friends, very simply this.\nour state needs you. Encourage yourself. Our cities need you. Encourage yourself. Every citizen\nof Georgia is depending upon you here today and throughout the session to make job producing,\nfood providing, relationships, strengthening, and forward-thinking choices. And even the rest\nof the globe is saying, what is Georgia going to do today? Your constituents are seeking your\nsupport. Your counterparts are seeking your collaboration. And even if I tell you nothing else,\nEncourage yourself, but you don't have much time.\nBenjamin Elijah Mays made it clear.\nI have only just a minute, only 60 seconds in it.\nForced upon me, can't refuse it, didn't sick he didn't choose it,\nbut it's up to me to use it.\nI must suffer if I lose it, give account if I abuse it.\nJust a tiny little minute, but it turn it tears in it.\nI am a soldier.\nI need to you to encourage yourself.\nI need you to work the difference.\nI need you to walk the aisles.\nI need you to kiss the babies.\nI need you to make the difference, encourage yourself, and lead us in the right direction.\nAnd while you are standing, let us pray.\nWe ask God that you simply take these kind moments and these opportunities to be able\nto share, to be able to say to these who have an authorized power of office, to look around\nand to know that we are counting upon them, we support the decisions they make.\nAnd for many of us in uniform, the fact needs to constantly be with us every time we put\non the uniform that we might have to shed the blood because of decisions made in this place.\nWe are looking to them to make the right choices and at the same time, I'm asking that you\nprotect them, but also, oh God, bless and protect our military, our families, those of us\nwho are here, sworn to support and to defend.\nWe leave ourselves with you, oh God, let it be for the better, amen.\npledge of allegiance.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands.\nOne nation under God, indivisible, with liberty and justice for all, also.\nOkay, y'all, the paperwork is ready in any room.\nIf you haven't been a member of the military, you can join now.\nIf you've been a member, you can re-up now, that's what I'm going to do.\nDoorkypers, please unlock the doors.\nMembers may greet the chaplain of the day in the south any room for photos and degree\ndetail. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information\nand Audits. Mr. Speaker, your committee on Information\nand Audits has read the journal for the previous legislative day and found it to be correct.\nAnd on another thought, Mr. Speaker, before we take down a fence, we should find out why\nit was built first. Great words of wisdom there, Mr. Chairman, I can\nunderstand that. Chairman Tarvan, the chair of the Committee on Information and\nAudits, reports that the journal of the previous legislative day has been\nread and found to be correct. Is there any objection to dispense with the\nreading of the journal? Chair, here's none. The reading of the journal is\ndismissed with. Is there any objection to the confirmation of the journal? Chair\nhere's none and the journal is confirmed. The clerk will read the resolution\nestablishing the order of business for the day. Mr. Clerk.\nRepresentative Session, a hundred first fourth moves following the establishes the\norder of business in the first part of the period unanimous concerns. Introduction\nof bills and resolutions. First reading and reference of house bills and\nresolutions, second reading of bills and resolutions, reports of standing committees, third reading\nand passage of uncontested local bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day. Chair, here's none and the resolution is adopted. First\nreading of bills and resolutions, the clerk will read. House Bill 76, my\nrepresentative, Apollo 33, Oliver, the 82nd, air heart of the 36, been out of the\n94th Hawkers, the 27th and others, will be titled act to amend Article 1 of\nChapter 10A of Title 43, the fish go to Georgia, Anitator, relating the\nlicensing provisions regarding professional counsels and social workers.\nRegulated industries. House bill 77 by Robson of Green in 154. Chokus 151. Samson 153rd year to 152nd.\nBill B. Todd on active men code section 15 6 2. The official quoted Georgia annotated relating the number of judges of superior courts.\nJudiciary House bill 78 by Robson of Alexander the 66 pays more to 69. Gladning the 130th. On all woods with 40 seconds Jackson the 165th and others.\nBill B. Todd on act to amend title 34 of the fiscal to Georgia annotated relating to labor and industrial relations\nIndustry and labor house bill 79 by reps and a parts on 7th, Beverly, 143rd Evans the 57th Clark with a hundred and a threes and the 140th and others\nBill B. Todd on act to men a chapter 7 of title 40 80 fiscal to Georgia annotated relating income taxes\nWays and Mains House Bill 80 by reps of 11 to the 123rd\nand all over the 82nd will be titled an act of men article\non a chapter 14 to title 24 of the fiscal to Georgia annotated\nrelaying the general business regarding proof generally.\nJudiciary House Resolution 43 by reps of Iowa\nthe 50th limit the 98th Holcomb of the 81st barons\nthe 86th Clarke of the 100th and others resolution\nand creating the cost and effects of smoking joint study committee.\nHelp.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse Bill 57 by Representative Anderson of the 10th, the Bill to authorize the governing\nauthority of the town of Talula Falls to Levy and X-Eyes Tax, House Bill 58 by Representative\nAnderson of the 10th, the Bill to authorize the governing authority of the city of Sky Valley\n1208 to Elevian excise tax House Bill 59 by Representative Anderson of 10 bells,\nauthorized the governing authority of Raven County to Levy and excise tax House Bill 60 by Representative\nAnderson of 10.\nThe built de enforcement, the governing authority of the City of Clayton to levy and excise tax House Bill 61 by\nrepresentatives of Andersen the bill to authorize the governing authority of the City of Dellaert\nshaking requires 19 L kinds to lower tough slider,\n105th, clerk of the 108th and others,\nit will be relating to public assistance.\nHouse bill 63, by Representative Williams\nwith the 148th, Taylor with the 173rd,\nLumps of the 12th, Newton of the 127th,\nTarvan of the 2nd, and others.\nThe bill relating to furnishing claims,\nexperience up to policy holders.\nHouse bill 64, by Representative Thomas of the 65th.\nA bill relating to identification regulation\nof motor vehicles.\nHouse bill 65, by Representative Thomas of the 65th,\nit will amend the building resourceful individuals\nto develop George's Economy Act.\nHouse bill 66, by Representative Thomas of the 65th,\nThe bill relating to the Department of Public Health, House Bill 67, by Representative Thomas of the 65th.\nThe bill relating to insurance, House Bill 68, by Representative Thomas of the 65th.\nThe bill relating to income taxes, House Bill 69, by Representative Thomas of the 65th and\nthe Limit of the 98th.\nThe bill relating to general provisions for public assistance, House Bill 70, by Representative Thomas of the 65th and\nLouis Ward of the 115th, the bill to amend the Surprise Bill and Consumer Protection Act.\n271, by reps of Taylor, 173, Stevens of the 164th,\nPetrie of the 166th, Green of the 154th,\nHitchens of the 160th, farce another,\nto be held relating to surface mining.\nHouse, bill 72, by reps of Bayes,\nmore of the 69th, bridge of the 61st,\nglaze of the 67th, and the Gis of the 68th,\nwill of the 55th and others,\nto be held relating to home rule powers,\nHouse, bill 73, by reps of Gallup of the 19th,\nfarceなら of the 44th, Tom,\nso the 65th, Anderson of the 10th,\nMeeks of the 170th and others,\nto be held relating to electrical service,\nHouse bill 74, by reps of,\nBarnes of the 86th, Beverly of the 143rd Davis of the 87th Clark of the 108th Park of the\n107th and others, a bill relating to medical assistance.\nHouse post 75 by reps of property of the 52nd canon of the 58th, Beverly of the 143rd\nKendrick of the 95th Scoffield of the 63rd and others, a bill relating to persons and\ntheir rights.\nHouse resolution 42 by reps of the 14th Powell of the 33rd Tarvern of the 2nd, Jasper's\nof the 11th.\nResolution proposing a amendment to the Constitution says to provide that the qualifications duty and salary the school superintendent shall be established by the board of education as provided by general law and to authorize the general assembly to provide by law that local school superintendent shall be elected by voters as an alternative to being appointed by the local school boards of education if approved by local referendum, three second readers.\nReports of standing committees the clerk will read.\nRepresentative Beth Campbell, 135th District Chairman of the Committee on Integral Coordination\nLocal submitted the following report, Mr. Speaker, your Committee on Integral Coordination\nLocal.\nIs that any consideration following bills to the House?\nIs the structure meeting to report the same back to the House and the following recommendations?\nHouse Bill 11, Deutepass House Bill 12, Deutepass House Bill 28, Deutepass House Bill 29,\nDeutepass House Bill 49, Deutepass House Bill 50, Deutepass, respectively submitted,\nI'm sorry, I'm sort of Beth Camp, 135th District Chairman.\nThat completes the reading, the report to standing committees.\nThank you Mr. Clerk.\nHouse will come to order.\nMembers please take your seats.\nHouse will come to order.\nWe do have a local calendar today that you will need to vote on,\nI asked you, I'm with y'all, I'm not going home this weekend, I got nothing to do.\nHouse will come to order, we have some important issues to local communities to take up.\nThird reading and passage of uncontested local bills.\nIf there is no objection, we will vote on the local calendar as a whole with a recorded\nvote.\nHearing none, it is so ordered.\nThe clerk will read the local calendar.\nHouse Bill 11 by reps of Campbell, the 171st Mitchell County House Bill 12 by reps of\nWe've levered to 123rd City of Coomer,\nhospital 28 by reps of Anderson to the 10th,\ntown of Alta, hospital 29,\nby reps of Anderson to the 10th City of Cornelia,\nhospital 49 by reps of grain to the 154th Seminole County,\nhospital 50 by reps of work highs to the 157th City of Hague.\nIs there any objection to the previous question\nbeing ordered on the local calendar?\nThe chair here's none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bills?\nChair, here's none.\nThe report of the committee has agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills on the local calendar\nwill vote yes.\nAll those opposed will vote no.\nand the clerk will unlock the machines.\nAll members vote it.\nHave all members vote it.\nall members voted. Now we have. If so, the clerk will lock the machines on the passage\nof the bills on the local calendar. The Yays are $159 and the Nays are $0. These bills\nhave received your requisite constitutional majority and are therefore passed.\nNow we'll move on to morning orders. Representative During Carter has a morning order.\nRepresentative Carter?\nPlease, thank you, Mr. Speaker.\nHey, a camera smile.\nI'm not sure if they made it.\nYou guys are here.\nSo, leadership Newton is here with us today.\nWe have the leadership from Newton County, Georgia,\nup in the gallery, if you guys welcome them.\nThank you, Mr. Speaker, I yield the whip.\nWell, thank you, Representative Cardin.\nWelcome, Newton County.\nGood to have you.\nWe have a special resolution this morning.\nMr. Clerk, will you read the resolution?\nHouse resolution six by Representative Bonner,\nthe 73rd Hitches, on the 61st, Williams on the 68th,\nPrince on the 132nd, and McCollum on the 30th.\na resolution recognizing January 26, 2023\nas National Guard Day at the State Capitol,\nand for other purposes.\nChairman Bonner?\nWe're last the Vice Chair and the Committee Secretary\nto join us along with the guest,\nRepresentative Bonner.\nChairman Bonner.\nThank you, Mr. Speaker.\nYes.\nGood morning, colleagues. It is a great day in Georgia. Today is Georgia National Guard\nDay here at the Capitol, and we are so appreciative of having them here. The first thing I would\nlike to do is recognize all of our guardsmen that are in the galleries. If you all can stand\nup and be recognized please.\nThank you.\nSo we're very honored today to be joined by Brigadier General John Gentry, Colonel Roger Brooks,\nGeneral Chris Powell, Commander Sergeant Major Robert Bain, and Deputy Attorney General,\nAgent General Joe Ferraro, along with Lieutenant Colonel Chaplin, David Burris, and we've already\nheard from Chaplin Jones, and I will say Chaplin Jones delivered his sermon exactly the way\nwe practiced it last night, so really appreciate that Chaplin.\nSo the motto of the guard is always ready, always there, and I cannot think of any organization\nin the state of Georgia that has displayed that motto more\nover the last several years than our National Guard.\nEverything from working at food banks\nto running COVID centers, to covering down\non hospital administrative staff,\nto protecting our cities during civil unrest,\nto protecting our border.\nWe currently have sold National Guardsman\nout on the southern border in Texas.\nWe've had them there for over a year,\nsupplementing that mission.\nSo all across the board, our National Guard is leading out.\nAnd I don't think there's any organization in the state of Georgia\nthat has given more and done more for the state of Georgia\nover the last few years.\nSo if you would, please let's recognize our National Guard.\nAnd I'd like to introduce Brigadier General John Gentry.\nWell, thank you, Representative Bonner.\nFirst of all, all of our representatives here.\nImagine when Brother Jones was speaking earlier,\nYou had to check yourself or pinch yourself to make sure you showed up in the right house.\nGeneral Cardin, on behalf of Major General Cardin, he normally says after a good opportunity\nor a good speaker or a good national anthem, he says, if that doesn't light a fire under,\nyou got wet Kenlan.\nSo on behalf of Major General Cardin, the entire 15,000 Georgia Army National Guard, Air\nNational Guard and our state defense force.\nan honor to speak before you here today and just to say thank you for your\nsupport of your National Guard. It's a tremendous National Guard, our\nleadership works hard to serve you and our Guard is proud to serve you as our\nrepresentatives. We are glad to have you as our representatives in the House.\nWe want to thank you for your support, your continued support, especially a lot\nof the armory renovations that are ongoing throughout the state of Georgia.\nWe have representatives from our Army National Guard in every single community within the\nstate, and you are representing 100 percent of us, I can honestly say that.\nSo thank you for that, thank you for your continued support, and one last thing I do want\nto say is we're hiring.\nWe've got vacancies, and we're looking forward to you helping us recruit.\nAnd by the way, we need to go over to the leadership group that's over here and pass\nout some R&R signs, because that's another thing we can thank you for, because you support\nall of our students who come into the guard with a student loan repayment program, and\nThat is a tremendous opportunity for young people in every community within every inch of\nour state to go and get a higher education and graduate debt-free.\nAnd because of your support, our youth have that opportunity.\nSo again, thank you, thank you, Mr. Speaker, Chairman Bonner, Mr. Representative Bonner,\nin the entire house.\nThank you.\nSo, General Gentry, on behalf of the entire House of Representatives, we'd like to present\nyou with this resolution, establishing January 6th, as George and National Guard day here\nat the Capitol.\nThank you, General.\nI know all of us know how important the National Guard has been in the history of the United\nStates of America.\nAnd there work here in Georgia and around this world is your service to protect our lives\nhere, is most appreciated, and certainly we're so very humbled and pleased to work with\nthe National Guard, and that will continue.\nThank you all so much for being here today.\nMembers, thank you for your attention to these folks\nwho are dedicated to our safety and our protection.\nSo thank you all for that.\nWe're ready to go move on to afternoon orders.\nWe'll start with Representative Bentley for an afternoon order, Representative Patty Bentley.\nWith the later yield for just for a minute, members, let me have your attention just for\na moment. I know that we all are respectful and want to be respectful. And I know that\nwe're all have need, there's a need to have conversations about a lot of important issues.\nBut if you need to have conversation and not pay attention to what the speaker in the\nwell is talking about, they're important, there are sensitive issues in many cases. It's\nnot a good object for the House. You'd be having a lot of conversations that certain\nSubjects are breached and talked about here in the well.\nSo I would ask you if you need to have an important conversation,\nplease take it to the any room.\nBecause we need to pay attention to the member,\nthey would not be here if it were not imported.\nSo I would appreciate your cooperation on that.\nThat's important for all of us.\nIt's important for the integrity of this house.\nSo let's remember that as we do our afternoon orders today\nand in the future.\nThank you so much.\nRepresentative Bentley.\nThank you, Mr. Speaker.\nColleagues, if you would please stay in.\nI come to you this afternoon, I ask that you focus your attention to the screens.\nI come this afternoon to offer our condolences to the families of Martavian time man of\nMacon County, Georgia and Jacob Jake Pounds of Taylor County, Georgia.\nTime man of Macon County passed away at the age of 30 and will be late to rest on this Saturday\nafternoon.\nTy was a 2010 graduate of making county high school and he was a son of Earl man senior\nand Reverend Anthony and first lady tapeth the man.\nJacob Jake Pounds passed away last week at the age of 23.\nJake was pursuing a degree in animal science from A-Bat College.\nJake was the beloved son of Russell and Michelle Pounds of Taylor County, Georgia.\nWe want the families of Ty Mann and Jake Pounds to know that the entire House of Representatives\nare praying with you and praying for you. And in the words of the late Eloise Bentley Lockhart,\nthe matriarch of the Bentley family, we don't lose the ones that we love. They just go on before us.\nAnd so to the families, you didn't lose Ty or man.\nThey just, Ty, man or Jacob.\nThey just went on before you, before us to be with the Lord.\nAnd with that, the entire House of Representatives\noffer our sincere prayers and condolences to you.\nAnd we pray that the peace of the Lord\nand the comfort of the Holy Spirit\nwill be with you on today and forevermore.\nAnd maybe we have a moment of silence.\nIn Jesus' name, amen.\nThank you, colleagues.\nThank you, Representative Bentley.\nRepresentative, or let's see.\nRepresentative Cielo Jones and Representative Kieran Bennett\nfor an afternoon order.\nThank you, Mr. Speaker, members of the House.\nThe women of the House are invited to join women in government, a national, non-partisan\norganization for a grab and go lunch today from 1130 to 1230 in room 125 and\nas your state director representative Jones and representative Bennett service\nthe state directors for Georgia we look forward to seeing you there today. Thank\nyou. Thank you so much\nrepresentatives. Representative Hutchinson is recognized for an afternoon\norder. Thank you, Mr. Speaker. I know you guys missed all the kids that are\navailable for adoption, so I had to come back up and start this over again. Meet\n12-year-old Travion. He goes by trade. He is a talkative boy who enjoys having\nfun, playing football, and eating snacks. Travion also enjoys listening to\nto R&B music, the music of Michael Jackson specifically,\nwatching action movies, WWE wrestling,\nNASCAR races, and Falcon's games.\nTravyon is one of thousands of kids\nwho are available for adoption in Georgia.\nThank you, Mr. Speaker.\nThank you, Representative Hutchison.\nChairman David Knight is recognized for an afternoon order.\nThank you Mr. Speaker many of you have already turned in you'll see on your desk it's the sign-up\nsheet for the Georgia Legislative Caucus again at the beginning of every two year our term\nwe resign up so old members who have done it please resign up to the new members a little\nbit about the caucus. This is part of the National Assembly of Sportsman's\nCaucus. This is tied up under the Congressional Sportsman's Foundation in\nDC, sort of the parent foundation, the largest nonpartisan caucus that's\nactually in DC. We're very much focused on conservation. Our great heritage of\nhunting and fishing outdoors and making sure that our great outdoors and\nand natural resources are protected.\nSo again, I would appreciate everyone\nto, if you are interested, please sign this up,\ngive it to me or bring it by my office in 245.\nAnd we really, really would welcome you\nto the sports and its caucus.\nThank you.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nChair recognizes Rift and Dunnie who for our evening order.\nChair recognizes Rift and Dunnie who for our evening order.\nThank you, Mr. Speaker.\nI come before you today as pro-life for understanding we're here to protect the\nunborn but Friday there was a meeting in a rally that I was not able to attend\nand in there when we pray we are praying to lift people up always remember if we\npray we believe in prayer that's not to put people down or make assumptions\nand I understood the prayer that was there Friday was not that way so I\nwant everybody to know that I didn't have anything to do with some of the words\nthat I went back and read and I heard last night but I want to tell you anybody\nif you ever need prayer contact me and I mean that I'll be glad to sit and\npray with you anytime thank you miss speaker thank you representative that\ncompletes our afternoon orders the clerk will read the caption to a group of\nprivilege resolutions honoring the life and memory of Suzy D. Wiltshire.\nCongratulations University of Georgia Bulldogs for winning the 2023 College\nFootball Playoff National Championship. Recognizing commending family and\nconsumer sciences. Recognizing in commending Dr. Lois Keith.\nCommending the Georgia Economic Developers Association on their efforts to\nimprove the economic development climate of the state of Georgia and for other\npurposes I can please the reading of privilege resolutions. Is there any\nobjection to adopting the privilege resolutions? Chair, here's none and the\nresolutions are adopted.\nWe have a few announcements before we complete our work for the day.\nChairman, Chair Lady Camp has recognized for an announcement.\nThank you, Mr. Speaker.\nThis is a reminder that you have delegation rules that are going to be required.\nIf you have more than yourself in a particular county, then please get your delegation\nrules together and submit them to intergovernmental coordination.\nMichael Satterfield, my office is in 401B.\nYou're welcome to submit those anytime.\nIf you have any questions regarding this, you're welcome to reach out to me as well.\nThe deadline is February 1st.\nThank you.\nChair Cal, where do you sit in the house right now?\nI sit in seat number two.\nWell, she's over in this part of the floor.\nHer seat is over here.\nSo she's told you where her office is.\nShe's told you how to contact her\nand get your rules to her.\nSo that's not an issue later on down the road.\nSo I would suggest we all comply.\nThank you for your willingness to reach out\nand work with members that you're doing your job\nand we appreciate it.\nThank you.\nThank you so much, Mr. Speaker.\nRepresentative Klein has recognized for an announcement.\nThank you Mr. Leader, I just like to make sure that everyone joins us today for our first\nworking family caucus lunch, it's going to be room 307 CLOB, it will be in person,\nwe will have box lunches for the members, so again it will be up on adjournment, normally\nwe're trying to start at noon but since we don't have very much going on, please 307\nC-L-O-B, the working-family caucus, and we'll be electing officers.\nThank you, Mr. Speaker.\nRepresentative, I'm glad you, I was not hearing plainly.\nI thought you invited them to the Women's Caucus.\nI'm glad you got that straight working-family caucus.\nVery good. Thank you.\nChairman Jasper is recognized for an announcement.\nThank you, Mr. Speaker.\nIt was good to see you last night with 350 other people\nat the Transportation Reception.\nAnd just just a reminder from the Transportation Committee,\nwe did change our time to 1230 today.\nWe do have a bill that Representative Brad Thomas has\nfor us to believe in.\nWe need you to be there.\nThank you, Ms. Speaker.\nThank you, Mr. Chairman.\nAnd it was good to see you as well as a lot of other good friends,\nfolks from around the state.\nChairman Ron Stevens, recognized for an announcement.\nThank you, Mr. Speaker.\nToday at 11 o'clock, room 406 CLOB\nwill have an organizational meeting\nfor the Economic Development and Tourism Committee.\nAnd in addition, today, Representative Lehman Franklin\nand Chairman Jesse Petri and I will be on the German.\nYou've got to notice on your desk\nwe're gonna have you stop by room 216\nand get a Chick-fil-A sandwich and tell you a little bit about those 3,000 acre\nmega site that we've got coming home with some cars coming off in about two\nyears with 16,000 jobs. Thank you. Thank you, Mr. Chairman. Representative\nAnola Woods for an announcement. Thank you. On Monday, the 30th, the Cobb\nof county legislative delegation will meet at noon,\nor if adjournments after that, upon adjournment,\nin room 514 of the LOB, we are going to be discussing\nhealthcare, we actually, lunch will be provided,\nand we're gonna be hearing from a well star,\nand also from Cobb Douglas Public Health.\nThank you.\nThank you, Representative.\nChairman Carpenter,\nif you recognize foreign announcement.\nThank you, Ms. Speaker.\nMonday morning 9 a.m.,\nWe will have an organizational meeting for Creative Arts and Entertainment.\nNo wigs allowed.\nSee you Monday.\nThank you for clarifying that.\nWe're going to recognize some folks for some birthdays here in just a moment.\nBut I want to remind this house that we have a great scheduling resolution in place.\nAnd today, what's the date of the day, Betsy?\n26th of January is a work day all day long so there are committee meetings that\nare going to be meeting this afternoon we all want to get home but today is a\nwork day for the people of Georgia so if you have a committee meeting you're\nexpected to be there intent to any other opportunities you have to serve the\npeople remain of this day so I appreciate y'all doing that and thank you for\nyour attention today. We have a couple of birthdays today.\nRipsey Carlton Howard. Do you have a birthday today? Is that accurate? Awesome.\nThis wish represented Carlton Howard, a very happy birthday.\nRepresentative Howard, we're glad you're good and continue drinking that water I'm with\nyou. We'll all do the same. Let's stay hydrated. On Friday, the 27th, big poppy representative\nHenry has a birthday. Happy birthday to you, brother.\nWow, another momentous occasion is going to a curl in Saturday.\nThe speaker pro-tim of this house, representative Jan Jones,\nthe speaker pro-tim has a birthday on Saturday. Happy birthday.\nAnd certainly last but not least, the Chair Lady Darlene Howard has a birthday-owned\nSunday, representative Howard, Stuart Taylor. Did I say Howard, I'm sorry? Darlene Taylor.\nThat makes it more meaningful, doesn't it? Darlene Taylor has a birthday on Sunday.\nThat completes our work for today, other than committee meetings and whatever other\nbusiness you have to tend to today.\nChair now recognizes the majority of this house for a motion.\nMr. Speaker, I move that this house stand adjourned until 10 a.m. on Monday, January 30,\n2023.\nI hope everyone has a wonderful and a safe weekend.\nAnd on the motion of the majority leader that this house stands adjourned until 10 a.m.\nMonday, January the 30th, 2023, all those in favor of the motion will say aye.\nAll those opposed will say no, as clear in my mind the eyes have it, we are adjourned.\n",
  "updated_at": "2026-02-12T16:16:49.788034+00:00"
}