{
  "video_id": "Z8CNhdqE0wM",
  "url": "https://www.youtube.com/watch?v=Z8CNhdqE0wM",
  "title": "House Day 31 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 31,
  "video_date": null,
  "duration_minutes": 184,
  "summary": "Here is a summary of the Georgia House Day 31 of the 2025 Session session:\n\n**Overview**\nThe session featured a prayer and remarks from Dr. Derek Lemons, a professor at the University of Georgia, highlighting the importance of using blessings to bless others. He drew parallels to the UGA football team's championship season and the university's mission to serve the state of Georgia.\n\n**Key Actions**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- SB 138\n- SB 139 \n- SB 68\n- SB 81\n\n**Notable Moments**\n- Dr. Lemons delivered a speech emphasizing the importance of passing on blessings and appreciating others, drawing on his experiences at UGA.\n- There was discussion of the UGA football team's national championship victory the previous season.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe speaker noted that some members were absent, attending a \"yellow rose ceremony\" in the blue room, but a quorum was present.\n\n**Adjournment**\nThe session adjourned. The next session date was not specified.",
  "transcript": "Well good Thursday morning. Glad to see y'all all here early. On time. We're ready to go to work. Members, we have a few members that aren't present now, so we're going to spend with the roll call. This is actually the women's caucus. Many of them are down at I think in the blue room. It's a yellow rose ceremony. So we're going to dismiss with the roll call. We'll take care of ensuring that everyone gets here and we're ready to take care of the business of the day and make sure we're all counted present and counted for and just a little bit, but we won't do that right now. All members, please come into the chamber. Doorkeepers, will you please close the doors and keep them closed? As is our custom, we will begin our day with scripts reading and prayer by the chaplain, after which we'll pledge allegiance to the flag of our country. Our chaplain this morning, I know a great conversation with the two of them, and learned a lot of things from the lemons. We're both and as our all that you introduced, I was impressed by them both, as I am by the chaplains every day. So we appreciate them always being here for us, but they will be introduced by the gentleman from the 120th House District Representative Houston Gaines, representing Gaines. Thank you, Mr. Speaker. And I'm impressed by them too. They're good people and certainly I'm honored to have Dr. Derek lemons here joining us today. Dr. Lemons is a leader in the field of anthropology of Christianity. He serves as professor and head of religion at the University of Georgia. And speaking of UGA, Dr. Lemons, I was really hoping we'd be here celebrating a victory last night, but instead it just kept up the bulldog faithful little too late, but I appreciate you being here. As a Christian leader beyond the University, Dr. Lemons has served temple, United Methodist Church in Arnold'sville since 2010. Dr. Lemons is a devoted family man. He's got his wife Paula who joins us here this morning. Paula, thank you for being here. And that Paul and Dr. Lemons have two sons and Paula, by the way, is a associate Dean in the Franklin College of the University of Georgia. Have they have two sons in the annual who's a senior UGA? If you've ever seen the spike squad who's always cheering on, he's the co-president of the spike squad. So he may have been at the game last night. Was he? He didn't make you last night. Okay, but there'll be the March Madness and there are the sons, Zach. So please join me in welcoming Dr. Derek Lemons. Well, go dogs. All right. I thought there may be a few of you out there. Mr. Speaker, members of the House, distinguished guests and fellow Georgians, good morning. It's an honor to stand here before you. I want to start by reading a passage from Genesis 12, 1 through 3. Now, the Lord said to Abram, go from your country and your kindred and your father's house to the land that I will show you. I will make of you a great nation and I will bless you. And I will make your name great so that you will be a blessing. I will bless those who bless you and the one who curses you, I will curse. And in you, all the families of the earth shall be blessed. Did you catch that? God blesses Abraham. Not just for his own benefit, though, but so that he can bless others. Now, let's be honest, this passage is easy to misread. We like the idea of receiving blessings. And if we admit it, there's a certain appeal to the part about curses falling on our enemies. But the real power of this passage is on passing blessings onward. I've seen this principle at action, inaction at the University of Georgia at my time there. Let me take you back to the fall of 2021 at the privilege of working with the U.J. football team as they navigated the challenges of COVID-19. Remember those days? They were tough. I collaborated with incredible people like Nicobie Dean, Jordan Davis, Kieres Jackson, Ron Corson, and our coach, Kirby Smart. Of course, we all know how that season ended after 41 long years. UGA finally brought home another national championship. Go dogs. What made that team, but the question is this, what made that team so special? I want to propose that what made them special is they lived out, Genesis 12, two. They understood that they were conduits of blessing. And it wasn't just about football. It was about simple, everyday interactions. One of the most powerful ways that they passed on the blessing is by telling people, I appreciate you. Now, the first time Kirby Smart told me that he appreciated me, I was stunned in a little starstruck by the whole thing. But then I realized everybody in that building said, I appreciate you. Now, as a faculty member and you may be able to relate as politicians, hearing I appreciate you is not something that I get on a daily basis. In fact, I found myself going through the football building just to hear people tell me, hey, I appreciate you. You know what I discovered? Something incredible happened. As I received that blessing, I couldn't help but pass it on. I caught myself telling other faculty members and administrators that I appreciated them. And yes, they look just as stunned at me as I did at Kirby Smart when they heard the first time. But that's the power of blessing. It doesn't stop with you. It flows through you. But this idea of blessing others didn't originate with the UGA football team. It's been part of the DNA at the University of Georgia since the beginning. On January 27, 1785, the Georgia General Assembly chartered UGA as the first public university in the United States. And in that charter, Abraham Baldwin wrote that there's a direct link between national prosperity and living out the principles of religion and morality. So from its very foundation, UGA was created to bless others as tall in Genesis 12, to 1872 under the moral act. UGA became a land grant institution and with a mission to use its knowledge and resources for the people of Georgia. And that mission continues today in 2024. Georgia's legislatures, you blessed UGA with $667 million in funding. And what did UGA do with that funding? We turned it into an $8.4 billion boost to Georgia's economy. Now let me bring it back to us here today. I stand before you as one of the most blessed men in the world. I pinch myself every day that I enter a classroom filled with the brightest minds in the world. And I want nothing more than to pass that blessing on. I've been teaching long enough about 16 years to begin seeing how those blessings are being passed on by my students. Just this past semester, I had a former student come in, Julie Cousins, wife of NFL quarterback, Kurt Cousins. Come, Kurt and Julie came to my class to share with my students. And in that class, she shared that something I said in one of my lectures led her toward finding her soulmate. Another one of my students works, brings joy to sick children through her role at Ryan C. Crest Studios with Children's Healthcare of Atlanta. Another student was on the ground floor of starting the Indomovement with Passion City Church, fighting modern day slavery and human trafficking. You see the connection? I shared my blessing and now my students are sharing their blessing. But here's the thing, you are blessed too. Maybe not in the same way, but in ways that matter just as much. So how can you use your blessing to bless others? I want you to get started right now. I want you to look to a couple people around you and I want you to tell them, I appreciate you. All right, now how did that feel? Did some of you here appreciate you from someone for the first time ever? All right, let's keep that going here. All right, we're rolling toward the end of this session. If you'll please stand as we pray. Thank you. Lord Jesus, we thank you that you do have intent on blessing us. But Lord, may we just be the conduits of your blessings to others and Lord, may your light shine through us in this world. May we be salt to this world. Thank you, Lord. In Christ name we pray, amen. Let's say the pledge. The pledge we just do to buy a United States of America and to the Republic, which is famous when we should not be gone. In the visible liberty and justice for all. Thank you so much. I appreciate it. Just like Houston Rudy for you, I can do. Hey, he's against me. Thank you, Dr. Lemons door. Keep it. You may open the doors. Members, you can join both Dr. Lemons in the South Any Room for a photo. Dr. Lemons, thank you for that message. You did bless us and we know that we in this room are blessed but our entire state is blessed. We're very fortunate to have a forgiving God that blesses us all. And thank you for what you're doing for your students. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Members, our doctor of the day is Dr. Modi. And Dr. Modi has brought to us by Representative Matthew Gamble. We appreciate Representative Gamble of the 15th. You have needs. Dr. Modi is down in the aid station. So make a visit if you need him. Thank you. Appreciate you too, Representative Williams. Chairman Hilton, the Chair of the Committee on Information Audits, has recognized. Thank you, Mr. Speaker. Your Committee on Information Audits has read the journal the previous Legislative Day and found it to be correct. And with St. Patty's Day this Monday, we want to wish you best of luck this weekend. It's going to be a great weekend all over, but especially in Savannah. Chairman Hilton, the Chair of the Committee on Information Audits, reports that the journal of the previous Legislative Day has been read and found to be correct. Is there any objection to the spends with the reading of the journal? Here in the reading of the journal is a spent with. Is there any objection to the confirmation of the journal? Here in none the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, it's the 100th fourth, whose following will be established as the order of business and the first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Here in none the resolution is adopted. First reading of bills and resolutions, Mr. Clerk, will you read? House will 755, I represent a balance of the 23rd, really, the 22nd time is the 21st. Jones, the 47th, Skoggins, the 14th and others, will be Todd and Act Authorized, the governing authority, Cherokee County, DeLuvian, X-Eyes Tax. The answer of governmental coordination. House will 756 by represent of Jackson, the 165th, Hitchens, the 161st, B-Tree, the 166th, Gilear, the 162nd, Westbrook, the 163rd, will be Todd and Act Demand and Act creating, the Chatham area, Transit Authority. Andrew Gov. Mental Coordination. House will 757 by represent of Kelly, the 16th Chatham, the 11th, Kendrick, the 95th, Ridley, the 6th, Mathis, the 133rd, will be Todd and Act to amend Article 6 of Chapter 13 to Title 16 and the Fisher go to Georgia and it's headed, related to Cratham. Agriculture and Consumé Affairs. House will 758 by represent of Mathy Aca, the 82nd and Camp of the 135th, will be Todd and Act to provide a homestead exemption from Spalding County School District at Valorum Taxes. The answer of governmental coordination. House will 759 by represent of Camp of the 135th and Mathy Aca, the 82nd, will be Todd and Act to amend and Act to provide a board of elections for Spalding County. The answer of governmental coordination. House will 760 by represent of Staints of the 180th, Townsend, the 179th, the Lodge of the 167th, will be Todd and Act to amend and Act to create board of commissioners in Glen County. The answer of governmental coordination. House will 761 by represent of Clark of the 108th, Lim of the 98th, McLean of the 109th, will be Todd and Act to amend and Act to provide a homestead exemption from all city of Lillburn, add Valorum Taxes. The answer of governmental coordination. House will 762 by represent of Gillier, the 160th, Second, Petrie, the 166th, Hitchins, the 160th, and Stevens, the 164th. Will be Todd and Act to provide for the creation of the Savannah Music Commission. The answer of governmental coordination. House will 763 by represent of Stevens, the 164th, and Petrie, and the 166th, and Franklin, and the 160th. Bill B. Todd and Act to create and establish the Richmond Hill, Bryan County, Airport Authority. The answer of governmental coordination. House will 764 by represent of Jasper, the 11th, will be Todd and Act to amend and Act to provide a new charter for the city of Nelson. The answer of governmental coordination. House will 765 by represent of Campbell, the 35th, Roberts, the 52nd, Cummings, the 39th, Panich, the 51st, Hugley, the 111st, and others. Bill B. Todd and Act to amend, Part 2 of Article 15, Chapter 1, and Todd will attend, and the official go to Georgia, and it's ended. The Fair Business Practices Act of 1975. Agriculture and Consumer Affairs. The answer of the 176th by represent of Chocus, the 151st, to be a Todd and Act to create and establish the Sumter, America's County Unification Commission. The answer of governmental coordination. House for resolution 567 by represent of Cannon, and the 172nd and 4th, and the 170th, a resolution honoring the life of Mr. Zera, D. Story, and dedicating an interchange in his memory. Transportation. The second place for his readers. Second, reading the bills and resolutions, the clerk will read. House bill 742 by represent of esteem of 169th, per chat of 176th, so Bill to amend and act to provide the new charter for the city of Proxton, House bill 743 by represent of Fleming of 114th. Williams of 112th, Martinez of 111th, Bill to provide a home state exemption from the city of Social Circle, Advalorem, Taxes, House bill 744 by represent of Williams of 112th. Martinez of 111th, Fleming of 114th, Bill to provide a home state exemption from the city of Walnut Grove, Advalorem, Taxes, House bill 745 by represent Martinez of 111th, Williams of 112th, Fleming of 114th. Bill to provide a home state exemption from city of Loganville, Advalorem, Taxes, House bill 746 by represent of Williams of 112th, Martinez of 111th, Fleming of 114th, Bill to provide a home state exemption from city of Monroe, Advalorem, Taxes, House bill 747 by represent of the 39th Parsons of the 44th. Wilkinson of the 38th, Carson of the 46th, Campbell of the 35th and others, the bill to amend and act to create a state court of Cobb County, House bill 748 by represent of Smith of the 18th, Smith of the 70th, Huttleson of the 72nd, Howard of the 71st. Bill to amend and act placing the coroner of Carroll County on an annual salary, House bill 749 by represent Smith of the 18th, Smith of the 70th, Huttleson of the 72nd, Howard of the 71st, Bill to amend and act to amend and revising superseding, consolidating the laws pertaining to the Board of Commissioners of Carroll County, House bill 750. My represent Cox of the 28th, Barrett of the 24th, McDonald of the 26th, Clark of the 100th, Jasmer of the 11th and others, the bill to amend and act to create a state court of four-side county. House bill 751 by represent Campbell of the 35th Miller of the 62nd, Evans of the 57th, Lubson of the 83rd, Buckner of the 137th and others, a bill relating to medical assistance, House bill 752 by represent McQueen of the 61st, Hugh Glave of the 111st, Beckles of the 96th, Florida of the 74th, with plain to the 109th and others, a bill relating to firefighter standards and training certification, re-certification on the 24, paramedics and cardiac technicians, employment and training of peace officers, House bill 753 by represent Barry of the 56th, 522nd, hearing of the 145th, Lale of the 59th, 30th of the 140th, the bill relating to the Department of Community Affairs, House bill 754 by represent of the corner of the 3rd and Tarmin of the 2nd, a bill to amend and act to reconstitute the Board of Education of Coutusa County. House Resolution 557 by represent Kendrick of the 95th, Holcomb of the 101st, Jones of the 25th, Evans of the 57th, Stevens of the 164th, a resolution creating the House Study Committee on Georgia Investment Funds, House Resolution 558 by represent of Corbett of the 174th, Powell of the 33rd, Ridley of the 6th, Jones of the 25th, Mathes of the 133rd, Resolution creating the House Study Committee on the State Board of Registration and Use Mode or Vehicle Dealers and Use Mode or Vehicle Parts Dealers. House Resolution 559 by represent the 20th, the 11th, the 19th, Resolution honoring the lives of Mrs. Ruby Floyd-Grogan and Mr. Lloyd James-Grogan and Dedicated Intersection in their memory, House Resolution 560 by represent the Recess of the 140th, the Resolution recognizing the Commending, Dr. Michelle Ow, House Resolution 561 by represent the Recess of the 140th, the Resolution recognizing the Commending, Congresswoman Nakeem-A-Williams, House Resolution 562 by represent the Recess of the 140th, the Resolution recognizing the Commending, the Nesert Raphael, Dr. L. G. Warnoch, House Resolution 563 by represent the chair of the 140th, the Resolution recognizing the Commending, Senator John Isopth, House Resolution 564 by represent the hanging of the 156th, Palad of the 140th, fouriß, seventh, Kamp, 135th, New of the 40th, Taylor of the 173rd, and others are President drop street of remission to any commending commercial op-mount for social existence still being Resolution 566 by reps and a reach of the 140th. The resolution recognizing commanding Congresswoman Lucy McBath. Senate Bill 281 by Senator Mallow of the second. A bill to create the Port Wentworth Convention and Visitors Bureau Authority. Senate Bill 316 by Senator Goodman of the 8. A bill to authorize the assessment and collection of a technology fee by the probate court of clinch county. Senate Bill 317 by Senator Goodman of the 8. A bill to authorize the assessment and collection of a technology fee by the magistrate court of clinch county through second readers. Thank you. Thank you members. Mr. Clerk, third reading. Excuse me, I'm sorry, reports of standing committees. Mr. Clerk, will you read? Senator Robert Dickey, the 134th District Chairman of the Committee on Agriculture Consumer Affairs submitted the filing report. And speak to your committee on agriculture and consumer affairs. As had under its consideration, filing bill of the Senate. This is struck to meet report same back to the House of the following recommendation. Senate Bill 144, Duke Pass, respectfully submitted, represented Robert Dickey of the 134th District Chairman. Grapes and a bill, work eyes of the 157th District Chairman and the Committee on Industry and Labor submitted the following report. And speak to your committee on industry and labor as had under its consideration, the following bills of the Senate that's instructed me to report same back to the House of the following recommendations. Senate Bill 55, Duke Pass, Senate Bill 191, Duke Pass, respectfully submitted, represent Bill Work Eyes of the 157th District Chairman. Grapes and a lumpston of the 12th District Chairman of the Committee on Insurance Submitted the following report. As speaking, your committee on insurance is said under its consideration, the following bills of the Senate that is instructed me to report same back to the House of the following recommendations. Senate Bill 109, Duke Pass, Senate Bill 121, Duke Pass, Senate Bill 276, Duke Pass. And respectfully submitted, represented lumpston of the 12th District Chairman. Rep. Beth Camp of the 135th District Chairman of the Committee on Intergovernment, Court Nation, Locals submitted the following report. Mr. Speaker, your committee on Intergovernment, Court Nation, Locals had under its consideration, the following bills of the House and the Senate that is instructed me to report same back to the House of the following recommendations. House Bill 699, Duke Pass, House Bill 701, Duke Pass, House Bill 714, Duke Pass, House Bill 719, Duke Pass, House Bill 720, Duke Pass. Council 722, Duke Pass, House Bill 724, Duke Pass, Senate Bill 238, Duke Pass. Respectfully submitted, Representative Beth Camp of the 135th District Chairman. Representative Gunner of the 8th District Chairman of the Committee on Judiciary submitted the following report. As speaking, your committee on Judiciary has had under its consideration, the following bills of the Senate is instructed me to report the same back to the House of the following recommendations. Senate Bill 882, pass, Senate Bill 145, Duke Pass. Respectfully submitted, Representative Gunner of the 8th District Chairman. proceed with the clerk. Representative Andy Ballinger, the 23rd District Chairman of the Committee on Judiciary Juvenile submitted the following report. As speaking, your committee on Judiciary Juvenile has had under its consideration, the following bills of the Senate is instructed me to report the same back to the House of the following recommendations. Senate Bill 982, pass, Senate Bill 110, Duke Pass. Respectfully submitted, Representative Andy Ballinger.\n\n23rd District Chairman. Representative Sharon Cooper, the 45th District Chairman of the Community on Public and Community Health submitted the following report and speak to your community on public and community health. I said under its consideration, the following bill of the Senate is just talking to me to report the same back to the House, the following recommendation. Senate Bill 162, passed by committee substitute, respectfully submitted. Representative Sharon Cooper, the 45th District Chairman. Representative Mitchell Skoggins, the 14th District Chairman, the Committee on Special Rules submitted the following report. We'll speak to your committee on special rules as I said under its consideration, following resolutions of the House, as I said, struck the meeting report, same back to the House, the following recommendations, House resolution 347, House resolution 463, due pass, respectfully submitted. Representative Mitchell Skoggins, the 14th District Chairman. Representative Shaw Blackman, the 146th District Chairman of the Community on Ways and Means submitted the following report. We'll speak to your community on Ways and Means as I said under its consideration, the following bill of the Senate is just talking to me to report the same back to the House and following recommendations. Senate Bill 141, due pass by committee substitute, respectfully submitted. Representative Shaw Blackman, the 146th District Chairman. That completes the reading of the report's standing committees. Members, if you'll, if you're in any room, if you'll come to the floor, we have an special invite resolution. It's been a part, I'll speak to a part of the history of our state. Going to be celebrated on Monday. And we're going to be celebrating a Saint, Saint Patrick. Chairman Petrie, you look good in that green. I'll tell you what, there's a, I don't get to say that off from about your chairman Petrie. So you look good in that green. Members, if you'll come to the floor, come to your seats. We have a special invite resolution. Chairman Carson is going to bring to us and we have, then we're going to, we will get on to morning orders so you can recognize your guest in the gallery. Members, please take their seats. Don't worry, we're going to have a long day so you have time to attend their all-ever business. Don't worry. We're not getting out here for lunch or anything like that. Hope you brought your brown paper sack and brought your lunch with you. Members in the center aisle, will you find another place to have that conference? Members up the center aisle, find another place for that conference, please. Are we going to let the door keep us fine and let you find a place, one of the two? Thank you, members. We have an invite resolution and then we have a video. I think we're going to have the clerk read the captions of the resolution. House resolution 372, then we'll see the video. Then we'll recognize you, Chairman Carson, to come speak to the resolution. Miss Clerk. House resolution 372, by the rest of the Carson of the 46. Stephen's the 164th, Petrie the 166th, Franklin the 160th, Bonner the 73rd, and others. A resolution, recognizing and commending Minister Dara Calieri on his outstanding public service. House resolution 372, by the rest of the Carson of the 46. Stephen's the 166th, and others. House resolution 372, by the rest of the Carson of the 46. Stephen's the 166th, and others. House resolution 372, by the rest of the Carson of the 46. House resolution 372, by the rest of the Carson of the 46. House resolution 372, by the rest of the Carson of the 46. Stephen's the 166th, and others. House resolution 372, by the rest of the Carson of the 46. House resolution 372, by the rest of the Carson of the 46. Thank you, Mr. Speaker. Ladies and gentlemen of the House, it is my honor to introduce to you a delegation that we have here today from Dublin, Ireland. We have Dara Calieri, as we just mentioned, he actually just flew in from Dublin last night, so he's a little bit tired. He serves as the Minister of Social Protection and Minister for Rule and Community Development since January of this year. He previously served, and I'm trying to get the correct pronunciation of the minister, the two-ogh de d'Allah. Is that right? Okay. Which is Mr. Speaker, that's the lower house of the Ireland Parliament. His father is here in Georgia. Okay, that's the Senate here in Georgia. Okay. I got you. But he previously served in that legislative body in Dublin, Ireland, as did his father, as did his grandfather, all from nearby in the same area of Mayo, Ireland. He studied at Trinity College in Dublin and then St. Murdoch's College. Also, we have a number of other guests with his party. We have Frank Grum, Council General to the US Southeast from Ireland. We have Nicole Sheel's, Vice Council. We have Eman McCormick, Private Secretary to the Minister, and Craig Dwyer. So, again, happy St. Patrick's Day, everyone, and I just want to introduce you to Minister Dara Calary. Thank you. Speaker Burns, Representative Zayden Jaderman, thank you for your very warm welcome to my south, until the dedication from Ireland this morning. It is our great honor to join you here. I want to thank Speaker Burns and particularly Representative Carson for facilitating our visit to you this morning. Thank you most sincerely for the welcome, for allowing us to show you our St. Patrick's Day video. I bring warmest St. Patrick's Day greetings from across the island of Ireland, from the government of Ireland, and from the parliament, the Oroctis of Ireland. In Ireland, we are really fortunate that our national day is globally recognized and globally celebrated. And we began today a series of engagements across Georgia that will culminate on Monday in Savannah. One of the world's biggest St. Patrick's Day parades here in your state. And really, really looking forward to that. Applause For the 70 million people worldwide claim Irish-owned ancestry, including about a million people here in Georgia. And we're incredibly proud of that ancestry, but we also want to keep writing that chapter, keep renewing it, and ensure that those connections remain contemporary. Our connections are deep, they're historic, and I want to remark and celebrate those and reflect on those, and reflect on all of those who've gone before us, who brought that Irish tradition to this state. And we think of those people who have passed on in these days, in particular. The civil rights movement that took Roo Sher and Atlanta inspired our island and inspired courage across our island. And today, we share a lot with Georgia. We are youthful, we are diverse, we are outward looking, in combined with you. We even have college football in common. I had the privilege of being here in 2023 when we promoted the college football classic. And I was so thrilled to welcome many from this as to Dublin last year when you came to see Georgia take when it sees an opening against Florida's stage. That is the second time Georgia Tech won an Irish side, so I'm not saying we are lucky charm, but look, you won twice, and you beat Florida, so that must be really good. Georgia, you are incredibly proud, and I know from talking to many of you this morning, that this is the number one US state in which to do business. In Ireland, we share that title. We are one of the best countries in the world to do business by any metric. And many of your Georgian grown companies have found success in Ireland. That is a two-way relationship. And today, Irish companies employ over 10,000 Georgian citizens across this fantastic stage. Last year, in 2024, Ireland and the US marked 100 years of formal diplomatic relations, even though our relations and our connections go back so many more years. And in this year, this new de-elected government that I am honored to be part of has placed deepening the relationship, particularly in states such as Georgia as one of the priorities of our new programme for government. Tomorrow, I will open an office here in Atlanta of Enterprise Ireland, which is one of our state enterprise assistant organisations that would assist Irish companies to build and grow business here in Georgia, to create employment and to work on building those links even further. And that is a sign of our strong commitment to building Irish Georgian relations. We have a wonderful language in Ireland. I have the privilege of being the minister for the Guelga and the Guelga. Guelga is our native language. We have a saying in North Cacar, there is no strength without unity. On this day, we celebrate our strength, celebrate our unity, and we will continue to work closely and work in the best interests of our people. Many times, you are kind invitation. Many times, you are giving me time and what the speakers are saying is going to be a busy day to mark this relationship. Many times, to all of you, who have dawned the green here this morning, there is some fantastic displays of us. Can I relive Garmel Maugov on a wish you health and happiness? Thank you. Members, the minister just spoke about our relationship that exists and those that we will develop with his great country, the country of Ireland. And we know the Irish build this country. And many of us have that heritage in our families. One of those that we are developing in Savannah continues to develop is the relationship with county Wexford, where many Irish immigrants came to and landed in Savannah. Many in New York, but many landed in Savannah from county Wexford. So that's a unique relationship. The folks in Savannah are working diligently on Georgia Southern University has now joined campus on county at county Wexford. So we are looking at building all these relationships. So we appreciate your attention this morning. Appreciate your continued support as we continue to build on this great relationship. This is good for both of us. Thank you for being here, minister. We appreciate you. Thank you. Members, you can join our friends from Ireland and the minister in that south any room and have a photo and have conversation and talk about how you may build a relationship with your community with our good friends from Ireland. South any room, meet the delegation and get some photos. Members, we are going to move on to morning orders. Boy, there's a whole slew of you. And we could take up a half a day. I'm going to get issue a challenge to all of you have a morning order. We have some great guests in the gallery, but I want to issue a challenge to you. You'll have up to two minutes. And I hope you will use less than that this morning. I'll give you a gold star. If you use less than much less than two minutes, you may get a promotion if you use less than a minute. Our first morning order is Chairman Chokas. Chairman Chokas is recognized for a morning order. Give the gentleman your attention, please. Thank you, Mr. Speaker. Colleagues, please join me in welcoming the Corporate Volunteer Council of Atlanta. Ladies, y'all stand up. The Corporate Volunteer Council of Atlanta supports member companies in achieving business results through a strategic commitment to civic engagement and social impact. Its members benefit from forms that focus on the best practices of the corporate community engagement and gain access to educational programming, networking and leadership development. The leadership of the CBC of Atlanta is Yvonne Whitaker, who is president. Please stand up. And my daughter, Brittany Church, who is vice president, Cat Reynolds, Secretary, Geneva Hall Sheldon, is Tricia, and Ticara Arnold Allen is the... Al Wum is the Community Volunteer. Ladies, thank you for what you do. Brittany, I love you. Thank you, Mr. Speaker. Thank you for making a difference as volunteers in the different organizations. Thank you so much for that. And thanks for being here today and celebrating with us. Thank you, Mr. Speaker. I want to ask Logan Paradise to stand up in the gallery. If his name sounds familiar, that's because he was here last year after he won his second state wrestling title. Well, Logan from Calcutta County is here again this morning after winning his third state wrestling championship. After dominating all his opponents from Mill Creek, from Newford, South Forsyth and Brookwood, Logan became the first Copic County Packer in school history to win three state titles. Logan's ranked number two in the nation is way classed, finished his senior season with an astonishing record of 45 and 0, and a combined high school record of 113 and 2. His only two losses were during his freshman ninth grade season. Logan recently signed a scholarship to wrestle at the college level at the University of Northern Iowa. You got to still here. Joining Logan in the gallery this morning are members of his family, his friends and high school coaches who made the long drive from South Georgia this morning to see him honored here at the gallery. Please join me in congratulating Logan, his family and his coaches for their amazing achievements. Thank you, Mr. Speaker. Three P way to go Logan, that's impressive. Good luck in Northern Iowa. That's a great school. I know you're going to do great there. Good luck to you. But it's a long way from home though, isn't it? Jim and Erwin is recognized for a morning order. Jim and Erwin. Thank you, Mr. Speaker and colleagues. I want to introduce a bunch of friends to you. And I want to point out to you that you got some coffee on your table. I'm all talk about Steven's County Northeast Georgia to co up there and there has absolutely fantastic people that live there and serve their community and the Steven's County Chamber has come with us today. I'm going to say that coffee that is before you is and I see you're up there, Haley Brewer, holy hand up there. I hope you like coffee. Taste this coffee. I'm going to tell you, you will see life's better when you share coffee with somebody. Thank you for this, Haley. I want to give you a little known fact about to co up the waterfalls further freely than Niagara Falls. So please come up and visit so much so that the co up falls is on the cover. On the cover of the Georgia travel magazine this year and we're very proud of that in in Steven's County. Please stand up and let's recognize the members of Steven's County. Thank you all for coming. I want to represent its Hilton Rees Beckles. Are you all ready? In other friends if you have them, you all are recognized. Thank you, Mr. Speaker. Yeah, the Gwyneth delegation would come join me. I would love to honor a friend, a mentor and a distinguished servant to the state of Georgia here. Mr. Mary K. Murphy served over two decades on the Gwyneth County School Board. She received her doctorate from Georgia State University, her master's from Emory, and has just been pivotal to education here in our state and our county. Mary K is up there with her daughter. I've you'd please stand up and be recognized. Thank you so much for your service. And Dr. Murphy, if you had come down and me to send the anti-room there, we'll get some pictures. Thank you, Mr. Speaker. I'm going to represent the podium. I apologize. I was not representing Beckles. Thank you, Mr. Speaker. This week it's Arts Week at the Capitol and what a better time to have the Noir Cross Splash Festival organizers here as well as the Duluth Fall Festival organizers. If you could please stand. These two organizations bring economic development to each of their respective cities. And I am so proud to be a volunteer with the Noir Cross Splash Festival for years. And next year Duluth, I promise I'll be yours. Thank you. If you can meet us down in the anti-room. Thank you, Mr. Speaker. Thank you. Thank you. Thank you. Thank you. Thanks for what you're doing. Duluth. Good to have you in the people's house. Representative Liam, you're recognized. Thank you, Mr. Speaker. We are keeping it going at and going at County Public Schools, actually. I am so happy to recognize here today during women's history month, one of my constituents, Leslie Palomino. Leslie, will you please stand and to honor her with House Resolution, House Resolution 536. Leslie serves as Georgia State Programs Director for Puder Latinx and is in fact one of the youngest Latina State Directors in not only the state, but the country I looked up as well as named as one of the 50 most influential Latinos in Georgia last year by the Georgia Hispanic Chamber of Commerce. She is a proud product of Gwyneth County Public Schools and it is my privilege to work with her over several years as she has organized people both at the Capitol and in the community to speak about their experiences to everything from the environment to child care to housing. We might be used to doing that on our end, but many people are not. And I have seen firsthand how she helps our constituents be comfortable engaging with us, which to me is a great gift. Leslie, who is here with her family, a round of applause. Thank you so much, Mr. Speaker. I yield the well. The chair recognizes representative Taylor for a morning order. Thank you, Madam Speaker, for a morning. This morning we have with us some a group that has traveled far and near to be with us in the gallery. Help me welcome the. Welcome those that are visiting from Central Africa. Would you please stand to be recognized. Welcome to the people's house. And instead of Georgia, we look forward to meeting with you in the next few minutes. Please come on down to the onto room on the third floor for some pictures. Thank you. Thank you, Mr. Speaker. If you have a morning order, if you've signed up, please come to the front so that we're ready to go and we can get through this. Representative chair recognizes representative Kendrick for a morning order. Thank you, Madam Speaker. If you like technology, feel free to join me in the well. Today is my second annual tech demo day at the Capitol. Thank you to those of you that join me in two 16. We have some amazing companies down in the atrium that we are celebrating women in artificial intelligence. So I want to name the companies that are down there. We have EcoMap Technologies AI, Intervision, Mentorado.ai, darkviolet.ai, review Taylor, Midley Labs, Inc., Anchorage, and SEMD label. And we also have two vendors tag and the Georgia Technology Authority. But we also have some attendees that are here as well. So if you are still in the gallery and having Whitbeck downstairs, just please stand up so we can give you a round of applause. Thank you so much for joining us here today. We appreciate it. Thank you so much, Madam Speaker. Chair recognizes Chairman Jasper's for a morning order. Thank you, Madam Chair. And I have a few that will be joining me also. Okay, I have the great honor this morning to recognize a company that's legendary. The gun that tamed the West was built by cult manufacturing. They are still in business 175 years later. From the battlefield to the backwoods, cult is a trusted name for generations. We are recognizing cult and their president, Josh Dorsey, who is here, and he's the president of cult for what they've done in safety. They have created their safety impact award. This award will recognize nonprofits dedicated to firearm safety. They have awarded $5,000 grants to four organizations so far and more to come. Project Childsay, Place for Charity, Ducks Unlimited, and the International Hunter Education Association, to foster the culture of safety and community education. These awards are to work also on safe storage solutions. They are meeting today with Darrell Ingram from Electric Cities with the Department of Natural Resources to help them with give a shot, which trains new firearm owners, and also their hunter safety. They are going to help support those that help train kids using weapons. I know Chairman Powell would like to say a word also. Thank you, Chairman Jasperson. We want to thank our friends at cult farms, but I'm remiss if I didn't say that by doing this, we're also paying honor to one of the greatest American inventors in industrial supply time, Samuel Cote. There's an old saying that was very prevalent back decades ago, and that's God made man, but Sam Cote made him equal. Thank you. Thank you. Thank you, members. Listen, give him a hand. Thank you for being here today and what you're doing in Georgia. Chair recognizes Representative Dawson for Morning Order. Dawson and many friends. Madam Speaker Pro Tem, members of the House, guests and citizens of Georgia. Today I have the honor of recognizing a distinguished group of men from the St. Augustine All Boys Catholic School. Will you rise, men? Thank you. I'm very happy to have met this group and to support this group. St. Augustine was started in the 1950s by the Archdiocese of New York City.\n\nOrleans who recognized a need for quality education for boys in the city. Today St. Augustine's tentacles reached nationwide and the alumni network of the school includes high ranking military officers who are here,bearance of business, doctors, lawyers, teachers, and just bang up guys reaching back and giving back to the institution that's given to them. The Atlanta Alumni Association is present with us today. They've raised six figures towards a $7 million gold for the school. They have a large fundraiser, a gala, martyr grot themed every year. They will have tickets to invite everyone out too. And these men are providing college scholarships to students who otherwise wouldn't be able to attend Morehouse College, the University of Georgia, Go Dogs, the Ivy Leagues, and almost every HBCU and other prestigious colleges in America. I'd like to give them a hearty round of applause because they're doing a hard work, a civic engagement. Thank y'all. If you guys will meet us in the anti-room, we'll take a photo now. Thank you Madam. The chair recognizes Representative Ademia for a morning order. All right. Come on back. Come on back. Come on back. Hey, hey, hey, hey, hey. Come on back. And friends. Thank you Madam for term speaker. Colleagues, ladies and gentlemen, it's carnival time in Atlanta. I'd like to recognize the CEO of Atlanta Caribbean Carnival Patricia Edgings can you still write and her colleagues. They are doing a vibrant Caribbean Carnival festival that they have had for the last 38 years in Atlanta, Georgia. The carnival features mix of music, soka, calypso, cultural pride, of course, food and involves a parade with colorful bands from all over the state. This year they're going to be having their parade starting from the peach tree to Ivan Rodney Cook senior park and they will have 15 bands performing and this will be May 23rd to the 25th of 2025. So let's celebrate the 38th year. Keep it strong. Keep the Atlanta Caribbean Carnival going strong and the culture. Let's give them a hearty round of applause. I'm by the way, I do have some San Vincent blood in me, my mom's from San Vincent and the Grinidines. Vincentians, let's do it. All right, all right. Thank you Madam. The chair recognizes Chairman Jasper's for another morning order. Yes, Madam Speaker, thank you for letting me have another morning order today. And they just made it in. If I get your attention, I want you to look up in the stands here. Miss Jasper's, we have your friends stand up please. Okay, I've got the cutest bunch of kids here. Who you have in the stands right there upstairs right now is what we from Pickens County called the Cowboy Church. Now they do have a fancy name. It's the Academy at double H ranch. And they're come today from their school. They have a K-12 school, Rambo, Rebecca Hampton, Ray Rebecca. There you are. And she has the founder of this school and has doing the Lord's work. I'll tell you, Rebecca, you're a hero to our community educating these kids. And they've done it for years. We appreciate what you've done. You know, we're going to have them out on the stairs in a few minutes. All these kids, even the six-year-old has memorized Psalm 1. And we'll do it out on the stairs in a little bit. But thank you for what you've done for the kids of our community and what Cowboy Church and the Academy does and parades and your fabulous Friday program. And we appreciate you very much. Thank you. Thank you Madam Speaker. Chair recognizes Representative Reese from Morning Order. Madam Speaker, thank you so much for this time for special acknowledgement. Many women of this chamber. I want you to join me in today and welcoming my mother who is here with me today. Ms. Cara Pras if you would please stand. Madam Speaker, a year ago, my mom had a very, very serious back surgery. And things got a little tough. And we were not sure what plans God had. And as I drove from making back to Columbus, I prayed for making all the way to Fort Valley for God to send me my family in Andrew to help God us to preserve her life, to keep her here with us just a little bit longer. And God led me to call a member of this body. Representative Dr. Michelle Owl. She answered the phone at 10.30 at night. And I'm sure she would have done this for any member of this body or any of her patients. And thank God, after that, my mom went into a coma for five days. And the toughest thing a child could do is sit there and look at twos. In their mother's throat. But I believe in God every step of the way. And so on behalf of my mother and behalf of my family, I want to present Representative Michelle Owl with these flowers on behalf of my mother, Michelle. Dr. Owl, if you would come down. And we also have a resolution. And Madam Speaker, I just want to say thank you to Michelle. And all the health workers that do an amazing job that taking care of us here in Georgia. But Michelle, you played an instrumental role in preserving the life of the lady who gave me an opportunity to have space on this earth. Thank you so much. These for you. And here's a resolution. On behalf of this body. Thank you. I want you to be a follower. If you guys will come down to the third floor, we're escort you down to the entry room for a photo. Thank you. Thank you, Madam Speaker. Chair recognizes Representative Bennett from Morning Order. Well, good morning to all the women legislators on both sides of the aisle. Want you join me this morning. We are here today to recognize women in our community. This morning was our 10th annual NICY-T Randall Yellow Rose Servant Leadership Award. We may have some of our recipients awardees in the gallery. Want you to stand and be recognized. Madam Speaker, today we recognize over 31 servant leadership, servant leaders in our community. Female, so we wanted thank you. Welcome to your state capital. And Madam Speaker, we owe the well. Chair recognizes Representative Panuch and Cahann from Morning Order. And many friends. Madam Speaker, you are welcome to be here. Good morning colleagues. Most Jewish holidays can be simplified down to. They try to destroy us. We won. Let's eat. Today's cookie is brought to us by the American Jewish Committee and American Rabbinical Association members who are in the gallery. Talking about the story of Purim, which comes from the book of Esther. In ancient Persia, the King chose Esther as his queen, unaware she was Jewish. When the King's advisor named Heyman, we boo when we hear his name. Became in rage that Esther's cousin Mordechai wouldn't bow down to him. Heyman. Heyman. Boo. Boo. Plot it to kill all the Jews in the empire and convince the King to issue this decree, choosing the date by casting lots. Risking her life, Queen Esther revealed her Jewish identity to the King and expose Heyman's Heyman's plot. Heyman's plot. Heyman's plot. The King had him hanged on the very gallows Heyman. Heyman's. Heyman's. Head built for Mordechai. The Jews triumphed and Purim celebrates his victory with a reading of the book of Esther, costumes. I am now Wonder Woman because I'm usually Queen Esther. We get drunk. Charitable giving and exchanging food gifts, including Haman Toshin, which is the cookie, named after the three corners of Heyman, Boo. Head. Our cookies are brought to us by American Jewish Committee and Sam Halper and Alex Harold Ben Lesions, Jacob Rogo, and from the American Rebinaural Association, Rabbi Dan Dorch, Brook Rosenthal, and AE Rosenthal. Let's welcome them to the People's House. Please come down for pictures and hug Purim Samer. Happy Purim. Thank you. Dean Green, Chairman Green. Representative Gerald Green is recognized for a morning order. Representative Green. Thank you, Mr. Speaker. Ladies and gentlemen, we have a guest here and two of the advisory boards for the Reesa Board. Amy, say if you're in the balcony, would you rise with your advisory group there? They may be still in the Senate over there, but they do an outstanding job, and especially Amy, as she advises these groups and works with them throughout the area. Thank you so much for what you do. Thank you to all educators, and especially the Flint, Chattanoche Reesa Group. Thank you so much, Mr. Speaker. Thank you. We're Barchett, Representative Williams, Representative Reese, and Representative Sharper. Recognize for a morning order, Representative Hering, your own deck. Hey, Ted James, Barchett, to get over here. He's coming. Ted Erees. The gentlemen are recognized. I think we had, thank you, Mr. Speaker. I want to recognize some ladies in the gallery. If you stand up for us, we've got members of the Sigma Gamma Roe sorority, and one of those fine ladies is City Councilwoman from Valdosta in Senator Tully. So we very much appreciate you all being here. Help me welcome them. Thank you, Mr. Speaker. No, also, Mr. Loana Bairon. Thank you so much for everything you're doing. And everybody together, thank you. Representative Hering is recognized for a morning order in friends. Thank you, Mr. Speaker and members of the House. I rise today to recognize an institution that is redefining what it means to be a college and career-ready graduate at WS Hutchings College and Career Academy. Hutchings is not just another high school. It is a direct pipeline to success, giving students real-world experiences, industry certification, and a head start in their future. By the time students graduate, they can earn up to 30 hours of college credit in turn with industry professionals and high demand fields, obtain certifications such as certified nursing assistants, emergency medical technicians, and gain real-world experience through corporations, corporations, partnerships with Coca-Cola, Geico, and Purdue. Hutchings operates on a simple but powerful principle. Education should open doors, not just issue diplomas. With a strong focus on college career and agriculture education, students are given the tools to graduate ready to step into the workforce or continue their education with a year's worth of college already completed. None of this would be possible without the leadership of Dr. Cassandra Miller, Washington, the executive director of CTAE and the CEO of Hutchings Academy and Career Academy. Dr. Washington has dedicated her career to ensuring that every student, regardless of their background, has high as a high-quality education and has a pathway to career and technical education. Today we have Dr. Washington here. If you guys will give her a wave over there for all that she has done for the students of Macon Beop County and the students of Georgia, we want to welcome her to the house today and I also have a resolution for her. Thank you so much members and speaker, I yield the well. Representative Richardson has recognized for a morning order. Leader Higley, can you go next, ma'am? Thank you, Mr. Speaker. I just wanted to recognize the Harlem High School, Harlem High School baseball team are as in the people's house today. They have won the last two state baseball championships. They are 15 and know this year looking for number three and congratulate head coach Jimmy Lewis on achieving his 900th victory earlier in the season. So I think they're over at the Senate right now but thank you, Mr. Speaker. Well we're glad to hear 900 victories. That's pretty awesome. Looking for a three-peat. Good luck. Hope you'll be back. Yes sir. Thank you. Congratulations to Harlem. Leader Higley is recognized for a morning order and Representative Reese. Give the lady your attention please. Thank you, Mr. Speaker. We're honored to recognize a few special guests from Columbus. We have Miss Royal Anderson who is chair of the Muscogee County Democrats along with Mr. Anthony Johnson and retired Colonel Ace Campbell. Thank you all for coming to the people's house. Thank you, Madam Leader. We're representing Glaze is recognized for a morning order. This is our last one members. We'll get on to the business of the day. Thank you, Mr. Speaker. I stand and rise with any of the South Fulton delegation. Not the city of South Fulton but all of South Fulton. Today I want to recognize the Secretary of State Award for an outstanding Georgia citizen. Our elected City Councilwoman Angela Meeling if you would stand she has served 20 years as a City Councilwoman in the City of Union City and she has done it with integrity with her focus on children, on education, economics and our seniors. 20 years the longest serving member of Council in the eight cities of South Fulton and she is getting that Georgia Outstanding Citizen Award and we thank you for your service and you are have been an honorable representative. Come down. Thank you, Mr. Speaker. I yield the well. Ladies yielded congratulations quite the honor. That concludes our morning orders. Members we do have a local calendar this morning and we'll have third reading and passage of uncontested local bill. If there is no objection we will vote on the local calendar as a whole with a recorded vote. Period none is so ordered. Mr. Clerk will you read the local calendar? House Bill 699 by the Representative Wade in the Ninth Lawson County House Bill 701 by Representative Chocus the 151st Terrell County House Bill 714 by Representative Hitchens of the 164th City of Rincom House Bill 719 by Representative Year to the 150th Second Worth County House Bill 720 by Representative Year to the 150th Second Lee County House Bill 722 by Representative Stevens of the 164th Ryan County House Bill 724 by Representative Franklin of the 160th City of Pembroke and Senate Bill 238 by Senator Anderson of the 43rd Rockdale County. Thank you Mr. Clerk. Is any objection to the previous question being ordered on the local calendar? Hearing none the previous question is ordered. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bills? Hearing none the report of the committee has agreed to shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machines? Whatever lies ahead of it. Have all members voted? have all members now voted. Yes, so Mr. Clerk, were you locked machine on the passage of the local calendar? The Yays are 169, the Nays are zero. The bills have received a requisite constitutional majority or therefore passed. And inadvertently skip one member since we heard from all the other members of the house. On morning orders, we're going to recognize Representative Hong for a morning order. Representative Hong and friends for a morning order. Thank you, Mr. Speaker. Colleys. Today I stand before you to reflect on a symbol that carries the weight of history, a symbol that embodies the spirit, struggles, and aspiration of the people of the house. This is the old flag of Laos, the flag of the Kingdom of Laos. And this was a flag of Laos from 1952 to 1975 before the Communists took over. This flag symbolizes the sacrifices by the Laos people and their struggle for independence and freedom, for wealth and prosperity for the country. In 1975, the Communists took over the country and this flag was replaced. While the old flag is no longer the official symbol of Laos, it remains a cherished part of the country's history. It represents a time when the Laos people were united under a common cause and common identity for freedom and independence. To remind her of the sacrifices that were made and the hopes that were held for a prosperous and independent nation. We want to send a message to the people that are here in Georgia that you can proudly fly this flag for the country that you fought for and for freedom that you fought for. Many from our Laos community are here today, including those who fought in the Vietnam War alongside our American soldiers if you can stand up and if we can give them a round of applause. Thank you, Mr. Speaker. Members, I want you to help me recognize and welcome back to this chamber, a friend that we've seen him before, but he had a number of years of great service to the people. His former representative Charlie White says I'll make Charlie welcome back to the people's house. Okay, members, we'll move on to the rules calendar. Move on to the rules calendar. Mr. Clerk, will you read the caption to SB 81 SB 81? SB 81 to be titled back to amend Article 22, Chapter 1 of Title 10 of the EFCH, Georgia, annotated relating to motor vehicle franchise practices. So to provide protection of consumer data in motor vehicle sales or lease transactions, this bill, I'm referring to the committee unregulated industries that committee recommends this bill do pass. Chairman Ellen Powell is recognized to speak to Senate bill 8-1, 81. Thank you, Mr. Speaker and ladies and gentlemen, the House. This morning I work. Proceed, sir. Thank you, Mr. Speaker and ladies and gentlemen, the House. I bring you this morning House Senate bill 81, which amends the Georgia franchise practices act. Just a brief history and sense we've had so much going on this morning, so I'm going to try to be brief. But the history behind the Georgia franchise practices act, this legislature has always known the importance of the auto bill franchise. And we did the franchise act several years ago, even to the importance that in 92 there was a constitutional amendment that established the need for franchise practices act between manufacturers and auto dealers. Now the reason for that is, then and it probably isn't a lot of cases unless you're buying jewelry for your better half. And that's an automobile is your second biggest purchase behind the home. And that's the importance of this. Have us off till we do an amendment to the practices act and I'll tell you up front that this was agreed to by the auto manufacturers and the dealers, the new car dealers in this state. Generally what this does, it puts new language into the modern changing technology. It defines recall services. It emphasizes the benefits of competition in the franchise system. It introduces new technology and supporting and maintaining vehicles. Data, something that's key to everybody's mind and new life we live in. It's an authorized access or sharing of dealership data. It prohibits third parties from limiting dealership's ability to protect and store information and data. It allows data and integrators to access data, permits dealers to continuously audit that. It allows dealers to do backup on this. It requires a manufacturer to compensate franchise dealers when they're doing what is called OTA, which is over there. A lot of y'all ask that question what that is. The auto manufacturers they have chips in the new cars. It sends back data to them on all the stuff in your car. So when you have to go to dealership, dealership has to repair it. So that deals with that information on the OTAs. It requires manufacturers to disclose how to fix it and the parts that need to be fixed on these accessories. The allocation process, the dealers or the manufacturers are going to be required to tell how they distribute vehicles and cars to the auto dealers. It defines a reasonable quantity of vehicles and parts. Increases the transparency of the allocation process. And it clarifies as what's excusable to the manufacturers. And lastly, it also puts specific language in there about showrooms and galleries for these cars. So it's again that this has been worked out by the manufacturers and the George Automobile dealers. And I'll be more than glad to answer a question, but I hope there's none so we can move on and I'd appreciate your favorable consideration. Gentlemen, how's it? Jim and you have four questions? Yes, sir. Jim and Parsons to your left has recognized four questions. Thank you, Chairman. Jim and you? Yes, sir. Yes, sir. It's a 16 page bill. And isn't true. The gentleman's done a very good job presenting the bill as always and I appreciate that. I have several questions, but I'll just ask the one. On page 15, it says for the purposes of this code section, activity as a new motor vehicle dealer, shown on include and then I guess this is a subparagraph, something or other, the disclosure of a manufacturer suggested retail price. I mean, why is that? I mean, don't they normally on the sheet that's on the window of a car or a new car? Doesn't it have that retail price? I think that's optional. That a lot of the manufacturers, they don't want to put a solid price down. And if that's their requirements to a dealer, I think that's the reason. I mean, this is new language though, isn't it? It says the date. It can be. They shall not. Well, they say it shall not, but that's the language that's worked out between the auto dealers and the manufacturers. It does not work that with the citizens of Georgia though, is that not true? I also promote the, it promotes competition in this industry. Thank you, sir. Thank you. Gentlemen, you have one more question. Yes, sir. Representative Ramon, of the Senator Owl to your left, his recognized request. Good morning, this is gentlemen Neild. Yes, ma'am. Thank you.\n\nSo in lines 260 through 270, it says that a dealer data systems vendor authorized integrator shall not be held responsible for any action taken directly by a dealer. And in the second section, essentially, that's vice versa. Why are this, why is this language in here? Because my concern is that if you as a vendor give access to the dealership, to that data, and somebody there happens to leak it, then shouldn't both parties be responsible because both parties are supposed to be taken care of that data. And there should be redundancies in protection of that data. First and foremost, I didn't write the language attorneys write this language. So a lot of times that seems to be redundant, especially when we're talking about data sharing. But the principle of this is that if you're an auto dealer, you have a customer data that the manufacturers don't need to have access to. And the manufacturer sometimes has data that the dealership doesn't need to have access to. Mr. Speaker, if there's no other questions, I would ask this house for favorable consideration. Let's move this back for final passage. I can't believe it's said it's got to be able to probably won't need fixing. Thank you. I think they perfected it when they asked you to carry it. You did a great job of explaining this. It's a good bill. Jim is yielded well. Thank you for bringing us the bill. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee's agreed to. Shout this bill now passed all in favor of the passage of the bill. Will vote yes. All those opposed? Will vote no? And Mr. Clerk, will you unlock the machine? Have all members voted? What purpose does Ripley Franklin rise? Mr. Speaker, I'm pursuing the rule 133. I would like to recuse myself from the vote. The gentleman has that right, the record will reflect that the gentleman's exercise rule 133. Rule 133. For what purpose does Ripley to have to rise? Thank you, Mr. Speaker. Parliamentary inquiry. State inquiry. Is it true that this bill does not interfere with the state's requirement. The employees of the Department of Motor Vehicle registration to maintain the privacy of all Georgia customers and the integrity of their information. I'm sure the lady has read the bill and that's correct, but I think you come from that world too, don't you? Absolutely, sir. Absolutely, I know the lady knows of what she speaks and we appreciate her insight and her participation. All members now voted if so, Mr. Clerk, will you lock the machine? On the passage of Senate bill 81, the yeas are 165, the nays are 5. The bill, Henry C, the records, the constitutional majority is therefore passed. Thank you members. Mr. Clerk, will you read the caption to Senate bill 139, 139. Senate bill 139 by Senator Dixon to the 45th and others to be entitled, the mandate to incorporate the City of Mulberry, April February 13, 2024. Mr. Bellam, been referred to the Committee on Intergovernmental Coordination. That committee recommends that this bill do pass. Thank you, Mr. Clerk. Majority Leader, ifstration is recognized to present the bill, representative ifstration. Thank you, Mr. Speaker. Well, ladies and gentlemen of the House, I bring to you today two bills from the Senate dealing with the City of Mulberry, my home city. And before I get into the substance of each of these bills, I just want to remind you of some of the history or maybe make you aware if you're not aware already. Last year, this body voted in a bipartisan manner to create a new city in Gwinnett County called Mulberry. Now, as part of the legislation, it had to be on the ballot. And it was voted on by the residents that make up my district and passed with 58%. A very strong vote considering the resounding amount of money that was spent, dark money, I'd classify it. Well, without clarity as to who was spending the money to try to oppose the measure. Nevertheless, it passed with a strong margin in the district that I represent. And members of the city council and a mayor were elected in November of last year. We actually have mayor Michael Coker, the mayor of the city of Mulberry here with us today in the gallery. Now, immediately after the cityhood vote passed, litigation was filed. It was filed to attempt to stop it from even being on the ballot. Shortly thereafter, after the cityhood vote passed at the ballot box, litigation was once again filed to stop the November council elections from taking a place. And at each and each of these lawsuits, they were not successful. It did not get Mulberry off the ballot and still was able to proceed to the voters. Now, at one point, actually the members of Governor Kim's transition committee, including myself, Representative McCollum and Senator Dixon, we were sued by Gwyneth County in our personal capacities. And as a result of, I've really lost count at this point, but I think seven lawsuits have been filed around this. Not one has been successful to date. It has required a great deal of time and has created distraction, which I think the opponents were desiring to perpetrate as part of this. But this background is important to give because when the mayor was elected in November, he immediately and council members started reaching out to Gwyneth County. They wanted to have a good relationship with the county government in order to work on service delivery agreements and other obligations. Obviously, a city of 41,000 residents, even in a county with a million population, it's still important to have a very good relationship and something that I have always wanted to take place and I know that the mayor and council has wanted to exist. Now, unfortunately, Gwyneth County refused to communicate with the city of Mulberry on issues like service delivery until legislation was brought here at the state capital. I'll get into this on SB 138, but it really wasn't until after SB 138 passed the state senate and was to be considered in a house committee that Gwyneth County finally responded and indicated a willingness to just communicate about service delivery. I mean, this has been a very unfortunate situation because of what Gwyneth County has caused. In fact, as the mayor of Mulberry testified in committee and as was quoted in the Land of General Constitution this morning, the mayor said, I feel like I'm in a mafia movie. We have had a situation where a stop sign has gone unreplaced in the city of Mulberry, according to testimony, speed bump projects, uncompleted. There were permitting applications that were submitted to Gwyneth County up until December 31st. Gwyneth County took the applications, took the money, as it's been conveyed to me, they then sent a mass email out at the new year said, you all need to go to Mulberry. They did not refund the application fees. They didn't even provide the applications to the city government so that the city government could process these. I mean, the bad faith is really breathtaking here. So this has been further, just two other quotes here, Senator Dixon testified in committee that Gwyneth simply would like to see Mulberry go bankrupt and be starved out. In an email that was received by an attorney around the litigation, a lawyer representing Gwyneth County made a statement that until Gwyneth received a satisfactory ruling in court, I quote, conditions will continue to deteriorate in Mulberry. Conditions will continue to deteriorate. As I understand it, that was an email, but that message was sent by the lawyer. This type of bad faith, this type of gridlock, and the refusal to provide the constituents that I represent with column and other members will represent. From receiving the services that they are entitled to that they pay for with their property taxes is unacceptable and it does warrant action by the general assembly when things get this bad. So what I'm presenting to you here today was Senate Bill 139 is a very reasonable annexation proposal, which would just capture certain parcels which are near or associated with the city in different means. Now the map that was presented in committee made clear that these are parcels, primarily commercial parcels, where maybe the city is on one side of the road and we're simply asking the annex, thank you, the map is up there. We're asking the annex area on the other side of the road, legislative annexation. This was requested by the city of Mulberry and is critical to ensure that we have the community of interest being maintained in the area that's impacted. The areas to the right, that's yellow, but that's actually the city of Auburn. That's not part of this. That's just a different color of yellow. The yellow parts are the areas that's before you here today and 139. This legislation is critical because ensuring that we have continuity of services for the constituents that I represent and the areas that are, say, at a busy intersection or important commercial parcels, which are so very near and very much impact the city that they be included as part of the city. This is commonplace historically in my experience where when we do have new cities come online, there may be a legislative annexation that very nearly thereafter follows to ensure that maybe the boundaries weren't exactly as they needed to be last year. And so this will help to clear that up. Now I want to make clear every representative who's district this touches, every representative who represents Mulberry supports this legislation. Every representative who voted on the creation of Mulberry last year, who represented the city or the surrounding area, including members no longer with us, bipartisan groups supported it on the ballot on the floor. The issue here today is that members from other, the reason that this is before you is because members who do not live in Mulberry or near Mulberry are objecting to Mulberries, self-determination to ensure that the city can operate be successful in the same line that we have seen from Gwinnett County. So we are requesting your support of this measure here today. This legislative annexation is reasonable under the circumstances. I ask for your favorable support of SB 139 so that this can be the second to last Mulberry bill that I bring to you this session. I'll finally say there is a minority report on this bill which I think is important to just point out the inaccuracies in the minority report. It's really shocking inaccuracies. The minority report says that there are unnecessary financial burdens that will put on residents and small businesses. There is no city property tax in Mulberry. There is no city property tax. It is inaccurate to claim that this is going to result in a tax increase. Simply money that is currently being paid to Gwinnett County Government would be received by the city of Mulberry. It's just a different receiver of the funds. It is not an increase in financial burden. Additionally, it's characterized in the minority report that this is in some way a detraction from historically how we've handled annexations. I wholeheartedly disagree. I have been down here some time. And in my experience when there are members who represent an area who fully support it, the body supports the measure. Because those representatives know and are able to voice the concerns and cares and wishes of the constituents that they represent. We do not, as a matter of course, live in other parts of the county and stand up to object to the requested annexation or associated legislation for a new city government. What's unprecedented about it is members who do not represent this area wishing to speak against this bill, vote against the bill in committee, and actively oppose the desires of the constituents that I represent, represent McCullum represents, and the other legislators who have been involved in representing this area, present and past. I ask for the body's favorable consideration of this measure. Mr. Speaker, I'm happy to answer any questions. General has numerous questions. I want to just make the members aware that we don't have a time limit on this discussion. But by Speaker's priority, we are going to limit discussion on those opposed, those in favor of 30 minutes each. So I let the members know to have questions. There are a number of members signed up. And I'm looking at probably an hour and a half, fourth of comments on this potentially. So we'll take some questions at the gentleman we're yielding. We're up to you. We're up to you. Now to your left is recognized for a question. Ladies recognized. Thank you, Mr. Speaker. Mr. gentleman, you. Yes, ma'am. What services will the city receive from the county and which services does the city going to provide for their residents? It's quicker. Yes, ma'am. It's quick for me to tell you what the city will provide, which is limited. So, statutorily it will provide planning and zoning, inspections permitting, and storm water management. So who will provide your fire and police? Gwyneth County. And that's consistent with the legislation that we passed last year. Is it not true that I do serve on governmental affairs? Yes, ma'am. Thank you. Yes, the best of my knowledge. And thank you for the question. I'll just finally say the legislation make clear there's a transition period where that service delivery is not to be in a rubbed. And the problem is, where you're seeing concerning conduct like the interruption of that despite the charter being very clear on that. We're sitting very france as we, Mr. Left, has recognized our question. Does the gentleman yield? Yes, ma'am. So, is it not true that next time there is a bill that is concerns my county cob and is taken from the local delegation and handled as a general bill, I will be using some of your testimony comments because I think you make some excellent points. Thank you. Well, I appreciate what I'm interpreting as your favorable support of my bill. No, sir. Thank you. Oh, okay. Well, one can wish. We're all entitled to one mistake. Let's see. Representative Ramon, up the center out to your left is recognized for a question. Then you have one more. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Is it true that there's about 535 municipalities in the state of Georgia? That sounds about right. And is it true that none of them have gotten three general bills in this session? Well, I cannot speak historically as to that. I will say that the blatant bad fate, the refusal of Gwinnett County to be a good local government partner, has necessitated this unfortunate situation. If Gwinnett County would simply change their approach and buy into the fact that the voters in the district that I represent won't local control the planning and zoning without imposing a property tax, that this would go much more smoothly. And my hope is that that will change in the future that Gwinnett County will be a better partner. Representative Moore to your left. President Angela Moore is recognized for a question. The gentleman yield. Yes, ma'am. Is it true that this measure would actually bypass the conversations between the county and the city? No, ma'am. And I'm presenting SB 139 right now, which is the legislative annexation. You may be talking about 138, which I'm happy that it's okay. Well, no, ma'am, I disagree. Legislative annexations take place here at the Capitol all of the time. And it's a reasonable measure under the circumstances. Is the gentleman for the yield? Yes, ma'am. So the negotiations between city and county, we have that issue in my county. So I would think that a measure like this would actually interfere. Is it not true? I understand the ladies' perspective on it. I just disagree. I think legislative annexation is very consistent with when we have a new city in place, we need to capture partials which may have been just outside the borders of the city. Mr. Speaker, I'll yield for one more question. Representative Carter to your left. Wait for your left. That's the gentleman yield. Yes, ma'am. Is it not true that normally a new city would go through the biennial process that maybe would relieve some of the issues that we're having now due to the fact that this particular legislation was rushed through in one session versus the biennial session? So I disagree with the, again, I'm going to try, I respect the question, I'm going to try to not re-argue the charter passing which was adopted by this body on a bipartisan basis last year. What I will just say is that consistent with the circumstances, it was very reasonable for this body to approve the charter which we did, the House Incident did, Governor decided in the law and it was approved by local voters under the circumstances. As you know, it is consistent with the law to do so, there's no violation of the code by doing so and it was appropriate. Okay, does the gentleman further yield? Yes, ma'am. So I'm going to try to ask it differently so maybe we'll get the answer. The fact that it did not go through the normal two-year process, is it not true that some of these boundaries and the annexations that we're considering now could have been worked out in a two-year process? So no, ma'am, I disagree. The legislation is passed and something that I've been very consistent on is all representatives who represent the impacted areas would need to support the measure. All the representatives in the impacted area here support the measure. There was a bipartisan outreach that occurred last year, ultimately the legislation just encompassed two members, parts of two members' districts, but it passed on a bipartisan basis on the floor. I don't believe that two years would have changed that whatsoever. Mr. Speaker, I will yield the well as for the body's favorable consideration. Thank you. Thank you, Mr. Leader. Thank you, members, for that conversation. We're going to have folks who are opposed to the bill. They'll have up to 30 minutes and we'll begin that discussion with Sam Park and representative of Corier and representative Mitchell, Y'all are on deck. Not you. Representative Park has recognized, speak to the bill. Thank you, Mr. Speaker. Colleagues, I really do find it unfortunate that we are up here yet again, spending valuable and limited time as a state debating a local issue. Colleagues, you reap what you sow. You reap what you sow. Are we not taught that? And as one of my colleagues noted earlier, the formation of a city typically takes two years, two years by well-established rules of this body, of the majority party, the majority of this body. To say otherwise, I think is misleading if I'm going to be generous. The creation of this city was rushed. You can't argue that otherwise. That's why we have to keep fixing these issues over and over and over again. And let's be clear what the problem is. When it has 15 other cities, who do not have these issues? Just last year, there was a bipartisan annexation bill from a member who carried, in the majority party that had no issues. I have a bipartisan annexation bill for the capital city of Wunette County. Because the purpose of ensuring sufficient time is so that the city and the county can negotiate with one another. I've heard repeatedly that, oh, this doesn't affect other members of the Gwyneth delegation. How dare they oppose this when the two local members who represent the area supported? Well, annexation impacts every single citizen of Gwyneth County. It impacts every single legislator who represents and is a member of the Gwyneth delegation. Because it is county money that is otherwise being taken away. Now I think it also very, very important to make clear, I think, some misleading comments or some mis-truths. The city of Mulberry states that the county won't talk to them. I heard in committee that one of their elected officials had not in the past three months had any communications with the county that it was radio silent. That could not be further from the truth. I do not appreciate being lied to in my face in committee. I do not appreciate when any member in committee is misled. There is multiple plenty of evidence and written documentation that show that the county attorney and the city attorney have been communicating with one another. Gwyneth County has been providing essential services this entire time. Police, fire, EMS, water, sewer, saw the waste and storm water. On October 24th, the city sent an official notice to the county that stated they would take over permitting and inspections on January 1st and they were not ready. The city was not ready. On January 8th, the city sent a notice to the county that an IGA was being prepared and will be sent over for review. That never happened. Instead we got 138, another bill that we will talk which is blatantly unconstitutional. We are setting dangerous precedent of the state coming in and forcefully requiring Georgia citizens to be annexed against their will. That is a precedent that the majority party is setting. Three weeks ago, the county sent over a proposed intergovernmental agreement to the county and received no response. Again, the county and the city are trying to talk with one another. But SB 139, SB 138, these pieces of legislation is the state interfering with what otherwise should be a local process, wasting all of our time. Now I have heard multiple times of some issue and concern regarding a road. By state law, the county cannot take responsibility of right away without an IGA once the city is incorporated. So again, our last thing I will say, reasonable annexation, especially since we are on 139. When is it reasonable to forcefully annex someone against their will without notice or vote? This is self-determination of Republican politicians, not the people of Georgia. This is not how we should be doing things, especially in this moment and time. And so again, I find it very unfortunate and a waste of every single member's time to continue to debate what is otherwise a local issue in which as legislators and leaders here in the state, we should be pushing our counties and cities to find compromise as opposed to forcing the state or whoever is in charge to do whatever one city wants, one politician wants. That's not how things should operate and it sets a bad precedent, not just for this body, but it sends a bad signal to the next generation of leaders. As I said earlier, might make straight. That's not who we are as Americans. And so again, I strongly urge all members of this body to vote no to SB 139. If you all want to stop hearing about these more various issues, vote no. Walk. Because we got another one coming up. Thank you, Mr. Speaker. Are you the well? Mr. Will. Is you the well representative Park? Representative Gabe Coillet is recognized to speak to the bill. Mr. Will. Thank you, Mr. Speaker. My friends, it's not often that I come up here to talk about any bills, but I have had enough of Mulberry City. I have had enough of it. I mean, what we're doing here today is probably one of the reasons why you heard earlier that there seems to be some bad blood between the city and the county. Because I can assure you without any doubt that the city's attorney and the county's attorney have been working together to try and resolve these issues. If you bypass them and come here to resolve it for them, how do you think the county will feel? Let us encourage, I'm not here to oppose Mulberry City ladies and gentlemen. It exists. I'm not here to oppose it. I just want to encourage, I think it was about last week that we had a priest talk to us about encouraging each other. I want to encourage the groups to give a chance to the attorneys to work these things out and make it right and force it down the troops of the landlords in the area. Because I think it is not right. Last week, then we just approved from an accession to the same city of Mulberry. We did it just last week. I'm representing part of Florenceville and we are going through the process of an accession. A large area and it has been going smoothly. I am very sure that if we hadn't heard this, but wouldn't be here talking about this Mulberry City every time, I come up to speak just because I am tired of it. We can use our time for better issues than Mulberry City. Am I saying, if you hurry?\n\nTo dig up a tuba of yam and it breaks, you spend time stripping down to dig up the balance. We heard it. I mean, the proponent of this bill is a good friend of mine. We self-todayda and the Gweneff Planning Commission. But what is right is right. We must not keep talking every time about this. I heard the presentation made that this and the next bill will be the last for this session. I guess we'll be ready for a hundred for the next session. But what I'm saying in effect is not very enough. I want to ask you to vote no, not on the city. The city exists. I am not opposed to Maubari. I am not opposed to it. What I'm opposed to is back cutting the process while it's going on and making things and creating more bad blood between the city and the county. Less encouraged them by voting no on these so that they will have time. The city's attorney and the county's attorney to work out their differences amicably. And Mr. Speaker, thank you and I hear the well. Gentlemen's you the well. Thank you, Representative Corrie. Representative Billy Mitchell has recognized the speak to Senate Bill 139. Representative Mitchell. Thank you, Mr. Speaker. Let me start off by giving just a little historical perspective although we don't much concern ourselves with the already any more around this place too much. But let me give go back to a time that some of you may remember. When bills came to the floor, we had slips in our desks. When we could make amendments, we could make suggestions, we could really debate and deliberate upon bills. There was a member that you all from me with, Calvin Smire, who used to be chair of the rules committee at the time, who tried his best to mentor me. And he would say to me that if your proposals can't withstand the scrutiny of debate and deliberation, then it does not deserve to become law in any event. Now I say that because it is becoming the same way with local legislation. Some of you may remember where local legislation used to be psyched or safe. It would be up to the local delegation to decide the voters who elect those folks and can hold them accountable. If some Atlanta legislators were to try to make a proposal that only affects Blue Ridge, Georgia, I think that you would see how ridiculous this is. I understand, my friend, the leader, where we stand on issues is based on where we sit. And even though my district doesn't touch Moe Berry, part of my district is in Gwyneth County. And I have constituents that are calling often about how this bill will affect them as tax payers. I think what you all should be concerned with is the duality of process when it comes to similar proposals should concern us all, really should concern us all. My suggestion for you to be that this bill does not affect you. If you're not in Gwyneth County, I think you should excuse yourself and let those who this bill truly affects. This is a local bill that has been taken to a general process. And if you don't want folks from other parts of the state dealing with your neighborhood issues, then this is the bill that you should not support. And Mr. Speaker, I will yield the well. General, as you will the well, thank you for your comments. Now we have one speaker in favor that's represented Donna Tucci and the lady will have up to 30 minutes. Did you say you won't take that long? That's what she said. The lady is recognized. Take what you need. Thank you, Mr. Speaker, colleagues. Today I rise to express my support for Senate Bill 139, a bill that seeks to redefine the corporate limits of the city of Mulberry. My background is in land use, particularly as a member of Gwyneth County Planning Commissioner. When I was running for office, one of the most frequent complaints raised by my voters to me was the issue of growth in Gwyneth County, specifically high density apartments and overburdening local infrastructure. In particular, my constituents watched as the city of Mulberry came into being to our north giving citizens within the city local control over planning and zoning. Now that I've been elected, I'm in a position to do something to give my constituents more control over growth in our community. This annexation bill allows the city of Mulberry to expand into my district, into representative Honds district, representative Martinez district, adding a set of parcels to the city limits. These parcels are a mix of residential dwellings, commercial properties, and undeveloped land located along the southern and the western borders of the city. With these parcels into the city of Mulberry, we'll allow my constituents to have a greater local voice over how this land is used and developed in the future, allowing decisions to be made by five locally elected city councilmen, rather than a majority of council commissioners who do not live in our community. I urge my colleagues to join me in supporting Bill 139. Let us demonstrate our commitment to responsive governance and the well-being of our constituents by approving this necessary adjustment to the city of Mulberry corporate limits. I yield the well. Ladies, due to the well, here's any objections to the previous question being ordered. Here in the previous question is ordered. Well, now here are our minority report. We have one speaker representing Jasmine Clark. You can be recognized. Representing for up to 20 minutes by rule the minority report. This rips into Jasmine Clark is recognized. Thank you, Mr. Speaker. Thank you, colleagues, for indulging me. I know that there are a lot of people who are kind of ready for us to put this to bed. Just to remind everyone, I am the chair of the Guinet Delegation. And I have spent ample time working with all members of the delegation on local issues. We have done annexation bills, we have done judge bills, we have worked together. And I have not had a hard time doing that with my delegation members. Regardless of party, my door is always open. My phone is always available. In fact, some of you probably have told me, hey, represent of Clark, look up. Because I'm always in my phone. It's always there. But here we are once again about the city of Mulberry. We have already had, including this one, two annexation bills. Plus, we will have SB 138 later, which is a bill that basically lays out a one-sided service delivery strategy that gives the city free reign to do whatever they want with a county's taxpayer money. But also tries to take away sovereign immunity from the county if they won't capitulate to those demands. That is not a negotiation, my friends. That is a hostage situation. And here's the thing. We have a delegation process for annexations. I stood in the well just a week ago and had the same exact conversation with you all. We have a process. All you have to do is present a letter of support from both the city and the county saying, hey, we have come to the table. We have done our work. Now it's your turn to do your job. We get a majority of the signatures of the delegation. And then we go on through the local delegation process. This delegation process mirrors the delegation process that many other delegations in this chamber has. So we are not doing anything special. We're not doing anything different. But this process allows for every person who will be affected by an annexation to at least know what's going on. So it really bothers me when we hear about, no one's talking to us. No one talked to the city of Mulberry. The county won't talk to us. Guess what? I'm the delegation chair. Members of our delegation, no one talked to us. No one talked to us. I really believe that we could have come to an agreement. Honestly, on these annexations, if that's what y'all feel y'all need, I don't think this would have been so much of an issue. But all we ask is that y'all talk to us. I love everybody in here. Y'all might not agree that and y'all might not love me back. But I love you all. And I don't have a problem speaking with any member of the delegation. Talk to us. So instead, we have gone through this process with the city of Mulberry. And let's, I mean, you've heard from multiple people already. This is a normally a two-year process, a biennial process that instead only took 20 days. It was a local process in the last session that was circumvented, or that circumvented the local delegation process. There was a feasibility study done by a private firm, which actually deviates from how the feasibility studies have been done for other cities. And apparently, when this feasibility study was done, they clearly overstated the actual feasibility, which is why we are here now doing an annexation of almost 200 parcels in Gwinnett County, 200 parcels. We're having to do that because somehow, some way in the beginning, what was feasible less than a year later is no longer feasible. And now we've got to grab more property. I think that should concern a lot of people. I think honestly, we need to codify this two-year process so we don't have to keep going through this. This process of the City of Mulberry coming into play is akin to that situation where your kid is in school. They come to your room at 9 o'clock PM, after dinner, housewound down, lights turned off, you're in the bed, getting ready to get under the covers and get some good sleep. And they knock on your door sheepishly and they say, Mom, I have a project that I need to do for school. And you say, well, when is it due, baby? And they say, tomorrow morning. And so now you're up in your PJs scrambling around the house, trying to throw things together to make this project work because you want to turn in something. And then the something that you turn in is really just thrown together. And now when you get to school and you get that grade on that project and it isn't an A, somehow that is everybody else's fault, but yours for throwing some stuff together. Here we are once again. Again, this city is taking up time and honestly sucking the air out of the room. Every other city represented by members of this chamber has managed to use their delegations normal legislative process to do their annexations this year. This isn't the first annexation bill that we've seen, but you know why we haven't talked about annexations because they all are on the local calendar. Mostly y'all have not even seen the actual bill that goes with the annexation of these other cities and towns because it's just on the local calendar. You push the green button, everyone went through the process, we're all good. The fact that we're having to sit here and have a debate about annexation because this one city can't seem to figure out how to do things the way everyone else is doing it, I find that problematic. We have had 74 local bills in this chamber. Five of them have been annexations, the town of Braselton, the city of Cochran, the city of Conjurs, the city of Canisau. Somehow they figured out how to do annexation without all this hoopla. In facts, like I said, y'all probably don't even remember that those places did annexations because all you did was push the green button on a local calendar. So why can't the city of Mulberry figure this out? Why do we keep having to debate when there is a process that skips all of this? So I know most of you all won't admit it now, but I've actually had some conversations with a few people and a lot of y'all have the same questions I have. And the question is why do we keep having to deal with the city of Mulberry? So here's one thing I will say. This issue is actually bringing us together across the aisle and bipartisan agreement that this is starting to get old. In fact, there are residents in the area themselves that are like, you know what? For once in my life, I'm actually on the Democrat side and you will never hear me say that. That's from the people that live there. So who says we can't come together and work together? I'll close with this, you all. At this point, remember that kid that told you about his project at the last minute and threw some stuff together? That same kid is now with you in the grocery store and they want some candy. And you have said no, you cannot have candy. And that child has said, you know what? If I can't have candy, I am going to throw myself on the floor. I'm going to scream and holler and flail because I'm not getting my way. And at this moment, we have a choice. Will we enable the bad behavior or will we put our foot down and say, stop it. Like you got some sense. Use your words. Come to the table. Let's stop using petulence as a political strategy. Let the locals do their thing the right way. Thank you, Mr. Speaker. I yoke the well. The lady has yielded the well. That concludes our minority report. Now we have to chair his time for up to up to 20 minutes. Leader, excuse me, chair lady camp. You are the chair of this committee. I apologize. I'd never do that again. Chair, ladies, recognize for up to 20 minutes. Thank you, Mr. Speaker. There were a lot of really good questions raised over the past hour or ever long this has been going on. Would this bill have passed if it simply had been on a local calendar? I don't know. Would it have gotten the signatures to simply be on a local calendar and it passed through? That would be the case. It would have been a whole lot easier for all the delegation just to have signed it. But for whatever reason, we've got a lack of communication. We have a lack of communication going on on a lot of fronts. The people in mold barrier, the collateral damage of not having the opportunity at this point. All counties are subdivisions of the state and cities are created by charters. Our job here is to represent the Georgians. This doesn't matter if they're in an incorporated in a city or simply a county resident. And for that, Mr. Speaker, I'd like to yield the rest of my time to the majority leader. Thank you. Chair has yielded the remain of her time to leader of strangeness. Gentlemen's recognized. Thank you, Mr. Speaker, ladies and gentlemen. I'm going to be very brief here. We're not here to re-litigate the charter that was passed last year. There were very strong reasons to pass the charter. As I've already said, it received bipartisan support, actually, a member of the other political party in the area voted in favor of the measure. In some ways, I feel like I've been a victim of, is that no good deed goes unpunished. My initial rule on when the charter was proposed was that only legislators who represent the area would be part of the city. And while there was support in the area, if a legislator was in any way unsettled about whether the area should be in the city, it wasn't going to happen if I was carrying the legislation. And then subsequent to, you know, we're now in a new year. And now the legislators who represent these areas are fully supportive of this annexation. So I guess, you know, for a talking point, that can be argued that it was done hurriedly. But it was done with respect for colleagues. You know, one of my first bills here in the chamber was an annexation for the city of D'Aquila, when I was a freshman member. It only impacted my legislative district that I represented in the House. It only impacted one state center's district. And you know what, the time I signed it, the state center, I checked in with the state center, he was fine with it at the time. And it passed on a local calendar. That was it. So this argument that this is in some way breaking with precedent. You know what's breaking with precedent is the new leadership of the Gwinnett County delegation insisting that a bill that only impacts the district, I, and select other members represent is suddenly the whole counties issue for a member to argue from this well that if you don't live in the county, you shouldn't be able to vote on this bill. How about if you don't live in the areas actually impacted up there? That same argument should apply. But I do not enjoy having to argue these issues very restricted to a very small area of Gwinnett County before this whole body. But because of the bad faith, the mafia movie style tactics as we heard from the mayor of Mulberry, we're left with no other choice. And it is my sincere hope that we will not need to have future legislation on this and that we can very briefly present the other bill 138 here today. I'd ask for your favorable consideration. Thank you. The gentleman's yielded the well. That concludes our comments pro-encon on Senate bill 139. Is any objection to agreeing to report the committee which was favorable to the passage of the bill? Here in the report the committee has agreed to. I shall this bill now pass. All in favor of the pass to the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk will you unlock the machine? For what purpose have all members voted, what purpose does represented court arise? Parliamentary inquiry. Statute inquiry. Isn't that true that the claim of the mafia movie is the one that's doing now because it served the local delegation process? I find all that conversation very interesting. For what purpose is represented to the early hard rise? Parliamentary inquiry. Statue inquiry, ma'am. It's not true, Mr. Speaker, that by passing SB 139 we are ensuring that the boundaries of the city of Mulberry accurately reflect both current and anticipated growth. And thereby doing so ensures the well-being of this new city. I'm sure the lady has her opinion. For what purpose does represented chess can arise? Mr. Speaker. The speakers are not true. The residents and next in the Mulberry will gain local control of planning and zoning without any city taxes. Sure, the gentleman knows a lot about local government because that's where he makes his living. For what purpose does represented be clean rise? Parliamentary inquiry. Statue inquiry, sir. Isn't that true that I've been a resident of Gwyneth County for 44 years? I believe that the gentleman says states I know he wouldn't do anything but to deal the truth for the inquiry. Is it not true that the people that there and next did not have an opportunity to vote to be a part of a city? I'll have to, I know the gentleman believes what he speaks and I'll have to certainly know in his background I wouldn't disagree with him but I don't have personal knowledge of that. Thank you, Mr. Speaker. I'm going to take one more representative, Hong, for purpose of your eyes. Parliamentary inquiry. Statue inquiry. Mr. Speaker, is it not true that this bill upholds the principles of local self-governance by ensuring that a city of Mulberry will have the resources and services necessary to function properly? Sure, the lady believes that we've heard a lot of discussion so I'm going to ask the clerk at this time to lock the machine. On the passage of Senate Bill 139 and 139, the A's are 96, the NA's are 74. This bill never see the record. The constitutional majority is there for pass. Mr. Clerk, will you read the caption to Senate Bill 138? 138. Senate Bill 138 by Senator Dixon, the 45th and others to be titled and act to amend chapter 31 and title 36 of the official go to Georgia and it's headed relating to incorporation of municipal corporations. So to provide for the transition of certain services related to newly incorporated municipalities in certain counties, this bill haven't heard the committee on intergovernable coordination. That committee recommends that this bill do pass. Representative, the administration has recognized to present the bill or represent the administration. Thank you, ladies and gentlemen. Thank you, Mr. Speaker. Ladies and gentlemen, I'm going to be much more concise on this. I know we've been debating Mulberry for quite some time. SB 138 is narrowly written to only apply to Mulberry and Gwinnett County and frankly, it is, well, all it is is to ensure that the transition for the new city is to occur a reasonable time table and that local services are provided by Gwinnett County with the threats that have been made with the failures of Gwinnett County to act as a good partner. This is necessary. Now, it's only to apply during the transition period. It's to make clear that it will provide the constituents that I represent with the assurance that Gwinnett will adhere to the transition procedures in state law and will include terms for Gwinnett's noncompliance in the future. We've been allowing for the recovery of attorneys fees by the city, as I mentioned, there's been extended litigation perpetrated by Gwinnett. Additionally, it will provide for a formula for calculating the actual costs of certain services within Mulberry and will ensure that Mulberry receives what would ordinarily be worked out in intergovernmental agreement, which is critical under these circumstances. Members of the House, I'm asking for your favorable consideration under the unfortunate circumstances of Gwinnett County refusing to act as a good partner with the city of Mulberry. The need for legislation is brought from Senator Dixon, will allow for a reasonable transition period so that the constituents that I represent who are paying property taxes to Gwinnett County actually receive the services that they're entitled to, that they're paying for. Mr. Speaker, I'd be happy to answer any questions. The gentleman has a question, Representative Jasmine Clark, to your left is recognize for a question. Thank you, Mr. Speaker. Does the gentleman use? Yes, ma'am. I just want to ask on this bill, you didn't really mention too much about the sovereign immunity piece. Can you go into that, please? Yes, happy to. The bill does include a waiver of sovereign immunity in circumstances where Gwinnett County fails to comply with law as to how Mulberry is to be treated just for this transition period. Does the gentleman further yield? Yes, ma'am. The way the bill is written, there is some confusion about who would be wa- who sovereign immunity would be wa- and there are some lawyers that are concerned that it actually would end up wa- wa- wa- the sovereign immunity of law enforcement officers because they are considered a part of the county government. Do you have any response or a way to call those concerns? Law enforcement officers enjoy a- a quality- a qualified immunity which is separate in a part from sovereign immunity that we're talking about here. So there'll be no impact to law enforcement officers. And I'll just say more broadly. This issue has been brought up and has been discussed. There's several bills pending here at the Capitol right now about a waiver of sovereign immunity. I have carried legislation in the past while I was a floorlier concerning a waiver of sovereign immunity for state government. It is very consistent with what we've done in appropriate circumstances to include such a waiver to ensure that the constituents that we all represent are able to seek redress, seek relief from government when it's appropriate to do so. When that county has any concerns about this provision, they just need to follow the law. If they just follow the law, it doesn't apply. Does it mean you have for one final question? One final question. All right. Mr. Leader, I appreciate you taking my final question. You mentioned earlier that annexations only affect the people in that area. And we're talking about basically codifying what this bill does is codify a service.\n\ndelivery strategy. And what you're saying is if they don't agree to this service delivery strategy, they would be in violation of the law and therefore wage sovereign immunity. Or they would lose their sovereign immunity. Is that not true? I disagree with the characterization for this reason. SB 138 deals with just the transition period. There's still a need for a Gwinnett and Mollaberry to work out a service delivery agreement for the future. The problem is when you have a county government stating what I consider almost openly about their intention to let conditions deteriorate until the county wins in court, that is a crisis situation. And it necessitates legislation to ensure that that transition can occur so that the discussion, the communication, so that an agreement can be reached. And to speak with that, how yield the well. Gentlemen, I have a few questions, but we do have some other speakers. He's yielded the well. We have folks signed up to speak in favor of an oppose. I'm going to recognize both groups for up to up to 30 minutes. Those opposed and those in favor. Will park, are you ready to go first? Representative Park has recognized to speak in opposition to the bill. Excuse me, Senate bill 138. The gentleman's recognized. Thank you, Mr. Speaker. Just for a moment. Mr. Wip. And then we've had a lot of discussion this morning. But the gentleman has some points he wants to make and he deserves your attention. The gentleman's recognized. Thank you, Mr. Speaker. Just a few points to note. Again, here we are talking about Mulberry. But again, with respect to what is unprecedented, what is unprecedented is a unilateral annexation in Gwinnett County forced through by the state. When we're talking about Mafia movie bad faith, again, that is the state coming in and dictating to local folks what they can and cannot do. That is bad faith. Not offers to send to intergovernmental agreement and efforts to ensure that both the county and the city can move forward. SB 138 is a gregious. When we're talking about a transition time, there are provisions in this bill subject to the sole discretion of the city that would make certain aspects indefinite. And definite, colleagues, I rise today in strong opposition to a bill, SB 138, that is both unconstitutional and fundamentally at odds with the principles of limited government, fiscal responsibility and local control. Principles that so many here in this body say they believe in. Well, colleagues, here is your opportunity to demonstrate that you believe in those principles with your vote by voting no to SB 68. At its core, this legislation is a dangerous overreach that undermines the integrity of our state constitution, erodes taxpayer protections and imposes unfunded mandates that will burden nearly one million Georgians who call Gwinnett County home. We should not and cannot allow this August body to substitute political power and political expediency for sound governance and our duty to protect and uphold the constitution of our state. So let's go over some of these constitutional violations. Stripping counties of official immunity. SB 138 unlawfully removes official immunity from county officials if they lose a legal challenge over municipal service transitions. The Georgia Constitution explicitly protects county officials from personal liability for their official acts. This provision is an unconstitutional attack on local government leadership and a chilling precedent for public service. Second, this bill strips sovereign immunity from Gwinnett County exposing them to costly lawsuits. Let's be clear, counties do not pay judgments. Tax payers do. This provision effectively functions as a tax increase, a Republican tax increase on every county, on every resident in the county, including those in this newly incorporated city, the city of Mulberry, and perpetuating these fights and litigation. We're still, again, when we're talking about good faith, bad faith, the city over the past three weeks has refused to come to the table. They have not done what they said in writing of sending over an intergovernmental agreement. So rather than come to the table in good faith, to resolve this dispute, rather than come to the table and negotiate this matter as a local delegation, you all heard from our chair and how reasonable she is. Y'all've seen how many bipartisan local pieces of legislation there are, Mulberry unfortunately remains the exception over and over again. So, again, so moving on. Third, SB 138 requires Gwinnett County to refund police district taxes to the city of Mulberry. Even when the city does not provide their own police services, this is an unconstitutional tax disparity that violates the uniformity clause of the Georgia Constitution. City residents would receive tax funds that unincorporated residents do not. Despite receiving the same level of service, as another example, the city of Mulberry agreed to provide stormwater services, one of three services that the city of Mulberry explicitly chose to provide, yet under this bill, under SB 138, the city will receive all stormwater fees that the county will provide, that county tax payers have to provide for services received only by the city of Mulberry. And this is not within a limited period of time. This is indefinitely indefinitely until the city says otherwise. The city keeps the stormwater fees, and yet the county provides the services. Where is the tax equity there? Let's put some guardrails and parameters into a transition period if that is the intent of the author. Fourth, the Georgia Constitution gives counties the power to provide police services, but it does not require them to do so. Yet, SB 138 mandates Gwinnett County to continue to provide police services to the city, which is an unconstitutional overreach. The General Assembly cannot compel a county to exercise a discretionary power. Lastly, with respect to the Constitution of our great state, SB 138 requires Gwinnett County to maintain roads and stormwater infrastructure within the city of Mulberry, while stripping the county of control over those assets. This means a county must fund maintenance without any authority over land use or development decisions. This is an unconstitutional forced subsidy that creates a financial win fall for the city of Mulberry at the direct expense of county taxpayers. We're talking a million Georgians. These are expenses that will fall on my constituents, on the constituents of every member of the Gwinnett delegation. So beyond its glaring legal defects, SB 138 is a direct assault, again, on the core principles I so often hear from members of the majority party. It undermines fiscal responsibility forcing counties to absorb legal costs, return tax dollars to cities, and maintain infrastructure they no longer control. This is reckless fiscal policy that will either raise taxes or cut services for nearly one million Georgians. This erodes local control, handcuffing counties by imposing state mandates on municipal and corporations. Local governments, not the General Assembly, should determine service agreements that serve their best interests. We have an unlimited government. We have an independent party of limited government. SB 138 expands the size and scope of government, removing sovereign immunity that will invite endless litigation, drain county resources, and ultimately burden taxpayers with the cost of political and legal battles. The only beneficiaries here, who will be the only beneficiaries, y'all, trial lawyers. We're talking about tort reform and we are opening up the second largest county to endless litigation. Where is the consistency from the majority party with respect to their treatment of a million Georgian citizens? So I've heard it said and perhaps you have too that these will be the last more very bills that you hear about. I doubt that. This legislation if here past today and signed into law will again trigger months if not years of litigation between the second largest city and the state of Georgia and this newly formed city that now clearly seems defective from the very beginning given its rushed process that gave no time for others to otherwise prepare. Unfortunately the city of Mulberry I think is getting a reputation that it certainly did not want and should not want with these unnecessary fights that are taking up so much time, so much of our time with so many big issues that we still have to debate. But ashamed. Now I've also made it clear now we'll say it again to both members as well as to the public. I am happy to let bygones be bygones. I'm happy to work to find compromise and help reconcile the city of Mulberry with Winnett County. However if this unconstitutional legislation passes I do not see a way back. It's not too late. Again I urge members to vote no to stop going down this unnecessary path of conflict. Vote no to ensure that this issue stops coming up. Vote no if you believe that we should put this the constitution of the state of Georgia first. Vote no if you want to demonstrate your allegiance to the rule of law, local control and fiscal responsibility. Vote no or walk if you are sick and tired of hearing about Mulberry and the problems it continues to cause. So with that Mr. Speaker I will yield for a few questions if there are any and if there are not I will yield the well. Gentlemen has a question to your left representing Park Canon. I will ask for a question. Thank you Mr. Speaker. Do you yield? Yes ma'am. Does the sponsor have bipartisan support from the local delegation on this bill? No. Again that's been one of the primary concerns raised. Members of the Mulberry delegation, as stated by the chair of our delegation, duly elected, never once did they come to the chair about certainly the annexation bills, certainly about this unconstitutional piece of legislation. They have demonstrated with their actions that they're in the majority. Unfortunately they will do what is right to the detriment of a million residents who call Gwyneth County home. Gentlemen has another question if you're yield. Yes sir. Representative Martinez, you're right in the back. Gwyneth County property facilitates the cityhood transition of Mulberry in accordance to the will of the voters. No sir. Again as I've stated repeatedly House Bill 138 in an unconstitutional manner requires Gwyneth County to provide services that and then refund the city. This bill, this piece of legislation allows the city of Mulberry to control infrastructure that requires the city to maintain and have control and utilize infrastructure that the county has to pay for even though the county has no control. Again this is unconstitutional. This sets a terrible precedent and will result in months if not years of litigation to the benefit of trial lawyers. Gentlemen you'll represent Martin to your right is recognized for a question. Gentlemen you'll for a question. Sir my chairman yes sir. Is not true you said we several times and Gwyneth County funds. Is that not true? Yes sir. Is not true that the county gets the money from the taxpayers and the taxpayers in Mulberry sending that to the county and all they're asking to do is for that money to come back and provide services to them so that they can control their local area and their local zoning and isn't it true that the money is from the taxpayers it does not come from the county. Mr. Chairman I would assert that the money is from almost 900,000 of the residents of Gwyneth County that are now going to be forced to subsidize services for this newly formed city of about 40,000 people. Where is the equity and fairness in that? I've seen on with this again as I had noted with respect to a potential violation of our state constitution regarding the uniformity clause that requires equity and taxation that is not present in this legislation. I want the city of Mulberry to succeed. The city of Mulberry will not succeed if we continue to litigate this issue and if the city of Mulberry unilaterally forces every single other taxpayer and Gwyneth County to subsidize its services for it alone. With that Mr. Speaker I will yield the well I think I've spent enough time trying to debate this issue and I know there are other speakers who would like to speak to the matter. Thank you Mr. Speaker. Are you with the well? Thank you, Representative Park. The gentleman is you with the well. Representative Audenio is recognized to speak to the bill. Representative Audenio. Thank you Mr. Speaker. Colleagues, I rise to speak on this bill. Not in support because we need to look at how the bill impacts local control. We need to understand the ramification of this bill. More importantly, local control is important to everyone in this chamber because we all represent a subset of constituents in the state of Georgia. I represent House District 110 which encompasses the cities of Grayson, Snowville, Lawrenceville, a little bit of Loganville and unincorporated parts of Gwyneth. All of us represent somebody, somewhere or some city. Now clearly in reading the bill, it targets just Mulberry. But let me walk you through the bill because I think it's important that I reference some lines in the bill and more importantly, I'll say follow the money. Line 26 defines county means a county with more than 15 municipalities. How many counties in the state have 50 municipalities? Gwyneth. Unfunded mandates on counties. This bill forces counties to cover legal expenses of newly incorporated municipalities. Even if the lawsuit is due to the new city's own mismanagement, this is on fair burden on the county taxpayers. Let's follow the money. Taxpayer giveaways to new cities. This bill requires counties to transfer taxes and fees to new municipalities with new municipalities and trying funds will be spent responsibly. This could lead to budget shortfalls for essential county services like public safety and infrastructure. And that's lines 88 through 101 in the bill. Follow the money. Undermines service delivery agreements by exempting newly incorporated cities from and renegotiating service delivery agreements. The bill disrupts the balance of local governance and creates confusion over who is responsible for key public services. Sided in lines 128 to 138. Follow the money. Shifts infrastructure responsibility without accountability. Counties remain responsible for maintaining major storm water infrastructure, but lose control over rights of way. Which could create safety and environmental hazards without clear oversight. This is cited in lines 71 to 87. Follow the money. Financially weakened counties. The bill allows new cities to opt out of county law enforcement districts while still receiving county policing services for up to a year. This could lead to revenue losses and cuts in public safety for unincorporated areas. Sided in lines 34 through 41. Follow the money. Legal loopholes encourages litigation. This bill waived sovereign immunity for counties and disputes with new cities making counties more vulnerable to lawsuits and draining public funds in legal battles. This is cited in lines 158 through 161. Follow the money. Create an unequal plain field. The bill gives new cities financial advantage such as election costs exemptions that existed cities never received. This is an unfair and arbitrary distinction. Sided in lines 139 through 143. Follow the money. Incentrifies reckless incorporation by making it easier for communities to break away from counties without financial consequences. The bill encourages hasty and poorly planned city formations that could lead to governance failures. This is cited in lines 168 to 188. Follow the money. Potential for tax increases. As counties lose tax revenue and take a new financial obligations they may be forced to raise taxes on remainder residents to maintain essential services. This is cited in lines 50 through 54. I can go on and on. But this bill for me as I read it is a money grab making the county paid for everything. This is an unbalanced bill of power for one participant in local rule. We should all participate in local rule and allow the county and the city of freeberry, I'm sorry, mulberry. Allow mulberry to sort their problems out. The county has a service delivery strategy agreement. And the lawyers of both parties have been in constant contact. Why can't we let them do the work for our constituents? Why are we here again? Because someone jumped the queue, not thinking of the impact that could have, they could have on other stakeholders. Normally we will get support from all our legislative delegation. But this is not the case. And that's why we're speaking up. Don't forget the story of the farmer, the snake, and the mouse. I know we've already that story. I ask my colleagues, let us fix this problem and not the symptom vote no on this bill. Let's not go down the slippery slope. Thank you, Mr. Speaker. I yield the well. Gentlemen, as you did the well, the representative doing the clean is recognizing, speak to the bill. Representative McLean. Thank you, Mr. Speaker and colleagues. I rise to strongly ask you to vote no on this bill. Mr. Speaker, I want to correct something. I moved to Gwyneth in 1978. So it's been 47 years and not 44 years, Mr. Speaker. I've been to Gwyneth 47 years. And I say that to say that I've seen a lot of things going in that county. I moved there in 1978. We had 70,000 people. A lot of you all heard this before. We had 70,000 people in Gwyneth County. Can you just imagine 437 square miles and you only got 70,000 people in it? Well, I was there as a 24 year old and not going to say any more than that. Because I want you all to understand why I'm opposed because it's a transition of certain services related to newly incorporated municipalities in certain counties. Certain counties. There are 159 counties in Georgia, but there's only one with 15 cities. One. So that's already grammatically wrong because it should say county, not counties. There's not another county in Georgia that has 15 more cities. So I have a problem with that. And as my colleague said, it is on line 26. I don't know if you all have read the bill. There's only nine. It is nine pages and 218 lines. And of that, 178 of them knew there's a lot of lines that are new. And I say that to them because I want you to know that you would see in lines 32 through probably 50, you see the word special district. So what I want to try to get you all to understand when you see the word county, Gwyneth is not mentioned in this legislation. It didn't say Gwyneth, but it's all about Gwyneth. So wherever you see county and commission, think about Gwyneth. One. Two. Wherever you see special district and you see municipality or city, say, just think about Loha Berry. But from now on, I will not call it Loha Berry because I will call it freeberry. You all heard my colleague, he freeberry because they want everything free. They are looking for everything free. They're looking for free police service. They're looking for free, free, EMS, free lawyers. I mean, everything is free. I mean, who wants to support someone that everything that they're looking for is free. When this came about last year, they say they were very influential city. You know, you know why they were very influential and they were a rich city. I see why they were a rich city and influential because they keep all their money. They get everything free. If they get everything free, you can keep all your money. You don't have to pay anybody. My concern is we've got to make sure that I represent the folks I represent. And I've said this before when we first started this is I don't care about I want Merrick Mulberry, freeberry, whatever been from now on to I wanted to succeed, but not on the backs of my constituents, not on my back. And I and I sure that with the author when we started this as long as Mulberry stands up on his own pays for his own services, they can do what they want to do. I can care less. Don't get me wrong. Mulberry is not a county. Mulberry is a city within the county and anybody that's in that county will be affected. I don't care what anybody say. If Mulberry wants to succeed and become a Mulberry County or freeberry county, I'll sign off on that because we can have 160 counties if that's what we need. I mean some of you all do not have even a county with 41,000. Some of you all do not have a county with seven counties with 41,000 people in it, but this city has 41,000. I'm going to try to speak to you all the way to some of you all know. My district in 109 is 6,000 acres. 6,000 acres is what my district represent in 109. A lot of you all we had to be earlier talking about going up in 2000 to 4,000 acres. Just think about my district in 109 is just 6,000 acres. It is a 9 mile square. Get your numbers out, get your pad out and you can you know you'll check it and make sure that I'm correct. That 9 mile square is what I have in Lawrenceville, North Cross, Duluth, and Littleburn, which is the heart of Gwyneth, the heart. So what I want you all to understand is you need to vote no on this bill. You need to vote no on this bill to send it back because it was not ready. It was not ready when it came up last year. Now all of a sudden we annexed in people that never voted for a city, but we did. And Mr. Speaker, I'm sorry. If you just annexed me, I did not vote for you. I could not vote because I was not there. I was not part of that boundary. So those folks did not have an opportunity to vote. So I want you all to realize you all have an opportunity to vote. There are 22 of us that represent Gwyneth, 22 out of this body of 180. That's more than almost one, that's one 10th. And I want you to be sure to you all that you should follow the majority of the Gwyneth voters because we represent more than the minority in this district. Mr. Speaker, I just want us to know that free-bearing, we need to make sure that the people know what's in this legislation. These nine pages, 178 lines, that is not for the citizen of Gwyneth. You know, again, I lived there 47 years, can't think of anybody in here who has lived there longer than I have. He might have been born there, but I have lived there. And I have seen it grow, and this is not the way that we should do things. We should do things properly. There's a process. And with that, Mr. Speaker, I do you the well. General, as you were to the well after 47 years, good work. Wasn't quite that long, Griffith. I'm glad you got me straight on that one. That completes all our comments, discussion from those opposed to Senate Bill 138. Now, we do have someone speaking favor. Representative Beth Camp is recognized to speak in favor of the bill. General, I declare. Thank you, Mr. Speaker. Thank you so much. Thank you, colleagues, for being today. I rise today in support of Senate Bill 138.\n\nIt is a bill that holds the fundamental rights of communities to govern themselves. This legislation ensures that when the people choose to incorporate as a city, that decision is honored, respected, and facilitated, not obstructed. SB 138 is not about municipal governance, it's about fairness. The voters in Mulberry, who are going at county citizens, made their voices heard, and they overwhelmingly choose to become a city. Now is the duty of this body to make sure that that decision is implemented. Smoothly, without unnecessary roadblocks or bureaucratic delays, this bill ensures that when net follows a clear and consistent process, when transitioning service system Mulberry, no city should be forced to fight what is rightfully theirs, simply because they chose to self-govern. The right to form a city is an expression of local democracy. It also, also communities take charge of their own future prioritizing their own needs and ensures that governments remain close to the people it serve. SB 138 strengthens that right by guaranteeing the transition to cityhood from Mulberry is fair, efficient, and free of obstruction. Colleagues, this is about respecting the will of the people when citizens vote for cityhood. Their choice must be honored. Their government must function as intended. I urge the support of SB 138 to ensure that the city of Mulberry received the services and financial resources needed. Mr. Speaker, I yield the will. The lady has yielded the will. That concludes our discussion on Senate Bill 138. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee's agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes, all those opposed? Will vote no, and Mr. Clerk, will you unlock the machine? All members voted. All members voted. This so, Mr. Clerk, will you lock the machine? All in the passage of Senate Bill 138, the yeas are 96. The nays are 69. This bill, and we see the requisite constitutional majority is therefore passed. Okay, members, here's our posture for the rest of the afternoon. We're at this house. We'll give you a heads up before I recognize the rules, Chairman. We're going to stand in recess until 1 o'clock PM, 1 o'clock PM. But first, I'm going to recognize the rules, Chairman. Chairman Parrish is recognized. Thank you, Mr. Speaker. I would like for the members of the rooms committee to meet me in room 341, please. We're going to have a meeting. Thank you. What time is your rules meeting? In about two minutes. About two minutes, this house will be in recess until 1 o'clock PM, 1 o'clock PM. We will get started again and finish our day so you can get all so you can all get home houses and recess. Members, I have your attention. Two things. Page photos. If you have a page here today, join me down front and rips in a big clean. Has an announcement. Give him your attention. Thank you, Mr. Speaker. I just want you all to know that the working family caucus is meeting room 307. And we will be talking about the mill health 307 CLOB and get you a little lunch. Working, working family caucus. Working family caucus. Thank you, Mr. Speaker. This house will be in recess. If you have a page, come on down.",
  "updated_at": "2026-02-13T14:40:12.496283+00:00"
}