{
  "video_id": "z8i4-aYOocs",
  "url": "https://www.youtube.com/watch?v=z8i4-aYOocs",
  "title": "3/16/23 - Committee on State and Local Governmental Operations",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 57,
  "summary": "Overview:\nThis Georgia legislative committee session focused on a bill (HB 254) to modernize laws related to legal organs in the state. The key discussion centered around addressing issues with legal ads not being properly published by newspapers serving as legal organs, as well as the declining number of local newspapers.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Representative Jacobs presented HB 254, which aims to address problems with legal ads not being properly published by newspapers serving as legal organs, as well as the declining number of local newspapers.\n- Representative Jacobs noted that this bill does not change any of the requirements on legal organs, but allows for digital ad placement to count as the first day of publication if the legal organ fails to publish the ad as required.\n- A representative from Columbia County provided examples of issues they have faced with legal ads not being published properly by their legal organ.\n- Committee members discussed the challenges posed by newspapers going out of business or shifting to digital-only formats, and the potential to explore a statewide digital repository for legal ads.\n- There was discussion around the increase in ad rates for legal organs, with the representative noting it had been around 30 years since the last increase.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nNo adjournment details provided.",
  "transcript": "You\nYou\nYou\nSo for me, if I can, because I always like ladies to go first, so I represent it a lot.\nYou want to start off?\nIt's actually representative bill.\nOkay, I was just trying to be politically incorrect.\nThank you, Ben.\nThank you, Ben.\nWell, good morning, members of the committee.\nI'm here to present House Bill 254,\nLC 491340S.\nThis bill modernizes legislation relating to legal organs.\nThis bill is brought because, you know,\nwe see a definite change in print media\nin the modern world, just looked at a study here\nthat says by 2025, a full third of our newspapers\nare projected to be lost by then.\nAnd this particularly impacts rural Georgia,\nwhere they're less papers to begin with.\nAnd over the last few years,\nwe've had legal organs cease publication\nand leaving counties without good options\nfor legal organs according to Georgia law.\nSo this visits that issue, it changes Georgia Law\nto make it easier for these counties\nto select a good legal organ.\nThe other part of this legislation\nis addresses the errors that seem to be fairly prolific.\nI have some research from Columbia County\nthat over the last five years, they've\ndecided 20 errors in publication that resulted in the\ninterruption of legal processes as a result of these errors.\nSo what this legislation does in section three is that it allows\nthe municipality or county to run the ad as currently required in the legal\nBut if the legal organ fails to publish the ad as as it was supposed to\nThey can now use electronic means to to back that up and proceed with the process\nBy with the the announcement on electronic means\nSo that change was section three the other thing that's addressed in this bill is under section two\nthis drastically increases the ad rates for legal organs, first 100 words, so have\nbeen increased from $10 to $15 and on subsequent publications nine to\n$14 per 100 words. So with that that's that's pretty much the bill from\nbeginning to end I'll stand for your questions. Or actually I guess I guess\na representative lot wants to present some Columbia County data for you.\nIf the chairman allows, I would like to do that.\nOf course.\nI know we spoke about that earlier.\nI came because we are having difficulties in Columbia County.\nAnd one example, just to explain why we even entered into this,\nwe requested through our legal organ and ad on May the 24th\nand listed the dates for it to run.\nOn June the 1st, when it did not run, we sent an email\nthat said, please run beginning 6-8.\nOn June the 6th, we sent a note\nthat just said we've not received a response.\nOn June the 7th, we received a return letter back\nthat said, due to a recent transition,\nthe below add cannot run 6-8, are there alternate dates?\nAnd all of this was for a sewer repair.\nSo we went from June the 1st until the week after June the 8th\nbecause basically they could not get the ad done.\nAnd we've had example of that over and over.\nAnd so the request was made, and Representative Jacobs\ndid state clearly that the intent of this\nis to not change any of the requirements\non our legal organs.\nIt's still required, and it doesn't\nchange any of the requirements of the legal organ.\nThey still must do all that they said they would do.\nBut this last, this third section just\nallows for the digital ad placement to count as day one.\nAnd that will help us continue on with our projects.\nThat's really my piece, and I'd be welcome.\nI'd welcome any questions as well.\nAnd I'm not sure which one of y'all wants to address this,\nbut I'll take your questions.\nWhen I started looking at the bill,\nand you mentioned in your testimony that there's\nnewspapers that are going out of business, out of circulation,\nthat presents a problem.\nI believe the AJC even announced that they're going full digital.\nThey're not going to be publishing on newsprint anymore.\nAnd you start looking at this.\nI reached out to my local newspaper that does several newspapers\nand several counties around me in most of my district.\nWe talked a little bit about it.\nOne of the things that I want to commend,\nwhere's our Georgia Press Association folks,\nsaid they, I want to commend the Georgia Press Association\nfor having a website that kind of combines\nall of the legal ads in one location\nwhere if you wanna go look at them that way,\nI'm not gonna do it to your bill,\nbut I do know that in the future,\nwe probably wanna look at, you know, okay,\nhow do we take that Georgia Press Association\nrepository of all of the legal ads,\nmake that into something that we can use\nas the statewide legal organ, searchable database,\nelectronic, everybody's got access to it.\nBut more importantly, let them print that every day\nand send to 159 counties to 159 county clerks and do that.\nWe won't do it today, but I will tell you,\nthere's a lot of opportunities to make this a little more\ntechnology savvy and a little bit more friendly.\nThe, I commend you on it.\nI do have a question about when you mention the excessive increase,\nYou're the one that sponsored the bill.\nI am.\nI didn't realize I used that adjective,\nbut there is an increase.\nYou agree.\nYes, you didn't use an adjective out.\nIf that wasn't exactly it, it was,\nyou did say it was quite large or excessive.\nSo you want to touch on that.\nHow'd you reach that number?\nThat number is, these ad rates hadn't increased\nin about 30 years.\nAnd so these, I believe it was the press association\nthat helped us out to find where the increase\nshould be increased to on those ad rates.\nOkay.\nYeah, you've got a couple of questions from it.\nI'm sorry, get asked, I think the consumer pricing index\non that would have placed it over $18.\nSo we've cut back a little bit\nand we just try to make a compromise in the middle.\nOkay, yeah, I've got a couple of questions from our members,\nour whip, Senator Robertson.\nGood morning, I appreciate you all bringing this legislation.\nBrief history, I learn how to read reading a newspaper\nwith my mom and I love newspapers.\nEvery Sunday, I buy as many as I can with my wife\nand I go to brunch and I love them.\nBut my problem is is when I go to other cities,\nColumbus, Asheville, other places on the visit,\nAs I walk around, I see these paper boxes that are newspapers.\nAnd I get the newspapers out and they have some news articles in them,\nbut fairly quickly I realize these are radical or racist or something like that\npublications that mix in news with a political slat and something like that.\nSo and they have a circulation beyond 100 per issue, of course.\nSo could one of these, if the local legal organ is not meeting\nin all of its requirements, could they possibly qualify\nto be a temporary avenue to get these legal notices in there?\nSo what they benefit from it?\nSo if the legal organ, if a legal organ that is specified\nin Georgia code is not available, then\nwas it the probate judge sheriff in the Clerk of Superior Court,\nThe majority of those officers will select one that does have at least a hundred copies\nper issue in their county and those members have that full discretion.\nAnd yes, I am aware of media bias myself, we've all seen that.\nYes, and you and I have sat down and watched it together.\nMy concern is, and of course, it makes my opinion, I find the Harris County Journal I find\nto be a legitimate newspaper, the Columbus ledger I find a legitimate newspaper.\nBut there's a newspaper in my district that I do not find to be a legitimate and they\nprint them out by the stacks, they go put them into the drug stores and other places if\npeople can grab them when they grab real newspapers\nand as they walk out and by doing this\nand understand it would be a temporary fix\nbecause of the failure of the legal organ\nbut they could benefit from running these types of ads.\nThat is correct.\nI just wanna make sure.\nAnd I'll also say, and I think we all,\nprobably a lot of folks here are aware,\nthe house has tried to address this issue\nfor the last several sessions\nI think there's been attempts with the Senate to solve some of these same problems and the\nreality is this is the one that we've gotten out of our chamber to your chamber and it\nwill help a lot of people and that's, you know, I think there is a lot of work to be done\nas you said on this matter.\nI hope we can continue to work on this in the future but this is what we've been able\nto get across the finish line to this committee today.\nThank you.\nYou mentioned that it was a sewer repair.\nWas there sewage spill occurred because of the failure of the ad?\nThere was not in particular.\nThey were just doing a sewer repair at the time.\nThey were doing a sewer repair and had to post.\nBut in that was one example, again, he mentioned that we had them.\nWe've had them track them for the last five years,\nand we have tried for many years to get some solution\nto these problems, one being what you just discussed,\ncreating that interim legal organ and then of course this we have we we want to be\nable to post on our county website and on the Georgia public notice website and have\nthat count so yeah we're really we're really just we're begging for a solution to all of\nour delays. Thank you. Senator Stale you have a question?\nThe attorneys that I've spoken to about this bill, both Metro and rural, they've for the\nlast decade or more, they've been referring to either the local county website or public\nnotices or the toward public notice website because it's more reliable, it's more consistent,\ndoesn't have the issues that you suggested.\nAnd as a former media guy myself,\nit's very poorly kept secret that these ad rates\nare what keep a lot of these small papers alive.\nAnd legal notices are what pay for newspapers.\nSo given them a 50% pay increase,\nbecause they haven't needed it for 30 years,\nbecause they had higher circulations.\nNow to a decrease in circulation,\nnow they want a fifth percent pay bump,\njust kind of wondering the logic that went into that,\nother than just, it was 30 years\nand now they're wanting it.\nRight, and it was explained to me essentially,\nit's been 30 years and the cost of everything has gone up\nand that was their basis to my understanding.\nAnd I can add something to that.\nCertainly the younger generation is still, you know,\nis interested in the digital,\nbut I know in my community and a lot of rural communities,\nwe still have a very heavy population of people\nthat like Senator Robertson want to buy the paper.\nSo the circulations have decreased,\nbut we did not, it was not our intent in this legislation\nto make the big change, to force all of those notices\nto go elsewhere, or even allow all of those notices\nto go elsewhere at this time,\njust because we had to recognize\nthat there are a lot of people that do still rely\nand really adore having a newspaper in their hand.\nSo we did kind of focus on the middle ground again.\nSo then as a follow up to that,\nso because people like to have a hard paper in hand,\nthat's for news and shopping guides\nand everything else like that,\nnot necessarily for legal notices,\nwhich is the purpose of this.\nI'm just wondering if we're giving\nrural newspapers of a prop up for the handful of legal notices they get just to try to keep\nsome of those papers going.\nAnd is this the vehicle that we're using to keep rural print media alive?\nI would not suggest it was the vehicle.\nI'm going to suggest it was the whole reason that Senator Robertson can read.\nAnd so if that's what may happen, we want to keep Senator Robertson able to read.\nI'm not sure that works, but Senator terrestive as you have a question.\nMr. Chairman, I'd also like to note that I believe the representative said that Mr.\nRobertson was a certain generation that would rely on these print documents.\nI don't know.\nMaybe I heard that incorrectly.\nYou may have been implied.\nI do appreciate the comments about the rates, but I think it is worth noting that if you\nkeep out with CPI, these rates would have been much higher, relative, right, $18 instead\nof $15, and I do think that there are plenty of folks who rely on these legal notices being\nin print, although not of my generation. And certainly want to support what we can but\nalso make sure that the process is updated and correct. So, Mr. Chairman, I'd love to\nmake a motion.\nAt the proper time I'll call on you to do that. Said we do have one witness that wants\nto testify on the bill and that would be Mr. Todd Edwards from the Association of County\nCommissioners Georgia. Okay. The Senator Svaz, your motion would be in order.\nAnd if you would state your LC number. Okay, is there a second?\nsecond from Senator Williams the all in favor please signify by saying aye\nSenator Butler you know I hear you okay thank you the your motion passes\nunanimously said the so congratulations who would you like to carry this bill\nin the Senate Lee Anderson okay we're not sure if he can\ngreen. Oh, I wanted to say that. Thank you very much. You all have a good day. Appreciate\nyou testimony. Thank you, Freddie. Colonel Hitchens, I believe you're up next with\nHouse bill 437, if you don't mind.\nThank you, Mr. Chairman and members of the committee.\nI'm here on behalf of Substitute to House bill 437, LC365509S.\nDo we have that?\nYeah, what was that LC number again?\nLC.\nI'm actually going to replace it.\nThe new substitute, LC-36-55-23S.\nThank you.\nSo now we're on the same page.\nAnd essentially it's the same, but this is on behalf of the Department of Administrative\nof services within the Department of Administrative,\nadministrative attach is a group called\nthe Georgia State and Demification Commission.\nAnd the mission of the State and Demification Commission\nis to provide monetary benefits to public safety officers\nkilled in the line of duty or permanently disabled.\nAnd essentially all this bill does,\nit's been in place for many years,\nI served 12 years on the commission myself\nand I know very much how it works.\nAnd what this does is the commission is made up as the governor's chairman and about nine\ndepartment heads.\nAnd with me today is Aldham Cole, who's the general counsel for DOES, and she's the one\nthat administers the program, but what this bill would do is it would change it from\nthe commission to being the responsibility of the commissioner of DOES.\nand actually Ms. Cohen her current position would be a hearing officer and she would hear\nthe case. As they do it today she prepares the case she does all the all the legwork with\nher staff and presents the case 99% of the time the commission goes along with whatever\nrecommendation they make. But she would be the hearing officer if the petitioners unsatisfied\nwith the result means the ability to petition it to the Commissioner of the Department of\nAdministrative Services. If they're unsatisfied there, they can move it to the Superior Court.\nThat's essentially it.\nCommittee members, are there any questions or a sponsor?\nI don't know if there's coal or something.\nSir Robertson.\nMr. Chairman, I was just going to at the proper time.\nSenator S. Vaz, you have a question.\nYes, the appeal process at the moment,\nit would go through the commission\nand then after the commission, what would be the?\nIn current status or what's proposed?\nCurrent status is the department makes an initial decision.\nWe do, through our risk management services program,\nwe also run the state liability program.\nThis is something we are well versed on\nas reviewing claims and back-to-plains\nand making determinations.\nAnd that initial determination can be appealed\nto the commission, as Colonel Hitchin said,\nwe prepare and prep the commission for those meetings.\nThose meetings are difficult to schedule,\ngiven those folks that are sitting on those meetings.\nThis is really intended to streamline that process.\nBut ultimately, the appellants have the opportunity\nto be heard in front of the decision maker,\nwhich will now be the commissioner of DOAS.\nAnd then we added that fourth or additional level\nof appeal to Superior Court, which is not currently\nexist in law as an additional protection\nof oversight over the department's actions.\nBut this is something that is just intended\nto get answers to these public safety officers\nand their families in a more efficient and quicker manner.\nBecause right now it's a little bit more cumbersome\nof a process to pull that commission together\nfor those decisions and those meetings.\nThank you, and that's what was at the heart of my question\nwas do they have the right to appeal to the court now?\nAnd the answer is no.\nNot directly in statute.\nThere's a legal argument that potentially we\nhaven't experienced that in the history of the commission\nto my knowledge.\nIt hasn't been tested, but we're putting it and writing it\ndirectly within the code.\nIt will be within our roles and regulations\nthat we will also promulgate pursuant to the bill\nas well regarding and providing information\nto the appellants as to how the new process will operate\nand we will, of course, provide direction\naround that of justice for your port as well.\nAnd there's nothing in the bill right now,\nbut with COVID, they've become very backlogged.\nThey've got about triple the number of people\nwho've asked for a review because determination\nabout whether you've got COVID based on your activities\nat work or whether you pick it up somewhere else\nbeen very difficult to differentiate.\nThis would just be an expedient manner of panning them.\nThe governor and all the department\nheads wouldn't be tied up routinely in trying to deal with these.\nLike Mr. Chairman, how many people did you have a panel?\nWell, as far as how many actual appeals\nwe received in the last four years,\nwe've only received six appeals that went\nin front of the commission.\nAs for all Hitchens, as far as actual total claims,\nthe claims went from an average of about 15 per year\nto closer to 50 per year during 2020 and 2021 and 2022.\nWe're starting to see a little bit of a drop now,\nbut that's kind of total claims versus appeal.\nWe just don't have very many of these appeal claims\ncoming up and therefore we generally try to have\nat least two to pull together a commission meeting.\nAnd so the results of that, because of the effort that goes into this commission meeting,\nwe've only had about one per year the last four years.\nSo this is just to get those answers a little bit quicker.\nI notice that on our after January 1, 1990, are there any out there that perhaps 1989 that might be affected?\nNo, sir. I don't believe that we have any. So the way that the payment of these work is it's either a lump sum or it's a five year payment process.\nSo any claims from that far back would have been resolved by now. And we only have one pending appeal in the moment.\nAnd I believe that was the actual occurrence of the death that my memory serving me well was 2021.\nThank you, Senator Robertson, you have a motion.\nI do.\nQuickly.\nI want to tell the Colonel thank you for streamlining this process.\nVery familiar with it.\nAnd clearing up this bureaucracy will also save us some money.\nYes, Mr. Chairman, I'd make a motion do pass.\nAnd that LC number.\nSo reading test.\nYes, sir.\nLarge print.\nLarge print.\nAnd in a certain age, it will definitely be large print.\nThe LC, I'm looking at is LC365523S is in Sierra.\nThank you.\nWe have a motion in a second from my vice chair.\nSo the all in favor, please signify by raising your hand.\nThank you.\nI can see better than I can hear.\nCongratulations, Carl.\nWho's going to carry this bill for?\nSenator Albrecht.\nSenator Albrecht, okay.\nThank you.\nThank you very much.\nI miss Cole.\nIf I could, if I will ask you to stay.\nOkay, the mother of all bills said that we're going to have a hearing and a hearing only on it, but I do want to have, uh, come on up.\nRepresentative said they, uh, we appreciate you coming up.\nIs there a representative saying you all, you know, would you want my vice chairman to join you out there?\nHe looks better on TV up here.\nYou know, I have a great view of him right now, so I'd hate to lose it, but wherever he'd like to sit, I'm\nI know that this will be the tag team show.\nSo, Representative Sains, why don't you help us kind of walk through the bill.\nAnd the reason that just so you know, and I've got a couple of questions that I read through the bill.\nAnd I look and I want to ask our committee members to between the hearing today and our next meeting\nto ask you to each read through the bill and understand kind of what it does, because this is quite honestly, it creates the automatically 159 authorities in every county and can also creates one for every city.\nSo this is a very big step that when we start talking about this and it's not a bad purpose.\nI get, you know, what they're trying to do, but it has the potential to create an awful lot, or it does create an awful lot of authorities.\nWell, Chair Mr. Chairman, I have a simple little bill to bring them before the committee.\nJust a couple of 23 pages, 25.\nI would note, in terms of the Chairman is correct, in terms of the language of the bill, creation of local authorities.\nThat's typical language on authority legislation.\nIt must still be authorized by each locality.\nSo though the enabling legislation puts it as created, so it is correct, the practicality\nof it is every city or county who wants the authority to be in use would have to approve\neach authority.\nOr else it's codified in law, but it is not active, I want to start with that because\nI know that is a dramatic language in terms of that law.\nI'll go back and talk about the premise and the policy intent of the commercial property\nassessment, conservation, energy, and resiliency program that this legislation would enable.\nWe currently have that program in code under the downtown development authorities.\nThis only one has been able to work under that framework in Atlanta, given the size and\nscope of that downtown development authority, is just shown not to be the place or the intent\nof DDAs to go into this kind of financial mechanism as you can see it is complex.\nThis loan program would enable a private property owner to seek 100% private capital for\napproving purposes in the bill, at a much lower rate than you typically get a\nstructure, and the approved purposes would be anything that is energy\nefficient, which would be above required building code, and also particular\ninterest in my district, and I'm sure many others, if a natural disaster\nhappens, or to prepare for typical hurricanes, tornadoes, to build a building\na building that is more resilient to those natural disasters.\nThat would also be allowable.\nI have a good example of the legislation, a developer, Jacobi development, who is revitalizing\nthe Gilman paper mill property in San Mary's, Georgia, which was once the largest employer\nin the entire southeast below making.\nhas been a brownfield site for the last 15 or so years.\nThey came and asked for this legislation\nbecause they saw this as a very good tool\nin their arsenal and developing that.\nMany other developers have seen it as well.\nSo though it is a complex bill,\nI think the policy intent and the usability\nto move our communities forward with private capital\nis more than worth looking at.\nThe legislation itself is based on the resource recovery\ndevelopment authority code section, so it's eight, we bring the language into this and\ncreate that new authority. Currently we have economic development authority code section,\nthe DDA, resource recovery, and then this would be the new one for the CPS program. And\nthat is where the authority language comes in. The purpose of the authority, because\nof Georgia's gratuities laws, we have to, in other states, they could be a pure transaction\njust like a bank loan.\nBecause of the way our mechanisms work,\nthat's what requires the authority to be in place.\nThe local government would create.\nThe authority can be a city or a county.\nFor the purposes of this, it can mimic\nyour economic development authority board,\nso it could practically function\nunder that same organization and staff members.\nAnd then once it's in place,\nthat landowner who would like to use\nthat property owner would find the private capital provider\nto use that C-PACE program.\nThe authority would approve it,\nthe local government that enabled the authority\nwould then have the requirement to approve it,\nor deny it, so there are several filters here\nto make sure it's in good.\nAnd that local government and authority\ncan capture this or?\nYeah, well, I interrupt just a minute\nand let's make some questions here.\nand I've worked with a couple of development authorities.\nWhen you look at a private equity coming into something like this,\nand okay, you got a agreeable lender that says, hey, I'm going to let you borrow some money.\nYou know, they're taking advantage of the tax situation and the tax advantage\nis of doing it through a local government.\nis there why you're getting a better rate as the only thing I can assume.\nMuch better rate will help fund a project like this,\nbut when you do have an authority or any kind of government involved in it,\nthen I look at the taxpayers and they're on the hook for this.\nBecause if the project fails, at some point,\nthen you're going to have the taxpayers may end up having to eat that loan.\nHow do you protect the taxpayers?\nSo I don't want to miss state.\nI think that's a great question.\nIf you're amenable to it, if I could ask George Ray\nor one of his many, Earl Taylor, who is a specialized attorney\nin this in authority and bond law to respond to that,\nif you're a given to the chair.\nHey, I hope Taylor would dealt some bullets.\nSo the tax payers were not at risk of this statute.\nBut first of all, the authority obligation specifically provides that the tax payers\ncould never be taxed to pay the authority obligation.\nThe intergovernmental contract between the authority and the local government provides that\nit has to be a limited obligation to the local government, payable only from the special\nassessment that the commercial property owner approving their property agrees to put on\ntheir property.\nIt's an only source of payment for these financial obligations is a special assessment commercial\nproperty over the grays to put all the property. The general tax payers, the\ngeneral flood, could never be touched under this legislation the way it's\ndrafted. I'm not a lawyer so I'll admit that right up front but I was a county\nmanager in a county where the county did a bond and an intergovernmental\nagreement to build a new hospital. Right, none of the tax payers were thinking\nAnd they were on the hook until the hospital went down and the bonds weren't paid and\nthen they realized, oh wait, we got a couple million dollars to pay off on this deal.\nAnd so for me, maybe we can talk after long since today is just a hearing.\nMaybe you can get in better explanation for me on that.\nThat is a great concern for me, how do we protect those tax payers and moving this forward\nand maybe you can explain it?\nYeah, there are intergovernmental contracts\nthat a developed authority can intergovernmental contract\nto the city of Kentucky.\nA city can play a candy can play\nas up to 1 mil, a tax, a city can play\nas up to 3 mil of tax to back a developed authority obligation.\nThat is not allowed under this bill, the hospital authority.\nExample you gave me, the tax payers can have an intergovernmental\ncontract that pledges up to 7 mils of tax\nfor a hospital authority obligation.\nnone of that is permitted or this legislation,\nthe deposition of inter-government contract,\nit's a limited obligation to the local government\npeople, only for the special assessment.\nAnd I'll direct it to Representative Sainz.\nI'm sorry, but on the bill, I looked at your makeup\nof your authority members and you're pointing two\nof the members and then those members can appoint\nother members, if I remember right, reading somewhere in the language that how the authority\nis made up.\nSo if it's a psycho-candy for a joint authority.\nSo a joint authority?\nYes.\nSo the joint authority, I don't believe the members could appoint other members.\nThe sponsoring line 184 with additional member to be appointed by the Board of Directors\nthemselves.\nOkay.\nYeah.\nSo, in the case of a joint resiliency, each unit shall point two members with additional\nmembers to be directed by directions themselves.\nYeah.\nSo, what that does, it gives each sponsoring government an equal number of members and\nyou got to have a tiebreaker.\nIt's so the sponsoring government's members\nall have got to agree on his goodby the tiebreaker\nthe way the bill is designed.\nSo it's a sign, the way that I read the code,\nit's a single member, additional one member\nthat to make it odd.\nAnd I don't know if we want to tighten that language.\nAnd that's where for me.\nI'm just trying to ask some questions\nbecause this truly adds a, every county, every city can create this authority and you\ncould literally, we could end up having hundreds of more authorities here.\nOne of the questions that I would ask would be because we have an authorities registration\nrequirement in Georgia.\nWell, you've created all the authorities, but you haven't, they don't have the ability\nto do transactions.\nSo, where does that fall into DCA's requirement that every authority, they have a report\nfor what's going on with their authority registration each year.\nWill these authorities now that they're created, will they have to respond to DCA and how\ndoes that work?\nYes.\nOne second.\nPrior to that, I would say there is an amendment because we had had the discussion\nand government affairs in the House in terms of the language that enabled all the authority\nto be created after the response because I'm sure there is one.\nWe are amenable to make in the interim after we have this hearing to look at that language\nif that might make the committee more amenable to modify that language to where it creates\nall authorities instead of enables local government to create the authority.\nI just wanted to state that because it was a concern and government affairs in the house\nas well.\nYeah.\nSo the bill does create every city, county, authority and that's typically how general\nlaw about authorities work. They lie dormant until the local government adopts an\nactivated resolution, activating the authority. So as those are lie dormant, there's no\nrequirement to register with DCA because it's not a legally activity. What's that\nactivated resolution adopted? It becomes active. Then it will fall under the\nregistration provisions of DCA and will register with DCA just like every\nauthority of Georgia does. And this is the, the general, the\ndevelopment authorities clause, the Constitution authorizes the\ngeneral assembly to create development authorities. They\nin 63, they, they created the, the development authorities law\n78 resource recovery, development authorities law 81, the\ndowntown development authorities law, this will be the fourth\nexercise of that power of the Constitution. And for me, one of\nthe questions that, that, you know, just comes to mind right on\nthis is, okay, why create all these new authorities?\nWhy don't we use the existing development authorities\nand give them some additional powers to say,\nhey, if the development authorities\nso chooses to do this,\nwhat would be wrong with allowing that development authority\nto create this authority for energy\nand efficiency and stabilization?\nWhat?\nThat was my first question when it came\nbecause that's probably my least favorite part of the bill.\nI still like the policy enough to have moved it forward.\nMy understanding, and I'm sure Mr. Taylor can elaborate on this,\nis the complexity of the sea-paced structure\nand it being completely private capital.\nIt fit better in creating different code.\nI understand it is possible if the committee does prefer\nto do something under the economic development code,\nbut we then are giving economic development authorities\nmore broader powers.\nSo there is a benefit to look at it in the realm of right now local government can decide\nif their community has this kind of power.\nIf we put it in code section for economic development authorities, those local communities\ncouldn't decide that that existing development authority having that added power.\nSo there's benefits and downfalls to both approaches.\nBut I do want to state if that is an approach the committee wants to look at there might\nbe a possibility to do so.\nIt's such a complicated program.\nIt really demands a son of authority.\nIt would take a major overhaul of development authority's\nlaw.\nFor instance, development authorities don't have grant\npowers.\nThey don't have development authorities.\nWe would have to open up a lot of things in the development\nauthority's law to do a pretty major rewrite.\nProbably I know how to do it, but it would be a big undertaking\nfor the development authority's law.\nWe thought it was clear to go with this approach.\nYeah, I believe Senator Williams, you have a question.\nOh, was it Senator Butler, I'm sorry.\nWhoever's, Mike 12.\nIt's 12.\nThank you, Ms. President.\nYou are what you mentioned 159 authorities.\nDo you have a number as to how many would really create?\nIt's gonna be much less than that\nbecause there are a lot of cities and counties\nIt probably will not use this program that we'll actually\nactivate.\nThe major cities, we'll use it.\nSome of the smaller towns use it for the downtown redevelopment.\nIt could be used for agricultural purposes,\nbut I don't anticipate seeing these authorities\ncreated in every city or activated in every city\ngetting a George.\nLeader Butler said, if I'm going to interject,\nin 159 counties, I don't want to forget, overlook their 537 cities.\nSo this automatically creates 537 authorities in each city if they choose and 159 counties.\nSo I don't want to, don't want to slide our GMA friends out there because, but it does\ncreate the enabling legislation for every city and every county to do this.\nAnd I would add, Mr. Chairman, I did clarify the language if the committee would prefer\nand it doesn't seem to change the policy intent on line 157 to modify there is created\nin and for each county municipal corporation in the state a public body corporate and political\nto modify it and strike there is created in and for.\nSo to start at each online 157 and move in between and put may create municipal corporation\nin this state may create a public body corporate and politic that would clarify that it is up\nto that local government to create that authority we're enabling those local governments to\ndo so.\ncorrect the the possibility is 537 plus 139 and I can't do that math in my head\nbut the the practicality is we're giving local control on on whether that's\nnecessary or not I don't know if that doesn't change the policy intent but it\nmight clarify the language for those looking through the process I like the\nI'll hold that thought in just a minute.\nI've got a block up, but it takes care of that.\nIt's a little more than that, but it gets rid of that.\nYeah, I've got a block up.\nSince this isn't hearing only, I want to make sure that you understand there's a constitutional\nquestion as to whether or not we can allow for local governments to create these authorities.\nAnd so that'd be one of the things that we'll try to get clarification between this hearing\nand the next potential hearing on the bill.\nBut for me, you know, there's a lot of things that are happening here in this legislation\nthat, and this is where for me, I just want to make sure that because I do have an\nAn enormous number of new members to the Senate said that this year I know some of them\nhave been here and they quite experienced but I know I have something that are brand\nnew to the Senate.\nThe importance of what we do in committee and making sure that we're familiar with what\nthe bill is going to do and whether it moves forward or not.\nI don't take lightly and I want to make sure that each of y'all look at this and what's\ngoing on with it.\nI believe Senator Mallow, you have a question.\nI do.\nThank you, Chairman again, and to the author of the bill, I know you spoke about the constitutionality.\nMy question is, would this be enabling state statute that could then be followed up?\nShould a local government want to do that by a local act?\nWould that be the process for that, for this to give the guardrails and for the establishment\nhave to come back by a local act, local legislation should.\nI mean, it's a power they choose to do this\nand require the members of that delegation to agree to it.\nWould that be something to be considered in this?\nThat's the reason we have plenty of lawyers\nin the building, because I can't answer that question\noff the top of my head, but.\nI know, Mr. Raleigh.\nI'm really good with that assist our committee,\nso I'll be a thought for consideration.\nThere'll be no need for local legislation.\nThere'll be a local resolution activating the authority,\nbut all of the guardrails and all the powers\nare contained in the general legislation.\nIn other countries, now the question,\nwe're traveling under the development authorities clause\nof the Georgia Constitution that gives the,\ngenerally, the power to create development authorities.\nAnd I would add, in terms of,\nit didn't come up in the House Committee yet,\nbut I know many of our House members have left\nand joined your body,\nso that might have been the question that didn't get asked there.\nBut if that is a more comfortable statue I'm assuming\nwe can require the provision of local legislation\nas an added filter if that is amenable to the committee\nor preferred, but it is currently,\nas Mr. Taylor mentioned, necessary as the bill is now.\nBecause this is a hearing,\nI'm gonna be a little bit more forthcoming.\nBasically, what's happening here is you have areas in the state, excuse me, where people\nwant to proceed with improvements to their property, they're wanting to do these things\nfor energy conservation, water conservation, whatever the case, these hardening structure.\nAnd they're asking for a benefit by having some government-sponsored financing to allow\nthis to take place that improves their community and this is where for me. I don't begrudge the\nconcept of what's going on but I do want to make sure that everybody understands this is a\npotentially very big expansion in what the government role is. So for me this is why I'm asking\nmy committee members to ask questions and participate in the discussion. Senator Williams,\nDo you have a question?\nYes, sir.\nI have served on a down-down development authority in the past.\nWhat is different from this, is it the financing, is it the guaranteeing of the money?\nYes.\nSo what's different?\nThe program, if you cut through it all, if it were in Georgia, if it were in another\nstate, a property owner that wanted to make an energy or water savings improvement or\nresiliency improvement would come to a local government and say, would you borrow money\nabove a half to approve a property to put a special assessment of a property to pay that\nloan back.\nBecause the Georgia Court has failed in assessments for taxes, I can't do that in Georgia without\nabout a referendum every time we do a loan which would be just completely unwieldy, but\nwith an intergovernmental contract, I can avoid the referendum requirement.\nSo we need to create a development authority to go out and bar the money to get the\nto the developer property owner to improve the property and then the local\ngovernment imposes a special assessment. It is in the Intergovernmental\nContract to pay the special assessment to the development authority to pay the\nloan. So that is how the program works. We've got the authority legislation was\nlargely modeled on the resource recovery development authorities law which\nwas a tighter development authority statute than the general development\nauthority's law and it took some powers from the downtown development\nauthority's law like grant powers it added to be in and then I added the\narticle of assessments the cooperation article is modeled off of the the\ncooperation law attached to the housing authorities law that allows these\nand counties to provide financial assistance to their to their local housing\nauthorities. So this this language is all language that it pretty much comes from existing\nlegislation woven together to fit this program in Georgia. It is an existing development\nauthorities law would work Atlanta trying to do it with the downtown development authorities\nlaw but it would work very well and the capital providers will use it because development\nas far as really work to side for seat base,\nat least outside the central business district.\nYeah, thank you, Mr. Taylor,\nI said they ask for other questions,\nrepresent sayings you want to continue your,\nand I apologize for interrupting,\nbut this is where, for me,\nI won't make sure my committee members,\nif they have questions that we're doing that.\nI, whatever enables the committee\nto get their fact-finding mission in terms of understanding\nthe policy and the intent.\nThe only thing, the majority of my presentations\nand concluded we do have a capital provider here\nthat could touch on the benefits of the interest rates\nin terms of what, why we would be going through\nthe hassle of this, but I would add, it is 100,\nbecause it was a big distinction for me\nto sponsor the bill, though it is a government structured\nand that comes with its own liabilities.\nIt's 100% private capital being infused,\nnot tax dollars on any level.\nIt is a government structure because of course,\nthere is a first right of refusal through using this.\nThat's what enables the capital providers\noffering such a low rate because they're such a low risk.\nAnd I would add to that in years prior,\nwhen it was introduced, there was some pushback\nby the banking association, the coalition\nthat's behind this policy had done a great job\nin working with that sector and they are neutral on the bill.\nAnd primarily, there is a provision for that for any property\nthat has a mortgage or has a loan with first right.\nThey would have to approve the use of this financing\nprior to that financing being allowable.\nSo I think that's an important part to remember.\nI know my vice chairman of the committee and who I think if the bill sees the light\ntoday, he may be able to inform us a little bit more on some of the things, but if I could,\nif I could ask the committee members to look over on page 22, line 533.\nfive thirty-three on page twenty-two. And you know if you're if you're going to create\nauthority you got to know what happens when authority goes away and I want you to read\nthat section right there and I'll ask Mr. Taylor to address it for us. Yes it actually\nThat comes is the identical language that was added to the development authority's law.\nPreviously once the authority was created in Georgia, like a development authority,\nit just had professional existence.\nAnd some of the cities and counties didn't make the board a point, but they existed,\nthey've been activated, but they weren't registered with DCA.\nAnd so the development authority's law was amended to give a bit of avenue if they don't\nuse the authority or just become an active to dissolve it. So as low as the\nauthority has no discharge obligations either debt or contractual\nobligations. This gives the local cities and counties the option to dissolve\nthe authority so they don't have to fool with the annual registration with\nDCA etc. And just so everybody knows this authority it contemplates in here\nthat you can have employees of your authority and you know all of those calls so when you\nstart looking at you know there's a lot of moving parts in this bill that I want to\nmake sure that everybody is familiar with it and reads it and I know the hours getting\nlate so what I'm going to ask your homework assignment is take a look at this talk to some\nof our folks here in the building that are much more familiar with it you know representative\nI appreciate you bringing it, I see there's a potential upside to where it is and how it can benefit in some of these developments and people being able to get access to better funding for doing it.\nBut there's a cost to it, and for me, I don't want to make sure that we're protecting the public and what we would contemplate doing here on this legislation.\nAs Mr. Chayler said, we've only done these big authority bills three times before.\nThis will be number four and this will be a, this is a huge step.\nSo I don't take this job as Chairman Lightland.\nI know you don't take it lightly as being a member of the committee.\nSo thank you much.\nAny other final comments?\nRepresentative Singh.\nThank you, Mr. Chairman.\nI appreciate this committee's time and I more than understand taking the time to\nFor example, the legislation I agree with you, it's a big step with what I would argue is a big benefit to our communities' tools and moving our communities forward, but I appreciate the time and look forward to the added discussion.\nThank you.\nWe stand adjourned.\nYou\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T12:27:50.223691+00:00"
}