{
  "video_id": "Z9FO_RExU1M",
  "url": "https://youtu.be/Z9FO_RExU1M?t=1201",
  "title": "Georgia House - Day 9 (2026-01-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-01-30",
  "duration_minutes": 87,
  "summary": "Based on the transcript provided, here is a structured markdown summary of the Georgia House session on 2026-01-30:\n\n## Overview\nThe session featured a prayer and remarks from the chaplain, Rev. Ben Day, emphasizing the importance of duty and service in public office. There were no substantive legislative actions detected.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Rev. Ben Day, the chaplain for the day, delivered a sermon on the concept of duty in public service, drawing parallels to figures like Jonah, Paul, and Moses.\n- He encouraged the legislators to embrace their duty with humility, wisdom, and grace, serving the common good.\n- Rev. Day acknowledged his previous experience working in political management before becoming a minister, giving him unique insight into the challenges of elected office.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe Speaker called for all members to come to the floor for the morning roll call. The transcript indicates that all members were present and voted to signify their attendance.\n\n## Adjournment\nThe transcript does not include information about the adjournment of the session or the date of the next session.",
  "transcript": "You\nYou\nYeah.\nYou\nYou\nSingle.\nSingle.\nSlow.\nSlow down, single but not with one and flavor.\nThank you very much.\nYou\nThank you most and thank you very much for watching\nand i hope to see you tomorrow.\nGood bye.\nThank you.\nYou\nYou\nYou\nYou\nThank you very much.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n.\n.\n.\n.\nAll members, please come to the floor.\nAll members, all members come to the floor, please.\nThe hour for convening having arrived, all members will please come to the floor and take\ntheir seats, Mr. Clerk, will you ring the bell?\nWe're going to have the morning roll call, all members present will please vote green\nto signify their presence in the chamber and Mr. Clerk will you unlock the machines.\nhave all members voted not quite but we're getting close all members we got you\nNow, if all members voted, if so, Mr. Clerk, will you lock the machines?\nDoorkeepers, will you please close the doors and keep them closed?\nAs is our custom, we will begin our day with scripture reading and prayer by the chaplain,\nwhich we will pledge allegiance to the flag of our country. Our chaplain today is brought\nto us by the gentleman from the 22nd House District, Representative Jordan Ridley, spoke\nto Reverend Ben Day a few moments ago. I'm not going to ask you to stand now, but on\nour mind, I know it is on all of our minds there about the tragedy that occurred in Washington\nAnd last night, Pastor Day will have some thoughts.\nAnd those folks and their families will be remembered in his prayer.\nAnd we appreciate that.\nRepresentative Ridley, if you'll come up and introduce our chaplain of the day.\nThank you, Mr. Speaker. Today I have Father Ben from Christ of his school church in Kineshaw.\nFather Ben graduated from Seminary, from Emory University here in Atlanta. He's originally from\nSouth Carolina. And before his time in Seminary, he actually worked in Capitol Hill in DC,\nso he shared a lot of similarities with us here today. Father Ben, and it's time running\nChrist of his school church has doubled the congregation size from 40 to 120\nmembers if I'm correct and he's also the chaplain for the city of Kineshaw\npolice department and his ministry at the church helps those with abuse\nsubstance abuse disorders and law enforcement and one thing about father all\nof amazing accomplishments I think the one that's the most amazing is he\nactually makes it really want to go to church on Sundays and with that father\nThank you very much.\nSpeaker Burns, Representative Ridley and Honourable Members of the Georgia House of Representatives,\nit is my privilege to stand before you as your chaplain of the day and to bring you just\na quick and brief word about the concept of duty, that ancient and sometimes inconvenient\ncalling that rest is a mantle upon those who are called to lead as you are.\nBefore I began, as you heard, I confessed that yes in my 20s, I worked in political\nmanagement on several legislative staffs running campaigns across the Southeast.\nAnd as should be obvious by the collar around my neck, I have now dedicated my life to\neternal repentance for those years in politics. But looking back on that season, I feel as though I\nknow a little something about what I'm going to say to you this morning. If there's one thing I\nlearned during my time, it is that public service for all of its noble intentions has a way of putting\nyou in situations that you never expected to encounter. Some of those situations are inspiring,\nsome frustrating and some wonder make you wonder if you accidentally signed up for reality TV rather\nthan elected office. But duty from a Judeo-Christian standpoint is not a burden upon you but as a gift\nand a blessing, even if it lacks the shiny wrapping paper and bow. The duty of leadership,\nparticularly that of elected leadership, can often feel more like the prophet Jonah calling the\npeople of Nineveh. Unexpected and uncomfortable and prone to detours.\nJonah, as you may recall from the Hebrew scriptures, had a very clear instruction from God to go\nto the people of Nineveh and to teach them a better way. Instead, he took a boat in the opposite\ndirection, only to end up in the belly of a fish, likely reconsidering his career options and\nchoices that put him there.\nLegislators, I dare say that you may relate\nto the story in ways big and small.\nYou have been called to serve and many of you\nhad a vision, a passion, and a deep love for your communities.\nBut duty often puts before you tasks that are difficult\nand that you never really considered when you signed up\nto run long committee meetings, difficult votes,\npatiently waiting through the phone calls and emails from all hours and times from constituent to\nlet's just say are very passionate in their opinions. Maybe you wonder at times if you've\naccidentally boarded the ship with Jonah at the Tarsius hoping for smooth sailing only to find yourself\nin stormy waters and yet duty when embraced has a way of bringing transformation and miracles\nnot just in the lives of those who you serve,\nbut in your own hearts as well.\nThe Apostle Paul wrote to the people of Galatia,\nlet us not grow weary in doing what is right\nfor we will reap at harvest time if we do not give up.\nPaul wrote this from a place of deep experience\nthrough beatings, persecutions, and prisonments.\nHe surely knew that he was doing what is right,\nbut it was exhausting.\nIt was easier to do what was expedient, what was popular,\nand what keeps the peace.\nYet duty calls us to something higher,\nand in the end Paul could say with confidence,\nI have fought the good fight, I have finished the race,\nI have kept the faith.\nForfilling his duty to God was not easy,\nnor was his path smooth, but he remained steadfast\nin his calling, trusting that his labors were not in vain,\nand his journey reminds us today that perseverance\nin the face of hardship is not only worthwhile.\nIt is, in fact, holy and good.\nMoses too, when leading the Israelites,\ncertainly had moments when he wanted to turn in\nhis resignation.\nThe people complained about the food,\nquestioned his leadership, and at one point,\neven suggested they return to enslavement in Egypt.\napparently slavery with a side of onions and leeks\nsounded better than freedom with a bit of uncertainty.\nAnd yet Moses remained faithful to his calling,\neven though it cost him purely.\nYour duty here is not just the bills you pass\nor the debates you win, but the people you serve\nand lift up, the widow, the orphan, and the stranger,\nand the protection you give to the God-given freedoms\nand liberties of this land.\nIn fact, the Hebrew and Christian scriptures are quite clear\nthat the duty of leadership is not about power or authority,\nbut it is about service.\nJesus himself, the greatest leader I know of,\ndemonstrated this when he knelt to wash the feet\nof his disciples, a task reserved\nfor only the lolliest of servants in the household.\nIf the Son of God could stoop so low to serve,\nthen surely we who are called to public office,\nto public service, can find it without ourselves\nto sermon the common good with humility,\nwisdom, and grace, when duty calls us\nto the work of governing.\nSo today as you take up the works\nthat before you may you find strength in knowing\nthat the duty you have been endowed with,\nthat often demanding is always worth the sacrifices\nand the humility it demands,\nfor God truly blesses duty faithfully executed.\nAnd if you ever feel like Jonah, just remember,\nNine of us turns out all right in the end.\nSo may God bless you in your service\nand may wisdom and grace guide your every decision\nfor the remainder of this session.\nWould you stand to pray with me?\nAlmighty God, you have blessed this land\nand entrusted us with its care.\nHelp the people who always remember\nyour blessing to seek and to do your will. Bless our nation and our state with meaningful work,\nwise education and virtuous behavior. Protect us from violence, division, pride and falsehood.\nDefend our freedoms and bring unity to all the diverse peoples you have brought together.\nGrant wisdom to those who govern so that they may seek justice, ensure peace, and lead with integrity.\nIn times of prosperity, fill our hearts with gratitude.\nAnd in times of trouble, give the faith and strength for all of us to endure.\nWe ask all of this in the name of Jesus Christ.\nAnd today, as we remember those who have been lost to the tragedy in the District of Columbia,\nwe ask a blessing upon all who are grieving, all who have been lost to life eternal,\nand all who are working to preserve the common good and peace.\nWe ask a blessing upon those who grieve and mourn this day,\nand we ask that we would remember them in our hearts\nand be faithful to the work that has been set before us,\nand we ask your mercy and grace and peace\nupon all who are serving in the recovery efforts\neven at this hour, in the name of Christ our Lord.\nAmen.\nWould you join me in the pledge?\nI pledge allegiance to the flag of the United States of America and to the Republic for the 10th Foundation.\nI'm not going to do that.\nThe Bush flag.\nYou like to have that?\nI don't go anywhere, I'm going to get things started.\nThe doorkeepers you may open the doors.\nmembers you may join Father Ben in the south any room if you would like to greet\nhim and thank him for his message and get a photo with him. Thank you for that\nmessage. We really really appreciate the thoughts and prayers that we all will\nbe offering up for that terrible tragedy. Thank you again and thanks for\npasturing. Representative Ridley's church and being so successful there in\ncommunity and your service to the police department as well. Thank you.\nour doctor of the day down in the age station is Dr. Siad and Dr. Siad comes to us at the\nthe invitation of Representative Esther Panich.\nThank you, Representative Panich, for inviting our doctor.\nGreat work.\nChairman Hilton, the chair of the Committee\non Information Analysis, recognized,\nChairman Hilton.\nGood morning, Mr. Speaker.\nWe are glad to have you and our colleagues back,\nsay thank you for representing us\nat such an important ceremony yesterday.\nWe behaved ourselves while you were gone.\nYour committee on information on it has reviewed the journal of the previous legislative\nday and found it to be correct.\nChairman Hilton, thank you.\nThe chair of the committee on information notice reports that the journal of the previous\nlegislative day has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nChair, here's none.\nThe reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nChair has done any journal is confirmed.\nThe clerk will please read the resolution establishing the order of business for the day, Mr. Clerk\nThe first part of the first part of the first part of the period is unanimous consent.\nIntroduction of bills and resolutions.\nFirst reading and reference of House bills and resolutions.\nSecond reading of bills and resolutions.\nReports of standing committees.\nMorning orders.\nIs there any objections to the adoption of the resolution establishing the order of business for the day?\nChair, here's none. The resolution is adopted.\nFirst reading of bills and resolutions the clerk will read House Bill 164 by\nRepresentative Meeks of the 178th Hagen 156 Buckman 137th Dickie the 134th Canon and 170 second and\nothers. Bill B. Todd and active men are to chapter six at title 32 of the\nfish go to Georgia and it's ended relating to dimensions and weights of\nvehicles. Transportation house bill 165 by represent a Franklin and 160\nfry the 120 second waves on 68th work eyes are the 150 seventh camera to the\nfirst and others. Bill B. Todd and active men title 40 80 fish go to\nGeorgia and it's interrelated relating to revenue and taxation. Ways and\nmain.\nHouse Bill 166 by revenue of Franklin in the 160th quarter to 174th Hagen 156, Puckner\nthe 137th Smith, 138th and others, Bill B. Todd and Actuament, chapter 4, Todd O'One\nof the fish going to Georgia annotated relating to holidays and observances.\nSpecial rules.\nHouse Bill 167 by resident of Hagen in the 156th, registration in the 104th canon in the\n72nd, Dupnick of the 29th, and Osteen of the 169th,\nthere'll be a total of an active\namount of one on chapter three,\na total 27 of the fish go to\nGeorgia, annotated relating to hunting.\nGame, Fish and Parks.\nHouse for 168, Barbara.\nIt's an important to the third Kelly,\nthe 16th, Canada, the 172nd,\nRidley, the 6th, Camp of the 135th and others.\nThere'll be a total of an active\nand part one of our three chapter eight,\na total of 48 of the fish go to\nGeorgia, annotated, relating to\ncounty special purpose, local option sales tax. Ways and means House bill 169 by\nrefs of Canada, 170 second, Tiki, the 134th corporate, 174th, Osteen, 169th, Huttles\nenough, 70 second, and others. It'll be titled act to amend our one on chapter\nfive, a title 48 of the official voted Georgia annotator, ruling the\ngeneral provisions for ad ballarm taxation. Ways and means, 170 by refs of\nMithiacal, the 82nd Hawkins, the 27th green, the 154th.\nJones, the 143rd, Taylor, 173rd.\nBill Bitton, an act to amend chapter three,\na title 33, the official building\nGeorge Aniston relating to authorization\nand general requirements for transaction of insurance.\nInsurance.\nHouse for 171 by reps out of Thomas,\nthe 21st Jones, the 25th,\nDonna Tucci, the 105th, Hagen, the 156th,\nCarson, the 46th and others.\nBill Bitton, an act to amend part one\nof Art 3, Chapter 12, Title 16,\nthe official go to Georgia,\nand it ended relating the general provisions\nrelevant to obscenity and related offenses.\nJudiciary non-civil.\nHouse Bill 172,\nBarbara Thompson,\nPulse in the 72nd,\nF Station 104,\nTickley the 134th,\nBrian the 120 second,\nFord of the 170th.\nBill B. Todd,\nan act of end part 6A,\nVarticle 7,\nChapter 3,\nTitle 20 of the official go to Georgia,\nand it ended related in state,\nveterinary education.\nHigher education House for one seventy three by reps and Taylor the hundred seventy third\nCooper the forty fifth Newton on the twenty seventh green to the hundred fifty fourth\nOsteen to the hundred sixty ninth and others Ability title back to a menpark three of articles\nsixteen to chapter two to title twenty the official book of George Anantetta relating\nto student health and elementary and secondary education Education House for one seventy\nfour by reps and a baller than 47th and Jones the\nhundred and forty third will be Todd and act to authorize\nthe municipal court of the city of centerville with\ncharge of technology fail.\nIntergovernmental coordination.\nHouse for 175 by reps of Jones the 25th or one of the\nthirty second Duke Nick of the 29th Wilkerson and 38\nMC the 13th.\nBill being Todd and act to a bench after one a titled\n20 of the fish go to Georgia and it's had a relay in early care and learning\nEducation House for 176 by revenue Smith of the 18th come 38th Evans the 57th Miller the 62nd\nBill B. Todd an active men title 5 of the fish go to Georgia and it's had a relay new appeal an error\nJudiciary non-civil House for 177 by reps in a Cooper the 45th silcox of the 53rd\nCardboard. Carper to the fourth. Reads to the 99th and new to the 40th.\nBill B. Todd, an active and title 19 in the fish go to Georgia and it's\nended relating to domestic relations.\nJudiciary House bill 178 by Rose of Cooper, the 45th Hawkins, the 27th\nSteven Sonham, 64th Taylor, the 173rd and Drenner, the 85th.\nBill B. Todd, an active men article seven to chapter four, title 49 in the\nFischer going to Georgia and it's ended relating to medical assistance generally.\nPublic and community Hill House 179 by reps and I smith the 18th\nhung of the hundred and third lever to the hundred and twenty-third.\nGunther the 8th Evans the 57th Bill B. Todd an act to amend article two\nchapter six of title five of the Fischer going to Georgia and it ended relating\nto a pellet practice judiciary House for 180 by reps and I smith the 18th\nSCOG is the 14th, Kelly the 16th,\nhall number the hundred and third,\ngone through the eighth and others,\nBill B. Todd, an act to a men chapter nine,\na title 15 in the fish, go to Georgia,\nand it ended relating to probate courts.\nDid you do, Sherry?\nHouse for 181 by reps in a very hard of the 36,\ncamp at the 135th of the 48th,\ndown to 2G, the 105th,\nSilcox, the 53rd,\nBill B. Todd, an act to a men chapter 10,\na title 31 in the fish, go to Georgia,\nand it's related to vital records.\nDid you do, Sherry?\nHouse bill 182 by Rose, and it loves them to the 12th Taylor,\nthe 173rd can, and the 172nd Williams, and the 112th Prince,\nthe 130 second, Bill Bittata, an act to a men chapter 25,\na title 33 of the fish, go to Trojan, and it's related to life insurance.\nIn short, House of 183 by reps of C ball, the 34th Kelly, the 16 threes, the 99th installation\nof the 104th Crow, the 118th and others, Bill B. Todd on active men are one of chapter 21\nand title 43 of the fish, but a George and attended relating the rights, duties and\nliabilities of in keepers, judiciary, House of 184 by reps and alums to the 12th Crow\nthe 118th Williamson, the 112th Prince, the 132nd, Hitchens, the 161st, Bill B. Todd\non Acto of Mentos, 40 and 44 of the fish go to Georgia, annotated, relating to motor vehicles\nand traffic and property. Motor vehicles. House Bill 185, I represent a very heart of 36,\nand Paul of 33rd, Bill B. Todd on Acto of Mentos, 43 of the fish go to Georgia, annotated, relating\nin the professions and businesses.\nRegulated industries.\nHouse Bill 186 by reps.\nAnd Ridley, the 22nd Jones, the 47th, Ridley, the 6th,\n4th to the 170th and Williams to the 112th and others.\nBill B. Todd, an act to amend code section 485c.\nOne of the fish go to Georgia, annotated,\nrelated in alternative ad valorum taxation.\nWays and means.\nHouse Bill 187 by reps.\nAnd a washburn to the 144th, follow the 33rd.\nMcDonald, the third of the 26 Carpenter,\nthe fourth McCollum, the 30th and others,\nbuilt me in title, an act to amend titles,\n8, 10, 36, 43, and 46,\nand the fish go to Georgia,\nand it's ended relating to buildings and housing.\nRegulated industries.\nHouse of 188 by Representative Limon, the 98th.\nHolcomb in the 101st and Loughton of the 83rd,\na built me in title, an act to amend titles 17 and 19,\nand title 44,\nand the fish go to Georgia, and it ended\nrelating to criminal procedure.\nDid you do, Sherry?\nHouse 189 by Rosetta Limon, the 98th,\nCarpenter, the 4th, and Loughton, the 83rd,\nBill B. Toddl, an act to amend chapter 17\nto title 45 with the Fiscal of Georgia,\nand it related to Notary's public.\nDid you do, Sherry?\nHouse, but 190 by Rosetta Limon, the 98th,\nDavis to the 87th, Loughton to the 83rd,\nBill B. Toddl, an act to amend chapter three,\nTitle 44 of the Fiscal of Georgia Annotated Relating Regulations Specialized Land Transactions.\nJudiciary House of 191 by Representative Moore, the 91st Cummings, the 39th Crawford, the 89th,\nPark of the 107th, Westbrook of the 163rd, and others, Bill B. Todd, an active mench\nchapter 13 and Title 19 of the Fiscal of Georgia Annotated Relating to Family Violence.\nJudiciary House Resolution 96 by Representative Moore,\nthe 91st and Crawford of the 89th.\nThe resolution recognizing Dr. Gregory B. Lovett Sr.\nand dedicating a road in his honor.\nTransportation House of Resolution 97\nby Representative Green, 154th,\nDunhu to the 31st, Smith to the 41st,\nwork eyes to the 157th and Hilton to the 48th.\nResolution authorizing the conveyance\nof certain state-owned property.\nState properties House of Resolution 98\nour reps at a green to the 154th done who the 31st Smith the 40 first work\nhigh to the 157th and Hilton of the 48th resolution authorizing the\ngranting of non-exclusive easements for construction installation\noperation and maintenance state properties house resolution 99 by\nreps of scope field of 63rd hugely the 141st Davis 87 Canada 58 Scott of\nthe 76th resolution proposing an amendment to the Constitution so to provide that the general\nassembly shall be authorized Appropriations House for resolution 100 by Reps.\nI'm Scofield the 63rd Townsend of the 179th.\nI'm trying to the 85th Davis of the 87th Scott of the 76 and others resolution creating\na House study committee and a communal impact of pollen pollution, an economic development\nand grows.\nNatural resources and environment.\nThat completes First Readers.\nThe second reading the bills and resolutions, the clerk will read House bill 140 by\nrims of Gallaudin 19th Jenkins of the 136th part of the fifth Lomson of the 12th\nand Tarvon of the 2nd, a bill relating to local government budgets and audits House\nbill 141 by rims of mom to hand of the 17th Kelly of the 16th, Ballinger of the 23rd\nCanada, 170 second, Cox of the 28th, and others are bill relating to Levy on business or practitioner with location or office, and more than one jurisdiction allocating drives receipts and limits of levies using criteria for taxation.\nHouse bill 142 by Representative Newton of the 127th, Dickey of the 134th, Williamson of the 112th, 4th of the 170th, Buckner of the 137th, the bill relating to general provisions relative to Advalor and Taxation of Property.\nClass Bill 143 by reps of Dickey of the 134th Smith of the 70th year to the 150 second green of the 154th cannon of the\n170 second and others a bill relating to water resources House Bill 144 by reps of Newton of the 127 Hawkins of the 27th Taylor the\n173rd Stevens of the 164th Westbrook of the 163rd and others a bill relating to income taxes House Bill 145 by reps of\nStill Cox of the 53rd Hilton of the 48th Jones of the 47th Stevens of the 164th Reeves of the 99th a bill relating to other state\nsymbol is House Bill 146 by Rep. Taylor, the 92nd. He would leave the 141st Jackson\n165th with playing with 109th Glazer with the 67th and others, and bill related to\nholidays and observances. House Bill 147 by Rep. Thomas of the 21st, Jones of the\n25th, crowed the 118th, Gallant of the 19th, lifted of the 131st and others, and bill\nrelated to the Georgia Technology Authority. House Bill 148 by Rep. Carson of the 46th,\nWilkinson of the 38th, Williamson of the 112th, Powell of the 33rd, Blackburn of the\n146 a bill relating to accountants House bill 149 by represent Barnes of the 86 you believe the 141st Oliver the 84th out of the 50th\nBuckner of the 137th and others a bill relating to the Department of Public Health\nHouse bill 150 by represent planning of 114 gains of the 120th bear of the 24th\nGogans of the 14th Carpenter the 4th and others bill relating to the University system\nHouse bill 151 by represent mom to hand at the 17th canon of the 170 second Hagen and the 156\nCorporate to the 174th Osteen of the 169th and others have been relating to income taxes House Bill 152\nByreps and Reeves of the 99th Anderson of the 10th Thomas of the 21st Aqua of the 102nd\nWilliams of the 168th and others have been relating to State County and Municipal Road Systems House Bill 153 by Reps of Camp of the\n135th Kelly of the 16th Williams of the 148th Smith of the 138th lifted 130 verse and others\nThey build relating to sales and use tax exemptions for manufacturing equipment industrial materials packing supplies and energy\nHouse Bill 154 by reps of Richardson of the 125th left into the 131st\nMathis of the 133rd Anderson of the 10th Gunter the 8th and others of Bill relating\nto emergency medical services House Bill 155 by reps of Anderson of the 10th\nLahore to the 175th canon of the 170th second Thomas of the 21st Cox of the\n28th and others of Bill relating to procedure for resolving annexation\ndisputes House Bill 156 by reps of Jones of the 25th Thomas of the 21st\nHilton of the 48th Lahore to the 175th Pro of the 118th the Bill relating to\nBill relating to general provisions relative to aviation.\nHouse Bill 157 by reps of Dunhu, the 35th,\nfirst singer of the 119,\ngains of the 120th and early in the 32nd,\nand Bill to amend and act to provide a new charter\nfor the town of Praselton.\nHouse Bill 158 by reps of Franklin of the 160th,\nWestbrook of the 163rd Smith of the 18th,\nChuck's in the 151st, Stevens of the 164.\nA bill relating to registration of business using trade names.\nHouse Bill 159 by reps of the 118,\nReaves of the 99 camp of the 135th and new in the 40th.\nA bill relating to the Georgia housing and finance authority.\nHouse bill 160 by rep to Smith of the 18th.\nHealth of the 72nd.\nHoward of the 71st to build to a minute.\nAct established in a city court in the city of Carrollton.\nHouse bill 161 by rep to Crow.\nThe 118th Reaves of the 99th new in the 40th.\nCamp of the 135th and Smith of the 18th.\nA bill relating to general professions\nrelative to the Georgia Bureau of Investigation.\nHouse bill 162 by rep to Hagen of the 156.\nWork eyes are the 157th lever to the 123rd.\nof the 99th, Dempsey the 13th, and others.\nA bill relating to the Georgia Bureau of Investigation,\nHouse Bill 163, by Reptile of the 22nd,\nRidley of the 6th, Hagen of the 156th,\nCarfender of the 4th,\nCox of the 28th, and others.\nA bill relating to food service establishments.\nHouse Resolution 70, by Reptile of the 31st,\nIrwin of the 32nd, Burns of the 159th,\nParsing of the 119th, Sebald of the 34th,\nand others.\nA resolution honoring the life of Officer Christopher Lee,\nReese, and dedicating an intersection in his memory.\nHouse Resolution 71, by Reptile of the 149th.\nResolution honoring the life and memory of Mrs. Latasha, our butts in dedicating a road in her memory.\nHouse Resolution 72 by Rift and Hopkins on the 27th.\nI'm the green to the 154th, Matthew, the act of the 80th,\nactive in Silicon, so the 53rd, Dempsey, the 13th.\nResolution creating the House Study Committee on Cancer, Care, Access.\nThree second readers.\nReports of standing committees, the clerk will read.\nI'm Senator Chuck Martin of the 49th District Chairman of the Committee on Higher Education submitted the following report.\nAnd to speak, your committee on higher education is adding to its consideration following Bill of the House.\nAnd to instruct the committee to report the same back to the House with the following recommendation.\nHouse will 38 do pass, respectfully submitted, represent Chuck Martin of the 49th District Chairman.\nI complete the reading of the report to standing committees.\nThank you, Mr. Clerk.\nMembers, we're move on to morning orders this morning.\nWe have some friends and families from back home who've made the trip here.\nhere, so I'm going to ask all members will please cease conversations and take your seat.\nMembers will please take your seats.\nthe member in the well-respect. If you have conversations, the south any room is open. Please take\nthem outside. If you're congregating, please uncomregate. I'm not sure that's a word or not, but it\nmeans go back to your seats. I think that's what that means. So members, we have a couple of\nvery respectful morning orders that we're going to take up that would normally\nbe an afternoon order because families are here. We're going to ask members to\nall take your seats and cease conversation.\nRepresentative Chaz Cannon is recognized for a morning order. I'm going to ask\nmembers if you will please stand as he recognizes a former member of this house.\nRepresentative Kevin.\nThank you, Mr. Speaker.\nI rise this morning to honor the life and service\nof William G. Billy Fallon.\nPassed away on January 4th after 92 years\nof extraordinary life of service to our community\nof mulchery and to our state.\nBilly graduated at the age of 15\nfrom mulchery high school and entered Georgia Military College\nin Millageville.\nHe then enrolled in Mercer University\nwith a degree in history and went on\nreceive his Juris Doctor in the Walter F. George School of Law. He became a member of the\nGeorgia Bar in 1959 and served more than six decades in legal profession. In addition\nto his legal career, Billy was also a veteran of the U.S. Army and served during the Korean\nWar. He served two terms in the Georgia House from 1967 to 1970. And three terms as the\nchairman of the Calcutta County Board of Commissioners, including one as president of ACCG.\nIt was also on the Georgia Board of Industry and Trade, the inaugural Georgia World Congress\nCenter Authority, the inaugural State Quality Basic Education Initiative, and was in the\nvery second class of Leadership Georgia.\nAside from this extraordinary life of achievement, perhaps as greatest accomplishment was marrying\nthe love of his life.\nHis beautiful bride of 67 years, Miss Barbara Fallon.\nTogether they had three wonderful children, Leah, Bill, and Laura.\nLeah joins us this morning in the gallery.\nFor 92 years, Billy lived a life of purpose, passion, and meaning through his commitment\nto God, family, and community.\nOur state is better off as a result.\nPlease join me in a moment of silence for the life and service of William G. Billy Fallon.\nThank you, Mr. Speaker.\nRepresentative is Leah in the gallery.\nSpeaker, she is.\nCould we welcome Leah and thank you for your family service.\nThank you for being here with us today.\nI'm sure your dad loved this house.\nLet's welcome representatives Yerter forward and maybe some other friends for another\nremembrance at this time as a morning order because we do have some folks in the gallery\nyou would also like to recognize so representative Yerter, Chairman Yerter, representative\nforward and represent those Dean and other friends.\nThank you, Mr. Speaker.\nMembers, will you please excuse me, sir?\nWill you suspend members please rise?\nThank you, Mr. Speaker.\nWe rise today to honor the life of Bryce Johnson.\nBryce was the Tipton Judicial Circuit DA who passed away\non December 2, 2024.\nBryce was first elected DA in 2020,\nand just last year he ran on a pose\nand was about to start his second term.\nBryce was a loving husband to Erica\nand proud father to wheel and son to Terry.\nBryce was a resident of Tifton,\nbut he grew up in Worc County,\nand I can tell you Worc County was very proud of Bryce\nand all his accomplishments.\nBryce was an example to all of us about integrity, leadership, and how to treat people.\nHe was hardworking, extremely bright, and most importantly, he had a great sense of humor\nand I can tell you, that's a rare combination, but Bryce had it and a lot of you knew it\nhere.\nBryce loved politics, some have referred to Bryce as having an encyclopedic knowledge\nof politics, especially Georgia politics.\nBryce would often come by the store and talk politics,\ndidn't matter what I'd work to do,\nbut we always love talking to Bryce.\nWe could spend hours talking politics,\nand you know, that knowledge,\nI could retain about 10% of what he knew,\nso, as a matter of fact, Bryce knew more about\nsome of my elections than I recalls.\nBryce also loves sports.\nHe's a big work, County Rams fan,\nlove the braze, FSU, and I think Erica even taught him\nand being a Georgia fan from time to time.\nBryce, as you all know, was involved\nin the Republican leadership of Georgia.\nHe met many friends up here in this body\nfrom that experience.\nBryce was really no stranger to the Capitol.\nJust last year he attended judicial hearings\nor an additional judge to the Tipton Judicial Circuit\nand his attendance was very valued to me\nand others in our district\nthat helped push that legislation through\nand he was there for the bill signing as well.\nYou know, I wouldn't be surprised if Bryce\nsitting up and having long political discussions\nwith former governors and even presidents\nand I tell you, Bryce leaves a big hole\nin Southwest Georgia and all over the state\nAnd there's a free and I'm going to deeply miss Bryce.\nAnd it's just something that I value his friendship forever.\nI think I can speak on behalf of a lot of us up here\nwhen we say we wouldn't be here without the encouragement\nand political wisdom from our dear friend, Bryce Johnson.\nIf you'd allow me, I'd like to share with you\nthis resolution honoring the law at the memory\nof Bryce Allen Johnson, whereas the state of Georgia\nmourns the loss of one of its most distinguished citizens\nwith a passing of District Attorney Bryce Allen Johnson\non December 2, 2024, whereas Bryce Allen Johnson\nwas born on January 6, 1972 in Sylvester, Georgia.\nI believe son of Donnie Lee Johnson and Terry Reigns\ncould.\nWhereas Bryce Allen Johnson showed an infinity for politics\nfrom a young age and his commitment to his beliefs,\nas well as his ability to debate\nthe most divisive political topics\nwith respect and good humor\nwhere inspirational to those around him.\nAnd whereas in his adult life,\nhe served in various capacities\nin local district and state republican organizations\nas the Lister General for several towns\nand as a district attorney\nof the Tipton Judicial Circuit,\nwhereas outside of politics,\nBryce Johnson found joy in watching\nhis favorite teams play,\ncoaching his son sports endeavors\nand serving as the professor to the Chick-fil-A Friday night football radio show.\nWhereas a man of deep and abiding faith, Bryce Allen Johnson was an active member of the\nfirst Methodist Church of Titton, where he served as president of the Church Council and\nwas a member of several committees.\nAnd whereas he was united in love and marriage to his wife Erica Stribling Johnson and was\nblessed with a remarkable child, William Allen Johnson.\nwhereas we will, he will be remembered for his encyclopedic knowledge of facts both important\nand trivial.\nBryce Allen Johnson could always recite a team roster, a school's mascot, a county seat, or\neven a school's most famous player.\nAnd whereas a compassionate and generous man, Bryce Allen Johnson will long be remembered\nfor his love of family, friendship, and community, and will be missed by all who had the great\nfortune of knowing him.\nthe family of Bryce Johnson, please stand.\nAnd may we have a moment of silence\nas we honor Bryce for a life well-lived\nthat will not seem to be forgotten.\nThank you.\nThank you, members.\nAnd thank you all of the representatives.\nA great remembrance.\nThank y'all for making the trip up\nfrom South Georgia to be with us as a great day of remembrance.\nAnd we appreciate Bryce's contributions to his family,\nthe community, and to this state.\nThank you all so much for being here.\nGod bless you all.\nWe're representing Kimberly Neu.\nThat's my important information.\nShe's on, so give her a listen up.\nShe also, oh, she's got several friends with her.\nWe're going to talk about CSG South, representative new.\nThank you, Mr. Speaker and members of the House.\nGood morning.\nI'd like to ask all of my cows alum family\nto come join me in the front.\nIt is my pleasure to welcome CSG South\nto the Georgia House.\nPlease stand up.\nCSG South is a non-profit,\nnonpartisan member organization that serves 15 Southern States.\nThey provide policy research and analysis,\nleadership development, governmental staff training,\nthe cows alone standing with me.\nAnd we all highly recommend this program.\nIt's the Center for Advancement for Leadership Skills Program.\nIt was an amazing experience.\nIt was wonderful to meet legislators\nfrom 15 different Southern States.\nand we are just better for it,\nbetter legislators for being a part of it.\nCSG also hosts their annual Southern Legislative Conference,\nwhich this year will be held in Birmingham, Alabama,\nJuly 19 through the 23rd.\nTheir headquartered in Atlanta,\nand today we have with us the Regional Director,\nLindsey Gray, Director of Marketing and Program,\nExtraordinaire, Angel Towsman,\nCommunications Coordinator Hope Grindel,\nand Programs Associate, Jasmine Jones.\nPlease join me in welcoming them to Georgia\nand to the People's House.\nThank you.\nThank you.\nDo you have another one as well?\nLet me just say this before you move on\nto your other morning order.\nC-S-G, we appreciate you, y'all are my favorite.\nI don't know about the rest of these folks,\nbut I can tell you that and give a each,\nI heard several meetings, so we appreciate y'all\nand y'all, the information y'all bring to us\nyear round is very helpful and we appreciate\nyour input and your counsel.\nThank you so much and good to have y'all here.\nOkay, Representative Newt,\nYou have the microphone again.\nThank you, sir.\nAnd members, if I could have my delegate,\nwell, do I have my delegation with me?\nThis one, but today it is my honor to welcome my friend\nand Douglas County Chief Superior Court Judge, Cynthia Adams.\nShe's been serving as Superior Court Judge since 2017.\nShe's the first female, first African-American to serve\nas the judge and Chief Superior Court Judge\nin Douglas County on the state or superior court level.\nShe was originally appointed in 2017\nand has been re-elected twice\nto continue serving her community.\nShe's married to her college sweetheart Duane,\nhas two wonderful kids.\nPlease join me in welcoming her to the people's house.\nThank you, sir.\nThank you.\nThank you.\nThank you, sir.\nThank you.\nJudge, welcome.\nWe're glad to have you here.\nWe appreciate your work and your community and it makes us make a difference and obviously\nthey keep returning you so congratulations on that and we appreciate your wisdom and\njustice and moderation that you bring to the people.\nThank you so much.\nChairman Hawkins, I think you have a special announcement, some folks are here with us today.\nChairman Hawkins, give the gentleman your attention please.\nThank you Mr. Speaker.\nToday we have the members of the Georgia Dental Association up on, I think, three sides.\nI'd like to commend this profession for all they do, for the missions of Mercy, where\nthey treat over 1,000 people in one day.\nThe time they give in the private clicks of their free time at no charge, taking care of\nthe patients of Georgia.\nAnd for all the continuing education that they go through every year to make sure that\nthe treatment is up to date, and George has\nget the best health access to care\nof anywhere in the United States.\nStand up and be recognized.\nThere you go.\nThank you.\nWow.\nThank you.\nNice ties.\nThey're beautiful.\nThank y'all.\nWe appreciate we know that our\nphysical health is tied down oral health so thank you for everything you do\nand serving the people of Georgia as well we appreciate you. Thank you. Thank\nyou Mr. Chairman and thank you for your work over the years and your\nprofession. Okay, representative Fleming, Crow, and Henderson. Well, I'll beat it\nthe well. And we're going to have a nice, another nice group of folks are here\nwith us today. Come on, representative Henderson. We're ready, sir. If you're\nready, we're ready. Thank you, Mr. Speaker. The Newton County delegation is\nhonored today to have a leadership Newton County with us today as an alumni of the association\nmyself. It's a great program for our leaders in Newton County and business leaders. So if\nleadership Newton County would stand so we can recognize y'all and thank y'all for being\nhere today.\nThank you, Mr. Speaker.\nChairman Guthrer, we had to relocate you, man.\nMembers, we have a motion, and I want to recognize and ask for what purpose does Chairman\nGuthrer rise?\nThank you Mr. Speaker I rise to make a motion to recommit House Bill 55 to let's let's do it this way\nSo we don't go by the rules. I know you're a former judge. I know you like to go by the rules. So I'm gonna do my best\nState your motion\nI move to recommit House Bill 55 to the judiciary committee\nMr. Clerk will you read the caption?\nthe commission.\nHospital 55.\nI was on the floor to the\nhundred and 70th.\nPerchette of the hundred and\nseventy-six quarter to the\nhundred and seventy-fourth\nand others.\nMeantime act to amend Code\nSection 1562.\nWill the official go to\nGeorgia and say we're\nleading the number of judges\nthis superior courts.\nOn the general's motion that\nthe House Bill 55 be\nrecommitted to the Judiciary\nCommittee is their objection.\nPeriod notice ordered.\nThank you, Mr. Chairman.\nMr. Clerk, will you read a caption to a group of privileged resolutions honoring the life\nand memory of Reverend Dr. Homer Lee Mitchell Senior?\nrecognizing February 4, 2025 as Girl Scout State Capitol,\nrecognizing commending the National Council of Negro Women,\ncommending the George Walton James Old Authority chapters of the daughters of the American Revolutions,\n2024, 2025, good citizens, recognizing and\ncommending serious soup ash, the winner of the 3M Young Science Challenge,\nrecognizing January 26th to February 1st, 2025 as physician anesthesiologist week at State Capital for other purposes that completes the reading of the privilege resolutions.\nIs there any objection to adopting the privileged resolutions chair here's none of the resolutions are adopted?\nRemove on afternoon orders now ladies and gentlemen members of the House members. We have a very timely afternoon order here that\nBut we're going to bring to us about the tragedy that occurred yesterday.\nSo if you will, please rise and everyone give the gentleman and friends in the will, your\nattention as we pay respect to that loss of life, that horrendous tragedy that occurred.\nRepresentative McDonald and friends.\nMiss Bigger, Lays and Jill in the House.\nLast night, at approximately 2,100 hours, a tragic mid-air collision occurred just north\nof runway 33 at Reagan International Airport.\nAmerican Airlines Flight 5342 and the United States Army UH-60 Blackhawk Helicopter.\nAs over 300 emergency responders arrived on the scene, they worked hard to see an effort\nto rescue any survivors.\nHowever, as time passed, their mission shifted from rescue to recovery.\nToday I asked this General Assembly and all of Georgia to join me in praying for these\nsouls, lost this devastating incident, and for the families who now face unimaginable\ngrief. To those members of our assembly, including our speaker in Washington DC, we're grateful\nfor your safe return last night. Please be with all our nation's transportation partners\nthat move our loved ones around this globe. We pray for them as safety of its passengers\nis paramount for their mission.\nAs I close,\nas we also keep in our prayers the first responders\nwho have worked through the night in recovery effort,\ntheir difficult task of identifying\nand returning loved ones to their families is just beginning.\nMay we pause on a moment of silence as a body\nand support of all these affected by this heartbreaking tragedy.\nThank you, Ms. Speaker, you're well.\nThank you, Representative, and members, I hope that you will not only with this moment\nof silence in our prayers today, but prayers for these families in the days that come as\nthey deal with this tragic situation, tragic situation.\nScottfield, you're recognized to speak to us about the American Heart Association\nRepresentative Scottfield.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nAs we've been hearing that Thursday, February 6, go red for women legislators.\nWe're asking everyone to wear red.\nIt's the American Heart Association, a advisory campaign to bring awareness to women\nand everyone affected by cardiovascular disease.\nAnd then on Friday, February 7th,\nthe 10th annual Go Red for Women Luncheon\nhosted by State Representative Doreen Carter,\nit'll be here at the Capitol at noon.\nGo Red, I just wanna say a quick, in 2020,\nI was standing here as we were doing the Go Red recognition\nand all of the symptoms she kept saying,\nI kept saying to one of my colleagues,\nI got sent for those symptoms going on right now.\nAnd we got back up, because we were in COVID,\nI got back up there, and all of a sudden,\nnurse, representative Viola Davis, started taking my blood,\nshe started checking my pulse, and she said something's wrong.\nThen, representative Doreen gave me\nand slipped something under my tongue.\nI went down to the nurses station,\nthey're about to call the ambulance.\nI actually drove myself to the hospital,\nand they told me if I had not gotten me,\nI would have stroked out.\nSo when we're telling symptoms here,\nwe're saving lives that we don't even know being saved.\nThank you, Mr. Speaker.\nI'll see you.\nMy be your own.\nThank you.\nRepresentative Angela Moore, do you have an afternoon order?\nWhile the ladies coming down, take your time.\nWe have a former member of the house I believe on the floor\nis former representative Melvin Everson here.\nHe was here a little early.\nThere's Melvin, representative Everson.\nCome on up, Melvin, let's get a photo.\nLet's all welcome Representative Everson back to the house.\nThe lady will suspend just for a moment.\nSo Representative Harrison was a member of one of the finest classes they ever come to\nthe Georgia House. Is he joined? I'm going to represent you, Sheila is, but\nI joined a class that I was in. Melvin is good to see you again, sir. And also\nformer representative England as well representing more are you ready represent\nevangelomore and friends one friend anyway two thank you mr. Speaker I think\nour debutants are seated colleagues in the past the debutants at the capital\nevent have consisted of young women rising to college level. This year we have\nboth young men who will rise and be presented this year. They are from the\nCab County, Rockdale County, Henry County, Newton County and I don't know if\nthere's another county but we are considering them as the devs and the dudes\nand the debutants from the east side of the A. These young people are doing amazing things in\nour community. They are excelling academically and over the last three years of them being here,\nthey have completed over 1,122 hours of volunteer service. All of our previous debutants\nhave attended colleges such as Boston Conservatory, Georgia State, Georgia Southern Fort Valley,\nFAMU at Arkansas, Alabama, A&M, Savannah State,\nKennesaw State, Howard University and the University of California.\nMelissa Sims is the founder and director of Showtime Pearls,\nand she's earned her bachelor's degree here in Georgia,\nand she is in charge of this group.\nThe mission of Showtime's Pearls is to advance the individuals\nand combat community deterioration,\nand juvenile delinquency through mentorship, scholarship,\nand community service projects.\nSince founding Showtime Pros in 2017,\nthe children, there have been 52 young adults\nthat have successfully been entered into society.\nShowtime's Pros has awarded $12,000 in scholarships since 2023.\nsince 2023 Mr. Speaker colleagues would you please help me welcome the young\npeople to the House of Representatives the 2025 Showtime Pro's Bose and\nand debutants from the east side of the A welcome to the house we are proud\ny'all are made there for the beer you're a good-looking group and please join us\nin room 216 for a taco bar to honor our debutants and bows thank you\nrepresentative.\nGrypsney Floyd Griffin is recognized for an afternoon order.\nRepresentative Griffin, give the gentleman your will.\nYour attention, please.\nThank you very much, Mr. Speaker.\nI rise also on the sad occasion of last evening in the Washington.\nThank you.\nI rise on the sad occasion of what happened in Washington, D.C. area last night.\nBut those of you who don't know my background, I am a combat helicopter pilot in Vietnam.\nI also served in a VIP unit in the Washington D.C. area where my unit flew VIPs around the\nWashington D.C. area.\nI flown into Reagan National a number of times.\nI flown into Gullis a number of times,\nPentagon and so forth.\nThat area up there is when I, at least my co-pilot and I,\nand other people flying choppers had to be on best alert\nbecause it is a dangerous flying in that area.\nSo I don't know what happened last night,\nBut I know that anytime we lose anyone, especially in this case,\nour military pilots, really we call ourselves aviators.\nSo I saw a lot of soldiers in Vietnam lose their lives in Champus when they were shot down\nof other reasons.\nSo I didn't see that last night, this morning when I came in I looked at my cell phone\nAnd that's the first thing popped up to me.\nAnd it hit me like a turn of risk.\nSo I also were preyed for the families\nof the military families and the families of the civilians\nthat was lost in that tragic situation.\nMr. Speaker, thank you, and I here to rig with.\nThank you, Representative, and thank you for your service\ntoday, and thank you for your service in the past.\nThat completes our afternoon orders.\nWe'll move on to announcement.\nLeader Estration is recognized for an announcement.\nGet the gentleman to well your attention please.\nThank you Mr. Speaker for planning purposes.\nThere will be a committee chairman's launch on Monday at noon\nin room 403.\nThank you.\nMr. Speaker, please join us for a joint meeting of the House and Senate Fulton delegation\non Thursday today, January 30th, at 4 p.m. in cap 216.\nThank you.\nThank you, Representative McQueen.\nChairman Stevens, Chairman Ron Stevens,\nrecognized for announcement.\nThank you, Ms. Speaker, today at 1 o'clock, room 403,\nthe Economic Development Tourism Committee,\nwill meet for a short meeting to adopt our rules.\n1 o'clock 403 here at the Capitol.\nthat completes our announcements. We do have a birthday over the weekend. I don't know\nhow old this guy is going to be. I'm not even going to ask. But on the 31st of January,\nRepresentative Lehman Franklin has a birthday.\nRepresentative Franklin, happy birthday.\nHappy birthday, sir.\nRepresentative Dewey McLean had an announcement\nand we've located him, he's ready to go.\nRepresentative McLean, get the gentleman here attention.\nWe're about ready to adjourn.\nThank you, Miss Speaker.\nJust want everybody, all of you going to know\nabout the working family that cockles lunch in the day,\nit's in room, 307 in the CLOB, and we are having lunch.\nAnd today's topical be about the GBPI,\nwe'll talk about the 25 budget, as well as the 26 budget.\nSo if you get a chance,\nplease come by 307 in the CLOB and lunch will be provided.\nLook forward to it.\nThank you, Mr. Speaker.\nThank you, Representative McLean.\nMajority leader, frustration has recognized for a motion.\nThank you, Ms. Speaker.\nI move that this House stand adjourned until 10 a.m.\non Monday, February 3rd, 2025.\nOn the motion of the Majority Leader,\nthat this House stand adjourned until another month rolls around\nuntil 10 a.m. Monday, February 3rd, 2025.\nAll in favor of that motion will now say aye.\nAll those in favor of that motion will now say aye.\nAll those opposed note.\nBoy, the eyes were strong.\nThis house will be adjourned.\nThank you very much.\nThank you for your work this week.\n",
  "updated_at": "2026-02-12T15:56:43.458463+00:00"
}