{
  "video_id": "z_r5kGRcekY",
  "url": "https://www.youtube.com/watch?v=z_r5kGRcekY",
  "title": "Safe Gun Storage Press Conference   1-28-2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 25,
  "summary": "Here is a structured markdown summary of the Georgia Safe Gun Storage Press Conference on 1-28-2025:\n\n## Overview\nThe press conference focused on legislative efforts to address safe gun storage and reduce unintentional gun deaths of children in Georgia. Key speakers highlighted the state's high rates of unintentional shootings by children and called for action this legislative session.\n\n## Key Actions\n**Bill 1**: Creation of a statewide database to identify students in need of essential services related to gun safety\n**Bill 2**: Establishment of a statewide \"ZARC\" (Gun Safety and Responsibility Coordinator) position to disseminate information, work with industry, and advise the legislature\n\n## Bills Introduced (First Reading)\n- Safe storage law with misdemeanor penalty for knowingly allowing minors to access firearms\n- Legislation to keep individuals adjudicated as dangers to themselves or others in the federal background check system\n\n## Notable Moments\n- Speakers emphasized that hardening schools alone is insufficient to prevent tragedies, and that addressing easy access to guns in communities is crucial.\n- Bipartisan support was highlighted, with speakers from both parties calling for action.\n- The fallout from the recent mass shooting at Appalachia High School was discussed as driving the urgency for legislative solutions.\n\n## Votes\nNo votes were mentioned.\n\n## Attendance\nNo specific quorum details were provided.\n\n## Adjournment\nThe press conference concluded, with no next session date specified.",
  "transcript": "The purpose that is programmed today of this press conference is to\nhighlight the issues that are important as it pertains to\nsafe storage and gun safety in the state of Georgia.\nI'm State Senator Daniel Jones representing the 10th district and I had the opportunity to cheer the safe storage\ncommittee this summer and I just want to discuss it this here and some of the findings that we have on my safe storage\na study committee. And I also want to emphasize the importance of this body this\nyear taking action. There have been a lot of suggestions, particularly members\nat a house, on what we can do as a body. But one thing that I do know is doing\nnothing is not an option. So I am glad to have Heather and the groups that\nand moms demand action joining us today\nfor this press conference.\nThe question that we had our aesthetic committee\nis what can Georgia do?\nAnd I just wanna share with you two things\nthat I think are critical and others will share the same\nin terms of what we can do as a legislative body\nand what we can do in our great state.\nWe've heard somebody remarks by Governor,\nwe heard some remarks by Lieutenant Governor\nand we've also heard remarks by our speaker\nand even our superintendent of schools.\nGovernor Kim says he wants to give money to the school system.\nWell, I'm going to show our governor a way\nthat he can spend that money so that it will benefit Georgia,\ncertainly as it pertains to reducing the number of pediatric\ndeaths in our great state.\nOne of the things that we highlighted\nin the study committee is that Georgia has the eighth highest rate of unintentional\nstudents by children in the United States.\nAnd I hope that kind of syncs in with members that are present here today.\nAnd it should also be stated that Georgia, that the highest incident of pediatric deaths\nin Georgia is caused by unintentional gun shootings.\nTo me, those numbers are just staggering and really unacceptable and Georgia can do better.\nAnd I said Georgia can do better because it's two things that I'm asking our great state\nto do during this legislative session.\nHere with me is bills that we are filing today and these are bills that should address\nA lot of the concerns as it pertains to children gaining access to guns, and I would also\nshare that members here today will share other ideas that we plan to introduce as well.\nThe first bill that I want to talk to you about is a bill that deals basically with creating\na statewide database.\nGovernor Kimson has remarks that he's on spending excess of $20 million.\nThe priority and our opinion should be the vote in some of that money on creating a state-wide\ndatabase where the rules are being promulgated by DOE, our Department of Education so that\nwe can identify those kids within our school systems and there's 180 of them in our great\nstate that need essential services and that kids can be identified that have problems\nin a particular school system to ensure that those problems do not carry forth into any\nother school system in our great state.\nTo me, that is just the bare minimum that Georgia should do as it retains to gun safety.\nThe other issue that I would like to discuss deals with creating a statewide ZAR position,\nand of course this position would be subject to funding.\nSo I'm calling on Governor Kim and I'd like to say to the body to allocate funds to\nfund a statewide ZAR position. This is not anything new as it pertains to gun safety.\nAs a matter of fact, the states of Texas has been doing this well over 20 years. North\nCarolina, Utah, and even other red states have a position very similar to this in their\nlegislative branch. And even in North Carolina, they have a position similar to this underneath\nthe Department of Juvenile Justice.\nThat's why we're here today.\nThis person, this ZARC, as I call it,\nwill have responsibilities to disseminate information\nthrough all of our schools, K through 12.\nThis person will have the responsibility\nof working with industry and defining best practices.\nAnd this person will have the responsibility\nof working with the legislatures to ensure\nthat as we move forward, that we are focusing on those issues\nthat is critical in ensuring the safety of our kids throughout our school system.\nSo those are the two bills that I plan to introduce and I'm going to ask if other members\nof our group will join me in discussing some of the issues that's critical, that we\ndeem critical to providing for the safety and care of children in our school system.\nThank you so much, Senator Jones, and thank you for your leadership on the study committee\nthis summer.\nAnd thank you to the leaders of our senate for appointing this study committee to talk\nabout this difficult issue.\nOur state is particularly in Barrow County, of course, but parents all across our state\nand schoolchildren all across our state are still grappling\nwith the fallout from the tragic mass shooting\nat Appalachia High School last year.\nAnd so far, we've heard a lot of discussion\nabout additional funds to harden public schools.\nAnd that discussion needs to be had.\nBut one thing that must be pointed out\nis that all the hardening in the world\nwould not have stopped the tragedy at Appalachia High.\nYou can make it a fortress, a school of fortress,\nand the young middle schooler who brought a gun to school\nand ultimately died after shooting herself\nat her middle school in Cobb County just this year in 2025.\nAll the hardening in the world isn't gonna stop that y'all.\nMost of these shootings are sadly done by people\nwho are a part of the community\nand they are expected to be in the building.\nAnd it just gets more and more glaring\nwith every single tragedy, the refusal\nto talk about other parts of the equation\nthat are necessary for any solutions.\nAnd so I commend Senator Jones for putting the issue\nof the very, very easy access to guns\nthat we have here in our state.\nWe have one of the weakest states in terms of gun laws.\nWhen it is extremely easy to get guns,\nthere will be lots of guns around in the community\nand people's homes on the street.\nAnd you will have more shootings, accidental, or on purpose.\nAnd you will have more deaths.\nAnd we have to talk about that side of it.\nAnd guess what?\nGeorgians know.\nGeorgians do not believe the Republicans\nwhen they're like, well, I guess we better put some more,\nyou know, some more locks on the doors.\nI think Georgians know that we have to be honest\nabout what has caused our gun violence crisis\nand talk about all parts of what we need to do to address it.\nI've got a couple of bills that I want to add\nto Senator Jones's package.\nI have followed them all before.\nOne is a safe storage around Miners Bill\nthat will require locking up guns around children\nAnd with a misdemeanor penalty, if one knows or should have known\nthat their gun could be easily accessed by a minor and a tragedy\nensues, another is, and this one's more complex.\nSo I won't go on and on if you want more details come find me.\nBut in Georgia, we essentially throw people out\nof the Nick's database.\nWe stop submitting their names to the Nick's database\nafter five years after an involuntary commitment\nfor mental health purposes,\nfrom someone who has been adjudicated\na danger to themselves or others.\nThat is not a safe practice,\nto just simply stop sending the names.\nAlso it conflicts, it is against federal law\nbecause having been involuntarily committed\ndue to being a danger to oneself or others\nis a bar for gun ownership\nunless you've been through a hearing process.\nSo this legislation, which is almost made\nto the finish line many times working with the GBI and others would simply set up that\nhearing process as opposed to summarily just not submitting the names anymore without\nfurther inquiry from folks who may be a danger to themselves or others. We also will have\none again as a caucus that would close our domestic violence, loophole wherein misdemeanor\ndomestic violence, convicts are still a lot, a legally capable holding guns here in Georgia\nwhich we know is incredibly dangerous and domestic violence being a huge\nproblem and cause of death and most typically it is with a weapon so those are\nthe three bills I want to highlight real quick for you all and thank you I think\nGeorgians are ready for a change as far as this how we talk about the gun\nissue it started over the summer with the study committee that Senator Jones\nwere actually able to chair that was a big deal to actually have a Senate\nstudy committee actually look at this particular issue of safe storage.\nAnd it's continuing now with these bills that we have here, and quite frankly, these\nbills that are here that are firmly supported by the Democratic Caucus is one that covers\nso many different issues.\nAnd that's exactly how it should be, whether we're talking about safe storage, whether\nwe're talking about creating a czar, it basically covers a lot of different areas as far\nas gun safety is concerned.\nAs a former prosecutor, I'm extremely interested in the fact that now we would actually be able\nto help domestic violence survivors as far as their abusers have an access to weapons\nthat is also going to be something that we're going to be pushing hard for, all of these\nbills are part of a general package that actually is going to keep Georgia safe.\nAnd I believe that Georgia's are ready for a change.\nThey're tired of not talking about this issue.\nThat was shown with that study committee in the support that that study committee had\nand they ready to do some action.\nSo the Georgia Democratic caucus is ready to get going and ready to do some action on\nthis particular issue.\nAnd we think we've got some good bills here that can pass, and even if they do not pass this particular year, we're going to get them done next year, but we're going to push hard.\nThere's no doubt about it. We're going to be pushing hard to get this legislation passed because it's to protect the state, our citizens and to protect Georgia's. Thank you so much.\nI just want to thank Senator Jones for his leadership on this issue.\nAs a former high school principal, I just want to give a little more perspective as to the\nimportance of the bill in which schools will communicate with each other.\nAs a high school principal, we all know that it's important to get information about our\nstudents' academics, but also it's even more critically important to ensure that we\nare getting information as to issues and concerns that schools have had with their students.\nIt is critically important for all parents to know that their children are in safe environments,\nAnd as a former educator who had a student bring a gun to school, have an information\nshared between schools is critically important and can't just stop at academics.\nSo these, I know it's become a term that is used a lot, but truly common sense reforms\nto ensure that our children are safe in our schools.\nWe all want to know that our children are safe and our educators are safe.\nSo I'm very excited to support these bills and I know that we can do more in the state\nbecause our parents are demanding that we do more\nto protect our students and our teachers\nand our school buildings.\nThank you.\nThank you.\nI'm State Senator Gail Davenport\nand we just have to do something\nabout these school students\nand something about gun violence.\nYou can go anywhere and just buy a gun.\nAnd so my mother and my sister were both retired teachers\nAnd they were there to teach children, not to police and to make sure that people did not\nbring guns to school.\nWe have to put force legislation and to make sure that we stop this gun violence.\nYou know, when I was years ago, when I was working the night shift right here in Atlanta, Georgia,\nI was attacked from behind and the gentleman pulled a gun out and it just scared me.\nNow we have so many persons that I lived,\nbut we have so many seniors now who called every day\nand afraid to go to the grocery store, afraid to get out.\nSo we have gun violence all around.\nSo we're gonna do something about this gun violence\nand stop it right now.\nSo I pulled Senator Jones, he made your Jones\nfor having the study committee and fighting for\nthe stopping gun violence here in the state of Georgia\nand across this nation.\nThank you.\nThank you.\nHello, my name is Heather Hallett,\nand I am the organizer for Georgia Majority for Gun Safety.\nWe are a coalition of all the various advocacy groups\nin the state of Georgia who are advocating for changes\nto Georgia Law to promote responsible culture of gun ownership here in Georgia and promote\ngun safety.\nWant to thank Senator Jones so much for initiating the Safe Storage Study Committee over the summer.\nAnd the bottom line is that the majority of Georgians, and we are a coalition of Democrats,\nRepublicans, gun owners, people who don't own guns, lots of doctors and clinicians, parents,\nregular people, the majority of people in Georgia support common sense legislation like\nchild access prevention laws.\nWe know that safe storage saves lives and there are bipartisan actions that we can take\nin the state to promote a culture of responsible gun ownership.\nI applaud Senator Jones again on advocating for funding\nto promote things like safe storage education.\nFirearms are the number one cause of death\nin children and teens in Georgia.\nAnd there are bipartisan actions that we can take.\nAnd I just applaud all of the legislators\nwho are up here in taking action and welcome\nthe rest of the legislature to join the majority of Georgians who know that there are things\nthat we can do to solve this problem.\nThat concludes our press conference.\nAre there any questions that our group can answer?\nPlease join them.\nYes.\nI'm sorry I can't hear you.\nCan you come a little bit closer please?\nThat's an excellent question, by the way.\nThe question was, how do you address the privacy concerns with children from parents when\nthey had privacy, and that data may be shared when they go to another school system?\nI would simply say that when a child transfers to another school system, there's already\na package that follows them.\nAs part of that package, the income in school system is obliged to accept that child.\nAnd I don't see any privacy concerns that should be addressed or could even possibly be\nthat big of a concern when it comes to a child needing medical attention, needing quality\ncare that they may have received at their previous school system.\nAnd I would hope that the parents would expect that their child will continue to receive\nthat same quality of care at the incoming school system.\nSo I do not see that as a private concern.\nI see it more as a safety concern.\nAnd as I've already said, there's a lot of data in our school system that follows children\nwhen they transfer already.\nThank you.\nWell, I can tell you the Republicans that I've spoken with have expressed an interest in\nthe two bills that I've introduced.\nI'm not going to call any names because when you have those tenuous relationships and\nthat tepid support, I'm certainly not going to do anything to discourage any\nmy colleagues on the other side of the aisle from joining with us in this\ndiscussion and certainly joining with us and helping us promote this\nlegislation. Our goal is the past legislation. That's what our goal is and as\nour minority leaders already mentioned, our minority chair, we're willing to\nwork with anybody and we will continue to do that in working with anyone that\nhas an interest in this, and I pray that all of the legislators in this great body already\nshould have an interest considering the trauma, if you will, that Georgia has its experience\nas it pertains to school students.\nI think I saw a statistic recently that already in January, it has been well over 18 high\nschool students across the country, the numbers are going up, they're certainly not going\ndown.\na lot that we can do. It's not going to cost the state that much money. And as I mentioned earlier,\nthis is kind of the low hanging fruit. This is the bare minimum. But certainly, we're always going\nto push to do more. Oh, I'm very confident. It's really those that are serving with me. They\nThey will tell you that it's never ever easy for a legislator,\nparticularly a Democrat and a legislator that's in a minority to pass legislation up here.\nBut I think my track record and that of those that stand with me speaks for itself.\nWe have passed legislation last year.\nI passed Senate Bill 10 that Governor Kim signing a law that was embraced.\nKeep in mind, it's not the legislation.\nIt should be ideals that drive a consensus in its body.\nI think we've done a good job between the study committee and the press conferences that\nwe've had in presenting ideas that should drive a consensus in its body.\nAnd I'm asking all of my colleagues, not just the Democratic colleagues, but the Republicans\nas well, to look at this idea and base your decision on supporting it or not supporting\non the merits of what you see.\nAnd I can share with you that every Republican I've shared this idea with regarding the\nThe database in the czar, which is not new to politics in the country, have its press\nsupport for.\nSomebody else want to join in, please.\nI'm sorry, could you repeat the.\nYou know, incentives are, the question is why, why, why have it, you know, be, be a criminal\ncharge?\nAnd here's, here's the answer, incentives are great and not as another thing that, that\nshould be discussed.\nBut one of the problems we have that I believe a number of our senators referred to is the\nsort of culture created that we have created here in Georgia of permissiveness and of not\nhaving in the forefront a discussion that these are extremely dangerous objects that you\ndon't just treat like you might treat something else.\nYou would expect that everyone would do that, but I can tell you that that's certainly\nnot the case.\nAnd when you don't have a charge that results, you know, and obviously someone, if their\nchild has shot themselves to death accidentally because they got their hands on a weapon which\nof course happens hundreds of times across the country and has happened many times here in\nGeorgia just in the last few years obviously they're probably devastated but by not saying that\nis not something that you are legally allowed to do under our state's code by that not being there\nThat sends a message. That sends a message like it's just fine to leave your gun lying around kids.\nSo that, to me, is one of the reasons that it is important to have it stated in Georgia code\nthat it is not legal to leave a gun around, around minors.\nAnd that is not to say that other ways to get at that problem don't have merit.\nBut I do believe that part of what our laws do is they represent our values as a society,\nand if those laws are so at counter purposes with the way you want people to behave,\nthen you need to look at that piece of it too. And while I'm on that topic,\nlet me just add that, you know, in Georgia, it was not illegal for the Appalachian\nshooter's father to give his 14-year-old an AR-15. Again, something that really is a bit\ncounterintuitive, but when it's perfectly legal, why would you expect people to not do it?\nSame logic goes with the safe storage, and thank you for the question.\nThank you. Can we do it? We have time for one more question, by the way. Yes, ma'am?\nLet me just ask if you would get with Senator Parent, so she can answer that question for you, and let me conclude this press conference.\nI thank everyone for being here today, even the members on the other side of the aisle with us.\nPlease introduce yourself.\nI'm representative of the State House.\nCome on up, Representative.\nI ask Representative House to ask you a lot to join us.\nShe had a conflict with there's some legislation\nthey've already introduced in the House as well, please.\nThank you.\nI'm representative of the State House of District 52.\nAnd Representative Ow and I have both filed\nlegislation over the last three terms probably.\nI know she has pediatric safe storage as well.\nI will be dropping the red flag bill again this year.\nA lot of these things could go in tandem,\nI truly believe, monitoring the kids' school records\nas they transfer those things showing up\nand then being able to go law enforcement\nor family members to alert schools\nand to remove guns from the homes.\nThose are important.\nAnd then I'll also be filing another bill\nabout domestic folks being convicted of domestic violence,\nnot being able to have guns.\nTo me, that's common sense.\nThe U.S. Supreme Court has passed it,\nbut the states need to file it as well.\nSo I love being able to work with the Senate\non these important common sense gun safety bills.\nThese are not crazy.\nI personally, my family has guns locked up at home.\nI'm not anti-gun, but we have to begin to find ways\nto protect our kids and to protect our communities.\nThank you.\nThank you all for attending and this concludes our press conference.\nMoms of action, I appreciate you guys, Heather. Thank you, thank you all for being here and been part of this press conference today.\nThank you.\n",
  "updated_at": "2026-02-12T19:09:06.726226+00:00"
}