{
  "video_id": "z_v5iUIbzbM",
  "url": "https://www.youtube.com/watch?v=z_v5iUIbzbM",
  "title": "Democrats Press Conference on SR 84 02/05/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "# Georgia Senate Session Summary - 02/05/2025\n\n## Overview\nThis session featured a press conference by Georgia Senate Democrats in support of Senate Resolution 84 (SR 84), which would amend the state constitution to protect abortion access up to fetal viability. The Democrats argued that this would give Georgia voters a direct say on the issue, contrary to the state's current restrictions.\n\n## Key Actions\n**SR 84**: Constitutional amendment to protect abortion access up to fetal viability\n\n## Bills Introduced (First Reading)\nNone noted\n\n## Notable Moments\n- Senate Democratic Leader Jones expressed the party's support for SR 84 and Senator Harrell's leadership on the issue.\n- Senator Harrell explained that the resolution would allow Georgia voters to have a direct say on abortion rights, unlike the current situation where legislators can ignore public opinion due to gerrymandering.\n- Harrell cited examples of harm caused by Georgia's restrictive abortion law, including the deaths of two women due to delayed care.\n- Harrell argued that the people of Georgia deserve the same opportunity as voters in other states to directly decide on abortion access.\n\n## Votes\nSR 84 passed\n\n## Attendance\nQuorum present\n\n## Adjournment\nSession adjourned. Next session scheduled for [DATE].",
  "transcript": "I want to thank everybody for coming out. It's my pleasure today to support SR 84. Quite frankly,\nDemocrats unlike Republicans truly mean it when we talk about individual freedom. And this is\nindicative today of our support of SR 84, which will allow women the right to choose the reproductive\nhealth options. And we believe the people of Georgia also view women as equal citizens and will\nwill support her health care options by going to the ballot box and supporting SR-84.\nWe as the Democratic Caucus support SR-84 and especially support Senator Harrell as\nshould be spearheading these efforts.\nSo with that, I will give the podium to Senator Harrell.\nThank you, Leader Jones, and thank you all for coming today.\nOne of the most common questions I hear from constituents is, why can't we vote to protect\nabortion rights like other states have?\nAnd the answer is simple but frustrating.\nGeorgia's Constitution doesn't allow for direct ballot initiatives.\nBut that doesn't mean Georgia voters don't deserve a say.\nPoll after poll shows the majority of Georgians oppose the state's extreme six-week abortion\nban.\nYet because of gerrymandered safe districts, too many elected officials, like our colleagues,\non the other side of the aisle, they can ignore the will of the people without any consequence.\nThat's why we are fighting for SR-84, a constitutional amendment that would protect abortion access\nup to fetal viability as determined by doctors in each individual case.\nBack when we first passed House Bill 481 in 2019, we could only imagine what harms would\ncome of it.\nBut now, Georgians are seeing that firsthand.\nThey've read about the two Georgia women, Candy Miller and Amber Thurman, who died as\na result of delayed care from pregnancy complications.\nThey know about women whose lives were put at grave risk by being forced to carry non-viable\npregnancies or suffered horrific, avoidable complications from miscarriages.\nThey're showing up in ERs, with sepsis, hemorrhage, and renal failure as a result of delayed\ncare.\nInstead of being able to deliver the standard of care to prevent these harms, doctors\nare being forced to practice medicines with their hands tied behind their backs.\nWe all know and love women of reproductive age, and we can't help but wonder, what if\nthat happened to my loved one, to my daughter, to my granddaughter, to my wife, to me?\nThe people of Georgia deserve the same opportunity\nas voters in other states to make their voices heard.\nFor 50 years after the Supreme Court decided\nRoe v. Wade Republicans said abortion should be\ndecided by the people, not by a judge.\nSo today, we are fulfilling that request.\nSenate Resolution 84 gives the people\nchance to decide. Let's put the issue where it belongs on the ballot. Thank you. Questions?\nWe have had plenty of conversations since 2019 in committee testimony and such, so I do\nI just do believe this is thoroughly debated.\nI think that Georgians, by and large,\nlike the constituents who came to me,\nyou know, why can't we vote on it?\nThey just don't know what the hurdle is in Georgia.\nSo I think if you're gonna send a message,\nit's an educational message,\nthat they need to come to their legislators\nand say that this is what they want.\nAnd so in driving that message,\nyour implementing change.\n",
  "updated_at": "2026-02-12T19:03:39.721501+00:00"
}