{
  "video_id": "Zar0UlYDkNY",
  "url": "https://www.youtube.com/watch?v=Zar0UlYDkNY",
  "title": "Senator Parent & Senator Harrell Press Conference | Donna's Law",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 23,
  "summary": "Here is a structured markdown summary of the Georgia Senator Parent & Senator Harrell Press Conference on Donna's Law:\n\n**Overview**\nThis press conference focused on the introduction of SB 522, known as \"Donna's Law\", which would allow individuals to voluntarily place themselves on a \"do not sell\" list to prevent them from purchasing firearms during periods of suicidal ideation. The law is named after Katrina Breeze's mother, Donna, who died by suicide after impulsively purchasing a firearm. The senators and advocates highlighted the rising rates of suicide by firearm in Georgia and the need for this type of preventative measure.\n\n**Key Actions**\n**SB 522**: Donna's Law - Creates a process for individuals to voluntarily suspend their ability to purchase firearms during periods of suicidal thoughts.\n\n**Bills Introduced (First Reading)**\n- SB 522: Donna's Law\n\n**Notable Moments**\n- Katrina Breeze shared the tragic story of her mother's suicide and how Donna's Law could have saved her life.\n- Chelsea Piot, from the American Foundation for Suicide Prevention, spoke as a suicide loss survivor and in support of the bill.\n- The senators emphasized the bipartisan nature of the legislation and their hope to gain broad support.\n\n**Votes**\nNo votes were taken, as this was an introductory press conference for the bill.\n\n**Attendance**\nQuorum was not mentioned.\n\n**Adjournment**\nThe press conference concluded, but no next session date was provided.",
  "transcript": "and start our press conference. Thank you so much to everyone who is here to talk about SB 522,\nDonna's Law, especially Katrina Breeze who flew in for this hearing and is the one of the\nmain individual spearheading the adoption of Donna's Law around the country.\nToday we want to talk to you about SB 522. We want to talk about tragic but preventable\ncircumstances where individuals are dying by suicide and have not been given all the\ntools that they could be to prevent that outcome for themselves and for their families.\nis on the rise, but many are preventable. And it is rising faster here in Georgia than\nit is in other states in the Union. Over 48,000 people died by suicide in the US in 2021,\nand nearly 1,700 of those were Georgians. In 2021, 226 of those deaths were among veterans,\nand 60% of Georgia suicides are by firearms.\nWe don't hear about suicides by gun the way we hear about mass shootings,\nbut we can't sweep the facts under the rug.\nSuicide is a leading cause of death above homicides.\nAnd people may think of them like they do sometimes erroneously think of gun violence\nviolence is an urban problem, they may be thinking of suicide by gun also as an urban problem.\nIn fact, in both instances, it's more prevalent in our rural communities.\nThanks to the compassion, personal experience, and hard work of Katrina Breeze,\nwe, Senator Harold and I, are today presenting Donna's Law as one method to prevent suicide.\nI'm going to let Katrina tell her mother's story in more detail, but she suffered from bipolar\ndisorder and this tool was not in place in the state that she lived in before she spontaneously bought\na gun and committed suicide. So how does Ghana's law work? It creates a way for people battling\nsuicidal thoughts to voluntarily put themselves on a do not sell list for guns.\nPeople can voluntarily and confidentiality, confidentially suspend their own ability to\npurchase and possess firearms.\nThey would decide this, knowing that there are a person that maybe has battled depression\nin the past, has had suicidal ideation in the past, and in a moment when they're not\nin that low, they realize that they, when they're in that state, may be at risk of doing\nsomething spontaneous and taking their own life. And when they're in their right state\nof mind, they say, I want these tools available to protect myself. If I'm not always, as I\nam now, if I do have that low, again, where I'm experiencing suicidal ideation, Donna's\nThis law is easily implemented and at a very low cost, the Georgia Bureau of Investigation\nwill create two forms, a form to get on for a person to voluntarily place themselves\non the do not sell list and a form for the individuals to get themselves off.\nA person can file the form with the probate court in the county where they reside or\ncomplete the form with their health care provider.\nreceipt of the form via either method, the Georgia Bureau of Investigation contacts the FBI\nto put the individual's name on the NIC system, which is the National Incident Criminal\nBackground Check System that gun merchants utilize for background checks.\nThe goal of Donna's Law is prevention.\nIt is a lifeline to those who are vulnerable to self-harm and it gives those individuals\nthe freedom to choose to help themselves so that they can live. Georgia would be the fourth\nstate to adopt this legislation. The other states are Washington State, Utah, and Virginia.\nWe have a number of experts because that I'm excited for you to hear from today.\nIn addition to Ms. Breeze, we have practitioners in the medical field as well as\nand one of our citizen advocates\nwho's an expert in suicide prevention,\nwho can tell you some other important relevant facts\nabout what Donna's Law would do to help.\nSo, but first, I'm gonna turn it over to my co-sponsor\non this legislation, Senator Sally Harrow.\nThank you, Senator Parent.\nI too want to thank everyone for coming today.\nI've actually been working on Donna's Law,\nthe Donna's Law bill for the last couple of years.\nI've been trying to get bipartisan support,\nbecause it seems like if there's any piece\nof gun legislation we could introduce in Georgia\nthat could get bipartisan support, it would be this one\nand it should be this one.\nAnd we are still hopeful that we'll be able\nto get that support.\nWhen I realized that Senator Parent was also working\non this bill, we decided to pair up.\nAnd pairing up resulted in us getting a hearing today\nin the Senate Public Safety Committee,\nwhich we're very excited about.\nJust recently, this bill took on new meaning for me.\nShortly after Senator Parent and I filed Senate Bill 522,\na young woman who is a family friend tragically\ndied by suicide with a fire arm.\nNone of her family members knew that she had that gun.\ndone. There are too many people hurting in our state. The COVID-19 pandemic\nexpanded and intensified a growing mental health crisis in Georgia. Mental\nhealth America ranks Georgia 49th in the country for access to mental health\ncare. While we work on removing barriers to access, Donna's law will help\npeople who experience suicidal ideations to protect themselves from making an irreversible\ndecision. Studies show that suicide attempts are hasty decisions made during a short-term\ncrisis. Donna's law can help those in crisis and their mental health providers to save lives.\nI now would like to introduce the woman\nwho is why we are here today, a Katrina breeze,\nwho was able to travel here today.\nAnd we're so grateful that you are here.\nYeah, I really appreciate it.\nThis was my mom, Donna.\nWe call her Mama Donna in New Orleans.\nShe recently died by shooting herself in the head\nwith a handgun.\nShe had just purchased that same day.\nShe did not want to die.\nand she did not want to shoot herself.\nShe wanted to live and she wanted to play\nwith her grandchildren, but her bipolar disorder\ncreated an impulse for suicide.\nShe was aware of this and frightened by her altered state.\nShe knew that she was in danger and she immediately\ntook proactive steps to protect herself\nfrom suicide every way that she legally could.\nShe went to her doctors and psychiatrists regularly\nand maintained daily contact with them.\nShe then voluntarily committed herself\nto impatient psychiatric care multiple times in a row.\nShe tried everything she could to not kill herself.\nDespite the best psychiatric care,\nmy mom was forced to leave her hospital programs\nand she impulsively Googled for nearby gun stores on her phone.\nShe drove to the gun store\nand bought her first gun and shot herself.\nOur family called the police five times that day\nto prevent the tragedy that was unfolding.\nMy mom wrote to her psychiatrist\nthat same day, desperately begging for help.\nMy mom had never even held a gun before.\nShe took the gun to the public park\nand she shot herself under a tree.\nI know my mom would have signed up for this list\nbecause she definitely did not want to die.\nHad my mom been involuntarily committed\nto the psychiatric hospital,\nshe would have been protected\nfrom an impulsive suicidal gun purchase.\nBut because she took the initiative\nto voluntarily commit herself to a psychiatric hospital.\nShe was not protected from purchasing a gun.\nA voluntary waiting period to purchase a gun\ncould have saved her life.\nI want to be on this list too,\nbecause families like mine desperately need this tool.\nThank you.\nThank you, Katrina.\nNext up is Chelsea Piot.\nThank you, Senator, and thank you for having me here today.\nMy name is Chelsea Piot.\nI'm the Associate Area Director for the Georgia Chapter of the American Foundation for Suicide\nPrevention, and our chapter is in support of Katrina and Donna's Law.\nSo I'm speaking about this issue today, not only as a representative of AFSP, but also\nas a suicide law survivor.\nI lost my father to suicide by firearm in 1996,\nso I was very young at the time\nand didn't know what resources were available to me.\nMy journey with AFSP has been instrumental in my grief\nand just wanna share a little bit about what AFSP does\nand how we can support.\nSo we are the leading not-for-profit organization\nand our mission is to save lives and bring hope\nto those affected by suicide.\nAnd we do that through research,\neducation, support, and advocacy.\nAnd I know we touched on this earlier,\nbut just over close to 1,700 deaths in Georgia in 2021\nwere suicide deaths.\nAnd 60% of those were firearm deaths.\nSo at AFSP, we strongly encourage gun safety and safe storage,\nsafe usage.\nAnd research shows us that putting time and distance\nbetween a person who is at suicide risk\nand the lethal method can save their life.\nSo that's what Donna's Law would help to do\nis to put time and distance between someone\nwho is in that suicidal crisis.\nSo AFSP again is happy to be here\nand support Donna's Law and support Katrina as well.\nSo thank you.\nNext up is Dr. Peter Ash.\nThank you very much.\nI'm a professor of psychiatry at Emory University.\nI also sit on the legislative committee of the Georgia Psychiatric Physicians Association,\nwhich is basically the leading professional organization representing psychiatrists in\nGeorgia.\nAnd I am happy to say that the GPPA does support this legislation.\nI'm authorized to tell you that.\nAnd really what this does from a psychiatric point of view is it allows patients who anticipate\nthat they may act impulsively to put themselves on a list so they can't buy guns.\nI think from a mental health perspective, we understand that many mental health conditions\nmost, in fact, wax and wane.\nAnd as mental health practitioners,\nwe try to help patients have insight into their condition.\nOne classic example, particularly for these kinds of issues,\nis bipolar illness, which different people\nhave different courses.\nBut the characteristic course is there's\na period where the person is actually normal.\nThey're not experiencing symptoms.\nAnd then, often biologically driven,\ntheir mood shifts and they may get depressed for a while\nand then after a while come out of it,\nback to normal, then they may get a little hyper\nand manic and come back.\nAnd so these people can, while they're in their normal state,\ncan clearly anticipate, because they've had a history,\nthat in the future they're likely to get depressed\nfor periods of time.\nAnd given that, we try and help support\nOur patient autonomy to really, when they're doing well, make decisions about what should\nhappen to them when they're not doing so well.\nIn a way, this is analogous to the psychiatric advance directive, which was legislation\nthat was passed in Georgia back in 2022, which allows patients, when they're doing well,\nto give consent for psychiatric treatment of whatever sort they want when they need it\nlater and may not be in a position to understand the pros and cons of treatment.\nThey could also appoint an agent, but for purposes here, so we have a history now of having\nmechanisms so that patients, when they're doing well, can make decisions that will affect\nhow they're, what happens when they're not doing well.\nAnd Donna's Law, I think, is another instance of this, where they can protect themselves\nto that.\nAnother thing about this law, particularly from the perspective of a psychiatrist, is it\nprovides a clear way to take up with a patient considering when things aren't going so well.\nFor example, a very large percentage of inpatient psychiatric admissions are precipitated by\na person either making a suicide attempt or having serious suicidal thinking.\nSo they come into the hospital in that state and then they're treated and by the time\ndischarge comes around, they're improved.\nAnd at that point, you discuss with the patient, you know, what's the safety plan going\nto be going forward.\nAnd this provides an easy, clear way to bring up an issue about, well, what about, you know,\nthe idea that you might get impulsive and when you get more depressed, you know, you may\nfeel like hurting yourself and here's a way you could protect yourself from that.\nSo that would be not only helpful to patients, but would be helpful to clinicians as well.\nAnd I think these kinds of things like the psychiatric advance directives on which we have\na fair bit of research.\nThey are generally accepted by patients\nbecause the patients feel that it increases their autonomy.\nIt increases their ability to make decisions.\nOften people caught up, particularly in the mental health\nsystem, feel, well, other people make decisions.\nThe doctor says this, the doctor says that.\nAnd ways that you can help the patients feel\nthat they're in control of what happens to them\nare very valuable.\nSo with that, I'm personally, and on behalf of the GPPA,\nI'm happy to support this bill.\nThank you very much.\nThank you, Dr. Ash.\nNext up is Kim Jones with NAMI.\nThank you, Senator Harrell and Senator Parent\nso much for this bill and for your support\nand work on this bill.\nThank you, Ms. Breeze, for being here today\nin my regards for your mother as well,\nyou're a brave woman.\nAgain, I'm Kim Jones, Executive Director of NAMI Georgia,\nthe National Alliance on Mental Illness.\nAnd I am here to offer support for this bill.\nWe think it is a good bill that allows people and peers\nto have choice and control over the process,\nwhich is very important to those we serve.\nAnd that is exactly what House Bill 522 does.\nThis bill will also, as was just mentioned,\nbroaden the opportunities for clinicians and counselors\nfor patients' needs and give them more opportunities\nto also help those that we serve.\nSo we're just here today to say thank you\nto our senators for bringing this forward\nand participating in this process\nand helping us make a better Georgia for those we serve.\nThank you.\nThank you, Kim.\nAnd finally, we have Roland Bain.\nGood afternoon. My name is Roland Baim. I'm one of the co-founders of the Georgia\nMental Health Policy Partnership, along with Kim and the former chairman of the Georgia\nChapter of the American Foundation for Suicide Prevention. I am also the father of a 29-year-old\nyoung man named Kyle who took his life in August of 2019. I am delighted to be here to\nto lend my support to SB 522.\nAs you've heard, it does a number of things.\nBut one of a couple of measures that maybe are worth noting\nis that this is not just a bill that's designed\nto help those who may be suicidal.\nThis is a bill that sends a lifeline to their family,\ntheir friends, their colleagues, their classmates.\nThis is a way in which an individual who might otherwise\ntake their lives is able to move beyond that.\nAs was mentioned, the best thing to put between yourself\nif you're suicidal and the act is time.\nAnd this gives that time.\nAnd while some may be concerned that somehow it implicates\nfirearms and may in fact sort of impede or encroach\non Second Amendment rights, this\nis fully consistent with our Second Amendment rights.\nOur rights don't require us to have a gun.\nOur second amendment rights give us the option\nof having a gun, just as it gives us the option\nof saying, I will not have a gun,\nor I will not have a gun for a certain period of time.\nAnd so by being able to put that time\nbetween the individual and the act itself,\nlives are saved, lives are saved not only\nfor those individuals, but for every suicide death,\n135 other people on average are affected,\nAnd those are immediate family members, friends, classmates,\ncolleagues, things of that nature.\nAnd those who are affected by suicide\nare themselves at a higher risk of suicidality\nin the years to come.\nSo this offers an off-ramp for an individual.\nIt provides a blessing to that individual's family,\nfriends, colleagues, and classmates.\nAnd it is something that is fully consistent\nwith any conception of what our rights are under the Second Amendment.\nSo I think that this is a perfect vehicle as Senator Harrell was mentioning to sort of\nmove forward in terms of saving lives and bringing hope to Georgians who might otherwise consider\ntaking their lives by firearms.\nSo thank you both for bringing it and thank you for your efforts.\nI'm so sorry for the loss of your mother.\nThank you.\nThank you.\nquestions. Thank you. That's all of our scheduled speakers, but we're happy to answer any questions\nif there are any. I was just going to ask, you know, we're doing toward the end of the session\nhere. You know, what do we, what do we feel, how confident are you feeling that this bill is going\nto get any kind of a vote? Well, our goal is to a, say, thank you to Senator Albert, the chairman\nof public safety for having a hearing even though it was introduced late in the session.\nDo you want to speak about your work with him over the last few years?\nSure. So our terms are two years. Two years goes very quickly when you're only talking about 40 days\nin each of those years. So it is common for it to introduce issues one term and then carry them\nthrough the next term, and I think we have some long-term goals like that.\nIt is actually quite an accomplishment to have gotten the hearing today, because like\nI said, I've been trying to get that for two years, and it's difficult to get anything\nheard in this state that has anything to do with a firearm, and so I think we have taken\nand tremendous steps forward in getting the discussion started.\nYou answered my question with that.\nI was just going to ask about conversations with colleagues across the aisle.\nBut it sounds like you spoke about some of their hours and hours.\nYeah, and I think there are going to be an opportunity for some good conversations\nwith our colleagues on both sides of the aisle.\nObviously, especially the Republicans over the interim.\nand hopefully as we get into next year and that was one of the goals of introducing the bill\nin a full hearing, even though we knew that it would not be eligible for a vote this year.\nAnd I think the opportunity that our colleagues had to hear from all of these individuals and\nexperts can start to the education process. And when we get into next year and for meetings ever\nthe interim, there'll be more time to explain some of the nuances and answer educate folks on\non suicide and suicide prevention when they may not know,\nfor example, that those that don't survive a first attempt\noften do not try to commit suicide again.\nSo I think there's some opportunity for education\nafter hearing from some of these experts today\nand we'll hope that we can work to build\ntowards a bipartisan vote in favor of Donna's law next winter.\nThat's very important.\nYeah, come to the conclusion.\nYou know, a number of, sorry.\nJust in case.\nIt's a very important point, some people think that once you become suicidal,\nyou remain suicidal and you will continue to attempt until you ultimately complete that suicide.\nBut the facts show that to be a boldface lie. What you see is individuals who have attempted\nsuicide but have not completed, 90% of them will not go on to die by suicide,\nso that if you can save a life in the short term, you've saved that life in the long term.\nand what a minimal investment for such a tremendous return.\nSo.\nThank you.\nThere we go.\nAny other questions?\nWell, thank you all so much for being here, and we hope to see you again next year\nas we continue pushing this legislation forward and try to save George and Flags.\n",
  "updated_at": "2026-02-12T01:30:20.25629+00:00"
}