{
  "video_id": "Zb0-u7KOyXo",
  "url": "https://www.youtube.com/watch?v=Zb0-u7KOyXo",
  "title": "Inside the historic renovations of the Georgia Capitol Building",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "Overview:\nThe transcript details the extensive renovations being made to the Georgia State Capitol building, focusing on the restoration work in the House and Senate chambers. The renovations aim to preserve the historic architecture and infrastructure while modernizing key systems like HVAC, electricity, and accessibility.\n\nKey Actions:\nNo specific bills or legislation mentioned.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Detailed descriptions of the painstaking restoration work, including replastering, new HVAC systems, over 76,000 feet of new cabling, and the meticulous repainting and gilding by specialized artisan painters.\n- Mention of previous renovations under former House Speaker Tom Murphy that had to \"cut corners\" due to time constraints.\n- Emphasis on the sense of pride and ownership the Georgia-based contractors, architects, and craftspeople feel in restoring this historic state landmark.\n\nVotes:\nNone detected.\n\nAttendance:\nNo quorum notes provided.\n\nAdjournment:\nNo specific adjournment or next session date mentioned.",
  "transcript": "We are at the top of the house chambers.\nTop the house chambers, so we've got a lot of the work that's been redone.\nIt's a rare, close look at the intricate artistry and guilded touches at the highest point of the house chamber.\nThen you have the fine detailed work in here.\nThey were restored all this and then added some more detail of adding gold into that.\nWe want it a little bit. Georgia gold everywhere. Georgia gold in here.\nUp to and a half stories, we're standing atop a complex skeletal framework, comprised\nof tons of connecting pieces of steel, mass of scaffolding, built on house floors so\nold, they needed showing up first.\nThe weight of the scaffolding is quite heavy, so we had to have a lot of engineering to\nbe done to make sure we didn't collapse this scaffolding to the bottom floor, so we replaced\nall the flooring that's in the building.\nwere still went back to the original timbers that were from the 1800s.\nRefreshing every inch of the chambers required engineering precision,\nbalancing preservation with safety. In that enormous wooden box.\nThis is our chandelier. The chandelier will see downstairs as boxed up, protecting it.\nIt's been cleaned. They're going to be putting new lighting in there.\nArtisan's meticulously restored everything to its original\nneoclassical look of the late 1800s.\nThere have been over 60 painters that have just worked in this building.\nWe have artisan painters that are here doing the detail work.\nThey actually started on that detail work in their shop in New Haven, Connecticut, back\nlast January.\nSo they went through a selection process.\nThere's probably three historical painters in the United States that do that work.\nKind of a knob color.\nAnd that's one of the store colors that has been in there for a while.\nBut it's been more pink before we started.\nThere's been a lot more pink.\nThere's more what we called like a Pepto Bismalpink that was then brought in and so that\nwas been more replaced with some of the Bob.\nThe restorations, not just cosmetic, it's comprehensive right down to the air inside\nthe building.\nThey repaired plaster damage from the humidity in the building.\nOriginally, the domed ceiling opened up to let out hot air inside the chamber.\nIn the building and from the people discussing things in the building.\nI would imagine there was quite a bit of putting it different times here.\nNow, the HVAC system, the last time it was replaced is in the late 50s.\nSo it was definitely needing to be done.\nSo we're proud to have that and have good quality air in here and try to maybe keep it\na little bit cooler or keep tempers down if they need to.\nWe leave the house.\nWe're in the Senate Chambers.\nSo we started the restoration project in the house in Senate Chambers back last May.\nare this past May, and so we're wrapping up in here.\nOn this day, the scaffolding is gone,\nand they're working on wiring and new carpet.\nIn here, there's new stain on the wood.\nEvery piece of wire has been pulled.\nEvery item has been either touched in some way.\nWe have new HVAC and air systems in the building.\nHandling that, we have a new stain on the wood,\nnew paint on the wall, new gold in the gilded areas,\nand the chandeliers have been cleaned.\nThey are putting new wiring in a building,\nnot built for that kind of electricity we use today.\nWhen we ripped up the floors,\nwe were able to do new duck work throughout here.\nSo just in the Senate chambers,\nthere's over 36,000 feet of cabling\njust in this small area that we have here\nand in the house chambers there's over 76,000\nfeet of cabling in there.\nLawmakers will have better access to computers and phones\nwith USB ports and chargers at their desk,\nand where are those desks on this day?\nThe desks are being restored down in the depot.\nWe turned the depot, the Georgia depot, into a workroom.\nSo we've been doing the restoration of the desks\nthat have been on-site.\nWe didn't let them leave state property,\nso the workers have come in there to do that.\nChairs were a little bit more of a challenge.\nThe chairs have far outlived their usefulness,\nSo we actually have replica chairs that are coming in,\nsome of them are original chairs\nfrom the turn of the century.\nNot the most recent turn of the century,\nthe one before those long ago, 1990s.\nNow to the carpet.\nIt's very similar to the design of before,\nthere's some modifications because I did not know this,\nbut all the carpets have copyright design on there.\nWe've got this design.\nIt's actually out of Dalton, Georgia.\nSo Charlotte Carpet is our provider for that\nand very proud of what they were able to produce for us.\nGeorgia grown, of course.\nContractors, architects, and craftsmen,\nmany Georgia taxpayers themselves,\ntreating the capital as a shared legacy.\nBut just being part of this project,\nthis is more of a sense of pride\nin giving back to the state.\nThey've all taken this as their ownership\nand that they're all taxpayers here in the community\nand they're proud of what they're doing\nand you can just tell by the quality of work.\nModern systems carefully hidden now support a building first completed in 1889 that hadn't\nbeen restored in 30 years.\nAnd even then faced challenges under House Speaker Tom Murphy.\nThe story goes that they were going through a pretty extensive renovation and they had\nto cut off a cut a few corners with them because Speaker Murphy got tired of all the time\nit was taking and so he told them to get out of this chamber.\nSo he was that was one of the things that so Speaker Burns has been very helpful with\nus to make quick decisions. New ADA access, open committee rooms, and redesigned\nstadium seating for the public. This phase of restoration in the chambers began in May after\ncareful planning to finish everything by the end of October. What are you most proud of\nabout this renovation process? Being able to get it done in the time frame that we have.\nPreserving history, restoring dignity, and preparing these revered historic chambers for generations\nto come.\n",
  "updated_at": "2026-02-12T01:26:20.438543+00:00"
}