{
  "video_id": "ZBqKbbjW68I",
  "url": "https://youtu.be/ZBqKbbjW68I?t=1423",
  "title": "Georgia House - Day 4 (2026-01-11)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-01-11",
  "duration_minutes": 172,
  "summary": "Overview:\nThe Georgia House session on January 11, 2026 featured a devotional and prayer led by Reverend West Sarls, as well as a pledge of allegiance. The session did not involve any substantive legislative action, with the focus being on inspirational remarks and setting the tone for the day.\n\nKey Actions: \nNo bills were passed or referred during this session.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- Reverend Sarls delivered an inspirational message encouraging lawmakers to live lives of significance and be \"make it happen people\" who make a positive difference.\n- Reverend Sarls reflected on the history and importance of the legislative chamber.\n- Reverend Sarls quoted theologians and coaches to emphasize the value of purpose, integrity, and service to others.\n\nVotes:\nNo recorded votes took place.\n\nAttendance:\nA quorum was present, as the House chambers were noted to have a \"good crowd.\"\n\nAdjournment:\nThe session adjourned after the pledge of allegiance. The next session date was not specified.",
  "transcript": "So, you can now have the video. That's the last video of our webinar. Thank you so much for having us. Thank you so much. Thank you. Thank you. We'll be moving on to the other videos. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you for joining us today. Oh. Oh. Oh. Oh. That's a lot of fun. Yeah. Yeah. Yeah. Yeah. Yeah. Fuck. Oh, so happy. Yeah. Yeah. Yeah. Well, it's a very good stuff. Yes. So much fun. Yeah. Yeah. Yeah. That's a lot of fun. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I you the I you you You You You you If so, Mr. Clerk, will you lock the machines? Big day, we got a good crowd. Doorkeepers, will you please close the doors and keep them closed? As is our custom, we will begin our day with Scripture reading and prayer by the Chaplain, after which we will pledge allegiance to the flag of our country. Our Chaplain this morning will be introduced by the gentleman from the 100th and 12th House District, Representative Bruce Wingson. Thank you, Mr. Speaker and members of the House. It's my honor today to introduce I pastor the day, Reverend West Sarls from Monroe, Georgia. I first met Reverend Sarls about 13 years ago when he and his beautiful wife Ashley moved to Monroe when West was called to serve as the youth pastor of the Methodist Church, to which I belong. In subsequent years, he and Ashley have been blessed with three children. Now I believe Ashley is about 12 years old and Hudson and Hayes. If they are watching this, I apologize Hayes. There are twin boys, there are nine years old, but West is somebody that he has taught more than I am. He is somebody I have literally looked up to over the last 13 years, but more so I have looked up to him spiritually. He is a great man of God and I would like to tell you a little bit more about his service. Reverend Sarls has been in the ministry for 16 years and is currently one of the senior pastors at Monroe First Methodist Church. He was born and raised in Athens. He attended Georgia College and State University where he was an outstanding baseball player for four years. He was a great athlete in college, but he is also known to be a pretty fiery competitor. He brings that same fiery passion and making sure that our next generation knows Jesus while also serving not just our church, but all God's children of all ages in Walton County. West, thank you for joining us today. I give you Pastor West's All. Thank you, Mr. Speaker. I just call him Bruce, but it is an honor to be here. I was kind of a last second edition yesterday about two o'clock with the phone call, but I've always learned to never turn down an opportunity to share the good news. So I am so thankful to be here at the history of this room. I know you all come in here all the time. So for somebody new like me to walk in and just be overwhelmed by the history and the heritage in downtown Atlanta in this amazing place. So thank you for having me. My wife wanted to come. She is a nurse in Monroe. She's a cancer nurse. So she spends her time with chemo patients. I let her have a pass today. There's something that we say this time of year, at least I hear it a lot. Maybe you do too. It stops around the middle of January, but we say this phrase, Happy New Year. Happy New Year. What the heck does that even mean? What does Happy New Year mean? Does that mean we hope that you have a Happy New Year or is it selflessly saying we're speaking it into existence that we are going to have a Happy New Year? Never really know how to take that. But I hope this year is happy for us. I'm going to quote somebody. He's a theologian and he just so happened to retire yesterday is Nick Sabin. And yeah, trust me. Well, I'm a Georgia guy, but I've got smarts quote at the end.\n\nBut there's something that Sabin, and I think he actually got it from Lou Holtz, how to quote about being happy, is that if you want to be happy for an hour, go eat a steak. If you want to be happy for a day, go play golf if you're decent at it. If you want to be happy for a week, go on a cruise. If you want to be happy in your life, ask yourself this question. If you didn't show up here tomorrow, what anybody realized you're gone. And if you answer that question, you will find out, is do you live a life of significance or not? Is what you do matter? I believe it does, and so do you or you wouldn't be here. But it's more about the rules and things that we pass in this room, is do we do things, are we living a life of significance for our next generation? Those that we see every day outside of these walls. So I'm an Apple Watch guy. I don't know if you were a garment or if you're an... I don't know, I'm an Apple Watch guy. I probably should take it off more than I do. But in the mornings, when I'm getting ready, my little activity app reminds me a couple things. And what it says is, at least mine, is you didn't do so good yesterday. Make it happen today. Make it happen. So another great theologian in Davos Sweeney was quoted at saying this. There's three types of people that we come into contact with. The first is a make it happen person. The second is a watch it happen person. And the third is that person that wakes up at noon and says what the heck happened. So there's three types of people. You are make it happen people. Our state, our community is filled with watch it happen people. We call those the armchair quarterbacks. We call those the Monday morning preachers in my world. E-mail you on Monday and say the things that you should or you shouldn't have said. But you are make it happen people. So when you're making things happen this year, live a life of significance. Because years from now, years from now, no one's going to remember your salary. No one's going to remember the hours that you put in to your craft. No one's going to remember, they might, some of the things that you do in here. But what they're going to remember is, who did you love on? Who did you care for? Could you be counted on? Are you a man or woman of integrity? Did you do what you say and serve others and did you bring change for the next generation? Is living a life of significance? It's being a make it happen person. And then closing. Who do you want to be in 2024? I'm not a big fan of making resolutions because, whoa, it's the 11th and most of those are already out the window. If you've kept yours, congratulations. But who do you want to be in 2024? And as you're thinking about that, that's not as important as who God has called you to be. You are chosen in 1 Peter 219. You are a child of God in 1 John 3, 4. You are fearfully and wonderfully made and saw in 149, 14. And my favorite, and I think for you this morning, Jeremiah 2911, you are created for a purpose and of great work. So from a small town in Monroe, thank you for what you do. Thank you for being make it happen people because our world needs more. And as Kirby Smart would say, keep the main thing, the main thing, which is loving God first, loving others and being make it happen people. Would you pray with me? Lord, what a special place this is. Thank you for what you're doing. Thank you for what you've done. Thank you for these families, these people that represent these amazing communities from the small town in Georgia to the biggest. Allow their work to be pleasing unto you, go before them, lead, guide and direct them, give them the strength, give them the courage, give them the wisdom to do great things and be make it happen people so we can live a life of significance for you. We love you and we need you. We thank you for what you're doing across. Thank you for saving us when we have done nothing to earn it. And all God's people said, Amen. Would you join me in the Pledge of Allegiance? I pledge allegiance to the pride of the United States of America and to the Republic for which it stands. One nation under God, indivisible with liberty and justice for all. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Doorkeepers, you can unlock the doors. Members, you can join our Chaplain, Chaplain Sorrows in this south any room for a photo. And then we'll continue with our business. Thank you. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits, please give him your attention and your respect. Mr. Spinn. We have a busy day but we need to take care of the business of this house. Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. And on another note, 20 years from now, we will be more disappointed in what we didn't do than the ones we did. I'll think about that. I'm sure you've thought about how you wouldn't have said it but I'll think about it too. Chairman Tarvan, the Chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the Spents with the Reading the Journal? Chair here's none, the Reading the Journal. Is the Spents with, is there any objection to the confirmation of the journal? Chair here's none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the Order of Business for the day? Representative Strachan, the 104th News following me establishes the Order of Business and the first part of the period unanimous concerns. Introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, morning orders. Is there any objection to adoption of the resolution establishing the Order of Business for the day? Chair here's none, the resolution is adopted. Mr. Clerk, first reading the bills and resolutions, the clerk will read. House will read 61, my reference of school field is 63rd, Scott of the 76th, Davis of the 87th, will be titled Act to a Men. Chapter 1 of Title 26 of the Fisher go to Georgia annotated relating to food, drugs and cosmetics. Agriculture and consumer affairs. House bill 894 of our reference of Horn of the 3rd, Jasper's the 11th, Ridley the 6th, Ridley the 22nd, Powell the 33rd, and others. Bill M. Tonto, an Act to a Men, Chapter 2, a title 21 of the Fisher go to Georgia annotated relating to primaries and elections generally. Governmental affairs. House bill 895 by our reference and Ridley the 22nd, Ridley the 6th, Powell the 3rd, 33rd, Horn of the 3rd, Personjure the 119th and others. Bill M. Tonto, an Act to a Men, Article 2, Chapter 7 of the Title 48 of the Fisher go to Georgia annotated relating the imposition rate, computation, exemptions and credits for state income tax. Ways and means. House bill 896 by our reference and a new with a 64th lot of the 131st, Gold of the 19th, Hullson of the 72nd. Ballot of the 147th and others. Bill M. Tonto, an Act to a Men, Chapter 5 of the Title 19 of the Fisher go to Georgia annotated relating to divorce. Judiciary. House bill 897 by our reference and a Ridley the 22nd, Ridley the 6th, Powell the 33rd, Horn of the 3rd, Jasper's the 11th. Bill M. Tonto, an Act to a Men, Chapter 12 of the Title 31 of the Fisher go to Georgia annotated relating the control of hazardous conditions. Public and Community Hill. House bill 898 by our reference and a Ridley the 22nd, Ridley the 6th, Jasper's the 11th, Horn of the 3rd, Bird of the 20th and others. Bill M. Tonto, an Act to a Men, Article 2, Chapter 7 of the Title 48 of the Fisher go to Georgia annotated relating the imposition rate, computation, exemptions and credits. Ways and means. House bill 899 by our reference and a Davis the 87th, Mitchell the 88th, Beverly the 143rd, Scott of the 76th, Scofield the 36th of the 63rd and others. Bill M. Tonto, an Act to a Men, Part 5, Article 6 of Chapter 2, a Title 20 of the Fisher go to Georgia annotated relating to programs, weights and funding requirements on the quality basic education. Education House bill 900 by our reference and a Davis the 87th, Mitchell the 88th, Beverly the 143rd, Scott of the 76, Scofield the 63rd and others. Bill M. Tonto, an Act to a Men, Article 6 of Chapter 2, Title 20 of the Fisher go to Georgia annotated the quality basic education. Education House bill 901 by our reference and a Scott of the 76, Davis the 87th, Scofield the 63rd, Bill M. Tonto, an Act to a Men, Chapter 4, Title 53 of the Fisher go to Georgia annotated relating the wills. Judiciary House bill 902 by our reference, Scofield the 63rd, Davis the 87th, Scott of the 76th and Roberts the 52nd. Bill M. Tonto, an Act to a Men, Article 4 of Chapter 18 to Title 50, and the Fisher go to Georgia annotated relating inspection of public records. Governmental affairs. House bill 903 by our reference, Scofield the 63rd, Scott of the 76th, Davis the 87th, Bill M. Tonto, an Act to a Men, Part 5, Article 4, Chapter 11 to Title 16 to the Fisher go to Georgia annotated relating to Brady law regulations. Public safety and homeland security. House bill 904 by our reference, advanced to the 133rd Jackson 128th, Campbell 171st, Maynard the 56th, Washburn the 144th. Bill would be titled an Act to a Men, Titles 8, 10, 36, 43, and 46 of the Fisher go to Georgia annotated relating buildings and housings. Regulated industries. House bill 905 by our reference, and it reads the 99th Roberts the 52nd, lever to the 123rd, Lohood to the 175th, Washburn the 144th and others. Bill be titled an Act to a Men, Chapter 66 and Title 36 of the Fisher go to Georgia annotated relating the zoning procedures as pertaining the counties. Governmental affairs. House bill 906 by our reference, year to the 150th second, house to the 170th, Burkle 169th. Bill be titled an Act to men, Code Section 1562, and the Fisher go to Georgia annotated relating the number of judges in superior courts. Judiciary. House bill 907 by our reference, and Franklin 160th Smith the 18th, Mathis the 49th, Jasper the 11th, Collins the 71st and others. Bill be titled an Act to a Men, Article 4, Chapter 6 and Title 40 of the Fisher go to Georgia annotated relating the right away for operators and motor vehicles. House bill 908 by our reference, and Ridley the 22nd Ridley the 6th, Jasper the 11th, Fleming of the 114th, Versa sure the 119th and others. Bill be titled an Act to a Men, Article 13, Chapter 2, Title 26 of the Fisher go to Georgia annotated relating the food service establishments. Agriculture and consumer affairs. House bill 909 by our reference, and Megan the 156th Smith the 18th, Work Eyes of the 157th, Levert the 123rd, Campbell the 135th. Bill be titled an Act to a Men, Chapter 3, Title 35 of the Fisher go to Georgia annotated relating the Georgia Bureau of Investigation. Judiciary non civil. House bill 9010 by our reference, and Jasper the 11th, Cox the 28th, Chastain the 7th, Horner the 3rd, Perkle 169th and others. Bill be titled an Act to a Men, Title 39 of the Fisher go to Georgia annotated relating the Miners. Judiciary. House bill 911 by our reference, and Scott of the 76th, Scofield the 63rd Davis the 87th. Bill be titled an Act to a Men, Chapter 14, and Title 10 of the Fisher go to Georgia annotated relating the cemetery and funeral services. Judiciary. House bill 912 by our reference, and Amanda's into the 10th, Road to the 124th, Bridge of the 1176 Smith the 18th, Williams the 148th and others. Bill be titled an Act to a Men, Code Section 41, one of the Fisher go to Georgia annotated relating the definitions relative to motor vehicles and traffic. Ways and mains. House bill 913 by our reference, and Barnes the 86th, Beverly the 143rd, Oliver the 82nd, Kennedy the 101st, Iowa the 50th and others. Bill be titled an Act to a Men, Title 37, the Fisher go to Georgia and it's ended relating to mental health. Public and community health. House bill 914 by our reference, the 86th, Bruce the 61st, Paris the 42nd, Canada the 58th, Clark the 100, Nathan others. Bill be titled an Act to a Men, Part 3, of Article 6, Chapter 2, Title 20 of the Fisher go to Georgia annotated relating to education programs on the Quality Basic Education Act. House bill 915 by our reference, the 59th Jones the 47th, the 134th and the 155th, Bill be titled an Act to a Men, the Act making providing appropriations for the state fiscal year beginning July 1st, 2023. Appropriations. House bill 916 by our reference, the 159th Jones the 47th, the 144th and the 155th, the Bill be titled an Act to make and provide appropriations for the state fiscal year beginning July 1st, 2024. Appropriations. House bill 917 by our reference, the 159th Jones the 47th, the 144th and the 155th, Bill be titled an Act to a Men, the Act providing appropriations for the state fiscal year beginning July 1st, 2024. Appropriations. House bill 918 by our reference, the 159th Jones the 47th, the 134th and the 155th, Bill be titled an Act to a Men, the Act making providing appropriations for the state fiscal year beginning July 1st, 2023. Appropriations. House bill 919 by our reference and the 159th Jones the 47th, the 134th and the 155th will be titled an Act to make and provide appropriations for the state fiscal year beginning July 1st, 2024. Appropriations. House bill 920 by our reference and the 159th Jones the 47th toughest in the 313th and inicial faithful to the at 155th. Bill Bitton and act to make him provide appropriations for the State Fiscal Year beginning July 1st, 2024. Appropriations. House Resolution 770 by Rep. Scott of the 76 Davis, the 87th Schofield 63rd Resolution, urging the Board of Regents of the University System of Georgia to offer nursing course credit. Higher Education. House Resolution 778 by Rep. Scott Field, 63rd Beverly, the 143rd, Mitchell, the 88th Schofield 76th Davis, the 87th Resolution, urging the Department of Public Health to identify funding for research. Public and Community Health. That completes first readers. Second reading of bills and resolutions, the clerk will read. House Bill 877 by Rep. Lums of the 12th, the Bill to provide a homestead exemption from Chattuga County, Ivalor in Texas, House Bill 878, by Rep. Lums of the 12th, corporate of the 174th, Smith of the 138th, Hitchens of the 164th, Powell of the 33rd, a bill relating to General Provisions, relative to uniform rules of the road. House Bill 879 by Rep. Ridley of the 22nd, Bonner of the 73rd, Powell of the 33rd, corner of the 3rd, Jasper of the 11th and others, a bill relating to the State Defense Force. House Bill 87880 by Rep. Ballard of the 147th, Bonner of the 73rd, Chattuga 176, Blackburn of the 146th, Prince of the 132nd, and others, a bill relating to licenses, or transitioning members of the Armed Forces, House Bill 881 by Rep. Gullet of the 19th, Gaines of the 120th, Chattuga 176, Abstration of the 104th, Hatch of the 155th, and others, a bill relating to Posseucuting Attorney's Qualifications Commission, House Bill 882 by Rep. Bruse of the 61st, Smith of the 18th, Gunter of the 8th, McLean of the 109th, Beverly of the 143rd, and others, a bill relating to the disclosure of a rest booking, photographs prohibited, House Bill 883 by Rep. C. Bob of the 34th, Cooper of the 45th, Hawkins of the 27th, Dempch of the 13th, Cell Cox of the 53rd, a bill relating to meetings, open to the public. House Bill 884 by Rep. C. Alexander of the 66th, Bruse of the 61st, New of the 64th, and Thomas of the 65th, a bill relating to the number of charges of superior courts, House Bill 885 by Rep. Alexander of the 66th, Bruse of the 61st, Thomas of the 65th, a bill relating to regulation, a specialized land transactions, House Bill 886 by Rep. C. Alcoma of the 81st, Fleming of the 125th, Paris of the 142nd, Regent of the 99th, Friday of the 122nd, a bill relating to special license plates, House Bill 887 by Rep. Thomas of the 65th, a bill relating to general provisions regarding insurance, House Bill 888 by Rep. Thomas of the 65th, a bill relating to recording of deeds and other property transactions, House Bill 889 by Rep. Thomas of the 65th, a bill relating to delinquency, relative to juvenile code, House Bill 895 by Rep. Thomas of the 65th, a bill relating to laws and statutes, House Bill 891 by Rep. Thomas of the 65th, a bill relating to income tax is, House Bill 892 by Rep. Thomas of the 65th, a bill relating to regulation of rates, underwriting rules and related organizations, House Bill 893 by Rep. Thomas of the 65th, a bill relating to tax exemptions, relative to property tax exemptions and deferrals. House Resolution 768 by Representative Horner of the Third, Chastity and other 7th, personate at 119th, Canada of the 170th, Ridley of the 22nd. Resolution creating the House Study Committee on the elimination of state income tax, through second readers. Mr. Clerk, we have reports of standing committees. Clerk will read. Representative Hawkins, the 27th District Chairman of the Committee on Health submitted the following report. Ms. Speaker, Committee on Health is on consideration the following bills of the House's Dr. Metri report, same back the House and following recommendations. House Bill 434, Duke Pass, House Bill 502, Duke Pass, respectfully submitted the representatives of Hawkins, the 27th District Chairman. Representative Gunner, the 8th District Chairman of the Committee on Judiciary submitted the following report. Ms. Speaker, Committee on Judiciary has had an consideration following bills of the House and instructed me to report the same back to the House with following recommendations. House Bill 368, Duke Pass, my Committee substitute, House Bill 456, Duke Pass, my Committee substitute, respectfully submitted, Representative Gunner, the 8th District Chairman. That completes the reading, the reports of standing committees. Thank you, Mr. Clerk. Members, will members please take their seats. We have a couple of morning orders that we'll get done now, so give your attention to the gentlemen in the well. Jim and Rob Leveritt is recognized for the House's four doorkeepers at any room. Can you close that door? A lot of coffee sip and noise coming in here. We need to quieten things down. We have some guests in the gallery. We want to show the proper respect to the member and to our guest. Chairman Leveritt, you have friends with you? I didn't know you had any, but it's good to know. Chairman Leveritt is recognized. Thank you, Mr. Speaker. There's still a few brave souls who are willing to acknowledge me. Ladies and gentlemen of the House, we have some very special guests with us in the chamber today from Madison County, which Chairman Powell and I have the pleasure to represent. If they'll go ahead and stand, I am pleased to welcome the participants in the 2024 Madako-made High Potential Leadership Program from Madison County. There here were the sponsors of that program, representatives of the Madison County Chamber of Commerce and Jackson EMC, and I'm so proud to have them here today. This program seeks to encourage, develop, and provide community leadership in order to enhance the quality of life in Madison County. The group's also here today to advocate for your support of the Georgia-Gurne Trail 98, which will be asked to consider and approve later this session. This trail will promote agriturism from Homer to Homer, traversing banks, Jackson, and Madison counties. If approved, they plan on having a ribbon cutting in May 2024 in downtown Commerce, so everybody go ahead and mark your calendars now. I also want to give a special thanks to Anna Strickland, the President and CEO of the Madison County Chamber, who's here today for all of her hard work on behalf of the businesses of Madison County. So thank you, ladies and gentlemen, for being here. Please, if everyone in the House will join me in welcoming these fine folks of the Georgia House. Congratulations. That's awesome. Thanks for being here. Thank you, Miss Bigger, I yield the well, and we'll see you on Georgia-Gurne 98. Gentlemen, as you will, you all have at least one good representative. I think you all have two, so I'll make that your own, made that choice. Chairman Hatchett is recognized for a morning order. This is a special morning order. Thank you, Mr. Speaker. This is kind of an order, but an announcement, too. It's budget time. The budget books have been printed, and will be available in the House Budget and Research Office approximately noon time. And that is 412 CLOB. You will get an email to your State House email when they are available. Around noon, we cannot release them, and in fact, we don't have them until the Governor announces that today. Second, next week is Budget Week. We will start Tuesday, the 16th at 9am in room 341. We are going to hear from the Governor first, and then the State Economist, and then more than 40 agencies over the next three days. Everyone is welcome. Bring your budget book so you can follow the presentations. Next week, 9am, room 341. We'll hear from all 40 plus agencies. Finally, the most exciting part of this today for me is today, when you go and get your budget books, you will receive the inaugural publication of the 2024 Georgia Fact Book. Your House Budget and Research Office has spent all of the offseason producing this book. It is full of all kinds of great Georgia facts, figures, budget stuff. There's even a section in here about the Senate. So, y'all, they have spent a lot of time on this. Let's go ahead and give them a big round of applause for this, because there's a lot of work in this book. Thank you. Budget Office, research office, that's for you. See y'all later. Mr. Chairman, before you leave the well, and you invited everyone to be a part of those hearings. I thank, but the protocol there is that your members of the committee would you speak to that for members? So, there's approximately 85 members on the Appropriations Committee. You are more than welcome to sit closest to the front. So, if you're not a member, make sure that we've got room for those that are members of Appropriations sitting up and toward the front and you are more than welcome to attend. It will be, you know, there will be, it's going to be broadcasts so you can watch it from your office too. But if you're there and you want to ask questions, your members of the Appropriations will be take the prerogative on question asking. Thank you, Mr. Chairman. Appreciate you working. Look forward to the information you will be hearing and bringing to these members next week. Representative Bernal is recognized for a morning order. Thank you, Mr. Speaker. So, today in the gallery, Clayton County Public Schools Superintendent Dr. Anthony Smith, if you stand, if you are, but welcome him to the People's House. And along with him is Dr. Kimberly McLeod. She is the incoming president for the National Alliance of Black School Educators. Thank you, Mr. Speaker. Thank you, Representative. And welcome. Glad to have you all. That completes our morning orders. Members, you may want to listen up to this. It's maybe something you'd be interested in. Most of you, you don't know the days you may hang around here and the days you could go home. So, with that, Mr. Clerk, I'll ask you to read a resolution. House resolution 779. My represent of the registration of the 104th resolution relative to meetings in the Germans and General Assembly. That was shortened to the point. Thought it'd be a little more dramatic than that. Chair recognizes the gentleman from the 104th House District. The majority of this House, leader of the House, the leader of the House, is to explain the resolution. Well, thank you, Mr. Speaker. I know that there's been a lot of, I've received many questions about the calendar for this session and for all of us, but particularly members who represent districts outside of the metro area, having some predictability for our calendars important, not just for our families, but for our businesses, for our constituent work. And last year, as you know, we agreed on a 40-day adjournment resolution that provided great information to members well in advance of session for planning purposes for all of their obligations. Well, I'm proud to tell you here today that we are replicating that. We're going to have a 40-day adjournment resolution.\n\na calendar to present to you here today for your consideration for an unprecedented second year in a row. Thank you. Thank you. So the next question I've gotten probably most here is after our 48 calendar is how many Fridays will be off. Well you will see in this resolution before you in this 40 day schedule of the 12 weeks we have eight Fridays off. So that will provide extended weekends for members to take care of their business here during the week but then be able to get back home to their districts so that they can prioritize their families, their businesses and their local communities. I want to thank Senate Majority Leader Steve Gouge for his work in this process. He and I have developed a strong working relationship working on this schedule and other issues and I'm proud of this deal that we struck. I want to thank Speaker John Burns for his guidance during this process. He certainly as a former Majority Leader himself has experienced dealing with the Senate. So he's been very helpful. Thank you Mr. Speaker. I'd ask for your favorable consideration. I'll just briefly go through the calendar here. As I mentioned on this 12 week calendar there are eight Fridays off so strong majority of our weeks will have Fridays off and that's tremendously important. Additionally if we can flip to the second page we will not be in on Valentine's Day so we can all prioritize our most important constituent at home. And so we will have offer Valentine's Day. House Over Day is set for February 29th. It's a leap year so that will be crossover day. And then we have also if you look after crossover day on this page in the next we have four committee work days after crossover day. So that is something that was very important to me so that House members have plenty of time to work with the Senate to pass their legislation that's pending in the Senate after crossover day and that there's ample opportunity for hearings. So House members proud that we have a 40 day calendar to present to you here today and would ask for your favorable consideration. Thank you Mr. Speaker for your work on this and I yield the well. Thank you. You did a really good job. No questions. One question with the gentleman. Mine returning to the well. Thank you. Mr. Leader. Have a question from the gentleman from the 88th. Representative Mitchell right in front of you. Y'all I mean y'all are pretty close together y'all can figure this out but go ahead and represent it. Thank you Mr. Speaker and I will tell you this is my 22nd year here and I don't recall ever receiving an adjournment resolution this early in the session. How about do you have one question. Tomorrow the state observes the Martin Luther King Jr. observance and I'd like to know with time as a matter of fact I happen as chair of the commission I happen to know that the governor lieutenant governor and yourself were on the program at 10 a.m. So I'd like to know how that is going to square with us coming in tomorrow. Well as you can see in the resolution Martin Luther King Jr. Day on Monday is we're off for session and I think we'll make that when we make the motion to adjourn we'll address the time that we'll be in tomorrow. I think the answer to that we're ready to address that when we get to the motion so we'll come in a little early so we can be on time for everything we need to do tomorrow. There are no further questions I'd ask for your favorable consideration I'll yield the well thank you. General is yielded the well. So we have a adjournment resolution you just were able to take a look at and Mr. Leader thank you for your work. Is there any objection to the adoption of the resolution chair here's none the resolution is adopted before I recognize you for another motion I just want to thank you for your work in conjunction with Senator Gooch and certainly Lieutenant Governor's office our office it was a team effort on both sides of the aisle and on both sides of this building so we appreciate the input appreciate your sticking with the job and getting her done so this gives a lot of folks a lot of comfort and we'll save you having to answer a lot of questions as well so that works as well. Majority Leader has recognized for a motion. Thank you Mr. Speaker I move the house resolution 779 be immediately transmitted to the Senate. Speaker of the illustration moves that house resolution 779 be immediately transmitted to the Senate is objection hearing none in this order. Okay members here's our posture right now we're ready to move on with some important business for this state as we prepare to welcome our guest here so at this time I'm going to ask the members of this House to stand at ease and we'll get back to the business of the day in just a few minutes so don't go away too far we'll be started back on the business of the day very very soon so the House will be at ease. House will come back to order House will come to order members you know the drill take your seats please members will please take their seats. Members will please take your seats. Members will please take your seats. Mr. Doorkeeper. Mr. Speaker the President the President Pro Tem and the members of the Senate await entrance to the House Chambers. Mr. Doorkeeper please allow the President the President Pro Tem and the members of the Senate to enter the House Chamber and will the messenger please escort them to the designated seats. Thank you. We're going to ask the Senate to take their seats. All members of the House and Senate will please take their seats. you you you I know you all have it seen each other in the day or two. Members I think you all are getting ready for the next guest but if members will take their seats or at least have your attention. Mr. Doorkeeper. Mr. Speaker the Honorable Michael P. Boggs Chief Justice of the Supreme Court the Honorable Nell's S. D. Peterson presiding justice of the Supreme Court the Honorable Amanda H. Messier chief judge of the Court of Appeals and the justices and judges of the Supreme Court and Court of Appeals prospectively await entrance to the House Chambers. Mr. Doorkeeper. Mr. Doorkeeper if you will please allow the Honorable Michael P. Boggs Chief Justice of the Supreme Court the Honorable Nell's S. D. Peterson presiding justice of the Supreme Court the Honorable Amanda H. Messier chief judge of the Court of Appeals and the justices and judges of the Supreme Court and the Court of Appeals respectively to enter the House Chambers. Thanks to Mrs. H. To the re Ministries. you you you you\n\nyou you Mr. Doerkeeper Mr. Speaker, the honorable Brian Peacamp, Governor of Georgia, his Committee of Escorts and distinguished guests, await entrance to the House Chambers. Mr. Doerkeeper, please allow the Governor, his Committee of Escorts and distinguished guests access to the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Mr. Doerkeeper, please allow the Governor to enter the House Chambers. You guys have a good time. Yes, we want to sit. Members of the House and Senate, this joint session will come to order. I'll ask everyone to take their seats. It's great to see a full house this morning. Good to have our friends from the Senate. It's certainly good to have a full gallery this morning. So welcome everyone to the people's house. Mr. Clerk, will you read a resolution? House resolution 763 of our representative, Mr. Doerkeeper, please allow the Governor to enter the House Chambers. The House resolution 763 of our representative, Mr. Doerkeeper, please allow the Governor to enter the House Chambers. Thank you, Mr. Clerk. We want to recognize a few people this morning and let everyone show their appreciation to the folks that are here. First, I'll ask you to stand when I recognize you as a group. The Constitutional Officers of the greatest state in the Union, the Constitutional Officers of Georgia, would you all please stand? I'll ask you to stand when I recognize you as a group. The Constitutional Officers of the greatest state in the Union, the Constitutional Officers of Georgia, would you all please stand? I know you're in the gallon. Let's give them a great hand. Good looking group. Good looking group. Members of the Cossal Accord, will you please stand so we can give you, show you our appreciation? Members of the Cossal Accord, will you please stand so we can give you, show you our appreciation? Thank you all for being here. Now, a special person to the people of Georgia, especially to this House, the Speaker Pro Tem of this House, Jan Jones. Thank you for your service. And I'll gentlemen, I've known for a few years, but our paths have brought us closer together. And we're working well. We're both pretty strong-wield, but it all works out. So it's a real pleasure for me to introduce the President of the Senate, a dear friend, Bert Jones. Another dear friend, the President of the Senate, John F. Kennedy. Welcome, sir. Now, a special lady to me, one of the best mothers and grandmothers, and just generally help keep a guy straight. My wife, Dale Burns. The Lieutenant Governor, give me a speech for about five minutes on this next one, but I'm going to short it down a little bit. A great first lady of the Senate that we appreciate her being here today, Jan Jones. If you will, welcome First Lady of the Senate, Jan Jones. Another first lady. Let me tell you, I am incredibly proud I am grateful to this lady for her work on human trafficking. We thank you, we appreciate you, and we look forward to continuing to work with you. So human trafficking no longer exists in our state. The first lady of the state of Georgia, Marty Camp. And the credible first family who's stood by their mom and dad and continued to support them every day. So we appreciate these incredible daughters. Thank you, Mr. Chairman. Lucy, we couldn't go on if you didn't stand up. You had to do it. A special treat for us as well. She's been here any numbers of times, and we always appreciate her, the mother of the governor of this state of Georgia, Miss Ann Cabish. Miss Ann. First mother, thank you for being here. Again, thank you all for being here. First family, we appreciate you and your support for our governor and for what you are doing for our state. So now comes a fun part for me to recognize a friend and a man, a governor of this state who's doing it all right. A leader that proves himself every day. He was a leader before he came here and assumed the position of governor. His skill has improved every day because he has worked every day to ensure that the people of Georgia are better than they were the day before. And I truly believe that his accomplishments working for the hard workers, the hardworking people of Georgia will go down in the history of this state. He has sustained our state through tough times and certainly through very good times as well with a rock solid, common sense approach to life and to government. He needs no introduction obviously in our state, but I kind of assure you that his leadership, he needs no introduction in many parts in any part of this country and in many parts of the world. It's my great honor and my great pleasure to welcome my friend, the 83rd governor of the state of Georgia, Brian B. Kim. Thank you all very much. Thank you all very much. Thank you Mr. Speaker for those kind words. I appreciate the recognition. It's honor to be here. The Lieutenant Governor Jones, Speaker Burns, President Pro Tem Kennedy, Speaker Pro Tem Jones, Members of the General Assembly, Constitutional Officers, Members of the Public Service Commission, Mayor Dickens, Members of the Judiciary, Members of the Concert Corps and my fellow Georgians. Later this year, the people of this state will once again fulfill their civic duty. They will choose to occupy these seats of service and they will determine what course America takes in the years to come. As they have in years past, when they go to the ballot box, they'll see a stark difference between Georgia and our nation's capital. They'll see what we've achieved together at the state level to make Georgia an even greater place to live, work and raise the family. And they'll see the hardships Washington DC has brought into every home and placed on every kitchen table across our state. Congress has become synonymous with runaway spending, bloated budgets, job-killing regulations, gridlock and partisanship, and elected representatives. And both parties who are more interested in getting famous on cable news than delivering results for the American people. All the while across the nation, over 60% of households are living paycheck to paycheck. Over 8.4 million Americans are working two jobs to make ends meet. Mortgage rates remain at highs not seen in the generation. And while the rate of inflation may have fallen, high prices on everything from groceries to rent have not. In fact, it cost Americans over $11,000 more per year to maintain the same quality of life that they had just a few short years ago. For the hard work in men and women of this country, paying $11,000 more a year is not a choice between the luxuries of life. For too many people, that's the decision between putting food on the table for their family, making their car payment, buying clothes for their kids, or going further into debt. For a recent graduate, it's about whether you can afford to get your own place and pay off your student loans. For a single mom, it's the decision about taking a job, a new job, and a new career that pays better, but it doesn't offer childcare. For a family of four, can they make ends meet when also saving for their kids' college and trying to pay their mortgage? And for our seniors, are they able to stretch a fixed income to meet their basic needs? These are the people that Washington DC is left behind. Because for every challenge our nation faces, the federal response is to spend more, regulate more, tax more, and come up with another government program meant to cure every yield. Instead of empowering hard work in Americans to innovate, create, seek greater prosperity, their answer is simply more government. But the good news is here in Georgia, we have chosen a different path. Because we realize that the success of our state does not rely on the actions of government, but the prosperity of our people. Washington DC forgot a long time ago that it's not the brilliance of politicians or the good intentions of a new program that make our nation great. It is the resolve, the ingenuity, and the character of the American people. Those were the hard work in Georgia's we heard from on the campaign trail. As a family, we heard their stories, their struggles, and their hopes for a brighter future. And as you all know, that was truly a family affair. And I want to thank Marty, Jared, Lucy, and Amy Porter for being there every step of the way. Thank you all. And I also appreciate my mom who you all recognize earlier, my sister Julie Reef and her husband are here with us today, and we just are honored by their presence. My commitment to the people of our state was very simple. I promised to put hard work in Georgia's first. Fund our priorities like education, public safety, and health care, but also keep government efficient, responsible, and accountable. The federal government may have abandoned those principles, but here in Georgia, thanks to the partnership between my administration and the General Assembly, we have delivered real results for the people of our state, a head of schedule, and under budget. Thanks to a strong economy and conservative fiscal management of state revenues, we provided nearly $5 billion of direct relief to taxpayers, in tax refunds, gas tax suspensions, home-stead tax assumptions, and more. You all were a big part of that. Despite unprecedented challenges, we have maintained a triple A bond rating, while celebrating the creation of more than 171,000 new jobs, and roughly $74.5 billion of investment in every corner of the Pete State over the last five years. And unlike a lot of blue states, these are private-settler jobs, not growing the ranks of government, and we are not done yet. Last month, I joined Lieutenant Governor Jones, Speaker Burns, and others to announce a plan to speed up implementation of the largest state tax cut in history. With your support, I look forward to signing legislation that decreases our state income tax to 5.39% starting this year. This matters because it represents savings of $3 billion for Georgia taxpayers over the next 10 years. Mr. Speaker, Lieutenant Governor, while President Biden hires tens of thousands of new RS agents, my vote is we just keep cutting taxes here in Georgia. The path that Georgia has taken over the last five years has led to record job growth, historic investment in communities from Bambards to Blue Ridge, $5 billion of tax relief, and enough funds saved to operate state government. That's the choice for Georgia in this November, and I feel confident they'll vote to keep Georgia moving in the right direction once again. So to answer the question, the state of our state is strong, growing, and prosperous because we trust our citizens more than we trust the government. Georgia is succeeding because we have charted our own path, rejected the failed policies of Washington, DC, and worked together to put our citizens first. But I believe the worst thing we could do is call it today and coast through what is certain to be another contentious election year. We have accomplished so much over the last five years despite unprecedented times and challenges because we haven't gotten distracted from doing the job that we were sent here to do. Like I mentioned four years ago in my second state of the state address, we stayed true to the example of Nehemiah, committed to our great work, and now we are seeing the results. It's no secret that Georgia is growing and is the top state for business for a record 10 years in a row. New jobs are headed our way almost on a daily basis. Existing businesses are looking to expand and companies from all over the world look to the Pete State to locate their next headquarters. But with growth comes the need for more trained workers to fill these good paying jobs in a rapidly changing labor environment. That's why I was proud to unveil the Georgia Match program at last year's Workforce Summit. The largest direct college admissions program in the nation, Georgia Match is already doing an incredible job linking the upcoming generation with the schools that meet their needs. As of today, over 10,000 students have already met their match and we'll keep working to reach every high school senior in Georgia so that they know there is a higher education path open. Right here in the Pete State, no matter their circumstances. Speaking of education, my amended 2024 budget in the fiscal year 2025 budget proposals, double down on our continued and historic support of K through 12 education, with $1.4 billion in additional funds allocated to make a total of $12.8 billion. Republicans and Democrats alike have supported this record investment in our students. And I want to take a moment and thank all of you for that strong bipartisan achievement. It's also important for us to remember that increased funding does not guarantee greater success. It's a small business owner for almost 40 years now. I believe like many of you that competition in the free market drives innovation. At the end of the day, they result in a better product for the consumer. When it comes to education, the same principles hold true. Over the last few years, there has been a great deal of debate around different proposals to expand options for students and families when it comes to finding the education that best fits their individual needs. Many members and both chambers have worked hard on this important issue and I want to thank and applaud them for their efforts. Some prefer the term school choice or educational freedom. Some call them vouchers. In my opinion, what each of these terms or slogans fails to mention is the child. At the end of the day, our first and foremost considerations should be the future of that student. Our job is not to decide for every family, but to support them in making the best choice for their child. This week is the second year of another biennial of the General Assembly. I believe that we have run out of next years. I firmly believe we can take all of the above approach to education, whether it's public, private, homeschooling, charter, or otherwise. It's time for all parties to get around the table and agree on the best path forward to provide our kids the best educational opportunities we can, because that is what we were elected to do. To that end, my office and I look forward to working with the members and the leadership of both chambers to get a bill passed and signed into law this session. Finally, our students and teachers deserve to have a safe learning environment, no matter their zip code. Since I took office, I've had the opportunity to hold more than 30 round table discussions with educators and superintendents from all over this state. We heard frequently that our schools were in need of additional resources to enhance security. That's why since 2019, we have provided more than $185 million to all of our schools to help secure the safety and well-being of our students and our teachers. This year, I'm proposing we continue those efforts by making schools' security funding permanent. In my budget proposal, I've included a request for $104 million that will go directly to school districts for school safety enhancements. Schools will determine how to best use this money, whether for personnel like school resource officers or for physical or technology improvements that make our places of learning more secure. This investment is more significant because it will enable schools and administrators to plan accordingly knowing that this money is headed their way for this specific purpose. I hope to see strong bipartisan support for this budget item to keep our kids and our schools safe. Since being sworn in as your 83rd Governor, the top priority of my administration has been ensuring the safety and security of our communities.\n\nThere is no doubt that we have made great progress from the GBI's anti-gang task force and heat unit and the Department of Public Safety's Crime Suppressant Unit to the First Lady's Grace Commission and the Attorney General's Human Trafficking Prosecution Unit and the School Security measures I just mentioned. We have not wavered in our commitment to strengthening public safety, but the state cannot do it alone. Thankfully over the last two years, we have had strong partners at the local level who have worked alongside state law enforcement to make our capital city safer. Two of these gentlemen are here with us today and I want to take a moment and thank Mayor Dickens and Chief Share Bomb for their partnership. We appreciate you all. Thank you. While the mayor not come from different political parties and don't agree on everything, we do agree on the importance of reducing crime and keeping our citizens safe. By partisan majorities of both chambers, the mayor and myself all agree on the critical need for the completion of the Atlanta Public Safety Training Center. This facility... This facility will provide our law enforcement officers, firefighters and additional first responders, the critical tools and knowledge, as well as the skills needed to keep themselves and our community safe. One of our brave public safety officers is here with us this morning. Exactly a year ago this week, this dedicated trooper was shot and severely wounded near the side of the future training center. He spent weeks in the hospital fighting for his life. He endured multiple surgeries and spent the better part of a year in recovery while his family stood strong beside him. Marty and I were honored to spend time with him while he was in the hospital and I was honored when he gave me one of my most prized possession, his SWAT challenge going bearing his badge number. He had that coin on him when he was shot that horrible day and it is a constant reminder for the price paid by men and women like him all over this state who keep our children, our homes, our businesses and our streets safe. Trooper first class, Jerry Parris, would you please stand with your wife Kelly and let us thank you for your great service. Thank you to the entire Parris family for your service, your bravery and the sacrifices you've made over the past year for us. We are also joined in the gallery by some brave men who rendered life saving aid to Trooper Parris on site and who helped get him to safety. They represent some of the very finest from both the Department of Public Safety, the Department of Natural Resources and our EMS folks. Would you all please stand and let us thank you for your bravery on that day. We are so grateful for you all. I don't claim to speak for anyone else in this chamber today, but this decision is very simple for me and my family. As long as I'm your governor, there will be no gray area or political double tall. We will support our law enforcement officers, we will support our firefighters and our first responders in the Atlanta Public Safety Training Center needs to be built period. Article 1, section 1, paragraph 2 of the Georgia Constitution states, protection to person and property is the paramount duty of government and shall be impartial and complete. To fulfill that paramount duty, we must do more than show our support for law enforcement and words. We have to show it through action. That is why last year thanks to the work of the General Assembly, I was proud to sign a budget that included a $6,000 pay raise for state law enforcement officers. That pay raise was a recognition of the contributions these brave men and women make as they put their lives on the line day in and day out. This year I look forward to working with each of you to once again provide another pay raise for state law enforcement. Within my budget proposal or pay increases of an additional $3,000 for state patrol officers like troop repairs, as well as our correctional officers and other state law enforcement agencies. These investments will not only serve as a renewal of our commitment to these law enforcement officers, but will also support our ongoing retention and recruitment efforts. I am also urging the General Assembly to complete what we started last year and give final passage to the Peace Officer Loan Repayment Program. Because despite what some may say, we need more police officers, not fewer. This year will also be continuing our efforts to combat human trafficking in our state thanks to the leadership of the greatest First Lady in the country, Marty Kemp. Thanks to her work and not of the Grace Commission and members of both chambers, Georgia has gone from being known as a human trafficking destination to being known as the leader in going after traffickers and supporting the victims. Under the First Lady's leadership and with overwhelming support from both chambers, we have passed and signed into law eight pieces of legislation that go after those who work in this evil enterprise while also supporting the victims. Our efforts have enabled the GBI's heat unit to investigate 369 cases of human trafficking since its creation. And for Attorney General Cores Human Trafficking Prosecution Unit to secure 32 convictions while assisting rescue of over 129 victims since it launched. But we still have work to do. And Marty and I are both looking forward to working with each of you this session to keep up that fight. Five years into my administration, when it comes to healthcare, we've made enormous strides in lowering cost, expanding access and incentivizing more healthcare providers to give care. We began this work with the passage of the patient's first act in 2019. And since then we've seen strong results. In 2019, no counties in Georgia had more than two health insurance carriers. Today, 87% of Georgia counties have three or more carriers. And thanks to Georgia Access and the Reinsurance Program, enrollment in the private sector exchange over the past five years has grown from just under 460,000 to over 1.2 million Jordans. Georgia Access is also saving hard work and families more and more in their wallets. In all we've reduced premiums by an average of 11% across the state. That represents an average annual premium reduction of almost $929 million a year. In rural counties where premium prices were the least affordable when I took office, Georgia Access has reduced premium payments premiums by an average of 29%. And while some in the media refuse to acknowledge this significant progress, we will continue to support policies that work for Georgians, not political narratives. Because the fact is that for individuals and families struggling to make ends meet, lower insurance costs and more choices lead to better care that they can actually afford. And because... And because we've made those sound policy choices and budgeted conservatively, prioritized innovation and efficiency, we're now able to make other important investments in the health and well-being of hard work and Georgians. That includes our efforts in mental health. Two years ago, as you know, I was proud to sign into law of the mental health parody act. They fitting capstone to the late speaker David Ralston's years of service in this chamber, and one that leaves the lasting legacy. One of the most visible examples of that legacy was the 988 Crisis Hotline campaign, conducted by the Department of Behavioral Health and Developmental Disabilities last year. Thanks to Commissioner Kevin Tanner and his team, more Georgians than ever before are accessing services that help them when they need to turn their lives around for better. To enhance this program further, my budget proposal calls for an increase of $205 million for DBHDD and other entities that address mental health. This new funding will enable DBHDD to expand services for those struggling with mental illness. It will increase the number of crisis beds throughout the state. It will further crisis intervention resources in all communities and improve the quality of mental health services overall. Once passed, we will be spending $1.6 billion on mental health more than ever before. I'm proud of what these and other agencies are doing to help their fellow Georgians, and keeping us the best state to live, work, and raise a family. As we speak all across Georgia, there are men and women working hard to keep our neighborhood safe, attract new jobs and industries to communities in need, and teaching a whole generation that will one day occupy these roles and much more. They have remained committed and hardworking during unprecedented challenges over the last five years, and I'm so proud of everything they have accomplished for our citizens. It is no secret that most state government jobs pay less than private sector opportunities in the same line of work. But for many of our employees do it because they feel a sense of public service, and they want our state to succeed. But for state government to stay efficient and stay ahead of Georgia's continued growth, we must be able to attract and retain employees who perform these vitally important jobs. That is why my budget proposal provides a pay increase for all state employees, including our teachers. This will build on the historic raises we provided for educators over recent years, and will increase every state workers pay by 4%. My proposal also rewards those who gave decades of their lives and careers to serving others by allocating $500 million to shore up our state retiree ensuring our state. This will ensure that our state keeps its promises for our retirees and also stays on solid financial footing. Instead of expanding the size and scope of government, we're putting state dollars to work in targeted, efficient ways to recruit, retain, and thank employees in vital roles from corrections officers to case workers. By doing so, we're continuing our efforts to wisely use every penny taxpayer's send us from state agency personnel to our schools, public safety, and the healthcare marketplace. As we look across America, there's no doubt that we're at a crossroads. From crushing inflation and dysfunction in Washington to the crisis that our southern border and unrest overseas, these are indeed trying times. But I believe we have an opportunity here in Georgia, an opportunity to highlight a different path. One of the brilliant principles of America's founding is the role of the states. For them to be the laboratories of democracy to protect the liberties and freedoms of their citizens and to carry out the will of the people. I founders didn't believe the states had always looked to the federal government for answers. And by judging by current comparison, I don't think we would have much to learn. In Georgia, in Georgia, we balance our budget and spend less than we take in. We cut taxes instead of raising them. We return money back to the taxpayers rather than justifying new government programs. We back the blue and crack down on violent crime and gangs and put the safety of our communities ahead of partisan political agendas. We celebrate the free market instead of using the heavy hand of government. We work together across party lines on more issues than not. And most importantly, we put our people first. In an election year, I don't expect all of us to agree on every issue. Every district represented under this gold dome is different and sends each of you here with a unique set of issues to address. Over the next 36 legislative days, there will be passionate debate, there will be disagreements, there will be tough votes, there will be long nights, and maybe even some short tempers. But in the middle of all of that, I ask that we also remember Georgia is different for a reason that our success is not an accident, but the result of a resilient people who elected their leaders to keep state government efficient, responsible, and accountable. In Georgia, we believe the American dream will always provide our people greater prosperity than the government. The state of our state is strong, growing, and full of opportunity. Let's use this session to keep it that way. Thank you all, may God bless you, and may God continue to bless the great state of Georgia. Thank you, Governor Kimper, I expected no less. That was awesome. Thank you for those words. Will the committee of escort, please escort the Honorable Brian Peakem, Governor of Georgia, and his distinguished guest from the House Chamber. The majority leader of this House, leader of the House, is recognized for a motion. Thank you, Mr. Speaker. I move that this joint session be dissolved. Is there any objection hearing none? This joint session is hereby dissolved. The House will stand in recess for about 10 minutes and we'll get back to our bed. Just thank you all for being here. We're glad to have our guest in the chamber. We should be going here. Oh, at least. That's not ready. That's not going to be. When you move one down below, I know all the time. Well, now everybody is happy excited about the meeting. Thank you. Thank you. Thanks for your service. Thank you. Thank you. No. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes.\n\nyou you you you you you you you you you you you you you you you you you you There she comes. Representative DiWillis. And she has some friends with her as well. Don't worry about him. We won't. Thank you, Mr. Speaker. Good morning, colleagues. Good morning, colleagues. And what a beautiful day it is indeed to be a woman of alpha, alpha, sorority incorporated. As I stand here today with my sisters in service, for those who may not be aware, alpha, alpha, sorority incorporated was founded January 15, 1908 on the campus of Howard University, Washington, DC, 2.0059. With my sisters here, founded on the precipice of service to all mankind, alpha, alpha, strives to cultivate and encourage high scholastic and ethical standards to promote unity and friendship among college-trained women to study and alleviate problems concerning girls and women in order to improve their social structure. This organization was founded by African-American women at NHBCU and it is a privilege and a pleasure to serve and maintain our commitment to service moving forward as we celebrate our 100th and 16th Founders Day. Thank you, Ethel Hedgeman, Laugh, our moving spirit. Thank you, Black Women at Howard University and thank you all others who have come after us for the service that you provide. Mr. Speaker, I yield back to you. That's how you do it. That's how you get to do it. 116, that's awesome. Representative Kendrick's. You're recognized for and after representing Kendrick. There she is. Good morning. Thank you, Mr. Speaker. On your desk is an article about David Cummings who is the founder of Atlantic Village. For those of you that don't know or have visited Atlantic Village, it is in Buckhead. It is a tech incubator. It has done amazing things but he purchased a bunch of property in South downtown. A lot of properties he's going to turn into almost a technology and entrepreneurship hook. Hopefully in the next few weeks I'll be able to arrange a tour for some legislators who want to take a look at that property to go and see the property that he's purchased and some of the plans that he has to make it a tick hub. So look for your email and if you have any questions they should be answered in the article. Thank you. Thank you. Representative Bennett is recognized for an afternoon order. Thank you, Mr. Speaker and to our distinguished colleagues from Pink to Purple. Each day this week you have heard from our colleagues about maternal mortality. And what we aim to do is to continue to bring awareness to the rise and deaths of Georgians that can be prevented with this awareness. So within the United States Georgia has one of the highest maternal mortality rates in NIH reports that in 2021 the death rate in Georgia increased by 1.2 deaths per 1,000 people in 2020. Death pregnancy related deaths increased by 15.17 deaths per 1,000 people. The Georgia Department of Public Health provides the following information about the DPH 2018 2020 Executive Summary. There were 30.2 pregnancy related deaths per 100,000 lives. The leading causes of pregnancy related deaths and this is what my message is today are hemorrhage, mental health conditions, cardiomyopathy, cardiovascular and coronary artery disease. Also embolisms and pre-clampsia. These are conditions that can be prevented and or treated and so is time for Georgia to rise to the top and not stay at the bottom in being number one in eliminating maternal mortality deaths. Thank you Mr. Speaker. Thank you colleagues and we yield the well. Thank you. Great job. Great job. Ladies, you are the well representative. Stacey Evans is recognized for an afternoon order representing Evans. Good morning colleagues or afternoon. Happy New Year. I really hesitated about coming up here today. I know we all hear things and see things that make us want to speak out or say something or point out hypocrisy because as much as perhaps we all try to be consistent, I know I do and it's hard sometimes regardless of party, regardless of situation trying to be consistent in the moment is not always easy. But one thing that I've always found very easy is recognizing the sacrifice of the men and women that serve in public safety. Whether they do it at the state level, the local level, the federal level, whether they are injured or whether they are fallen dealing with a situation of protest that I agree with, whether I disagree with it, they are serving. They are doing their job. They are standing on the line. And that's why my heart hurt. I didn't realize it when I was here yesterday when there was a recognition of the officers that were hurt on January 6, 2021 that there were colleagues that not only didn't stand but that turned their backs. And then today, during the state of the state, there was a discussion and recognition of officers who were injured and those that came to his aid during the public safety protest, public safety training center protest. And I saw some colleagues refuse to stand. So it's both sides. And it's sick, y'all. It doesn't matter whether you agree with what they're defending at the moment or not. They are doing their job. There are plenty of men and women that have also stood on the line to protect our freedom and at worst that I don't agree with. They are doing their job. And we are men and women who are serving our state. And if anybody should recognize service, it is us. And so I just implore on all of us and I'm holding my self-responsible as well. Let's be consistent. Let's be fair. And let's recognize the sacrifice of service that so many in the state and country do for all of us. Thank you, Mr. Speaker. Thank you, Representative Evans. That completes our afternoon orders. Mr. Clerk, will you read the caption to a group of privileged resolutions? Recognizing January 25th, 2024 is National Guard Day. Let's say Capitol, recognizing commanding the Rebecca Martin Home and Garden Club, recognizing commanding. Ives Kumbu, recipient of the Engineer in Environmental Services, Champion of Long-Term Care Award, recognizing commanding Angela High, recipient of the new Administrator of the Year Award, recognizing commanding Jill Cooper, recipient of the Assisted Living Administrator of the Year Award, recognizing commanding Tammy Martin, recipient of the elderly and disabled waiver case management, nurse case manager leadership award, recognizing commanding David Thadnor, recipient of the elderly and disabled waiver, waiver case management, social worker case manager leadership award, recognizing commanding Agnes Ogu, recipient of the Year Award, recognizing commanding Jennifer Kelly, recipient of the Emergency Preparedness of theième champion in winter the Year Award, recognizing and commending Sheila Weaver, recipient of the Elderly and disabled Waver Case Management Administrative Support Leadership Award, recognizing the naming of Coach Donald Stitcher Jim Nazim, recognizing the 50th anniversary of the Consul General of Japan in Atlanta, and recognizing commending Dunwoody Police Chief William J. Billy Groven as Georgia's 2023-2024 outstanding police chief of the year, and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? Chair, here's none in the resolutions are adopted. Thank you, Mr. Clerk. We could adjourn to the, I want to make the announcements. Okay, opted for announcements, just messing with you. Chairman Stevens, Chairman Ron Stevens has recognized for announcement. Thank you, Mr. Speaker. Just a few minutes and we'll be a little bit late if you'd like. There's going to be a joint economic development and tourism information meeting today at the World Congress Center Hall C, as in CAT, room 302, and parking for those of you just use your badge so that you don't have to worry about your placard. It'll be in the red lot right in front of the stadium there, and a member does not have a parking pass again, use your badge. The boating industry will be showing us their economic expertise today, a short committee information meeting, $7.8 billion in economic impact, 27,000 jobs in this state. And I don't know if you noticed the chairman of the, from Nashville, Georgia, has a boat that's out front from the Chapeur-L company, right down the street from where she lives. Lots of jobs come in the state and we're here to showcase that. Hope those of you in the committee will join me. Good after what o'clock or so. Thank you. Thank you, Mr. Chairman. Awesome job of leading the committee. That Chapeur-L location is really impressive. It's always a lot of people down there in the community that need some good jobs as we all do, so thanks and I hope the members will take advantage. We're presenting a bit of claim and is recognized for our announcement. Thank you, Mr. Speaker. I just want to make sure that you all can join us today for the working family caucus lunch. It'll be in room 307 in the CLOB and our lunching sponsor today is the Georgia AFL-CIO. So look forward to seeing you all aboard the German or when you all can get over, we're in 307, CLOB. Thank you, Mr. Speaker. 307 CLOB, thank you, Representative Claim. Chairman Mitchell, recognize for the announcement. Thank you, Mr. Speaker. I want to encourage all of you to come to the state's observance of Martin Luther King, Jr. tomorrow. This is his home, state his hometown. It is a bipartisan event as a matter of fact. The speaker usually brings a rousing remarks at this event. You will not want to miss this for that reason alone. Once again, as tomorrow morning 10 a.m. in the retunda, the steps on the governor's side. Thank you so much, Mr. Speaker. Thank you, Mr. Chairman, for helping organize. And thank you for the invitation as well. I don't know about the rousing part, but I'll do my best. That completes our announcements. The majority leader of this house is recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 9 a.m. on Friday, January 12, 2024. Thanks for the schedule and the hard work. We would certainly appreciate that. I remember this house does. And a lot of other folks that support us appreciate as well. So thank you for your hard work. On the motion of the majority leader of this, this house stand adjourned until 9 a.m. Friday, January 12, 2024. All those in favor, let it known by saying aye. Aye, yes. All those opposed, no. It's clear to me, the eyes have it. We're adjourned. See you all in the morning.",
  "updated_at": "2026-02-13T19:26:24.169182+00:00"
}