{
  "video_id": "ZexbzAbOiJ4",
  "url": "https://www.youtube.com/watch?v=ZexbzAbOiJ4",
  "title": "House Day 26 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 26,
  "video_date": null,
  "duration_minutes": 121,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House Day 26 session transcript:\n\n## Overview\nThis session focused on finalizing the state's fiscal year 2025 budget, with a significant portion dedicated to hurricane relief efforts and support for the Department of Corrections. Substantive legislation was passed, including appropriation bills and funding for various state agencies and programs.\n\n## Key Actions\n**HB 67**: Amended state budget for fiscal year 2025, including $862 million in hurricane relief and $345 million for the Department of Corrections.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Lengthy explanation by Chairman Hatchett on the details of the amended state budget (HB 67), including funding for hurricane relief, agricultural/timber support, community hospital assistance, and corrections/public safety.\n- Discussions around improving recruitment and retention of state law enforcement officers, including $20,000 salary increases for Department of Community Supervision officers.\n\n## Votes\n- The House agreed to the Senate's substitute of HB 67 as amended by the House.\n\n## Attendance\nA quorum was present, as all members were called to the floor for the key budget vote.\n\n## Adjournment\nThe session adjourned. The next session date was not provided.",
  "transcript": "Mr. Clerk, how about ring the bail? Let everyone know we're getting ready to come back to session. Thank you. All members, please come to the floor. Are we ready to call one of our most important bills of the year back to the floor? All members come to the floor. Chairman Hatchett has recognized for a motion. Thank you, Mr. Speaker. I move that this House agree to the Senate's substitute of HB67 as amended by the House. Thank you, Mr. Chairman. Mr. Clerk, will you read the caption? House Bill 67 by Burns, the 159, Jones, the 47th, the 134th, and others to be entitled to amend and act, making and providing appropriations in the state fiscal year beginning July 1, 2024 and ending in June 30, 2025. Chairman Hatchett has recognized to explain the Senate's substitute and the House amendment. Thank you, Mr. Speaker. Colleagues, you have two items on your desk, the actual bill that was passed by the Senate, and then a smaller document that highlights the amendment and the differences between the Senate and us, and then the final column to the right is where we ended up. I guess you could say it's the conference committee, but there was not a formal conference committee done. As you know, this budget, as the Speaker just said, is the one piece of legislation that we are required to pass, and I would argue it's the most important bill you have before you today, but given the day's calendar and other bills working to make to crossover, I'm going to be as brief as I can. This budget includes an infusion of $4.4 billion of the original FY 2025 budget, which we passed last year. You can do a lot of good things with $4.4 billion, and we have. But for me, the centerpiece and the most important element of this budget is the storm relief package we crafted. Together with the Senate, the House is delivering a total hurricane relief package in this budget of $862 million. Combined with the legislation drafted to provide tax relief for those Georgians who will fill the impact of the storm for years to come, the total relief provided under this known this session is well over $1 billion. Thank you. The House and Senate agreed with the Governor's Storm relief package, which addressed the most immediate and pressing issue of cleanup and recovery efforts, including $145 million in the Governor's Immunicy Fund. $299 million in the Department of Transportation to backfill lost revenue from the motor fuel suspension, to clean up debris and state roads, and to repair and replace damaged infrastructure including signs and traffic lights, and $100 million in direct ag and timber relief. Working together, the House and Senate built upon the Governor's package by including an additional $18 million in the Governor's Immunicy Fund to help meet the state and local match of 25% for the debris removal. The House and Senate felt strongly about adding $185 million in additional relief for the farmers and timber producers for a total and unprecedented appropriation of $2.5 million. These funds will provide loans and continue to breed cleanup. We know that there's pin up demand for these funds, as Georgians that were in the path of the storm, continue to rebuild and replant. Agriculture and timber are important industries in our state, and we want to support them. But the reach of Helene went far greater than any of us could have ever imagined, and people are still hurting. The House and Senate agreed to provide a $25 million to the One Georgia Authority to engage nonprofits to help rebuild the lives and communities of storm victims. The House version of the amended budget recognized the unanticipated role that our community hospitals played in the storm response, going far beyond meeting the immediate medical needs of their communities by utilizing their own limited resources to provide food, water, shelter, and care to many who had lost everything. The Senate agreed, and this budget, before you, includes $22 million for 27 hospitals and 8 FQHCs in the major disaster declaration area to assist in their financial stabilization and recovery efforts. Moving on to public safety, and before I talk about the Department of Corrections, I want to shine a light on a success story in the Department of Community Supervision that demonstrates a return on investment in our human capital, our state employees. Officers in the Department of Community Supervision are responsible for supervising offenders who are on probation or parole and for monitoring their reentry back into the community. If you've been here for a few years like me, you know that improving the recruitment and retention of state law enforcement officers across multiple agencies has been a priority. Back in fiscal year 2021 officers in the Department were making a starting salary of $35,000. Just four years later, we've improved that starting rate by $20,000, and it's having a positive impact on the agency. Last year turnover in the agency was just 4%. Because of this improved retention, additional funds are needed and the House and Senate added $4.5 million to cover projected personnel service expenses for the rest of the year. That's a good problem. Now moving on to the corrections. I told you several weeks ago that Hurricane relief was a priority of this budget. And addressing the needs of the Department of Corrections was the other. Working together, the House and Senate have agreed to a package of support of $345 million for the Department that prioritizes staffing, safety, and security and technology upgrades. Like community supervision, the Department of Corrections is also seeing improvements in recruitment and retention. Salary enhancements in marketing efforts are resulting in an increased number of hours, and additional salary steps in compensation for longevity is also resulting in improved retention. Because of this, an infusion of $50.9 million is needed for new correctional officer positions, which will be utilized to improve staff to offender ratios. We've had a lot of conversations about funding for these modular units, which despite how the name may sound are actually maximum security prefabricated correctional units that hold 126 inmates each. The House and Senate have agreed to fund four of these units as recommended by the governor at a cost of $80 million. These units along with an increased contract with our private prison partners for more bed space are part of the state's master plan to shift inmates out of aging facilities temporarily so that long-ever-day repairs and maintenance can occur. The budget also includes $17 million to continue the implementation of managed access systems and drone detection to fight contraband inside the wire. In addition, the House funded and Senate agreed to nearly $18 million for new body cameras and taint tasers, as well as the surveillance system improving the safety of both officers and defenders. These safety tools link to an overwatch logistics unit. So when either is turned on, surveillance officers can immediately zero in on disturbances and send additional correctional officers if necessary. The budget also includes funding for the department to continue contracts with consultants who can provide additional recommendations for cost savings and safety improvements, as well as oversee the implementation of enhancements funded in this budget. There are a few other differences between this version of HP 67 and the one that passed this chamber a few weeks ago that I'd like to point out. On economic development, in addition to the 501 million in coastal service surface water resources in Giefa, the final version of HP 67 includes an additional $266 million for sewer and water infrastructure for communities not impacted by the surface water expansion resources. These funds will go a long way in helping local governments access funds for water and wastewater to meet the needs of aging infrastructure. The House and Senate have agreed to an additional $5 million to recapitalize the downtown development revolving loan program at the Department of Community Affairs. This fund will provide access to low interest loans to communities across the state for revitalization of their downtown areas. If you're able to listen, if you were able to listen to the Economic Development Committee hearing, you heard the Agricultural Commissioner talk about efforts and their rapid response to combat avian influenza. This is the other AI related to that need during the bird flu event in January and February. The poultry veterinary diagnostic lab ran in a two week period. The number of tests normally run in six months. This highlighted their need for additional equipment and this budget includes $90,000 for two additional PCR machines. This is said that the lab can stay ready to respond and support our poultry industry. In turning to health, there's $2.8 million is provided in the Medicaid budget for quality incentive payments that skilled nursing facilities across the state. We know there's a physician shortage in our state and one of the best strategies we have for solving that problem is through our residency programs. As we know that doctors are more likely to become established and stay near where they complete their residency. To that end, the Senate added in the House agreed to fund $21.5 million for new and expanding GMA programs in South Georgia. We hope to build them on upon this foundation in the 26th budget as well. In the Human Services budget, the House and Senate recognized an unmet need for our foster youth and added $38.5 million in Department of Human Services for growth and utilization, acknowledging the increased cost of foster care across the system. For veterans, the House added $1 million to the Senate and the Senate made for a total of $2 million to support the opening of a new sub-acute unit at the War Veterans Nursing Home in Millageville. This new unit plans to open in early 2026 and will provide intensive services for veterans with severe mental illness and traumatic brain injuries. In transportation, the House and Senate agree to enhancements in the state's intermodal programs of rail and airport aid, with airport aid receiving $7.8 million and rail receiving $12.9 million to continue upgrading state-owned rail to class two standards. Finally, the budget includes $265 million for local road projects, a slightly higher figure than when the budget left this house. Mr. Speaker, those are the highlights of the differences between the House and Senate on this amended budget and the proposed amendment. Are you for any questions and ask for your favorable consideration on the Senate's substitute to HP 67 as amended by the House? Gentlemen, has a couple of questions. Yes sir. Your left-wilted park right on the front has a question for you. Gentlemen's recognized. Thank you Mr. Speaker. This is a gentleman you. Yes sir. So I greatly appreciate the hard work on the supplemental budget. I did have two questions. First on, I think it's 17.4.1. First, let me express my appreciation for the House's appropriation of 35 million initially. The Senate of course proposed 15 and we saw ultimately an agreement of 21 million or at least a deduction with respect to grant programs for critical hospitals. Will those funds be added to the big budget or can you speak a little more in terms of the decrease in those grant programs? I'll speak to how we came up with this number. The number that we had when we did it first included all of the rural hospitals. The Senate then came back and said they only wanted to provide assistance to those that were actually in the path of the hurricane, the designated zones. There were about three or four different calculations and we settled on the 21.9. I didn't disagree that that's probably was the major intent and the structure of the help for the hospitals evolved over even after we did our 35 million and it became more of a grant program. So that's we could do what they asked. Thank you for the clarification. With respect to the Department of Corrections, likewise we saw some reductions in section 19 for pharmacy services, for repairs, maintenance personnel, contraband detection. With an increase in correction personnel, could you again provide a little additional information and clarification as to the reasoning and whether or not we may see some of these appropriations in the big budget? So as the whole budget proceeds through the process, we're always getting as I call it later, later data, later data and the reductions are from later data that we received from the governor's office. The other increase in the staffing of corrections is their number. They are having more success at hiring and they do need more money strictly to fund positions that they are getting and have now through the end of the year. And that number will continue to increase in 26 also. Thank you for your hard work. I look forward to supporting this supplement. Mr. Wuerke. Jim and you for another question. Yes, sir. Chairman Wuerkeiser to your left. Is recognize for a question. Thank you, Mr. Wuerke. Jim and you. Yes, sir. Is it not true that this provides critical financial lead to those families who are recognized by the federal government as disaster relief areas and they can deduct qualified losses. Yes, sir. And that I think I've maybe spoken too much about the need in that part of our state from this well this year, but you're absolutely correct. Jim, when you yield a couple more. Yes, sir. Representative Park Cannon right out in front of you to your left. As a question. Thank you, Mr. Speaker. Mr. Chair, do you yield? Yes. Thank you for your work on this budget. I have a question about the 27.8.2. It's the Startup Funds for School of Safety, Threat Assessment. Can you tell us more about that program? We're ending up on 1.5 million for that. I think you will see, I think perhaps today, a lot more about that program is coming out of the Education Committee today. This is an initial start on the whole program and it gives them a little bit of a starting money to go ahead and start working on the whole Threat Assessment Program. Okay, thank you, do you further yield? Yes. And so that this bill you're saying that's coming will tell us how schools can qualify for that? Yes. I don't know the details on it, but I know it's coming out of our education and chairman Irwin could probably enlighten us all on that. Okay, thank you. Do you if you yield for one further question? Yes, ma'am. Thank you. Section 38.1.2. This is a Public Awareness Campaign on the impacts of vaping, like to thank you on that. Will this be a multilingual public awareness campaign? I'm not aware of it being multilingual, but as many things in this they evolve and I'm sure a request could be accepted for that. Mr. Chairman, we will hear the school safety bill tomorrow, so that information will not be presented today. We can't share everything with you, Mr. Chairman. But now I'm probably mislistened earlier. No, you didn't. Representative Al Williams to your left in front of you is recognized for a question. Thank you, Speaker of the gentleman yield. Yes, sir. On behalf of Representative Andrew Jackson and the entire coastal delegation. We certainly want to thank you for your consideration of Savannah State University. Much needed. Thank you. We appreciate being able to help. Somebody in the back would say the Representative Williams, this Savannah State University. Representative Barnes to your left is recognized for a question. Thank you, Mr. Chairman. And I need to ask a gentleman yield. Yes. Thank you. I want to say thank you for the additional nutrition services funds that you added on 22.2. How have we identified those 10 sites and how do the sites apply for the grant being that we only have? What was the last party print? How does what? How do those sites apply for the grant to get those summer meals? They apply through an apartment of education and decal, I'm sorry, and get it. But they have all the requirements and guidelines on that. Does the gentleman yield further? No, all of them. Yes. I would like to say thank you for these funds for these summer meals as we did not have funds for some of meals last year. Thank you so much. Mr. Chairman, you have one more question to your right to clarify a situation. Mr. Chairman, if you add an ejection from the great city of Savannah, I would recognize for a question. Mr. Chairman, do you yield? Yes. Thank you. Thank you. Lady from Savannah. Thank you so much. And from these Savannah State University, I just wanted to say representative Val Williams has said what. I wanted to say thank you for really recognizing that the oldest history, all of the history of the university. Thank you for helping us to do those things because we needed this money. $6.7 million is really going to help us to do some of the things that we need to do right away. Thank you, Representative. We met with the president of Savannah State last week. I think Savannah State University is headed in the right direction. Thank you. Thank you so much. Mr. Speaker, with that, I will yield. You have a question from Chairman of Transportation. He wants to congratulate you if you would take that one. Probably won't. I'm going to talk about this that you all sit close together. But, Representative Jasper is a recommended question if you will accept it. Thank you, Mr. Speaker. It's Jill Maniel. I don't know. Well, yes, sir. I will yield. No, but I'm in whispered in your ear. It looks like, if you look on page 26 and 27, you know, this is a, just amazing commitment to all the different transportation projects across our state, whether it be air, rail, and road, and freight infrastructure, $500 million is absolutely wonderful. Thank you. Thank you. It's been a pleasure working with the governor to make sure we keep that going. Mr. Chairman, you have another further question. If you accept the comment from behind you, I'd like to make one. If the gentleman will let me do that. Mr. Chairman, I want to thank you personally and for Senator Tillery and Y'all's hard work in the governor. This budget is a fiscally responsible and serviced budget that makes investments all over this state. But I can assure you that the folks that were impacted and or currently being impacted by the resource of Hurricane Helene, this budget will make a difference. Mr. Chairman, thank you for your big heart, your compassion, and your hard, hard work. Thank you, Mr. Chairman. Thank you. Thank you, Mr. Speaker. But as many of us in here as not in our notes, so we might forget to mention it. But this lady sitting right here, Mr. Christine Murdoch, y'all don't know the hours she has worked, especially in the last week to get this done. So thank you. And all her staff. Thank you, Mr. Chairman. The gentleman, as you were the well, is there any objection to the adoption of the House Amendment? Here's none. Chair, here's none in the House Amendment is adopted. On the gentleman's motion that the House agree to the Senate's substitute to House Bill 67 as amended by the House, all those in favor will vote yes, those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machines? On the gentleman's motion, the yeas are 170, the nays are 3, and the House has agreed to the Senate's substitute to House Bill 67 as amended by the Senate. For what purpose is represented, Hatchet, rise? To make a motion. State your motion. The House immediately transmit H, the Senate substitute, HB 67 as amended by the House immediately to the Senate. Representative Hatchet moves at HB 67 to be immediately transmitted to the Senate. Is there objection? Here in none, it is so ordered. Mr. Clerk, will you read the caption to House Resolution 32? House Resolution 32 by reps and administration of 104th and others, a resolution proposing an amendment to the Constitution so it's an increase the maximum maker to qualify an assessment and taxation as a bona fide conservation use property. This resolution haven't been referred to the Committee on Ways and Means, and that Committee recommends that this resolution be adopted by Committee substitute. Leader, estration is recognized to present the resolution. Thank you, Mr. Speaker. Ladies and gentlemen of the House had bring before you here today, H.R. 32. This resolution is a constitutional amendment consistent with legislation this body previously passed this session which would increase the cap on KUVA acreage to 4,000 acres from 2,000 acres to 4,000 acres. That's all that this would do. What asks for your favorable consideration? This is a critical measure for protection of family farm land in our state and for protection of conservation land within our state. Currently, we have a situation where if acreage exceeds the cap, we're in a position where either that land has to be in multiple family members names or there's some other potential that that would be. Reutilized for a different purpose by passing H.R. 32, you voting in favor for it. It's a strong message of support for family farm land in Georgia preservation of land for purposes of farming and for conservation. I'd ask for your favorable consideration and Mr. Speaker, I'm happy to answer any questions. Gentlemen, has there questions? You'll the well. Gentlemen, as you were the well, we'll recognize we have someone to speak in favor. One of the members, Lady from Junction City, RIPSEBUTTER has recognized to speak to the bill, RIPSEBUTTER. You have 10 minutes. Thank you. Thank you, Mr. Speaker. I stand in support of this resolution for a variety of reasons. I know a lot of people that live in town that have a quarter acre lot, I think 4,000 acres is a lot of land and it is. But what happens in a lot of parts of our state is that there was farm land that was divided among large families. Many times it was a family that would have maybe 10, 15, 20 children and as grandma and granddaddy passed away and it was divvyed out and then maybe some of those people never married or had children and the numbers got smaller and smaller over time. What we found is what we will what is seen happening across the state is that land that people acquired, bought from hard work, laboring on the land for many, many years is falling to fewer people instead of many people. And when that happens and you try to get a koova, you find yourself 250 acres over the 2000. When it was decided that they would check up the amount from 2000 to 4000, quite honestly it was just an arbitrary number to increase it. Most of the states in the United States do not have a cap on this because they want people planting trees and doing conservation.\n\non as much land as possible. And that's what this is about. It is a conservation use. It is to help people be able to afford to keep the land cleared, to do the prescribed burns, to plant the trees, which are not cheap. And they have to plant them and wait 20 years for their first crop, maybe 10 or 15 sometimes, but it's on average 15 to 20 years. So they're not cash crops that come around every year. And the last thing that I want to say about that is when we think about that this is something that's helping with conservation, it's not just helping the people out in the hinterlands of Georgia. When you have clean air anywhere in Georgia, when you have clean water anywhere in Georgia, it's because of forest land that's everywhere in Georgia. And we need to be sure that we help as much as possible. So I urge your favorable support of this resolution because it will help keep Georgia. Growing trees, it will help keep Georgia have communities that quite frankly, when you think about giving a tax break in a rural community, you think, well, maybe that's hurting that community. But trees don't have to have police. Trees don't have to have schools. Trees don't have to have a lot of the things that high-end neighborhoods do. And so we are keeping the farmlands and the tree lands growing. And that's what we want to have happen in Georgia for clean air and clean water. And with that, Mr. Speaker, I urge everyone to vote in favor of this in a yellow well. Ladies, you're in the well and she knows what she speaks. Is there any objections to the previous question or the previous question or the previous question? Is there any objection to adopting the committee's substitute? Here in the undercommittee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? Here in under the report, the committee is agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? All members voted. All members voted if so, Mr. Clerk, will you lock the machine? All the adoption of House Resolution 32, the A's are 168. The A's are found. The resolution, however you see, the requisite constitutional majority is therefore adopted. Mr. Clerk, will you read the caption to House Bill 473. 473. House Bill 473, by the way, I'm Steven's in the 164th. And that lives to be entitled back to a men chapter 13 to title 16. The Fish Go To Georgia Annotary relating to controlled substances, soon as to provide for certain provisions relating to schedule one control substances. This bill eminence for the committee on health. That committee recommends a disbile due pass. Chair Rick and my recognized gentleman from, is it garden city of Port Wentworth? Savannah. That was close. Representative, gentleman from Savannah, Chairman Ron Stevens. Thank you, Mr. Speaker. This, you may recognize, is our annual drug update that our department sends to us. It has to do with the Board of Pharmacy and also the drugs and narcotics. As you're flipping through, I've had somebody come down and ask, what does this mean? If you're starting, the first four sections are talking about schedule one drugs. That's drugs that are typically highly abused and have no medical use. The first one there is an opiate. Very similar to in the same class as heroin. The second one is a mushroom. The third one is a stimulant, Ethyl Fena date. Some of you might recognize that as methyl Fena date, which of course is given for kids under the brand name of Ritalin. And again, the next one, of course, used to be an odor put in a natural gas to give some sort of odor so that you could tell if there was a leak. That's not used anymore. All the rest of these in section five are dangerous drugs. You won't find these in your 7-11 store, but they do everything from cardiac myopathy's cancer, blood pressure all the way down the list. And I'll be glad to tell you which one of them does if you're interested. But if not, I hope you'll go along and vote for the annual drug update bill. And I'll take any questions if there aren't. To your right, if you'll represent Sanchez, just recognize for a question. Sir. This is the gentleman you'll need. Thank you for this bill. Just a quick question. I saw that one of the things that are being added to the dangerous drug list, which means it includes a prescription. Is monkey pos vaccine? Can you just explain that? I'm sorry, say that again. The monkey pos, Mpox vaccine, I believe. It's online, 79 if that I'm mistaken. That falls into all the vaccines and a class of categories. And of course, you'll also see below that. And you're probably going to be the next one to ask that. The allergy. There's a list of those that are in allergy extracts as well for peanut allergies. Got it. Those you won't find in 7 or 11 either. Thank you. I appreciate it. Gentlemen, you owe for another question. Representative McQueen to your left. Yes, ma'am. Hi, this gentleman yield. Yes. So speaking about those allergens, specifically the peanut allergen powder. As someone who suffers from a severe peanut allergy, and I know that I have students who do as well, would that make it harder for us to get the treatments and the prescriptions that we need? Not at all. That's already in your physician's office, which by the way, can dispense. So he already has this in his office. Your allergists, whenever you go to visit, this is standard in their office. Thank you. Gentlemen, ask me further questions. Thank you, Mr. Speaker. You're the way. Gentlemen, as you order the wheel, thank you for the presentation. Does there any objection to the previous question be in order? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to, shall. This bill now pass all in favor of the passage of the bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? On the passage of House Bill 473, the yeas are 170 and the yeas are zero. This bill haven't received any requisite constitutional majority. Is there for passed? Mr. Clerk, will you read the caption to House Bill 399? 399? House Bill 399 by Representative Oliver, the 84th and others to be taught on act to amend Article 1 of Chapter 7 of Title 44 of the Fiscal Code of Georgia and Attetty relating to landlord and tenants in general. So it's required certain residential landlords to have in-state staff to manage tenants' communications related to such properties. This bill now referred to the committee on governmental affairs. Does that committee recommend that this bill do pass by committee substitute? Representative Oliver is recognized to present the bill. The lady is recognized. Thank you, Mr. Speaker, for allowing me to bring for your favorable consideration and hopefully your vote, House Bill 399, which addresses issue of accountability of the out of state, large investors, large headphones, large moneyed entities that are purchasing significant portions of our single family homes across Georgia, particularly targeting the Atlanta area. Specifically, House Bill 399 says that any landlord who's not a resident of Georgia, who owns 25 or more single family homes, shall employ a local broker, real estate agent, and have at least one person, at least one person, in Georgia, who can be identified as receiving complaints for the tenants of the significant numbers of single family homes that are required for rental use. I have worked with the community to improve this bill, and they have emphasized to me the opportunity that the real estate commission can have over the absentee landlords who are not repairing and not receiving and not implementing repairs as tenants are requesting. Last week, I shared with you an AJC article about the deaths of three children who died in Atlanta area. In the out of state landlord, that was apartments and a this bill 399 only applies to single family homes that was unidentified would not answer and could not be located in terms of the deaths of these three children. The issue of accountability of the out of state investor is a growing significance in our state, and I'd like to give you some specific numbers, and I asked the gentleman who controls the board up there to show us a map. There are two entities, invitation homes and progress residential, that earn more than 10,000 homes each. There are seven entities that own a total of 51,000 single family homes. When that county is the number one county for acquisition of single family homes by these out of state investors, this map is not easy to read, but the top map, the darkest areas are the house districts that have more than 50% of single family homes owned by out of state investors, and the bottom map is the census tracts. These maps were prepared by geography professors at Georgia State. We also had a hearing, thank you to the chairman of the government affairs committee, that brought to us academics from both Georgia State and Georgia Tech to discuss the significant impact on our economy of this purchase of single family homes. Bringing it home to house district 84, there are 1,012 single family homes in house district 84 that I represent that are owned by out of state investors, and 42.3% of those 1,012 homes are owned by an out of state investor. Why is this important? I think that we all know why it's important. It affects our economy in significant ways. If you are a single family, young family looking to purchase a home, these investors are taking assets out of Georgia. They're making a profit on the rents charge. They're making a profits on the acceleration of values, and that profit is not being enjoyed and earned by Georgia families. The economy of the developer, if you're trying to develop a suburb, if you're trying to develop new housing stock, you are going to be competing with these entities who are going to raise the prices, take it away from your opportunity. It's even going to affect the governor who is trying to create workforce housing across Georgia. This is a big deal. I think that $3.99 is a small step. There are many of you who have talked with me about this issue. Those sides of the aisle, obviously, there are several other bills that Governor McFaire's chair allowed us to have a good discussion about. I'm delighted that more of us are recognizing the phenomena of loss of wealth from the individual families and from the businesses of Georgia. Thank you again for this opportunity to discuss this major issue. Let me personalize it a little more. For the last 80 years since World War II, when my two generations of the Oliver family purchased their first home during World War II, as my dad was going off to the Navy in a small old neighborhood around within one mile of Emory University, we have held two generations, owned five homes since World War II, and each one of those homes close to the same community where we had small businesses, we had good schools, we had safe neighborhoods, and we were able to acquire equities through these homes over a long period of time. When my parents' home in older neighborhood, they were not able to be there by themselves, and my mother came to live with me. The equity from that home allowed her to have full time home care in my home for many years in her 90s. I say this to you that this is an issue that affects all of us. It's an issue that I'm glad we're paying attention to, and Mr. Speaker, I'm happy to stand for questions. Thank you for your explanation on the bill. You have a couple of questions. Ladies, where's she yield? Yes, sir. Representative Hefner to your left. How about midways back? Thank you, Representative. Did the General Lady yield? Yes, ma'am. So, thank you. I will be supporting this bill because of what it offers renters, especially in the current system, natural disasters where they need to have some immediacy and some response. But does the General Lady yield for a question? Yes, ma'am. It's true that this bill does not interfere with the Federal Civil Service Members' Relief Act, where those members who are military veterans or active duty are deployed. It maintains all of their rights in terms of terminating leases, procuring mortgages, and notification. Is that not true? It is true, ma'am. Thank you very much for that good question. Thank you. To your right, Representative Beth Camp has recognized for a question. Thank you, Mr. Speaker. Does the General Lady yield? Yes, ma'am. Thank you for bringing this bill. Is it true? Is it not true that what this bill does, it's very short, but it puts the purview of the Georgia Real Estate Commission over the property managers. So if someone is a bad actor, there is actually an entity that they can contact and the people who are the bad actors, their license can be in jeopardy, and their ability to rent in our state could be compromised if they do not fulfill their duties as landlords. You're exactly right, and that's why this suggestion made to me by the realtors to increase the opportunity for enforcement was such a good idea. There's ongoing discussion about how this bill and these issues can be further improved. I appreciate the help that I've received from many of you, again, both parties, and I look forward to continuing this discussion. We know realtors in our community, and we know that they care about improving the values for families to enjoy the homes that they're purchasing. We have to put them a little bit more towards the center of these discussions and allow them to be protective of our constituents in these difficult issues of out of state ownership. I think you feel a lot of yay to your left as recognized for question. Thank you, Speaker, this is the General Radio. Yes, sir. Is it not true that establishing a locally based representative in a clear line of communication with out of state landlords would only serve but to increase response times and improve living conditions for children, youth, and families? I believe that's true. And it also creates enforcement for those out of state landlords who are not going to comply in the way that they code requires them. Housing codes require the new respond. Thank you for the question. Thank you for the bill. Mr. Speaker. You have another question to your right. Representative Hong is recognized if you'll take a question further to your right. Yes. Where around? Yes, ma'am. Thank you, Mr. Speaker. This is General Radio. Yes, ma'am. The second part where the person must be located within the state would a registered agent be somebody that would qualify in that situation? Yes, sir. If they are the broker or the real state agent himself, herself would qualify for that. That's correct. Thank you. But if it's an out of state, you know, you can have a real state agent at license in Tennessee and be governed by the real state commission of Georgia even though you reside in Tennessee, we put that provision in so we would close the loophole of having somebody in Georgia available and identified to receive complaints by tenants. Thank you. Mr. Speaker, I yield the well. The lady has yielded the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee substitute? Here in none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Shout out. This bill now passed. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no in the clerk. We'll unlock the machine. All members voted. All members voted if so, Mr. Clerk, were you locked the machine? On the passage of House Bill 399, the A's are 163, the NA's are 4. The bill, Henry C, the requisite Constitution majority is there for a past. Mr. Clerk, were you read the caption of House Bill 612? House Bill 612, by Representative Dempsey, the 13th and others to be entitled to enact two amend Article 1 of Chapter 2, Title 37 of the Fifth School to Georgia, and it's generally in the general provisions regarding the administration of mental health, developmental disabilities, addictive diseases, and other disability services. Ms. Bill, I refer to the Committee on Health. That committee recommends that this bill do pass. The lady from Rome, Georgia, is recognized to present the bill, Chair Lady Katie Dempsey. Thank you, Mr. Speaker. Good afternoon. Many of you are here in 2022. When we passed the Mental Health Parity Act, HB1013, we still struggle. That act endeavored to ensure that mental health and substance abuse treatment receive the exact same insurance coverage as physical health services do. There are still struggles involved in this though. While we do have an online portal for challenges to be reported on, there is concern that the data may not be accurate. So this bill takes a step forward by adding a member to the Behavioral Health Coordinating Council. One member will be added. I serve on that council, and I think it will be a great thing for this to be added. The Commissioner of Insurance will be there and have a voice to represent the challenges that we face. It will also establish a parity compliance review panel made up of six members to actually put their muscle behind making sure that we are delivering what we promised in a bill back in 2022. It will hold insurers accountable for parity compliance creating a formal mechanism to review and address complaints. This bill is a significant step forward ensuring that mental health care is treated equally to physical health care with the insurance system of our state of Georgia. Mr. Speaker, that is the bill. If there are any questions, I will be able to take them. Lady Hesse, further questions? I have no questions. Thank you. I yield the well and ask for your favorable support to help true Jordans with true needs. Thank you for the bill. The committee has yielded the well. Is there any objection to the previous question being ordered? Peary none of the previous questions ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Peary none of the report of the committee has agreed to shout this bill now passed. All in favor of the passage of the bill, will vote yes. All those opposed? Will vote no in Mr. Clerk? Will you unlock the machine? All members voted. All members voted this so. Mr. Clerk, will you lock the machine? On the passage of House Bill 612, the yeas are 170 and the yeas are 2. The bill has received their requisite constitutional majority. Therefore adopted. Therefore passed. Mr. Clerk, will you read the caption to House Bill 454-454? The House Bill 4-5-4 by Representative Gaines, the 120th and others to be entitled and act to amend chapter 3 and 12. The official go to Georgia and it's related to Parks historic areas, memorials and recreation. Those who create the Vince Dooley Battlefield Trust Fund and Vince Dooley Battlefield Trust Fund Program, this bill emphatically to the committee on Game Fishing Parks, that committee would recommend that this bill do pass by committee substitute. The gentleman from Athens, Representative Houston Gaines, is recognized to present the bill. Representative Gaines. Thank you, Mr. Speaker. Please present House Bill 454, the Vince Dooley Battlefield Trust. A bill that will help us preserve some of our historic battlefields in Georgia. This legislation is named for the late great coach Vince Dooley, a lifelong history buff and a proponent of battlefield conservation and a great friend of many of us here today. Coach Dooley loved history and he served on the board for the American Battlefield Trust. This bill will create a trust fund administered by the Department of Natural Resources and importantly, it doesn't create any new administration or a new board to oversee this effort. The fund may include appropriations if we were to do so in the budget. It also would include public or private grants, gifts, donations or contributions dedicated to the fund. DNR would review and approve project proposals for matching grants for the purchase or permanent protective interests in our Georgia battlefields. This measure does require that any organization selected for grants must match dollar for dollar any money given to the fund. Many other states up and down the East Coast have invested similar efforts that work to preserve historic battlefields including Virginia, North Carolina, Kentucky and others. The federal government has done similar and often matches state and private funds. As we see more and more development creeping throughout our state, I think efforts to preserve these historic sites has never been more important. And doing so will help share and preserve our country's history and help educate future generations of Americans. Miss, speak, I'm happy to answer any questions. Gentlemen, has a question to your left, which I mean, P-Tree, your extreme left. Gentlemen, I recognize it. Thank you, Mr. Speaker. This is gentlemen, you. I do. My friend is not true that the tide was turned in the revolution by wars in the south and many of those battlefields are here in Georgia, Kettle Creek, Breyer Creek, Siege of Savannah, Siege of Augusta, men like John Twigs and so many others, Lacklin, McIntosh. And we've really failed to recognize those sites as well as we could. You've given us an opportunity to do that. I want you to know how much I appreciate that. Well, thank you and appreciate your support and support of this body and would ask for everyone's favorable consideration. I'll learn well. You can ask, the representative Donna, you have a question. It's okay to be your last one. I was recognized. Does the gentleman need help? Yes, sir. Do my delegation make it? Yes, sir. And I'm sorry I'm losing my voice, but is it not true that the Viz-Dilly Battlefield Trust Fund, who's significantly aid in preserving our state historic battlefields for the future generations to come? It does. Yes, sir. Thank you. Thank you. General, we have so far the questions. How are you? The gentleman is yielded the well. Thank you for bringing the bill. Is there any objections to the previous question being ordered? Here in none the previous questions ordered. Is there any objections to adopting the committee's substitute? Here in none the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none the report of the committee has agreed to. This bill now passed. Only in faith the passage of the bill will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? All members voted. All members voted if so. Mr. Clerk, will you lock the machine on the passage of the bill? The yeas are of House Bill 544, 454, I'm sorry. The yeas are of 1.57, the days of 14 in this bill have received a requisite constitutional majority. Therefore, passed. Mr. Clerk, will you read the caption to House Bill 91, 9-1? House Bill 9-1 by the represent of Cooper, the 45th and others to be entitled to act to amend R3H, 50, title 43. I would like to go to George Anand's head of relating the licensing service to provide for a licensure for graduates of foreign colleges or schools of veterinary medicine who are abored, certified, and especially. This bill is earned for the Committee on Agriculture and Consumer Affairs. That committee recommends that this bill do pass by Committee substitute. Representative Sharon Cooper is recognized to present the bill, Chair Lady Cooper. I'm not. Okay, ladies and gentlemen, I bring you the substitute to House Bill 91. Across our state, we are enduring here more vets, and we are especially in need of vets that are board certified, believe it or not. There's a three-year course, sometimes a four-year course, of course, for vets to further their education and become board certified in surgery and orthopedics, and all basically pretty much all the specialties we have in medicine. And this would allow vets that have gone to a foreign vet school, but most of them are already in this country, and they go to usually an American school for this four-year course or three-year course, and it would allow them to practice to be, and they are certified by one of the board certification approved boards in our state. They would be allowed to practice in the state of Georgia. If there are no questions, Mr. Speaker, that's what the bill does, and I will yield the well. Thank you. Lady has no questions. Ladies, yield the well. Is there an objection?\n\nThe previous question being ordered here in none the previous questions ordered is any objection to adopting the committee substitute here in under committee substitute is adopted. Is there any objection agreeing to the report of the committee which was favorable to the passage of the bill here in under the board of the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no. So Mr. Clerk were you in the machine. All members voted. All members voted if so Mr. Clerk were you locked the machine on the passage of house bill 91 the yeas are 169 the nasa zero the bill and recourse a constitutional majority is therefore passed. Mr. Clerk were you read the caption to house bill 398 house bill 398 by represent of Hagen and 156 another me entitled back to men chapter 2 title 26. The future go to Georgia annotated relating standards labeling and adulteration of food so to authorize the production and sale of cottage food items with certain exemptions requirements and disclosures this bill and for the committee on that culture consumer affairs that committee recommends this bill do pass. You got something you can put up in a minute tell us when you're ready representative Hagen is recognized to present the bill. Thank you Mr. Speaker if you will remember if you were here last year we passed this bill overwhelmingly out of this body and I bring you back to you now for your consideration again this bill encourages small business growth and entrepreneurship by opening a new delivery string for our cottage food operators. If you remember our cottage food operators are licensed through the department of ag they produce non potentially hazardous food goods which means they don't require to put your control because they are not known to. They're not capable of supporting the rapid growth of botulism and some other toxins so these are safe foods non potentially hazardous it's a it's a booming industry for a lot of people currently. The sales of cottage food products are only allowed directly to the consumer this bill would allow sales via a third party seller like a grocery store or a restaurant and why does this matter because cottage food operators are at their very core just pure entrepreneurs they get an idea they go to their kitchen and they see if they can make it work they get licensed through the department of ag. They're not going to be able to get the food back and there's your business so this is this is something that those of us that support small business would definitely want to encourage. It'll get their products in front of more of their potential consumers and also according to the Department of Agriculture most if not all of us have got cottage food operators in our district and they are very excited to potentially have another stream of delivery for their products. I would stand for a question if there is one but I would also ask for your favorable consideration for this bill to encourage entrepreneurism and growth small businesses in our state. Lady has no question. Thank you very much. I yield the will. Ladies yielded the will is there any objections to the previous question being ordered. Here in none of the previous questions ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. Here in none of the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine. All members voted for what purpose represent camp rise parliamentary inquiry. Mr. Speaker is not true this bill ensures consumer protection by requiring proper labeling and disclosure for all cottage food products sold in Georgia. I read I thought it was a good deal. Thank you for the question. Have all members voted all members wrote what purpose represent Wilkerson rise parliamentary inquiry state inquiry sir is it not true that the delicious turtles that many of our members enjoy our cottage food products and I am very much appreciative all those that have supported this bill. I know the gentleman knows what he speaks and he's pretty good at those cottage food. Thank you for your benefit in this all. Mr. Clerk I thank all the members of voted all members voted so you please lock the machine on the passage of House bill 398 HB 398 the years are 171 the days. The bill haven't seen the records constitutional majority is therefore passed. Mr. Clerk will you read the caption to House bill 255 255. Mr. Clerk is the representative of the bill. Thank you Mr. Speaker and colleagues I bring you all HB 255 HB 255 that established a specialty license plate for Southern University and the Delta Sigma Fader. I would like to say that the term is a day was dealt today we had roughly 250 Delta members in the House today so I want you all to realize that these the funds from these tax will go there. I want you all to know that one 30th of the members in this house you all know y'all are trying to get those numbers together but one 30th of the members one 30th of the members in this house are dealt with. That's good six so there's six Delta in this house. I want you all to realize ribbons ribbons representative Jackson is a Delta representative Davis is Jackson you know it's a Delta representative I guess the read is what we have in the House today is it's almost Delta everybody's not wearing red is some of us are wearing red they are not really Delta but we have representative. You all you all going to bring it down some have representative Bernal representative McQueen and representative coming so those are the six that are Delta's in the House and representative Jones I'm sorry and representative Jones so I want you all to know that this is a tag that this will help them do the things they want to do in the community. Southern University is you know we have some great alumnus in the state of Georgia from southern the Keith Gammage who is the so the solicitor of Fulton County he's from Southern University I always tell people that Karen Cobb who's also the judge and cop can't excuse me West who's in Cobb County is the judge from Southern University and always since you know we know about little by football male blunt. The all Pro Divins back he was a graduate of Southern University no I did not go to Southern University I don't want and I want to make sure make that clear but with when it was one of the schools as a young high school or idea to apply to but they didn't want any Oklahoma kids don't know why but with that in mind and speaker I actually want to support these two great organizations because they do do a lot of things for the community. As well as a lot of our students in Georgia go to Southern University in fact there were over 800 that applied last year and 350 plus were admitted so with that in mind and speaker I'll take any questions as long as they're not football. I don't know about that part but you have a whole heap of questions. It's big way big this is not my first bill so I don't need all these questions okay this is not no. And the other part of it you're bigger than any of these want to ask you a question too so I think I best recognize that. Representative Barry is recognized for a question he's to your left right in front of your seat back there. Thank you Mr. Speaker the gentleman of you. Yes I will you for my seat mate my sweet mate and somebody that I see roughly no yes. So is it not sure that you have not presented a bill in a minute correct. I'm sorry. It's not sure that you've not presented a bill before us in a minute correct. Yes that's correct. Will you further you. Yes. Thank you do it again to get some more practice for us. Yes. Thank you. Thank you. But I want to say thank you very much for that question because he was back there working on a question and I gave him one but I answered it already that I did not attend Southern University. You got a train on them. Representative yes sir. You got a couple more I'm on that if you'll take two more. Representative I think you said something about everything but now is recognized. Do you have a question. Mr. Bernard yes I will. Thank you Mr. Speaker does gentleman yield yes I do. Is it not true that I am a graduate of Southern University. Yes. I am a graduate of Southern University and she is also a Delta Sigma thing. So she is a two friend in this house. No doubt. Now this is the last one this is an important question. I'm not sure where he graduated from but I'm sure y'all are working this out. Representative Al Williams from down on the coast. Has a question. Hey Mr. Speaker. Yes I do for my friend my cigar caucus friend. Is it not true that you are one firm. That is true. What I mean is you really wanted the tags to be from your school but you are the only graduate in all of Georgia that went to your school in Oklahoma. So we couldn't possibly do it. Mr. Speaker I'm going to yield the well but I do though there is true because the president of out all the state is a graduate of Eastern University. Yes. So I just want you to know that. Mr. Speaker with that I'm going to yield the well. Gentlemen's yield the well thank you for your persistence. I'm getting this done. We're glad to work on it. Gentlemen's yielded the well. Is there any objections the previous question being ordered. Is there any objection to adopting the committee substitute. Is there any objection to the committee which was favorable to the passage of the bill. Here in the committee is agreed to. This bill now passed all in favor of the passage of the bill. Will vote yes all those opposed will vote no. Mr. Clerk will you unlock the machine. It's not his first bill remember. Have all members voted all members voted. If so Mr. Clerk will you lock the machine. The bill is on the passage of House bill 255 the age are 168 the nasa zero this bill. Have you seen the requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption of House bill 229. House bill 229 by represent of Neil of the 79th and others to be entitled back to amend code section 4883. The fiscal to Georgia annotated relating assumptions from sales and use taxes. So exempt from local taxes the sale of use of materials used in construction of capital outlay projects. This bill that refer to the committee on ways and means that committee recommends this bill do pass by committee substitute. You ready represent Neil represent the asthma Neil is recognized to present House bill 229 the ladies recognized. Thank you to the speaker thank you to this body today I bring to you House bill 229 all this bill does is allows for local school districts who have east lost capital building projects to have their local sales taxes exempt when they purchase construction materials. This just allows for school districts to save a few extra dollars during their educational developments which they can reinvest in their communities. And with that, Mr. Speaker, ask for your favorable consideration. Thank you. Thank you. Is there any objection to the previous question being ordered? Is there any objection to adopt in the committee substitute? Is there any objection to agree to the board of the committee which was favorable to the passage of the bill? This bill now pass on in favor of the passage to bill will vote yes all those opposed will vote no. And Mr. Clerk will you unlock the machine? Have all members voted? All members voted. If so. If so, Clerk will lock the machine. On the passage of House bill 229 the yeas 169 the nays are to this bill carrying seated requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption of House resolution 69 House resolution 69 House resolution 69 by Representative Barnes the 86 and others a resolution recognizing every third Thursday and April is biomedical research day. This resolution have been referred to the committee on health that committee recommends that this resolution be adopted. Representative Marty Barnes is recognized to present House resolution 69 representing Barnes. Thank you, Mr. Speaker. I'm here today asking for your favorable favorable consideration for House resolution 69 House resolution 69 would recognize biomedical research day every third Thursday and April to bring awareness for some of the medical research day every third Thursday and April to bring awareness for scientists and that do the research and result in medical advancements for both humans and animals to help diagnose prevent disease and treat disease. So I asked for your favorable consideration to pass HR 69 to recognize biomedical research awareness day. Lady E.O. for a question. Yes, please. Representative Park Cannon to your left is recognized for a question. Thank you, Mr. Speaker. Do you yield? Yes. Okay. What kind of diseases do biomedical professionals work with? Any disease that you can think of cancer, Alzheimer's, sickle cell, alcoholism, biomedical researchers work with every disease you can think of and help create treatments for animals and humans. Lady has no further questions. Thank you. I yield well. Ladies, you do the well. Is an objection to the previous question being ordered here in under previous questions ordered? Is any objection to agreeing to the report of the committee which was favorable to the pet adoption of the resolution here in under the committee is agreed to? This resolution now be adopted. All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine? Have all members voted. All members voted for what purpose is for purchase rise. Parliament, Tranquery. Is it true that the representative that was just in the well this may be her first bill? Oh, she almost slipped by didn't she? I see the chairman of the caucus is back there with her. Good catch. For what purpose does the leader of the minority caucus rise? Reps him hugely. Thank you, Mr. Speaker. It's true that even though it was her first bill she did an outstanding job. Looks like she's going to squeak by to me. I guess you did. All members voted. Congratulations on the first bill. You did a great job. All members voted. Mr. Clerk, will you lock the machine? He's a little slow. All the adoption of House resolution 69 the yeas are 171 the nays are won. This resolution having to say the records of cost is majority as they're for adopted. Congratulations to the lady. You Mr. Clerk, we'll give it just a minute. Mr. Clerk, will you read the caption of House bill 141? House bill 141 by Reps. The 17th and others to be entitled act to amend Code section 4813 14 the fiscal to Georgia and Tate relating 11 on business or practitioner within location or office and more than one jurisdiction allocating gross receipts and limits on levies using criteria for taxation. The committee on ways and means that committee recommends that this bill do pass by committee substitute. The represent the month of hand is recognized to present House bill 141. The gentleman is recognized. The speaker members of the House today I rise to present House bill 141. This bill seeks to protect the financial privacy of businesses ensuring local governments continue to receive the revenue they need to function effectively. Currently when businesses report the gross receipts for the purposes of calculating local business taxes. The optional requires to submit detailed financial records including tax returns, PNLs and other proprietary financial documents to local jurisdictions. This practice raises several concerns for small business owners and entrepreneurs across our state. Many business owners are understandably reluctant to disclose since the financial data to government entities. Particularly when that information clues proprietary vendor relationships, competitive pricing details, payroll data and other confidential financial records. So under House bill 141 businesses will no longer be required to turn over their full financial records to local governments in order to determine their occupational tax liability. Instead a CPA who is bound by street ethical and financial standards could certify the gross receipts on behalf of the business. The local government will continue to create the required business occupation tax ensuring no loss of revenue for the jurisdiction while also protecting the privacy of business owners. And will that Mr. Speaker I will yield for questions. I will take one. Reps. Remind to your lift. Right at the center out. I would recognize for a question. Thank you Mr. Speaker. It is a gentleman yield. You. So if for example the city had questions about any of the financial information could they still request attack returns or is that mean they just can't request that at all. No if a CPA certifies these results and the financial information that is what they are going to get under this bill. Gentlemen has no further questions. Thank you Mr. Speaker. You are the well. Gentlemen yielded the well. Is there any objections to the previous question being ordered? Hearing none the previous questions ordered. Is there any objection to adopt the committee substitute? Hearing none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the past of the bill? Hearing none the report of the committee has agreed to. This bill now passed. All in favor of the past of the bill will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machine? Have all members voted? All members voted if so. Mr. Clerk will you lock the machine? All the passage of House Bill 141 the yeas are 158. The nays are 16. This bill has recreated constitutional majority. Is therefore passed. Mr. Clerk will you read the caption to House Bill 165. House Bill 165. I represent Franklin of the 160th and others to be entitled to amend. Title 48 of the fish go to Georgia and it's related to revenue and taxation. So it's to repeal and reserve and income tax credit for business enterprises for lease motor vehicles. This bill now refer to committee and ways and means that committee recommends this bill do pass by committee substitute. Representative Lehman. Representative Lehman Franklin has recognized to present the representative Franklin. Thank you Mr. Speaker. This is another way to try to help with the hurricane relief disaster that we've had. It's another attempt to do all that we can for those that were hurt. But basically what this bill does it would extend the net casually lost the dungshin to non-automizers who would take the deduction on top of that stand. So we currently do not conform to the federal standard deduction said to conform with the federal intention to allow this deduction we would need the additional clarifying language. So having said all of that basically if you don't qualify for your to itemize to state atomize return you can take the this casualty deduction on your standard return. And that's all the bill does. Mr. Speaker I'll take any questions that may have. Gentlemen has no questions. Thank you. You're the well. Gentlemen's yield of the well is an objection to the previous question being ordered. Here you know the previous questions ordered is any objection to adopting the committee substitute substitute. Chair here's none the committee substitute is adopted. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill. Here you know the report of the committee agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine. So they don't want they don't. All members voted. All members voted for what purpose is represented camera and rice. Mr. Speaker is it is true that by updating our tax code with a fair standard deduction we're put we're strengthening the Georgia economy and putting more money back in the hands of working Georgians. I know the gentleman knows of what he speaks whether you're in North Georgia or South Georgia that fact holds have all members now voted. If so Mr. Clerk will you lock the machine on the passage of House bill 165 the yeas all 173 the nays are zero this bill here to see the requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to House bill 262 House bill 262 by represent a most dean of the 169th and others to be entitled act to amend chapter two title 31 of the fiscal to Georgia and it's a relating the department of community health. So it's to provide for a grant program for the purposes of acquiring and installing backup generators. This bill I refer to the committee on rural development that committee recommends a disbilled do pass by committee substitute. Let's see the author of this bill is a lady from rural South Georgia representative angel the way just a minute now. I was going to say something nice about you but but I will lady from from rural South Georgia knows a little bit about hospitals and health care would that be correct. I think she's a nurse in some point her life has been a nurse. She's a nurse. She wants a nurse always nurse.\n\nThe President, Angio Stingens recognized to present the bill who represented hosting. Now you're ready. No, you look like a veteran to me. I wouldn't say anything about it being your first time in the will. The lady's recognized. Well, Mr. Speaker, it is not my normal MO to correct my authority figure, but this is technically not my first time in the will. Ma'am. No, you have been to the will before, haven't you? Yes, sir. I've been to the well in this very house. You've asked several questions over there without asking, without pushing your button as well, too. So you're a real veteran to this process. That might be because I've had a lot of help from my free and chas cannon. And brick costs. But Mr. Speaker, can I call your attention to this picture over here? This picture was made in 1988. My senior year of high school, because I came here through youth assembly and debated bills all throughout high school. And that was the picture of the one and only time that I got my first bill passed. Thank you, Mr. Speaker. Good morning, or good evening, whatever it is this afternoon. I'm not even sure it's been such a long day. I bring to you House Bill 262. I'll be quick. This bill would establish a grant for rural hospitals to correct an obvious problem that Hurricane Helene unveiled during this path of destruction through Georgia last September. The current required minimum generating capacity proved to be woefully insufficient during this time of widespread disaster. With some hospitals going without power and water for a week or more. The criteria for this grant are as follows. Must be a rural hospital located in a rural community within one of the 41 counties included in the governor's state of emergency. After July 1, 2024, and it may be a lot of work to do with this. In 2024, and it must contain fewer than 100 hospitals, I mean, sorry, fewer than 100 beds located in those counties with a population of less than 50,000 residents. There are potentially 30 qualified rural hospitals in those counties. The current financial state of these rural hospitals makes capital expenditures of increased generator capacity prohibitive. On a personal note. Would you look at this next picture. That is a picture of my little 81-year-old daddy who almost lost his battle with a deadly bilateral pneumonia. At the point this picture was made, he was hospitalized for 49 days. He was scheduled to be discharged on September 26. Thankfully, the nurse at the hospital in Jeff Davis County said, I think that let's just see what this storm does before I send you home because your oxygen depended. Little did she know the wrath that it would bring the next day. And he spent 17 more days in the hospital because they didn't have power. That hospital went without power for seven days. They could not flush toilets. They could not wash hands. They had to reduce everything that only the little generators would operate. And thankfully it operated the ventilators and the oxygen. So I know you're going to have fun with me with this bill. But at the end of the day, these hospitals are dependent on us and these communities are dependent on us. So I would greatly appreciate your favorable consideration. I will yield for questions reluctantly, Mr. Speaker. Well, we're going to see if the second time is a charm. I don't know if you passed it that first time when you were in this well a few years ago. This is a great bill. It's a great need. Our hospitals, whether in rural Georgia or urban Georgia, are lifeline as many of us. But you do have a couple of questions. I can't wait. If the lady's going to answer them, I'll let you have a shot at them. Yes, sir. All right. Let's do it. Then Representative Gamble. He weighs, boy. You got to him. Some people in this chamber do have a heart. Let's see about these other guys. Well, I said that too quickly because Representative Jason Ridley is recognized for a question to your right. The way around you way up back here. Thank you. General recognized. This is General Idaho yield. Well, just remember this, Representative Ridley. My predecessor is sitting right over there and he's watching you. But yes, I will yield. Well, this kind of comes from him, believe it or not. Is it not true that the other day, and I guess this still stands, the other day we had your bill on, but we had to go back in my little adjustment to it. Is that correct? Yes, sir. That is correct. That morning, we got a call from Athens, Georgia, from a certain little girl. And her, she said, y'all better not be mean to my mama. You sure did get that phone call. And so I'm not going to be mean to her mama. Because her husband said, back out, he's bigger than me. Thank you for bringing this bill. It's a great bill. Thank you so much. Just lady, recommend the yield for a question to rip some of you's mix to your right. Yes, sir. Thank you, Mr. Speaker. It's generally the yield. Yes, sir. I do. On line 16 to 17, were you indicate that the hospital must have been a reason that was declared a disaster or state of emergency after July 1, 2024? Is it your intent that moving forward as another disaster is indeed experienced in some of these real communities that those hospitals would then qualify? Say that again now. Hit me with that one more time. On line 16 to 17, where it's 100 beds and located in a region of the state in which the governor declared a state of emergency after July 1, 2024. That's for those 41 counties that the governor declared a state of emergency after that date. Right, but moving forward, say this year we have another state of emergency issue with those hospitals and those communities in qualify. I would be open to that, but that's not what this bill directs to. Okay. It just says after July 1, 2024, I thought it would be indeed dead qualified. That's not what this bill is for. Right? Am I correct? Yes. Thank you, Mr. Speaker. Yes, sounds like a pretty good answer. Thank you so much, Mr. Speaker. You're not even aware of it. No, sorry. I'm not here. Let's see. You have a lot of friends. Let's get a good question from a lady from rural Georgia's World Representative Hagen has recognized for a question. Thank you, Mr. Speaker. I appreciate it. Do you? I do you to my friend. Yes. Thank you for all your hard work on this. We have had many conversations about what should be included and how this would best serve the communities that need it most. And I'm wondering if you considered putting nursing homes, including nursing homes in this bill. I appreciate that question very much. I did consider it. It was brought to my attention. And I'm very tender to that because I had a grandmother that spent seven years there and my husband's grandmother spent many years there. So I am very sensitive to that. But specifically when times of crisis hit, I watched these hospitals. Nursing home patients need to come to the hospital when they don't transfer patients from the hospital to the nursing home. So this is our first line of defense. And to that point, there were actually people who brought portable home oxygen that were recharged. They actually brought those to the hospital so that they could get charged up. That is ground zero. That is the point where everything starts or the hospital. So thank you for that question. I appreciate that. I appreciate you bringing the bill. Just a couple more for Lady Wattay. One from Representative Sharper to your left all the way to the back. Yes sir. All right. The gentleman and lady. Yes sir to my friend I do. All right. You go to my friend and a good husband of your friend of your husband as well. But I've been in the medical field for over 35 years now. And I'm glad she brought up the situation about the nursing homes. I think there's something that we need to look forward to in the future because when you have a nursing home that goes down on multiple nursing homes goes down, you don't have enough amlases or anything first responders to be able to go for one to check on those patients. And also if that believe the nursing home and go to the hospital, that's the nightmare, especially when you have other emergencies going on. But I 100% support this bill. But I think in the future we need to also look at the nursing homes, get me the same grants. Thank you so much. Thank you so much. I want to make, I wanted to kind of piggyback off that. In addition to people where I was in coffee county, we have a cardiac cath lab. It was shut down because we didn't, we could not operate it. There was not enough generating capacity to operate it. But over in representative work hizers district, one of his hospitals, they were in the same position that we were, some of those machines are cryogenically cooled. And a machine called $600,000. The deductible for it was $598,000. There were within one hour of losing that entire machine, one hour of losing that entire machine. So it's in addition to equipment, medication, more than more than people. Thank you so much. Representative Todd Jones is interested in asking you a question. Would you yield the representative Jones to your right? Yes sir, I do. Thank you, Mr. Speaker, does the gentleman leave yield? I am going to regret this, but yes sir, I do. We have a very important scientific question. In 1985, Marty McFly learned that it took 1.21 jiggle watts to go back to the future. We need to know how many one megawatt generators would it take to travel in time? Mr. Speaker? I think that today is a good day since I heard that Terry England has stood up. I think today is a good day to pay homage to our friend Terry England, because I hear that he is a Jerry Klauer fan just like me. And I'm going to pay homage to him with an old classic called the Schofer and the Professor. So I am going to defer that question to my professor who is Chairman John Corbett, and I will yield the will. Ladies and gentlemen, the will. Thanks for the job. We appreciate you staying with us. And we do have a speaker on the bill. Speaking of favor, represent Mac Jackson who knows a little bit about rural Georgia and rural issues. Representative Jackson, appreciate you speaking on the bill. The gentleman is recognized. Thank you, the speaker. Today I rise in support of House Bill 262. Hurricane Helene was possibly the most worse natural disaster in many of our lifetimes. The devastation and loss of lives, the loss of electricity was horrendous. The power outages necessitate the use of generators in most of our communities. It was a vital service not only in our homes but in our hospitals. And this legislation is a fix for critical access hospitals. But even though we are taking this necessary step, we must not forget our community health care centers who played a vital role in the recovery efforts following the hurricane. They too need the necessary backup generators, especially in our rural communities. So while I support House Bill 262, I am advocating for generators by community health care centers too. Thank you and I yield the will. The gentleman is yielded well. Yes, we have some more work to do in that area. That concludes our comments on House Bill 262. No further speakers. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the committee substitute? Hearing none, the committee substitute is adopted. Is any objection to agreeing to report the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed. Will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 262 that yeas are 173, the nays are zero. This bill, Henry C. The Requisite, Costs are some majority. There's zero for pass. Congratulations. Mr. Clerk, will you read the caption in a group of privileged resolutions? Commending the Georgia Minority Supply Development Council upon its 50th anniversary. Commending the Georgia Penitentiary in recognizing March 4, 2025. As Georgia Penitentiate, the state cap will congratulate in commending. Michelle Calvo for receiving the 2025 Yellow Rose, NICETT Randall Service Leadership Award. Recognizing commending reverend art a while there upon the occasion of his retirement. Recognizing commending, Catherine Flutcher for her services chair of the Georgia Society of Certified Public Accountants. And for other purposes that completes the reading of the privileged resolutions. Here you know the resolutions are adopted. We've moved on to afternoon orders. Reps and Cond. You're recognized for an afternoon order. Members, the lady will hold up, lady, if you will suspend just for a moment, Reps and Cond. Members, if you will stand with the representative and myself. She has an afternoon order of condoses. Ladies, recognize. Thank you, Mr. Speaker. Colleagues, please join me today in celebrating and honoring the life of my Wheeler High School classmate and a great Georgian Amir Abderraheem. Coach Amir dedicated his life to basketball, not only as a player, but as an inspiring coach. As a head coach of Kennesaw State University, he led the basketball team to the program's first NCAA tournament appearance in 2023. He inspired countless individuals and truly wanted the best for his student athletes, not only on the basketball court, but in life. I still remember always looking up to him when we were in high school, not only because he was so much taller than me, but because he was a leader. Before his passing in October of last year, he was the head coach of the University of South Florida, where he emphasized integrity and community engagement. He was a loving husband to his wife, a dedicated father to their three children, and shared his love for basketball with his brother, Sharif Abderraheem. He left us too young, but his legacy lives on. He will continue to be honored through initiatives such as the Love Winds Classic. I'm proud to present a resolution honoring him, and if you can join me in a moment of silence. Mr. Speaker, we're also joined by his mother, Deborah, his sister, and a few of our classmates and friends here today. I would like to give a round of applause and honor and celebrating a mirror. Thank you, Mr. Speaker, and I yield the well. If you remember, this is what everybody would believe that we had caught up until decades ago. Remember this is your makeup stop there, and this is my کا, the best makeup ache during the year. recognize or a remembrance members of your main standing. She has some friends with her representative Scofield. Thank you, Mr. Speaker, members of the House. On Thursday, March 27, my community lost a man with a huge heart and a measurable helping hand and a strong love for his community. Mr. Maurice Davis was the owner of JMR Tireshop and Southeast Atlanta. He was gunned down by a man he employed, a person he was helping turn his life around in the right direction. Tragically, he was murdered in front of his own son, who also worked with him. Maurice was always extending out olive brands to help others. During the summer, I kept reminding myself I wanted to provide him and give him a resolution, honoring his service to the community and acknowledging him as a small business owner. I knew he had never been to the Capitol and would never come. I said to myself, let me wait until I get back to the Capitol and I'll put the resolution in. About two weeks ago, he put air in my tires and I said to him, I want to do something nice for you because you're such a good person and a pill in the community. He laughed and then flashed a big smile and said, Rep, it ain't necessary. I'm just here to help. I didn't file the resolution thinking I had time before a sign he died. I'm sad at the missed opportunity. So this body, if something is laid on your heart for someone else to do it, to the family, Maurice was loved. He loved his family. We talked about his children all the time. And even though he's gone, it was through M.J. M.R. tires that he showed his love to the community. To the community, it's tough, but we'll heal together as we will truly miss a servant and friend to most. Let's bow our heads and send up a silent prayer for all who knew Maurice. Thank you, Mr. Speaker. I yield the well. Thank you for that. And our best wishes and condoses to the family. Rimsing baseball. Rimsing baseball and some friends are recognized for an FN orders. Thank you members for standing in your attention. Thank you, Mr. Speaker. Just a reminder, we had this invitation some time ago, but then the ice and snow decided we had to cancel and you get another day for this. So I'm reminding you all that you are invited to the Ramadan F.Tar dinner honoring Georgia's legislators and leaders. And that's going to be tomorrow at 5 p.m. program starts at 5.30 down in the blue room at the freight depot. So please come and enjoy. Thank you, Mr. Speaker. I yield the well. Thank you. That concludes our afternoon orders. We have a couple of motions for what purposes represented Cooper rise. Thank you, Mr. Speaker. I move that the rules be temporarily suspended so that a bill may be read for the first time and assigned to committee. Mr. Clerk, will you read the caption? Unnumbered House bill by represent of Cooper the 45th and others to be titled back to amend article 2 of chapter 34, title 43. The district voted Georgia annotated relating the medical practice act of the state of Georgia. Home the ladies motion that the rule of this House be tipper to suspended so a bill can be read for the first time and assigned to committee is the objection. Public and community health for what purposes represent Brad Thomas rise. To make motion. State your motion. Motion House bill 668 be moved from agricultural consumer affairs to public and community health both chairs agree. Mr. Clerk, will you read the caption? House bill number 668 by represent of Thomas the 21st and others to be titled back to amend title 16, chapter 4, title 30 and chapter 6 and title 40. Any fish go to Georgia annotated relating crimes and offenses rights of persons with disabilities and uniform rules to the road. On the general's motion that House bill 668 be withdrawn from agriculture and consumer affairs committee and be recommitted to the public and community health committee is the objection. Here you know this order. For what purpose does represent still Cox rise. To make a motion. State your motion. I move that the House bill 638 be moved from the committee on urban affairs to the committee on transportation both chairman or an agreement. Mr. Clerk, will you read the caption? House bill number 638 by represent of still Cox the 53rd and others to be titled back to amend article 2 chapter 9 and title 32. Any fish go to Georgia annotated relating to martyr. On the ladies motion the House bill 638 be withdrawn from the urban affairs committee and recommitted to transmission committee is the objection. Here you know this order. For what purpose does represent Sheila Jones rise. To make a motion. State your motion. I move that the roads be temporarily suspended so that a bill may be read for the first time and assigned to committee. Mr. Clerk, will you read the caption? A number of House bill by represent of Jones the 60th to be entitled back to amend chapter 4. I move that the House bill 1 of the fish go to Georgia annotated relating to holidays and observances. So as it provides its first week of April each year, Shelby women's golf week in Georgia. On the ladies motion that the rules of this House be temporarily suspended so a bill can read for the first time and assigned to committee is their objection. Here you know and special rules. Yes. Okay members, we have some announcements about committee meetings. I want to suggest to the committee chairs that meetings begin immediately upon recess. We'll do that in just a few minutes. Chairman Gunther has recognized for an announcement. Speaker, judiciary committee will meet this afternoon upon adjournment. I got it. We'll only have about an hour and a half and we got six bills on there. So we're going to meet in the morning at 8 a.m. and try to finish up that calendar. Thank you. Representative Campbell has recognized for an announcement. Thank you, Mr. Speaker. Tomorrow morning at 7 a.m. the fellowship will meet in House Room 132. We have a special guest tomorrow morning and representative Hilton is going to share who that will be. Hey guys, my predecessor, Chairman Tom Rice, who actually started the fellowship over 20 years ago will be hosting this tomorrow at 7 a.m. So please join us. I will be meeting him at his house early morning and dropping him down here. We'd love to have a big crowd for him. Thank you. Thank you members before everyone gets out of this room. I want to recognize former member of this House, Chairman Clay Perkel, to see to know what am I right. Let's welcome Chairman Perkel back to the people's house. Chairman Hawkins. The Health Committee will meet in 403 upon a journey. Ripley-D. Vince Smith, the Director of the National Ennorsment. Thank you, Mr. Speaker. The subcommittee of resource management of the Natural Resources and Environment Committee will meet a plan of German and Room 415 of the CLLB. 415 CLLB. Thank you, Mr. Speaker. Chairman Chukus, recognize for an announcement. Thank you, Mr. Speaker. The Small Business Development Committee will meet tomorrow morning at 8 a.m. 506. Tomorrow morning at 8 a.m. 506. Thank you. Chairman Powell, recognize for an announcement. The members of regulated dentistry will meet in about 15 minutes. Make every attempt to be there because I cut it. Sure you won't be coming back at 7 in the morning. Chairman Martin, recognize for an announcement. Thank you, ladies and gentlemen. I'll make this now for Chairman Parsons. His subcommittee on the Energy Subcommittee will meet at 4 o'clock and the Chairman has asked me to know the full committee will not meet this afternoon. It will be done as regular day tomorrow at 4 o'clock at 1 o'clock. Chairman Skoggins, recognize for an announcement. What did you say? I'll do the butcher out. Thank you, Mr. Speaker. Special Roves will meet this afternoon at 430 and 515. Chairman Martin's room is 403. Chairman Martin in 403. Chairman Blackman, recognize for an announcement. Thank you, Mr. Speaker. Subcommittees of ways and means will start meeting upon adjournment in room 406. And if time permits, we'll roll into full committee this afternoon as well. Thank you very much. Chairman Erwin, recognize for an announcement. Thank you, Mr. Speaker. The House said committee will meet at in room 506 CLOB upon adjournment. Thank you. Chairman Lumsden, recognize for an announcement. Thank you, Mr. Speaker. The full House insurance committee which was scheduled to meet in the morning and at 8 o'clock will have to be rescheduled. If you would pay attention, we will reschedule that and make an announcement for probably Wednesday. Thank you. Chairman Petrie, recognize for an announcement. Thank you, Mr. Speaker. We're going to reschedule the human relations and age in committee meeting for tomorrow morning at 8 a.m. in room 515 CLOB. Chairman Crowe was recognized for an announcement. Thank you, Mr. Speaker. Public Safety and Homeland Security Committee members, we will meet in room 606 now. We will now be in room 606 CLOB immediately following the regulated industries committee. Thank you. That concludes our announcement.\n\nThank you members. We had a good day. Appreciate your attention and your patience. The majority leader of this house, leader of frustration is recognized for a motion. Thank you, Ms. Speaker. I move that this house stand in recess until 5 o'clock PM, then stand adjourned until 10 AM on Tuesday, March 4th, 2025. Own the motion of the majority leader of this house stands in recess until 5 p.m. today, at which time we will be adjourned until Tuesday, March 4th, 2025 at 10 AM, 10 AM in the morning. Everybody heard all of that? All those in favor will say aye. All those opposed will say no. The cool kids said aye, so this house is adjourned. Thies have it. Sorry.",
  "updated_at": "2026-02-13T15:43:26.467491+00:00"
}