{
  "video_id": "Zk3BGRMELRQ",
  "url": "https://www.youtube.com/watch?v=Zk3BGRMELRQ",
  "title": "3/16/2023- Senate Committee on Higher Education",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 86,
  "summary": "Here is a summary of the Georgia Senate Committee on Higher Education session on 3/16/2023:\n\n**Overview**:\nThis session focused on discussing and passing several bills related to higher education, including adjustments to scholarship requirements and expanding eligibility for tuition grants.\n\n**Key Actions**:\n- **HB326**: Expanded eligibility for the Georgia Tuition Equalization Grant to include an additional nursing school\n- **HB607**: Aligned the ACT test score requirement for the Zell Miller Scholarship to match the SAT score requirement\n- **HB932**: Passed out of committee\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced during this session.\n\n**Notable Moments**:\n- Discussion around ensuring the Zell Miller Scholarship standards are not lowered by aligning the ACT and SAT requirements\n- Praise for the simplicity and intent of HB607 to create fairness for students taking the ACT versus SAT\n\n**Votes**:\n- HB607 passed the committee unanimously\n- HB326 was discussed but no vote was taken\n\n**Attendance**:\nA quorum was present, with members waiting for one additional senator to return before proceeding.\n\n**Adjournment**:\nThe session was adjourned after the committee completed its business. The next meeting date was not specified.",
  "transcript": "You\nYou\nSo I'm going to ask Senator Williams, where do you go?\nOh, there you go.\nSenator Williams, if you would please.\nThank you, Mr. Chairman.\nI did a lot of thank you so much for many opportunities and blessings that you have bestowed upon\neach and every one of us.\nPlease bless us all as we go forward trying to do\nthe work for the state of Georgia.\nPlease bless our men and women in harm's way\nand give each of us safe travels as we go back home\nand our name we pray, amen.\nAmen.\nWe waited on one of our members come back.\nSo, Representative, you can come on up here\nand set out if you want to.\nThat's why we didn't want it.\nWe waited on where?\nHere's one and we got one coming out of this door, too.\nand we're letting you go out of order because we love you.\nOkay?\nSo remember that when we go over on that side of the bill,\nokay?\nSo tell us the bill number and the LC number\nand then you can start.\nYes, sir.\nOkay?\nYou ready?\nCan you hear me okay?\nYeah.\nOh yeah, yeah, there you go.\nOkay, thank you.\nThank you.\nSo HB607, it is an honor to be here before you today.\nAnd thank you.\nIt's LC-50-0554S.\nThat is LC-50-0554S.\nHow did you turn to that?\nSo this is, and so virtually every house member\ncomes before this all-guess body. We'll say this is just a simple bill. And it is. This\nis an apples-to-apples bill. So currently in the code regarding the zeal miller scholarship.\nOne of the requirements in addition to the GPA of 3.7, a cumulative score of 1,200 on\nSAT or a 26 on the ACT. These are composite scores. So the problem is occasionally the\ncollege board who administers SAT will change the SAT format and it no longer becomes\nequivalent to the ACT. So so for the past several years the students that have taken the\nACT exclusively are at a somewhat of a competitive disadvantage. So the way the SAT is escorted\nright now, the 1200 is in the 75th percentile, whereas the 26 that is in code for the Zellmiller\nis now equivalent to the 82nd percentile.\nSo all this bill does is it allows for our student finance\nto adjust the ACT to match the 1200 score on the SAT.\nSo it just makes it apples to apples equivalent.\nI think in your packet you'll have the document that shows\nwhat the percentiles are for the ACT, SAT.\nBut this is something that is independently analyzed\nthat our student finance president will have access to\nin order to make the equivalencies.\nSo that's the bill.\nPretty simple.\nKind of a couple of questions.\nNumber 12 is.\nOh, yeah.\nThank you to the author. This is an alignment bill. Is that correct?\nYes, sir. Yes. We're aligning ACT scores to the newly\noriented SAT so that our Jordan students are not at a disadvantage. That's correct.\nThat is correct. Right. And the best thing about it is the student could take either\none of these and still qualify for this pro. That is correct. I think the bad news is the way\nit's currently scored, they'd have to take both of them in order to be on par. So I don't\nwant to have to go that far, is that true?\nWell, so right now, so in a baseball analogy, right now, if you take the SAT, you're basically\nwatching the pitcher who is giving you a hint about what he's going to pitch. So if\nIf you're taking the ACT, you're at a slight disadvantage.\nAnd all this does is a line that's under the air equivalent.\nYou're exactly correct.\nAll right.\nThank you.\nI appreciate that.\nDo all schools, I know some schools look at the ACT's, some schools look at the SAT's.\nWhat about in Georgia's different, different schools, look at different ways?\nThat may be something for Mr. Chairman.\nMr. Chairman, I would.\nIf I may, Chairman.\nPlease.\nAdmissions will look at either of those scores, all right, and so admissions decisions\nare partially weighted on those scores, and along with their high school academic record\nand a number of other factors, but this is a qualifying for more demanding entry universities\nand colleges, and certainly it will be appropriate for hope to use this as a measure to determine\neligibility.\nThank you.\nSort of more.\nThank you, Mr. Chairman.\nRepresentative, I know the intent is alignment.\nBut when I read the bill, I didn't really\nget alignment out of it.\nWhat I'm worried about, and if you can address my concern,\nis that when we give it all to the Student Finance Commission,\nthat they could ultimately lower the standard\nfor the zeal miller scholarship.\nAnd I want to make sure we don't do that.\nNo, sir. I don't think that that is not neither neither the intent nor the language as I read in the bill\nThe SAT is fixed so it's it is aligning the ACT with the SAT. Yes, okay. I got you all right\nYou do that is that is still a case. Yes, sir\nYou ready to go home?\nYeah, 14.\nYes sir, please.\nThis may be the first time I've agreed with a house member that it is a simple bill.\nAnd I would make a motion to do pass.\nAnd second was Senator Burns.\nOkay, any discussion?\nSeeing none, all in favor?\nRaise your hand.\nOkay.\nPass 100%.\nThank you sir.\nSo very kind.\nYou very welcome.\nSponsored.\nOh, yeah.\nWho's sponsor?\nThank you.\nThank you, Senator Burns.\nHe explained it better than I did anyway.\nSo thank you, Senator.\nThank you.\nThere was an opportunity to say something there,\nand I passed it up.\nThank you, Senator.\nI'll stay here, you can do it.\nNo.\nCome on up.\nOK.\nLet's see, we're going to go to House Bill 228,\nRepresentative Dipsy, who is always smiling.\nI don't ever see her, she's not smiling.\nWe appreciate that.\nThank you.\nAnd I think we may have a, just, yeah,\nI think we may have a substitute.\nI mean, let's see, let me check.\nand y'all have guys in your polls.\nSo it should be LC 491442S.\nOkay.\nThank you so much, Mr. Chairman and members of the committee.\nYou speak closer to the microphone please.\nGlad to scoot this chair up.\nNice.\nAggravated.\nSo this measure, some of you that have been\non the committee for a while,\nyou've seen it several times, the underlying bill actually.\nIt did pass out of both the House and Senate rules last year and did not make it out on\nthe very last night.\nThe intent of this is to deal with one of the challenges that we're facing right now\nin our state, comes from the final recommendations of the Healthcare Workforce Commission, December\nof 22, and dealing with particularly Georgia's Healthcare Education Pipeline, the obstruction\nthat is there for students, the financial aid,\nand the completion challenges should try.\nThis is the underlying bill where we started.\nThere have been some changes in this substitute\nand I'll let each and every person speak to that\nas we go forward.\nBut dealing with just that little bit of help\nthat can come when you're in a private college\nor a university can make the biggest difference.\nThis is a school where particularly students go\nfor their second or third career.\nThey're mostly adults.\nIt's very diverse.\nIt's very fluid in how they can do it.\nIt is a brick and mortar institution right here\nin Sandy Springs with the effort to expand\nto another one in Stockbridge because they have the unique\nability actually to meet the demands of how many apply,\nhow many students apply.\nThere is not an athletic program.\nThere are no other courses other than to graduate\nvery qualified nurses so they can adapt\nin a way that most schools cannot.\nAnd the 2011 session, HB326, changed the eligibility\nfor private colleges and universities to qualify\nfor the tuition equalization grant.\nThe 33 schools, universities and colleges\nthat existed at that time, all were grandfathered in.\nmany are in all of the places where we live.\nI know where I am, there's Barry and Shorter, both.\nThey teach all kinds of things,\nbut this focus that I'm drawing you to today\nin the underlying bill is simply to expand a nursing school\nand address the huge challenges we are having\nin the nursing workforce.\nSo if you will look at the bill\nand turn with me first to page four,\nSection 1-4, this is the narrowly targeted amendment to the Georgia\nTuition Equalization Grant. As you look at it, you'll see that it's very\nspecific. It is for a qualified institution of higher education only with the\nbaccalaureate degree granting institution of higher education only offering\nthat baccalaureate program in nursing. It is accredited by the Southern\nAssociation of Colleges and Schools, or by the Higher Learning Commission, accredited\nby the Commission on Collegiate Nursing Education, with a National Council Licensure Examination\nfor your average passage rate at at least 85%. We've made the bar very high.\nIt will admit persons who have a high school diploma state approved high school equivalency\nDiploma degree from an accredited post-secondary institution.\nStudents are eligible to participate in the Federal Pell Grant Program.\nThey've been reviewed and approved for operation for receipt from the funds for the Georgia\nNon-Public Post-Secondary Education Commission.\nThey must be in Georgia.\nThey must have a bricks and mortar building here.\ntheir existence in the state for at least five years.\nAnd only institutions, baccalaureate degree program or programs in nursing,\nshall be deemed to be approved in this subpart of this bill.\nThe school that is specifically designed for was established in February 2012.\nIt has been here not for five years, but for 11.\nAnd it's very proven with a high rate of nurses, not only who graduate.\nbut who then sit for the nursing exam, pass it, and go straight into our hospitals and other health care facilities.\nI am open, Mr. Chairman, to either take in questions about this now or if you want to go through the entire bill and let each of the other members that are bringing theirs to us.\nWe got one quick question from Senator Harold.\nYes, thank you, Mr. Chairman.\nSo the accreditation language on lines 49 to 53,\ndoes that not apply to your section that you're dealing with,\nbut with somebody else's section?\nIt refers to the Southern Association of Colleges and Schools.\nThat is another portion that was added here the underlying bill is what I just went over in that that section is from representative Bentley\nSection ask one-ass to so Bentley about that would be better for her to explain that and other just so just for y'all's awareness of Senator Burns\nhas a portion at one dash three and then Senator Anivatar today\nAt section part two section two point one\nI'll save the question for representative Bentley then thank you\nOkay, is can represent Bentley come explain? That'd be great. Thank you. Please do\nGood afternoon, Mr. Chairman and members of the committee as\ncheerleaded Dempsey mention house bill\nbill 228, the changes, the addition to the bill from lines 48 down to 53 is what I'm proposing.\nThis portion of the bill will allow for institution which was previously accredited by the Southern\nAssociation of Colleges and Schools, better known as SEX, and that is now accredited\nby the Transnational Association of Christian Colleges and Schools tracks to be considered\nand approved school for purposes of tuition, equalization grants, and this will only\nimpact two schools in the state of Georgia, which are Morris Brown College and Pain College\nin Augusta.\nAnd they are both HBCUs and it will allow their students to utilize the Hope Scholarship.\nThank you, Mr. Chairman.\nRepresentative Bentley, I'm very familiar with the Southern Association of Colleges\nand Schools, but I've never heard of the Transnational Association of Christian Colleges\nin Schools.\nCan you fill us in a little bit with that accreditation agency?\nWell, from my understanding, Senator, and thank you for that question.\nAssociation basically just credits those institutions like Mars Brown and\nPayne College that are Christian institutions and so that's why this bill\nonly referenced those two institutions Mars Brown and Payne College and they\nare part of the AME religious background so AME and CME yes okay if I may\nfurther ask do you have any idea like how long this accrediting agency has\nbeen around. I do not but I may be our about 20 years about 20 years I've been\njust told. Okay says covers 90 schools in 21 states and six overseas. Apparently so\nyes ma'am. Okay thank you. Thank you for the question. Senator Williams. Thank\nyou representative Bentley. Well let's affect the funeral business. It will\nWe'll help educate some people to become funeral license, funeral directors, because we know we do have a shortage in the state for licensed funeral directors and licensed in bomber, so this was certainly helping that regard.\nYes, thank you for that question.\nI think I know what you're doing now for a little bit.\nThank you.\nSenator, I'm sorry.\nThank you, Ms. Chairman.\nI have a question for Representative Dempsey.\nOn line is 125 through 1, really 32.\nIt talks about assessments.\nAnd it talks about the local school superintendent\nworking in conjunction with the Department of Juvenile Justice.\nAnd I'm all for getting these kids out of the juvenile justice system\nand getting them educated and getting them employed\nand getting them on the right track.\nBut how does a local superintendent like in Cherokee County do?\nThey work with the juvenile, I didn't know they had\nrelationships there and how that worked.\nCan you explain how that works a little bit?\nSo this portion there is from Senator Anavatarta.\nIt's Senate Bill 123.\nI think that you all have passed, I believe.\nI'm not 100% sure if it passed out and education and youth.\nAnd I believe he is going to be here to speak to that measure.\nIt is not a part of the original bill.\nThis became very popular today, and there are others.\nAnd listen, I want to reiterate, I want to get these kids\nout of the juvenile justice system.\nI want to get them educated, I want to get them working,\nand being productive citizens in our state.\nI just didn't know how it's going to be coordinated.\nMy local superintendent's working as hard as he can\nto run his schools, and I just didn't know how he was going\nto be able to meet with the juvenile justice folks\nand how that was going to work.\nAbsolutely, I believe he is stepped in the room if the chairman is Senator Annabata, I believe just stepped in the room if y'all would like for him to address it.\nIf we could, could we, could we finish this section before we go to, oh yeah, I'm sorry.\nquestion. Thank you. I appreciate the author of bringing this legislation and the concept\nI support it. I've been around higher ed 30 years and I'm not familiar with the trans\nnational association Christian College University. Is that correct? We're specifically\nyou're suggesting we're specifically looking at pain and mars brown are there\nother colleges in Georgia that are a part of this accrediting group mr.\nsenator those of the only two that I'm aware of pain and if I look at their\nmember institution role and if I've got the right website for Georgia for Georgia\nI see the Atlanta University of Health science and swanney Georgia just on the\nfirst page. I see Bula Heights University in Atlanta, Georgia. I see the College of Athens,\nformerly Athens College of Ministry in Watkinsville, Georgia. And that's just on page 104. So my\nquestion is, would this legislation open all of those schools up for access to TG and hope?\nWell, my portion of the bill, thank you for that question, only reference Mars Brown and\nPayne College because they are the two HBCUs.\nCould you point that out, please, where is that referenced in your legislation?\nIt is not actually referenced in the lines on the bill, but just in from my knowledge of\nthe two institutions.\nThe trick is they were previously accredited by SACS.\nThat's right.\nThat's the limiting factor.\nIs that correct?\nThat's correct.\nThey were previously accredited by SACS.\nIf I could.\nAnd Mars Brown, both of them have been now.\nPreviously.\nRight.\nAnd can you explain the accreditation issue with why they are no longer in SACS or choose\nnot to participate in SACS?\nSACS is the normal accrediting for higher education.\nYes, sir.\nYes, sir, sure if the chairman will allow. Yes, yes, yes, please\nGood afternoon members of the committee. My name is Andrew Long. I am the consultant for\nMorse Brown College here in Atlanta, Georgia and for Pain College in Augusta, Georgia.\nand there are nine schools I believe in Georgia\nthat are accredited by tracks.\nThe only reason why it would only apply to these schools\nis because these two schools are the only schools\nthat were formally accredited by SACS\nand now accredited by tracks.\nIt will not apply to EG will not be opened up\nto any of the other schools that tracks represents\njust Morse Brown College and Pain College\nin Augusta, Georgia.\nNow, the reason, well, specifically for Moore's\nBrown College, poor management, poor leadership,\nmismanagement of funds, they were down for 18, I think,\n20 years.\nBut on April 26th of last year, they regained their accreditation\nand they are back.\nAnd for children, for students who are trying to attend\nMoore's Brown College, which has one of the lowest tuition\nrates of any of the HBCUs in Georgia,\ngetting that T-U-G funding would mean everything for them and their majority first-time college students,\nand the generation students.\nAnd on the new leadership as well.\nAnd I appreciate that and let me say I'm very familiar with paying college and the challenges\nthey've overcome.\nYes.\nAnd I'm very proud of them and I'm very supportive of paying.\nI'm very supportive Marsh Brown.\nI just wanted to clarify that we're not expanding that beyond with tracks of accreditation\nbecause.\nRight.\nThank you.\nThank you, sir.\nAnd if we want to make sure we ran a right that they are both under new leadership, better\nleadership now.\nYes, ma'am.\nThanks so much, better now.\nYes, ma'am.\nI think we've read that several places.\nThank you.\nCan I bring Senator Antibiotari up?\nHe'd come out behind the wall.\nI'm sorry.\nI couldn't see you over the man.\nOh, you're good.\nYeah.\nI was worried about you.\nI'm going to let Michael and also Joe Ferrero, who's the deputy edge in the general talk about\nthis so Senator Beech's question this does touch on juvenile justice and\nexpanding the opportunities but also to the ASFAB piece which I know General\nCardin supports as requested for us to try and get that piece done around that\nso I'm gonna let Michael come up and then last I'm gonna let Joe come up and then\nMichael. Military always first. Yes or please tell us your name and what you\ndid. Yes, sir. Mr. Chairman, I'm Joe Ferrero. I'm the deputy\nadjunct general for the Georgia National Guard. Thank you for giving the\nopportunity to be here to speak today on behalf of that portion of the bill\nthat affects testing for a military aptitude. So nationally 4% of service\nThis age youth get the ASVAB test at school, 96% then obviously don't.\nThis bill would allow the military entrance processing system to have access to the schools\non a broader basis to test high school students 11th and 12th graders so we can assess their\nabilities and their recruitability into the military.\nAnother part of this that I think is important for you to know is nationally again only 23%\nof recruiting age youth 18 to 24 years old in this country, only 23% are eligible to\njoin the military because of educational deficiencies, physical issues, and criminal involvement.\nSo we're down to recruiting out of a population base of 23% and if only 4% are getting tested\nin high school, it really puts some roadblocks in our ability to recruit soldiers, airmen,\nsailors, Marines, and now space force personnel to defend our country.\nSo this bill would allow the schools or would actually, the schools would give the test\nfor students who want to take it.\nIt doesn't force every kid to take it, but it makes it available for those who want\nto take it.\nAnd that helps us identify the kids that we can talk to and recruit them for a possible\nfuture with the military.\nActive duty, guard reserves.\nSenator Payton has an question.\nYes, thank you, Mr. Chairman.\nHow are you doing, my friend?\nI'm doing very well.\nThank you, Senator.\nGood to have you here with us.\nMy question was I'm looking at this and I'm having work with the Department of General\nJustice for 30 years.\nsomething's been worked out with DJJ that they're open to because this puts a lot of burden on them too.\nSo the DJJ part is a different section. Our section is just dealing with the military testing,\nthe one that I'm speaking to. So I'm sorry, so Mike here, Mike can speak to me.\nYeah, thank you.\nSo Senate Bill 123 and its introduced form\nwas an emphasis to provide students\nwith guidance for, you know, career college pathways\nand help them be better informed\nto make the best right decision for them.\nThe section here that we have,\nspoken out in favor of, section 2-2,\ndeals with being able to and encouraging districts\nto administer a college readiness\napt to test ACT or SAT during school time,\nduring school hours, at least once for juniors and seniors.\nThat is a policy that more than half the states\nin the nation do offer, most provide that some states\nhave it as a requirement.\nThis is not a requirement.\nThis is optional for all students who want to take it.\nThe section here is just about coordinating with the superintendents and DJJ to give those\nstudents the same opportunities to take the test, put department of education in charge\nof how that coordination looks like.\nI have not heard anything from DJJ in the two years that we've pursued this at any point,\nraising any sort of concern about how this would operate.\nThe reason I ask that question is because, you know, the kids with DJJ are reserved confidentiality\nfor one, and so for kid in our lot, they see, I mean, that confidentiality, how do we\nget past that barrier that, you know, the military or\nhervers coming into assess these kids, I mean, it's not\nimputing that that ability for those kids to.\nYeah, so again, this is providing those students\nwith the opportunity to participate in a test taking.\nAnd again, what I should have mentioned is that\nI know the ACT and I believe the SAT do offer on site testing to take place, which could\nbe an available option.\nIt doesn't necessitate DJJ to coordinate in any way that would break confidentiality.\nThey've got some flexibility in how they do it.\nIn the end, it's just a matter of making sure that that is an available course if a student\nchooses to take the test.\nOkay.\nWell, thank you.\nSenator Beech.\nI was told that section 2.1 and 2.2 could cost the state $5 million.\nIs that accurate?\nAnd if it is accurate, who's going to fund that $5 million?\nSo that's not entirely accurate.\nSo the 2.1 is entirely paid for by Department of Defense and there is no cost involved.\n2.2 is, if you are to make it a statewide, however, as you see in section 3.1, there is\na mechanism for section 2.2 and 2.2 only that does not put an unfunded mandate on the\nprogram and instead makes it so that it is, that this section is not in effect.\nOkay.\nOkay.\nWhat's the will committee?\nOh, we've got one more question.\nWe've got some things.\nYeah.\nYeah.\nPlease.\nHere.\nI'm trying to understand who would administer the assessment?\nfor the military testing?\nI'm good with the military.\nI think you're, I think I can turn to section 22.\nYes, sir.\nSo 2.2, it would be administered by the school much\nin the same way.\nSo if you think about how students, the state pays\nfor the PSAT, for 10th grade students, all students\nand all 10th graders in the state take the PSAT.\nThat is administered by the school during school hours.\nAnd this is just mimicking that for the purpose of the SAT itself rather than that.\nAnd who developed the assessment and what is the cost of the assessment?\nI can go back to Senator Beech's question online, 118, with state funding.\nYeah, so where's this, who created the assessment?\nYeah, so that is the ACT or SAT.\nSo you're going to administer the ACT, now again there's a big difference between a PSAT\nand an SAT and a PSAT is administered in schools, SATs do not administer, they administering\ncolleges, universities on central sites.\nI'm not aware, unless there are some large environments where an SAT would be administered\nin a local school setting.\nSo my concern is what is the cost of an SAT?\nSo what you've seen, again, in most states, more than half states in the country do provide\nthis program, just like this, and in many cases what they would do is they would be able\nto negotiate a lower price than what your sticker cost is, but the estimate is, the estimate\nIt is about $5 million is what I've been told.\n$5 million, and what is the cost per student assessment?\nAnd how many students are you going to assess?\nSo there are 150,000 roughly 11th and say-\nSo you're going to administer this test to every student in Georgia who chooses to participate?\nThey could all choose because they get a free SAT.\nthey could, I would hope so, that is the goal.\nSo in Atlanta, in APS, through a private foundation,\nAchieve Atlanta, they have been doing this for,\nI want to say four years now.\nWhy would they continue to do that if it was State Fund?\nAPS is only one school district out of many.\nWhy would any school district choose to do it?\nIt is in the best interest of children\nto be able to take this test early.\nThe research shows, and that's the reason why we've been\nsupportive, the research shows this is a proven mechanism\nto increase college going rates, to increase college\napplication rates, to increase college going rates\namong low income and minority students,\nand increases individual SAT or ACT scores\nby moving it up.\nSo, excuse me, one more question.\nWas that not the intent of the pre-SAT\nto indicate the capability of a student\nto pursue additional education?\nThat is one of the reasons, yes sir.\nAnd so we offer, as a state,\nwe offer that assessment for all 10th graders.\nAnd, but we don't offer the same opportunity for the actual test, the SAT or AC.\nWe got one more speaker.\nSure.\nIf you will, please.\nYeah.\nAll right.\nHelp me.\nYeah.\nYeah.\nThank you so much.\nSo, my name is Emilyona and I actually represent ACT in the state.\nAnd so, what we can kind of speak to is, you know, as Michael has said, and he's been working\non this for a long time on the advocacy side, but from our perspective, he mentioned\nover half the US is already doing this.\nReally, what the goal is and what our mission is,\nis ACT actually is a nonprofit and focuses on those kids\nthat are underserved, you know,\ndon't have as much access as other kids.\nSo what ACT does is they actually offer\nfor free fee waivers just to all kids\nthat want them that qualify.\nThe problem they're having is they,\nthe kids in rural districts, particularly not APS.\nLike you said, APS is already doing this,\nthat's not the issue.\nIt's kids in rural districts, kids that are underserved\nthat are having to drive an hour or two hours\nto go take a test.\nSo really the point of this bill is to allow\nthe school districts to offer that during school hours.\nThere is a funding piece that we hope, you know,\nat some point could be where school districts apply\nfor that.\nHowever, that's the goal right now for the bill\nis to allow schools, encourage schools\nand really with those local school districts\nto offer it during school hours in the districts.\nSo that way, they're getting the same access that APS is.\nYou know, we can still go after funding,\nbut the thing about this build, too,\nis until there's funding,\nwe will not be requiring any local school district to do it.\nYou know, that's only so thumb them.\nThere are a lot of advocacy organizations\nthat already do that, which is how APS does this.\nDoes that?\nAnd then this would allow those, like I said,\nrural districts to kind of offer that there.\nAnd that's from our research.\nYou know my, Mr. Chair, I represent\na lot of rural school districts.\nAnd I have school districts that have less than 200, 300\nstudents in the entire high school.\nThey would have less than 100 students in a 11th grade\nor a 12th grade.\nSo you've got a pool of very limited.\nAnd that's why they tend to go to more consolidated testing.\nAnd I am concerned about administration\nin an environment where they're very low numbers.\nYeah, I can only speak for ACT's perspective here,\nobviously on behalf of them,\nbut for my understanding, they do this, like I said,\nthey're doing this in many states that are very rural\nand for them to provide those opportunities for kids\non the college admissions, they're kind of fine with that.\nI will say that in most school districts,\nit's actually administered by teachers\nand we have talked to a lot of the districts\nif this would be a burden on them as well,\njust to be clear and we have not.\nAnd to them, they don't see it as a burden\nbecause it's providing that opportunity.\nThe other piece I just want to mention too is,\nis I know we also know every kid's not going to go to college\nand that's why we wanted to make sure\nthere was a workforce credential\nthat offers those opportunities for as well\nfor other students as well.\nYeah, my apologize Ms. Chairman,\nbut my experience with administering these tests\non a college campus is the ability to validate the student\nI'll validate the student and proctor the exam\nin an environment where there's assurance\nthat that student's evaluation is valid.\nI would say that that's gonna be a difficult challenge\nif you ask a classroom teacher to evaluate\nher students or his students and I have just concerns.\nAnd if my math's right, we're looking at about $30, $35\nper student, is that about right?\nYeah, it really said that this would go\na disc from like I said again from ACT's perspective this it depends on how so\nthis would still be like a local control situation in most states so the\ndistrict would contract with college board or ACT or for workforce credential\nwhatever that is and you know I think that that's probably on average but I\nthink that price depends on what that contract looks like just to be clear\nbut to your to your numbers that seems right I would say the average like I said\ntest for an ACT is around that. 35 to 40. 35 to 40 dollars and 150,000.\nSo yes, but like I said, they do offer those free fee waivers for kids that qualify, which\nthat's really important, and then to understand. And then like I said, there's the idea that\nit is we want to make sure this is opt-in, not so that way, you know, we're assuming\nnot every kid's going to take one of these tests. But that is maximum number, yes, sir.\nSir, the bill. I thank you, Mr. Chairman. So when I graduated high school in 2012, so I guess\n10 years ago now, I'm sorry, I didn't mean to disrupt the committee. I even sold now, sir.\nAnd I went to a very rural school. I think there were like 140 people in my class.\nI'm not as real as some, but I remember taking this test in the cafeteria we were all brought\nin and someone from the Air Force was there administering it. I'm not sure what capacity\nthat person was in. But if we're going to spend $5 million, where does that $5 million\ngo? Is someone profiting from this? I mean, that would be for the, that is if you do\nfor the college admissions test or the career readiness assessment and that's just like\nbecause that's a rough number,\nbut that would actually go for whoever's gonna admit,\nlike who's providing the test.\nAnd then there's gonna be a voucher for people\nto take the ACT or SAT, is that part of it?\nSo all that would be decided out at a district level.\nSo a local school district essentially would purchase\na contract, they would do an RFP process\nfor with who's gonna provide that test,\nas my understanding.\nI think for what you're talking about\nwhen the military testing and I let Joe speak to that,\nthat's a little different than the college admissions\nand career readiness, but thank you, Senator Moore.\nSo about the ASVAB testing, we'll call it,\nbut it's not called out specifically\nas ASVAB testing in the bill,\nbut it's military vocational testing.\nThat is provided by the military.\nThat is no cost to the school, no cost to the student.\nThat is handled through the military entrance processing\nsystem, MEPs, and they're the ones who send out\nthe Air Force sergeant or an Army sergeant\nor whatever to proctor and to give the test.\nSo that is no additional cost to the state,\nthe school, anybody.\nThat's just giving the MEPs personnel more access\nto the school and the students to test them\nbecause I had the same thing.\nWe got sent to the gym and the sergeant gave us the test\nand they went away with the results.\nAnd then if you wanted to, you could mark\nthat the recruiter could call you.\nAnd then if you mark that, then they would call you up\nand see what they could do to work with you.\nSo I'm further confused now.\nSo what exactly is this section of the bill doing?\nSo two dash one just gives, right?\nAs I mentioned earlier, only 4% of high school students\nnow get the test at school.\nMost of the kids, we recognize that the military\ngoing into other schools.\nBecause they're not allowing us in.\nSo this bill would allow us ready or access\nto go in and test them.\nIt's changed a little bit since you and I took that test\nor the schools open the doors, it just hasn't happened.\nAnd so this would open the doors for these\nmeps personnel to go in and give the test\nonly to the kids who wanted to take the test.\nSo this section is mandating the schools\nallow the men?\nIt allows the meps personnel in.\nYes, okay.\nThank you, Mr. Chairman.\nVery good.\nTurn it back.\nWe got some other presentation.\nWhat the world could be on this?\nI'm not ready to make a motion table.\nOkay, about that.\nSecond.\nAll in paper.\nOh, wait, wait, wait, wait.\nOh, hold on, okay, we got speakers.\nOkay, Senator Harrell.\nNo, shouldn't, right?\nAt the proper time, I'd like to make an alternate motion.\nAll right.\nCan I get a clarification?\nYeah, of course.\nThere's a point of clarification.\nSo we have a multi-section bill.\nIf I understand correctly, section 1.1-2,\nHouse Bill, House Bill, what is the House Bill number one?\n228, 228, did that bill go through the house and was it adopted?\n1.2 was not part of 228.\n641.\n641.\nAnd did that bill go through House Committee and was it acted on by the House?\nThis year it did not last year\nif identical linguists passed a house in that room.\nGot you, thank you.\nAll right, thank you.\nAnd then I know that section one-dash three\nis Senate Bill 137.\nIt passed this committee.\nIt was adopted by the House,\nand it was in the House higher ed recently.\nSo we know that's been vetted.\nSection one-dash four, what is the house bill?\nIt has passed.\nIt has passed.\nIt is the original underlying bill\nthat was sent over here.\nAnd it's the number is what we're working on.\n228, yes sir.\nOkay, and as section 2-1 is\nSenate bill 123 is that correct and I'm sorry all section 2-1 and 2-2 or just to or just\n1 and 2 and\nHouse bill 123 Senate bill 123 could make me right sorry jace and and did it go through committee has been to the floor\nIt was ready for a full vote.\nAll right, and then section 3-1 is just, thank you.\nThank you for clarification.\nThank you, Senator.\nLet's hear from you.\nWell, prior to making an alternative motion,\nit seems like there are a couple options\nbesides tabling the entire bill we could strike part two or we could in a couple\nof places change shall to may in part two. Is there any discussion about those\ntwo ideas? Well we will have at least one meeting next week and we'll probably\nhave to. So I think you still have some clarity to this that we need to have. I'd rather\nforce the period over, we apologize, but I'd rather force the period over to clear up some\nthings. And I think we got a motion and a motion and a second table to write. Okay, so\nis that okay? Yes, ma'am.\nSo you're proposing we table it now, but take it off the table at another meeting in a few days.\nWe'll definitely have it at least.\nWe'll have it at least one meeting next week and we'll try, we're going to try to have two.\nSo we'll definitely bring it back at one of those.\nIt will be the number one on list.\nIs that okay?\nThank you.\nAll in favor of that?\nRaise your hand.\n100%.\nOkay.\nThank you.\nThank y'all for your time.\nWe're now, I don't see a representative guest here.\nYeah, I see Kim.\nI was Senator Jackson.\nOkay.\nWe're going to go on and start with Senator Jackson.\nAnd she has...\nOkay.\nI didn't know who to go.\nThey went out of order.\nIf he shows up, he died of heat.\nThank you, Stucky.\nYes.\nI think we could be amenable to coming to some compromise around that chair.\nThank you, Mr. Chairman, and we are working off of Senate Bill 264, which is LC-5-0-0-5-1-0.\nAll right, thank you, and I want to begin by thanking the Chairman for allowing us to have\nthis hearing.\nThis is such an important conversation for us to begin, and so as you can see from the\nsign up list there are many people who are very much interested and invested in this issue.\nSo very briefly what this bill does is that it allows people who are resettled here in\nGeorgia via a special immigration status.\nSo what we're talking about specifically are people who served and helped our military\nin Afghanistan.\nwho have been clearly on our side\nwhen it's come to those wars.\nThey've come here with special immigrant status.\nAnd this bill will allow them to receive in-state tuition\nupon being resettled here.\nI think it's important to note that none of those folks\nthat have come here have come from another state.\nThey don't have another state\nwhere they could get in-state tuition, right?\nOftentimes, this is what we're thinking about.\nWe're like, oh, we don't want somebody who lives\nin South Carolina say where they could good in-state South Carolina tuition, we don't want them\ncoming to Georgia and getting our in-state tuition.\nFor people who come here who are resettled by our federal government, folks who have been\nour friends, who have gone through extreme amounts of trauma and yet still been dedicated\nto this country, people who are resettled here, this is their home state.\nThis is in-state for them.\nAnd so this bill would allow those who have a humanitarian parole status, a special\nimmigrant status, to be able to continue their education and to do that in a way that's\naffordable by receiving in state tuition.\nIf, with that, there are a lot of people who signed up and so I'm happy to yield as much\ntime to them if that would be helpful, Mr. Chairman.\nCan I ask a quick question?\nplease. I think maybe Senator DePain and I had a conversation about\nDalton, Georgia, and the Hispanic population of Dalton and so forth and\nthe parents of refugees but children. I guess the children are also refugees in\nthe school system up there and costume when they graduate from school system.\nThey don't qualify for any state tuition. Is that a part of all this? So actually\nSo that's a separate bill and so in one certainly that I hope that many of us would support\nin the future.\nSo the children that you're referring to often have DACA status so they are children who\ncame with parents of their known, no of court of their own, right?\nThese children are, these young adults, these are young adults or children, they are coming\nhere with legal status from day one.\nThey, on day one, not only did they come here with legal status on day one, they were picked\nout, right, from Afghanistan, from the countries that they were, and recognizing knowledge\nas having either assisted the U.S. military, as interpreters, or being people who are\nextremely in danger of being harmed because of their support to the U.S. military.\nSo these folks arrived on day one with legal status in our state as a special immigrant.\nWhereas the folks that you're talking about don't have legal status.\nSo this bill would be very clear and very specific to folks with legal status to be here in this state.\nAnd this is their home.\nSir, a pint.\nWhat does apply to my question is because I'm in my military, I remember we had a gentleman\nthat was actually from Nicaragua and he was serving in next to us in the first 5th, 4th,\n5th, 8th, 2nd Airborne Division and I come to realize since then that we have a lot\nof non-citizens that are serving in our military and for those who are living here this would\nallowed them if they were living in Georgia and stationed at Fort Benning and that would\nhave been allowed those to access.\nI'm going to bring in my specialists here.\nI don't think that's accurate.\nI have a different bill to allow those folks to become peace officers in our state.\nBut this is Darlene Lynch.\nShe really is my expert who can answer that question definitively.\nSo again, tell us who you are and who you represent.\nI'm Darlene Lynch and I'm a lawyer here in Georgia and I represent the business and\nimmigration for Georgia partnership.\nIt's a partnership of refugee and immigrant serving agencies in the business community.\nAnd so to answer your question, as Senator Jackson said, it's not possible to become eligible\nafter you're here.\nYou have to be admitted to the United States as a special immigrant visa holder.\nSo an interpreter from the Garagua would not have that ability.\nThey have to be from Afghanistan or Iraq.\nHowever, if they were a humanitarian parolee approved before coming to Georgia, yes.\nOkay.\nSo this is specifically for those in Afghanistan or Iraq.\nAnd for others who have humanitarian parolee or other special immigrant status, it's not\nsomething you can do.\nThe reason I identified that because this was the ladies in the town, Nicaragua was alright.\nAnd that was always one of those questions.\nHe fled Nicaragua in a very tough time to enjoy the military, to serve our country.\nThere's a mole.\nThank you, Mr. Chairman, so I'm just trying to understand what a special immigration status\nis.\nAnd if I read it off the U.S. citizenship and immigration services, Homeland Security\nwebsite, it says special immigrant is a non-citizen who qualifies for a green card after meeting\ncertain criteria.\nSo it doesn't say anything about assisting the U.S. or the state of Georgia for that\nmatter.\nDo you want to say something?\nSo this bill addresses three categories of people.\nRefugees, I think most folks are familiar with the U.S. refugee program that dates back\nfrom the Vietnam War and Georgia's program dates back four decades.\nSpecial immigrant visa holders are there's three programs that the U.S. government have\nset up.\nThe oldest program they're all referenced in the bill would apply to interpreters from\nIraq and from Afghanistan who served as interpreters or translators for a certain period of time\nand applied for an SIV and then came here.\nThe more recent programs, there's another one for Iraqis and the most recent one for Afghans\nwho had supported or acted in a trusted role with the U.S. government.\nThey have to get approved by the head of mission and then they apply for an SIV permit.\nThey wait many, many years up to three years now to get that and then they come.\nSo all three of those SIV programs are for people who supported the U.S. military or\nthe U.S. mission in those countries.\nAnd then the last program is for humanitarian parolees.\nAnd just to hopefully alleviate some of your concerns, we do spell out the exact code\nsection in the federal law if you look in lines 19, starting line 18 through 22.\nSo we're not talking about just special immigrants, but we do specify the exact\ntypes of special immigrants that mislead just a attorney council and it's just for\nto burn to. Okay yeah I certainly have to go read those. Thank you Mr. Chairman.\nThank you Mr. Chairman and thank you to the author and to those who support the\nlegislation. I certainly support the concept I think it's it's a worthy for us to\nacknowledge the service of those who helped our country. A few quick questions.\nAre other states offering similar benefits could you could you could you share that and kind of give me an idea of what other states might have\nChosen to do. Yeah, so there are other states and your Tennessee specifically\nConsulents might be able to add some more\nSo some of this is about clarifying the law if you if you look there there is a sentence\nI'll see if I can refer to the line where the Board of Regents is given some\nOpportunity to determine so if you look it on\nI think line, starting line 12, 12 through 14, the Board of Regents has some leeway already\nwritten into the law.\nAnd so in other states like Tennessee, they've actually chosen to interpret that those\nwho come as humanitarian parolees, who come with these S.R.V.s, the fair that they qualify,\nthey didn't necessarily, they've interpret that and decided to have that kind of generous\nread already.\nSo I know that's one example, if Councillor Litch can offer more.\nRight, and so different states are doing it different ways, but right now there are 10 states\nwho pass similar legislations, and some of them include Colorado, Virginia, Ohio, Wisconsin,\nVermont, both Democrat, Republican states, and right now there are five pending, including\nin Utah as the most recent one, similar legislation to this bill.\nThank you another follow-up Mr. Chairman, how many students do you feel would be a part of this qualifying group?\nYeah, thank you so much for that question and that's something we were trying to kind of get a hand handle on them\nWe're not 100% sure where we believe there'll be somewhere in the hundreds so\nWe're not talking we're not talking thousands at all. We're talking somewhere in the hundreds\nAnd then one more I apologize, Mr. Chairman\nBut have you had these discussions with us G and TCSG?\nAbsolutely, and those are they, they're response, how do they feel about it?\nWe're continuing in those conversations, so those discussions have been ongoing.\nThis legislation, I think the fact that we're having this conversation, this is a bipartisan\npiece of legislation that many of you on the majority side have signed on, I think will\nhelp us in that conversation.\nIt would impact their tuition, but I recognize that\nThey just need to be a part of the conversation. That's all right, and they are they absolutely are would you like to add to that?\nOkay, thank you. This chair. Okay. What one would bring up a couple of speakers. Let them let them have about a minute and a half each\nAnd so I'll let you choose\nDo you have the lists? I do actually. I've got another one\nI think if we'll have Jonas come first yeah we'll begin with darling and then we'll\nhave you know where do you want them to testify for Mr. Chairman yeah where would\nyou like do you want them to do it from here oh sir Roger yeah yeah okay thank you all\nand for the opportunity to share our support for this bill.\nAnd thank you for the sponsors of this bill on this committee.\nAgain, my name's Darlene Lynch, chair of the Business and Immigration for Georgia Partnership.\nI want to start by saying this bill arose out of months of work on the house side of a bipartisan study committee on how to maximize Georgia's global talent.\nAnd what we recognized is that one in ten Georgians is foreign born today, one tenth of\nour population, one seventh of our workforce is foreign born.\nAnd yet we have so much talent that we have yet to tap.\nAnd so the Global Talent Study Committee looked at what are the barriers, how can we remove\nthose barriers.\nAnd the number one recommendation was to address the barriers to admission to Georgia\npublic colleges.\nThat was the number one recommendation for really strengthening our workforce.\nAnd every member of that committee, both Republicans and Democrats, sponsored the bill, the\nversion of the bill you have before you today in the House last year.\nAnd that was HB932.\nSo today we continue the work.\nAnd we have a companion bipartisan bill in the House as well.\nAnd that bill sponsored by Representative Holcomb and Hitchens, both U.S. veterans.\nSo there's a lot of support for this bill.\nWe've been doing a lot of education around this bill.\nAnd as I said, it's part of a national effort to recognize the support that people from\nother countries have given to our country overseas.\nI just want to clarify a little bit about Georgia's history in this regard.\nGeorgia has a-\nThirty seconds.\nproud history dating back four decades of welcoming refugees.\nThey're vetted screened and approved by the U.S.\nand then resettled with the state of Georgia's help.\nWe have a state refugee program.\nAnd so we resettle a few thousand people every year,\nincluding many children and youth\nwho had their education disrupted.\nThe bill makes a very small change, as we said,\nto ensure that they are treated as in-state students\nas soon as they are resettled here,\nbecause they have no other state to go.\nI'll end by saying this bill addresses several challenges\nat once.\nYes, ma'am.\nThank you, that's it.\nI'm sorry.\nOkay, thank you.\nAll right.\nKim, what would you?\nYeah.\nYou know, next up you.\nThank you, ma'am.\nI appreciate that.\nGive us your name and what you do.\nYes, sir.\nThank you, Mr. Chairman.\nSenator Kim.\nSenators, thank you. My name is Jonas Abraha. I am the co-chair for CRSA, which is a coalition of\nrefugee resettlement services agencies. So CRSA helps the refugee when they arrive here,\nand the coalition has about 23 different organizations. And before that, if you allow me,\nI would just sit in here thinking, if this would be an opportunity where I come from,\nI would not have been refugee.\nSo thank you for that.\nBecause most of us in that refugees live in our school,\nour family, everything behind,\nbecause of this opportunity democracy that offers.\nSo for that, thank you.\nSo our organization, our coalition supports this bill.\nThe reason we support this bill is,\nas soon as some of the agencies receive,\nthey welcome the refugee when they arrive here\nat the Alana airport.\nThis is the first airport that they come.\nOnce they come to the airport, the first thing they ask is,\nif they left their school, I want to continue my education.\nI want to continue my education.\nBecause by doing that is the way for them\nto give back to the country that has given them opportunity.\nAnd for us to tell them, you can't afford it\nbecause you are considered out of state.\nIt's very difficult to explain that\nbecause this is the only state that they have.\nAnd a lot of them, they have, especially like the Afghans,\nand now the Ukrainians.\nThey have left, like they have certification\nthat they need in order to continue with their career.\nSo for all that reasons, we say, this is a fair bill.\nThis is a necessary bill that we needed.\nBecause Georgia is one of the best state.\nI came as a refugee.\nI'm an Air China refugee.\nI came here, went to Kroski High School.\nI went to Australia.\nI went under my undergrad.\nI like it so much there.\nI got my master's from West Georgia.\nI was even thinking about becoming a professional student,\nwhich was not possible, but I like Hamilton.\nSo for that, most of Georgia's, you know, they help us.\nFor me, for example, my school, for my teachers,\nall those things I would not have gotten.\nSo we, as the coalition, we are asking for this bill\nas soon as possible if it's possible.\nThank you.\nYes, sir.\nThank you.\nSenator Jackson, one more person.\nJust one?\nWe're right now.\nIt's great presentation.\nWe appreciate it.\nI'm sure this guy's fixed here.\nHe didn't miss it up now.\nThank you.\nYes, ma'am.\nIt's honor to be here and talk about the positive impact.\nTell us your name and the specificity of this bill.\nI'm Hacena Lekuzai, one of the new\nto the Afghan refugee in Georgia.\nI've been here for one year and my family\nrelocated here after the Taliban takeover the country.\nMost of my family members are here\nand we are all excited and motivated\nto track our career back here.\nAnd also we are excited that what the youth provide for us,\nespecially for me as a woman from Afghanistan.\nBefore the Taliban sees in Afghanistan,\nthe number of children out of school were 3.7.\nWhen the Taliban sees in Afghanistan,\nthe Taliban ban women from education,\nso the number moved to 6.2 million people for children.\nToday, Afghanistan is the only country\nthat for better than it is half of its population\nfrom education, which are girls and women.\nSo the new residual Afghan in the USA\nare the only hope of my country.\nI'm optimistic that one day delayed the country,\nthe break the chain of human right violation\nand this inequality in my country.\nHowever, beginning a new life in USA is not easy.\nWe face many challenges.\nSince coming to USA or to Georgia,\nI have been looking for opportunities\nto obtain my master degree in public health in Georgia\nand also to support my family financially at the same time,\nBut I couldn't make this in Georgia.\nSo I didn't give up.\nAnd I have been, I began looking for opportunities\nand other state.\nHappily, I made it.\nAnd now I'm awarded the prestigious scholarship\nof Pedro Salama with the School of Johns Hopkins School\nof Public Health.\nSo I'm leaving Georgia.\nBut I'm optimistic one day I can be productive\nto the economy of this country,\nor my second homeland.\nThank you, ma'am.\nGreat, thank you.\nThank you so very much for being here.\nSenator Burm.\nJust a quick question, please.\nFirst, thank you.\nThank you for coming, and thank you, Sharon.\nWhere did you, what is your undergraduate work in?\nSo I did my undergraduate in Kabul Medical University,\nBSPH was the Bachelor of Public Health.\nAnd then I start working with Ministry of Public Health\nof Afghanistan, and then I continue my career\nwith UNICEF for United Nations Children\nand Emergency Fund as a Nutrition Officer.\nAnd I work with the Nutrition Emergency\nand the Olimin Programme for around five years.\nThank you.\nAnd currently, are you employed?\nDo you have the opportunity to work?\nYes, I'm working as an interpreter\nwith the Department of Public Health of Georgia,\nwith the Department, yes, thank you so much.\nThank you.\nWe did the Cove County Board of Health Refugee Program.\nThank you very much.\nI appreciate it.\nThank you for being here.\nThank you, thank you for the time.\nThank you, Senator Burns, for your question.\nJust to one moment.\nWe have one moment.\nOne more please.\nOne more speaker or may I close?\nNo, one more speaker.\nYeah, I will, great.\nI wish we had more time.\nIt's a very interesting, but we don't.\nNo, that's okay.\nDavid?\nDavid?\nIf David Garcia from Galleria?\nTell us your name and tell us where you come from\nand tell us what you're doing now.\nSure.\nThank you for having me.\nI'm David Garcia.\nI work for an organization named Galileo Impact Fund,\nand we advocate for the Latino Hispanic community\nthroughout Georgia.\nI'm also a first-generation US citizen.\nGeorgia resident, college graduate, and military veteran.\nI graduated from Mary at a high school,\nenjoying the Marine Corps shortly after.\nI served as a US embassy guard in Peru, China, and Serbia.\nAnd I also worked as a contractor for the U.S. Department of State\nin Mexico, Bosnia, and Iraq.\nAnd throughout my time in service,\nI had the privilege of working closely alongside many\nhost country nationals who were vital to advancing\nU.S. interests worldwide.\nDuring my time in Iraq, I routinely worked with many young\nIraqis who had committed most of their lives\nto supporting our efforts there.\nAnd their support, warmth, and commitment to our mission\nwas vital to our success.\nAnd the same can be said for the thousands of Afghan citizens\nwho supported our efforts out there as well.\nI currently live in Decatur, Georgia,\nwhich is very close to Clarkston,\nwhere I volunteer with many refugee serving agencies,\nincluding Clarkson Community Center,\nRefuge Coffee, Friends of Refugees,\nand Clarkson United Methodist Church.\nI've met many refugees and special immigrant visa holders\nin Clarkston who served alongside US forces in Iraq\nand Afghanistan.\nAnd according to the US, according to the Atlanta History\nCenter, more than 1,500 Afghans have resettled in Georgia\nover the past two years.\nTo me, this bill is about supporting\na group of people undergoing major life transitions.\nAnd I can relate to many of the challenges that they face.\nAdjusting to life after living abroad\nis very difficult.\nMy first year back in the US, after serving abroad,\nwas very challenging.\nAnd having structure is key and transitioning\nsuccessfully, higher education and the opportunities that come with being a student on college\ncampus can help immensely in easing one transition. And I think that making higher education\nmore accessible for a group of people who have supported our country and our foreign\npolicies is the least that we can do. And I ask for your support in this bill.\nTime and it was just right. Thank you. Thank you. Thank you for your service. I'm\nappreciate it. Thank you. Yes, sir. We have sort of hostile. I could do this later, but I guess\nI want to make one point. Obviously, it's financed your working incentives and trying to get people\ntrying to make the state better. The biggest problem we have in the state right now is workers.\nThe limiting factor on our economy in Georgia is workers and these people are here legally.\nSo I'll stop there.\nThank you.\nSenator Orton.\nThank you.\nI certainly was going to start with Mr. Chairman with the point of our work for shortage.\nBut number two, we've heard from the chancellor of our great university system about the decline\nin enrollment and the need he speaks urgently in our budget hearings of the need to step\nup enrollment figures in our university system.\nAnd so we certainly have the slots there, and I think the case has been strongly made,\na meritorious case for moving ahead with this initiative.\nAnd let's catch up with Tennessee.\nThank you.\nI think Senator Williams has a statement.\nNo, that's what you've been on.\nYeah, I was pretty.\nWhat number are you?\nLet me just get Senator Jackson, thank you so much.\nI wish I could listen to this for a good long time.\nI appreciate your passion.\nI know the committee appreciates your passion, isn't it?\nThank y'all for being here.\nYou know, let's move it forward\nnot next week but next session, okay?\nMan make one closing statement.\nYes ma'am.\nSo I do want to thank you so much for having this hearing.\nI want to acknowledge that there's a family that's come here\nthat's from Ukraine.\nThey came to witness our democracy\nbe a part of this conversation and so I understand we're on a time limit but I\nwant to at least acknowledge their presence and and I do hope that we can\ncontinue this conversation thank you so much thank you thank you all very\nmuch 13 yes sir I'd like to make a motion we take 228 off the table and we go\nback and we amend this to fix this bill okay what is your suggestion oh that's\none oh yeah okay okay do I have a second second Senator Harold second all in\nfavor right now all the food okay as usual all right I'd like to take 228 and\nand strike part two, which will be lands 95.\nWait, hold it, okay.\nHold it.\nRule 147.\nOh, okay.\nI'll second that.\nWait, 95, oh, the whole section.\nYeah, the whole section two.\nThe whole section two.\nOh, okay.\nWe need to make a motion to pass to amend the bill.\nWe've got to have a motion to do pass.\nJust 2.2.\nI'll give you a motion to pass the bill and then we'll amend it.\nOK, do pass in a second.\nAll in favor say aye.\nWe don't have to.\nOK, just one, OK.\nI'm learning, I'm learning, I'm learning, be patient.\nOK.\nThe motion is to strike section 2.2, 2.2, that is page 5 from land, just I'll be clear\nwhere we at, what bill, I'm sorry, okay let's go back, Senator William start, if you would\nstart back over here.\nAll right, I want to strike section, tell us where we at exactly, Senate bill 228.\nbill 228, LC number 491442S. I'd like to amend the bill by striking section 2.2, which\nwhich is Lyons 115, 114-14, through 147.\nYeah, through 136.\n136.\n136.\nOkay, let's go back and make sure.\nLet's repeat all that again, please, sir.\nOkay, and we're again on LC-49\n1442S as in Sam\nCorrect. Oh\nI revised it and in the motion that he recognized I'll start with section 2.2\ntoo. Alright line 1 0 15 starting with land 1 14.\nThree 1 3 we got around\ninto the 1 35 1516.\nOne 36 Yeah.\nOkay yo y'all yo yo hold on\nplease hold on very please.\nOkay, so we'll go all the way through 147, okay, because part three only applies to section 2.2.\nOh, thank you for the definition.\nOkay, let's regroup, but I don't know everybody.\nAll right.\nThank you.\nYou want me to restate the motion?\nEverything.\nAll right.\nOkay.\nOkay.\nOkay.\nWe'll go on to talk real slow.\nExactly.\nTalk, talk, talk, talk like you're talking to a family about what you're going to do.\nOkay.\nLike you're explaining the bill to us.\nSenate bill, bill 228, LC 491442S, I would like to amend that by striking lines\none-fourteen through one forty-seven. Okay. And I'll second that. Okay, hold on just\nsay it. Is everybody okay now? I'd like to make another name. Yeah. Hold on just say it.\nYeah, we got to do it. Oh, so does everybody know what he's talking about now?\nI'm sorry.\nSenator Bates, do you follow me?\nI'm sorry.\nThank you, sir.\nSo do we take, do you have an amendment?\nYou have another amendment?\nWell, I'm sorry.\nTo my understanding, Mr. Chairman, I mean there's the issue with 97 through 113 is just another additional mandate to my understanding.\nSo, I mean, I understand your amendment, but what is the purpose?\nWhat are you trying to accomplish with that amendment?\nWell, I'm going back to the original bill, and I'm just taking out this other part from\nthis section one, lie on one fourth thing, getting rid of the juvenile justice part that\nwill just have to be cleared up.\nSo I'm just going back to the original bill.\nWe have a shortage of nursing and nurses, and that's what this bill was originally for.\nAnd the military part.\nYou leaving it in?\nAnd the military part.\nYeah, help you.\nIt does.\nOkay.\nOkay.\nSo you want to keep your memory, you want to strike your memory.\nI don't think he had on the memory. He was just out of issue with my memory.\nYeah, I'd like to add lines 97 through 113 as well.\nSo that would be a second proposal, remember? Okay. Any discussion?\nI have a question.\nI could ask John.\nPlease.\nPoint of order.\nI don't think you have to.\nAt least first I didn't.\nWe can make.\nIs there right?\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nWhat is the thing?\nThis is a symbol for the moment.\nFirst time.\nAnd then I think it was originally a second.\nBefore I said it, I was in the middle.\nI will be fine.\nOkay.\nSo we do.\nI'm sorry.\nWait for first.\nOkay.\nYou will vote on the center of Williams amendment first and that is to again\nHouse bill 228 LC 491442S and your amendment would be to strike lines 114 team\nthree one forty seven that's correct okay everybody everybody know what\nthat is okay so that's your motion have a second and Senator\nHaas set a second all in favor raise your hand\nAll but Senator, Senator Harold, you vote, vote against it.\nVote against it.\nOkay.\nOkay.\nAll in favor.\nI just want to clear it up.\nOkay.\nWe just want to clear it up.\nOkay.\nNow we take up.\nGreat.\nWe take up.\nSenator Moore.\nOkay.\nHe made a motion.\nHe made a second.\nSecond.\nWhat is his amendment?\nOh, yeah.\nYeah.\nI'm sorry.\nYeah.\nChairman, I'd like to make a motion to amend LC 491442S by removing sections or lines 97 through 113.\nI'm sorry, 95 through 113.\nSecond.\nWe have a second.\nSenator Boerner.\nJust a question for the senator. Is your concern on lines 101-104-106 and 108? The word shall\nDo you see this as a mandate?\nThat's correct, Senator. So again, wouldn't it not be beneficial to allow this to happen?\nWell, you're mandating it to happen. I understand that but the question is would it be beneficial to allow this to happen?\nI'm not so sure it would I think it would be yeah I would ask it instead of striking these terms that you consider an option\nWell, I think the only other option name would be may and if it's just may what's the purpose and having it in the legislation\nThey can't if they want to now they can't if they want to now\nSo that's that was my question center. That's unnecessary ink and paper. Thank you very much\nOkay, so we got a motion in a second to strike lines 95\nthrough one-thirteen, correct? We all together on that, okay? All in favor? Raise your hand.\nOne, two, three, four, five. Okay, all opposed. One, two, three, four. It's like your motion\nOkay. Okay. Okay. Now, um, doing also that we also carried so we're so in essence what this means we have now helped me out.\nWe've now voted and approved the strike lines 95 through 114 and then 114 through 136. Is that correct? 147. 147. 147. Yeah. Is that correct?\nYeah, so all in favor of all that raised in, okay, that's a man, that's a man, that's\na man.\nNo discussion.\nNo, we don't really get one.\nOkay, motion carries.\nDo you have my pose?\nYeah, yeah, we know that's going to happen in all the ways.\nOK, we've got one more bill, but I don't see him here.\nYeah, he's still OK, he's still ready.\nOK, I guess we're going to be adjourned,\nand then we'll see y'all next week, thank y'all.\nWhat?\nI'm sorry, go ahead and look for the last one.\nYeah, I'm sorry.\nGo ahead and look for the last one.\nYeah, I can't.\nOkay.\nOkay.\nThank you.\nThank you.\nBye.\nThank you.\nSee you again.\nBye.\nBye.\nBye.\nBye.\nBye.\nBye.\nBye.\nBye.\nBye.\nBye.\nYou\n",
  "updated_at": "2026-02-12T20:42:34.048595+00:00"
}