{
  "video_id": "zRh-JPzqkO4",
  "url": "https://www.youtube.com/watch?v=zRh-JPzqkO4",
  "title": "3/23/23 - Committee on Transportation",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 36,
  "summary": "Here is a summary of the Georgia 3/23/23 Committee on Transportation session:\n\n**Overview**\nThe committee discussed House Bill 121, which aims to regulate the use of \"wake boats\" that generate large wakes on public lakes and reservoirs in Georgia. The bill seeks to expand the no-wake zone from 100 feet to 200 feet from shorelines and other structures to mitigate damage and safety issues caused by these types of boats.\n\n**Key Actions**\nNone detected\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Representative Anderson provided an overview of the bill, explaining that it was prompted by concerns from lake associations about shoreline erosion, dock damage, and safety issues caused by wake boats.\n- The committee discussed whether the bill should apply to private lakes, with some members suggesting an amendment to clarify that private lakes would be excluded.\n- Colonel Bernard from the Department of Natural Resources was present to provide input on the enforcement aspects of the legislation.\n\n**Votes**\nNone recorded\n\n**Attendance**\nQuorum present\n\n**Adjournment**\nNo information provided on adjournment or next session date.",
  "transcript": "You\nYou\nOur newest member of the Transportation Committee has just been confirmed that Senator\nRandy Robertson has been named as an ex officio to the distinguished exclusive high-powered\ntransportation committee.\nAnd thankfully for you, we've already dealt with truck weights, and we're going to move\non to a matter of equal importance this morning.\nAnd that is Representative Anderson\nwith House Bill 121, Representative Anderson.\nWhy don't you go ahead and grab a seat here\nand Representative Rose, you can grab a seat next to him.\nWe have a House Bill 121 is serving as a vehicle\nof sorts for Representative Rose's vehicle legislation.\nSo we have a vehicle to deal with vehicles.\nSo would love Representative Anderson,\nif you want to talk us through the bill as it originally passed\nthe Representative Rose, you can talk us through the additions\nthat are in the committee sub.\nAnd we'll make sure we're working off the same version here.\nRepresentative Anderson, what version do you have there\nin front of you?\nThank you, Mr. Chair.\nI have LC393953S.\nFantastic, take us through it.\nThank you, sir.\nThank you, members of the committee.\nThis bill has been actually thought about and worked on\nfor many years in this past summer,\nthe part of my newly district 10 includes\nRaven County and the associations from both Lake\nBurton and Lake Raven approached me about this concept\nand brought to me identical resolutions\nthat their water safety committees had passed asking\nfor some help and some consideration to help protect\ntheir property and protect the lives and the livelihood\nof the people that are enjoying the lakes up there\nregarding boats that are generating a large wake.\nWe call them wake boats that we're not actually\nwith this legislation.\nWe're not defining a particular type of vessel.\nWe're defining an activity.\nSo when I was approached with this idea,\nI started looking at what's the best way to do this\nto make it make sense.\nSo I reached out to Colonel Bernard with DNR,\nwho is here today to speak to the bill.\nIf there's any questions that would be directed\ntowards the enforcement portion of this,\nhis suggestion was, let's start with the Tennessee law.\nWe actually have lakes at border Tennessee.\nWe also have lakes at border South Carolina,\nas well as Alabama and Florida.\nMaybe not Florida, but Alabama I know we do.\nAnd those states have different buffers zones,\nif you will from as far as wake generating water vessels\nthen Georgia does.\nMost of them are Tennessee and South Carolina are 200 feet.\nGeorgia is 100 feet.\nSo these particular boats generating three and four\nfoot high wakes are causing shoreline erosion.\nThey're causing seawall damage.\nThey're causing dock disturbances,\neven throwing people literally knocking them off\ndocks, knocking them out of boats into the water.\nThat sort of thing, particularly in our lakes\nthat are typically considered flat water lakes.\nSo what we've done here is we've put together a proposal.\nExcuse me.\nYes, Representative.\nMayors, the committee, please welcome\nChairman Brandon Lamont-Peach.\nThank you.\nThank you.\nCarry on, Representative.\nYes, sir.\nThank you.\nWhat we've done is we've taken this classification\nof activity, again, not identifying a boat,\ndesign, type, or specification, not identifying anything\nexcept the activity of generating a wake,\nwhich is capable of being surfed on.\nThat's a popular thing to do now.\nIt's a generated large wake behind these boats\nand literally step out onto a surfboard\nand surf that without actually being towed in many cases.\nSo we've identified that activity and said\nthat if you're going to generate a wake\nthat is capable of being surfed, the buffer zone,\ninstead of being a 100 foot no wake zone,\nit extends out to 200 feet from shores,\nfrom dock structures, that sort of thing,\nfrom mord boats along the shore to provide more space\nfor that wave to attenuate before it hits the shore\nand in turn will cause less damage\nand less likelihood to affect the people\nthat are enjoying the shoreline of our lakes.\nJust a couple of things that we've done with this,\nwe have excluded the intercostal waterways and rivers.\nWe have some of our residents and citizens\nto enjoy doing this along the rivers.\nRivers are a little different from lakes.\nRivers have varying water-high levels.\nThey have varying current flows, that sort of thing.\nSo Shoreline erosion is a little different characteristic\nalong riverways than it is along our flat water lakes,\nwhich cover lakes and reservoirs in the state.\nWe've also excluded regattas, boat races, marine parades,\ntournaments or exhibition, which the commissioner has granted a marine event permit.\nSo there will be situations and circumstances where this can be done and it will be excluded\nfrom this provision with approval of the commissioner.\nGreat.\nThat's that portion of the bit long.\nThank you, Representative.\nThe biggest probably also worth noting, this is in a section of the code that relates\nto non-private lakes, so private lakes are not captured in this.\nI do have a question for you, Representative.\nI've noticed you are a consistent, dedicated,\nand even some would say disciplined individual\nwho makes almost morning appearance at the Mollis.\nIs that correct?\nThat is correct, sir.\nIs this an attempt to get into shape\nfor weight-boarding and or weight surfing over the summer?\nUnfortunately, my age and my knees are way beyond that.\nSo fantastic.\nAll right, I believe Chairman Moore was reaching for the button here, which didn't work, but I'll recognize it.\nOkay. Thank you, Mr. Chairman.\nI just want to be clear that this is only on public waters and not private waters.\nThat is correct, okay.\nOkay.\nIt's just relative to the code section that it's in, that only this is the code section that I guess sets the law for the public waterways and not private waterways.\nAnd if we do need affirmation of that, Colonel Bernard can elaborate more on their skill\nappropriate.\nChairman Gan, what's your number there?\nFine.\nThank you, Mr. Chairman.\nBecause that was one of the first things I looked at in this, as I'll give you an example.\nI've had events and outings, the up and Jackson County, my chairman of the County Commission\nhas a wonderful light.\nThey do a lot of ski exhibits and recreational skiing.\nThat's all private.\nBut to me, I was talking to our legislative council over here,\nand we were thinking about making an addition in section B\nwhere the code section shall not apply to,\nand just making sure that there's no question about that.\nBecause for me, I don't see exactly where this spells it out\nthat, okay, this is only for public lakes.\nbecause for me, I want to make darn sure that, you know,\nif you own the lake and it's, you know, 40 acres or whatever,\nsaid that if you want to go wake boarding on it,\nwe're not taking away that right or privilege\nfor the individual.\nCorrect.\nJim again, I had actually had a version of this\nthat struck the 50 acre requirement\nbecause I had that exact concern,\nbut then was told by counsel that this one,\nthat this does not apply to private lakes at all.\nSo that change was not necessary.\nI think now that we've taken waters out of this state,\nbecause that's the fine term,\nwe might either want to add that back in,\njust to clarify.\nIf you want to work on an amendment,\nwe'll be ready at the appropriate time.\nThank you.\nYou mentioned Tennessee.\nI think that it's important.\nJack in our office actually did a essentially study\nof all surrounding states.\nAnd this mirrors, best I could tell,\nmirrors what Tennessee has.\nAlabama, interestingly enough, and I hate this,\nbecause I love to wake, sir, but Alabama has outlawed\nweightboarding all together.\nAnd I've seen that that's because of that.\nAnd then some lakes like Arrowhead, for example,\nwhich is private, they don't allow any of this activity anyway.\nSo Colonel, you are the subject matter expert.\nWhy don't you go ahead and step up to witness\nmy number one here, right here, Colonel, if you don't mind.\nI'm sorry.\nMr. Chairman, members of the committee, good morning.\nGood morning.\nYes, so this is Title 52 within that title.\nWe can only enforce state law on waters of the state.\nAnd so we don't go into those places\nof the private property at all with the Title 52,\nif that helps clear that up.\nI think the verbiage.\nThe waters of the state come from state\na little longer than that back in.\nRight, it's all throughout that Title 52\nas far as our enforcement on that.\nWe are a nationally accredited agency,\nand through that, not all 50 states are.\nAnd so we follow what it's called NASBLA.\nAnd so NASBLA has set the 200 foot as a recommended,\nand that's why you've seen Tennessee\nand South Carolina move towards that 200 feet.\nAnd we do that with also consultation\nwith the water sports industry.\nThose folks who make white board boats\nI also support that legislation.\nAnd I wanna highlight, as well,\nthe, what would happen if this were to pass\nis the existing 100 foot no-wake law stays in effect\nas it relates to distances from shorelines and docks\nand when you're a lot of said awake\nand any type of watercraft.\nAnd you're essentially capturing the activity\nof the boats that have the ballast and the surf gates\nand things like that.\nAnd when they're pulling someone\nthat are specifically designed to be weighed down\nsuch that it would increase the weight\nwith a, you know, you're talking about 600 horsepower\nmotors, and usually 2,000 pounds of ballast to make,\nI'd rather make the boats as the least efficient\nas possible to throw as much weight as possible.\nRecognize Chairman again.\nThank you, Mr. Chairman.\nYou know, I'm not a lawyer, I don't pretend to be one\nI don't know, I have watched Perry Mason.\nThe question that I have is, you know,\nif I go over to the other side of the Department\nnatural resources with EPD, and I'll go to a lake which much lakes are built on stream\nsaid they, and there's some type of an issue that comes up, there's mud in the, you're\ndoing deland is starving and it's going into the water.\nThey immediately jump to, that's waters of the state.\nSo I don't know, you know, when we start talking about, okay, well, this is not waters of\nthe state, this is waters of the state, and I don't want to get into an argument.\nSo I'm going to ask Ms. Dole, if you don't mind,\nand that we specifically exclude those privately owned\nlikes, and if that's okay with the sponsor.\nI would definitely be supportive of an improvement to the bill.\nI appreciate that, because like I said, I'm not the lawyer,\nbut we've got a great one here on staff.\nChair Vitch.\nLake Lanier is owned by the Corps of Engineers, correct?\nThat's correct, yes.\nWould that apply to Lake Lanier?\nAnd so the core, once you pass state law,\nthey will adopt whatever that is, is passed.\nSo they're like, that's correct.\nYes, sir.\nThank you.\nSir, Robertson, number one.\nThank you, and Colonel, again, I have Lake Harding\nright there at Alabama, and I have West Point.\nAnd I know West Point's Corps of Engineers,\nso this would be applicable.\nAnd Lake Harding, it would also be applicable.\nAnd so we're talking about, to be clear, 66 yards\nfrom the, from the, from docs and everything.\nI have a, I have a friend that has one of these\nridiculous, expensive, very inefficient boats\nthat they surf behind.\nAnd so I know they try to stay to the middle\nbest they can.\nBut this also applies if there's a anchored boat\nanywhere near, right?\nRight.\nWell, I think within this piece here,\nWe talked about just the shoreline and docks and not things.\nOkay, so we got done.\nOh, you did that then, okay.\nYeah, so I just want to be sure.\nAnd of course, your game warnings,\nas we've changed it back to Game War right now,\nuse discretion out there in the intent of everybody.\nSo it's not some crazed group of law enforcement officers\nthat are looking just right as many tickets as possible.\nNo, sir, I will say this.\nIt's my protocol for our folks.\nI have it in policy, where anytime the new law like this\nis changed, right, for the public,\nthat may not be aware of it.\nWe take that first year.\nWe push a lot of information out.\nWe work with the water sports industry.\nThey've actually got a couple of different articles\nthat they push out to notify the public.\nWe'll post that at boat ramps and arenas and different things.\nAnd then we also use that as an educational period\nthat first year that it comes out.\nIf we see somebody that's within the 200 feet, and for us, you know, we don't draw that\nexact line with what the laser range finder, right?\nWe look at how they're causing a problem, right?\nThey're, well, I'm just less than 100 feet.\nColonel, what's the current law relative to distance from an anchor vessel when you're\nit's 100 feet?\nOkay.\nI have a little bit of anxiety, honestly, about capturing anchor vessels in this.\nI think about, I've been away surfing for over a decade, and that could make, that could\nbe problematic. I think that the difference in my mind is we're talking large\nabout property damage here. If you go and anchor yourself out in the middle of\nLake Lanier, you're well aware that you're gonna get tossed around a little bit\nif you don't find a cove. So I may and more vessels obviously have or\ntypically more to something on the shore or on a dock. So I may want to strike\nanchor vessel. Was anchor vessel in the original language? It was not in the\noriginal language. Okay. What was the intent? Well your thoughts\nthat's drawn to adding in.\nWhen we were, I was discussing this with Wensh Council,\nwe were looking at being more consistent\nwith other areas of the code,\nand there were a few things that we did not include\nthat came from other areas of the code,\nso there would be absolutely no issue with me\nand would not diminish the bill's intent to remove that, sir.\nOkay.\nChairman again, I had a question.\nI had to vote five.\nYes sir, thank you, Mr. Chairman.\nIt said that, and that was my concern was,\nyou know, you're going late morning,\nand I've never done it.\ndon't know that I ever will at this ripe old age.\nBut for me, I'm thinking, okay,\nI'm coming up on a boat on the lake.\nAnd I got a look out there and see whether this guy\nthat's out there fishing has got a rope\nand a anchor down to the ground or not.\nI'm like, okay, you know what he's going to know that.\nAnd so for me, I agree with the chairman\nthat we need to make sure that's not the case.\nYes.\nI'm in full agreement.\nThank you.\nAll right.\nAny other questions for around the wake surfing\nportion of the bill before we move on\nto the vehicle portion of the vehicle.\nI'm just glad to be in the system.\nWell, we appreciate you and you,\nhey, you're worth your weight and goal.\nI did brand and Senator Brandon Lamott Beach.\nHave you ever waked served?\nNo.\nOkay.\nThis reference is in here on line 42,\nif you'll notice, an exhibition.\nAnd I feel like we could probably have a fundraiser\nand when Lamott Beach would pay a lot of money\nfor an exhibition of you waked surfing.\nSo, I see David Muller in the room\nprobably something worth considering, y'all teeming up on something like that during the\noff season.\nAll right.\nRepresentative Rose, before you get started, I've got to ask you about the double name\nbadge look.\nThat's the first time I've seen it.\nCan you help me understand what's going on there?\nYou know, Mr. Chairman, when you come before the honorable Senate, you need as many errors\nin your Quivers, Possible and Titles, so I just made sure I've got...\nIs that actually an attempt to block the arrows that may come your way from this?\nNo, just do.\nIt's just show my love young, okay? Fantastic.\nTalk just, if I may, I'm just going to observe that the title that he has on the bottom\nname badge is Lieutenant Governor's Florida.\nOh, I did not.\nI did not.\nWell, hopefully you can, can you get one of those made for Senator Walker?\nI think that he might find great use with that as well.\nWe'll have to ask the Lieutenant Governor.\nI did find out he is a Lieutenant Governor's Florida when I tried to amend his bill the other\nday.\nI learned the hard way that he is the floor leader for the lieutenant governor.\nAll right, let's talk about side by side.\nWe got fixed.\nMr. floor leader, take it away.\nThank you, Mr. Chairman.\nSome of you may be aware and some of you may not, but the term that we use in the country\nboy world side by side has changed a lot over the last few years.\nI know Senator Moore up in his area, he probably sees him quite frequently, but they've come\na long way from your old John Deere gator that you would use to kind of put around the\nfarm and haul stuff around. Now these side by sides are or four doors with electric windows,\nwith heat in there and they go 65 miles an hour. And basically all this bill does and we want\nto make it as safe as possible. But what this bill does is allow side by sides that can go 25 to\n65 miles an hour, be legal to ride on county roads with the ability to cross\nfrom a new sport or state highway. They would have to, and I want to add if we\ncan, if you look at line 162, it would have to be equipped with headlights,\nbrakes, tail lights, a review mirror, and safety belts. I would also like to add\nin there a blinker system if possible, and I've talked to Jen on that.\nIs that a blinker system? Yes, signal lights. What would be the legal term there\nthat we were seeing in our lives.\nI'm showing my country boy right there on the spot.\nThat's right, absolutely.\nBut that is pretty, if you look at line 187 is what we're trying to do here.\nMulti-purpose all-way vehicle shall be operated only on highways that are part of a county\nroad system, and shall be authorized across highways that are part of a municipal street\nsystem or part of a state highway.\nAnd you know, just to give you an example,\nwhere I live, my farm is 20 miles away from my house.\nBut I can weave in and out of dirt roads and paved roads\nand drive all the way to my farm.\nYou know, with vehicle that goes 60 miles an hour,\nyou're not impeding or holding up traffic.\nI know Senator Morgan probably tell you\nthat in North Georgia, this is a very big thing.\nIn Tennessee, they require their side-by-sides to be tagged.\nAnd they can come right in the state of Georgia.\nBut if you live up in the mountains of North Georgia,\nyou cannot take your side by side into Tennessee\nbecause you do not have a tag on the video.\nSo one other thing, positive note is we would be raising\nour state a good bit of money by doing this.\nSo Chair Moore loves a good tax increase.\nI'm gonna go ahead and recognize Chairman Moore.\nThank you, Mr. Chairman.\nReally, I'm excited about this section of the bill\nbecause we have a lot of ungovernable people\nin Northwest Georgia and this will make them into\nto law about us.\nBut I do like the bill as it's written.\nI would oppose adding blinkers to those.\nI think it's very common to hold your hand out the window\nand do this.\nAnd if you've got your brakes, you do this.\nThis is something pretty common.\nAnd I think that suffices when you take the mud\nin Northwest Georgia, and it gets up there in those lights.\nCan you see them anyway?\nI can't see him any way in a lot of times,\nand they don't work.\nSo I like how legislation is, it's written.\nI would be at the will of the committee, Mr. Chairman.\nMr. Floorlier, I happen to own one of these vehicles.\nIt is not equipped with brake lights or tail lights\nor rear-view mirror.\nIt does have safety belts and headlights.\nI'm assuming that most of these will need to be retrofitted\nto have the brake lights and tail lights, and I'm curious.\nSo would those not be just as easily\nif they able to serve as a signal light?\nSome may.\nThe ones that have been bought in the last year,\ntwo or three probably have everything,\nbut I know you can get a fully integrated\nlighting new lighting system with signals\nand everything for $6 to $700.\nNot sure about just tail lights and brake lights.\nThis is a random story, but I was with my son\non our trails and I was winging down a tree\non my side by side and like an idiot,\nI didn't look around and I pulled a tree down\ntop of the side by side and bent the frame and it was the middle of the pandemic and\ntook a year to get it fixed because all the parts were crazy.\nSo that's the problem.\nDon't assume that all of us are responsible with these vehicles and for the moral leader\nbecause that was pretty dumb.\nAll right.\nAny questions, comments?\nSenator C.\nYou ever been on the side by side?\nNo, I haven't.\nAm I getting that invitation?\nAbsolutely.\nI think that these are huge.\nIt's done a fundraiser before at Iron Mountain.\nI think you would love to go right through the mud in Iron Mountain and get that\nfull experience, we'll keep you in mind for that.\nRepresentative, I'm sorry, Senator Robertson.\nNot a second in your motion that what you did with the\ntray and all was not the most important thing that I've\nknown you to do.\nI couldn't get the doors open, we're surrounded by leaves and\ntwigs and I look at my eight-year-old at that point and\nI realize his dad is an idiot.\nDo they make an all-terrain skinny uniform that you can wear\nwhen you're out there?\nI look really good when I'm out there, so yeah.\nAll right.\nAnd what is the will of the committee?\nThe, yeah, did you get your permit?\nMr. Chairman, if I could.\nAbsolutely.\nBut yeah, I'd like to ask Mr. Dold to come join us for just a second.\nSo he's got the amendment.\nGreat.\nWell, Senator McClaurth is here.\nSo we're going to make sure we follow proper protocol on this.\nBefore we take up any amendments, we're going to take up any action on the underlying bill.\nBefore we amend the underlying bill.\nSo at the appropriate time, we will adhere to amendments.\nWe're not quite there yet.\nWe have a motion do pass from the good Senator McClure and second from Chairman Dixon.\nAny discussion or amendments?\nYes, sir.\nMr. Chairman.\nSenator Dianne.\nIf I could ask Ms. Dole to address the amendment, so she'll get the verbiage exactly right?\nOn line 32.\nOn line 32.\nOn line 32, after wakeboarding, add uponwaters of the state, strike line 34.\nnumber three to two online 35 and strike or anchored on that line.\nRenumber four to three online 39 and online 44.\nAdd a comma, remove the and and add a second comma after rivers and say, or private lakes.\nAll right, so I believe what you've done there is you've captured the private lake versus\nstate waters portion you have removed the anchored vessels portion and I believe you\nstruck all together the body of water less than 50 acres is that correct accurate okay\nyeah and I put that in the form of a motion all right we have a motion from chairman\nagain wait a second second senator Robertson whip Robertson all those in favor of the amendment\nor any discussion all those in favor of the moment please signify by saying aye all those\nlike song. All right. Any other amendments to this?\nChairman more. I'd like to make an amendment to give the option of the license plate\nbut not mandate the license plate. I think the license plate is important if you choose to go\ninto Tennessee and Tennessee wants to recognize that but if you're just like representative\nroads and you're going down the back roads. I don't I don't know if the\ngovernment needs to tax you to get from point A to point B. Okay. We have a\nmotion for a moment. Well, let's let's be a little more specific. Turn if you\ncan on that. And while you're doing that, maybe before we have a second on\nthat, my reading of this bill says they may provide a license plate and this\nin no way regulate activity on private property. Only activity should you\nchoose to be on the roads. I do have a question. Good.\nI'm not sure if I understand, you know, today we've got a lot of people that are right\ninside by sides to the state highways out in front of my house or county roads around\nthe corner.\nThey do so without any license plate or anything on them.\nI don't know whether they're doing that legally or not, so I'm not sure and maybe our friends\nthat are in the law enforcement community could address that.\nI'm kind of curious.\nI did want to point out and something was said we have had a horrific problem in the metro\nareas with individuals out here in these untagged vehicles.\nLaw enforcement cannot catch them.\nI understand Chairman Moore's concern and I agree with him that if my vehicle is on\nmy private property then you know damn the torpedoes I can go out there and do whatever\nI want to do but once I get on a public road driving I think the vehicle doesn't need\nto be registered and have the safety equipment necessary as the gentleman are attempting\nto do not only to protect the occupants of the vehicle but also to manage the safety\nof the roads in highways.\nI'd like to clarify for Chairman Moore, is your intent here to, is your reading of this\nbill such that you believe that any purchase of a side-by-side will now require a license\nplate?\nNo, no, that is not the intention of my amendment.\nSo is the intention of your amendment to allow these to travel on the roads without the\nlicense plates?\nMr. Chairman.\nOkay.\nUnderstood.\nAll right.\nSo do you want to, what specifically would you like to put on the amendment?\nWell, had I seen the substitute last night, I would have already drawn this up, but considering\nI have not read all the way through this, I'm not exactly sure I'd have to refer to legislative\ncounsel how to make that happen, because it looks like Section 2-4 relates to license\nplace as well as 2-3.\nI agree with him on principle with what he said, but the intent was what Senator Robertson\nwas talking about, we were basically trying to make sure in our metro areas that we did\nnot have people abusing this and just, you know, going crazy on these side by side\nin downtown Atlanta and Augusta and our different metro areas. So that was the intent of that.\nMr. Chairman, maybe we include attainment zones like we did with truck weights.\nYeah, that would capture part of what he mentioned, but not all of it.\nMr. Forleiter, because it would just be the ATL areas essentially.\nWhat is your understanding right now is it relates to current law if you were to take\nyour side-by-side on a county road?\nWell, without a license plate.\nWhen you live where I live, it's kind of a, I'm speaking to the law, what's your understanding\nof the law?\nunderstanding of the law is you're not supposed to be I would ask my law\nenforcement friends here but you're not supposed to do it in the country\nrally of this kind of understood but we were just wanting to make it clear in\nthe law that it was that you could be there on the county roads they could\ntell you I think it's against the law to be on the county road it's a\ntickable fence and it's a tickable fence extremely dangerous I drive a pretty\nlarge pickup truck and most of the folks out in my neck of the woods right\naround in these things are children and juveniles and it's you know they're\nlike we all were when we were young kids they go out there and try it but also\nI was with Georgia State Patrol when night crime suppression team and we chased\na gaggle of motorcycles all over the city of Atlanta saw them could not catch\nthem but could not identify them because they were not registered vehicles and\nand I'm sure the the Colonel's team sees many more than we do because of the\nIn fact, of those who go out hunting and fishing and this kind of stuff, sometimes they'll\nattempt to take shortcut and just take one vehicle and go down a public road and those\ntypes of accidents are devastating to the individuals on the all-trained vehicles.\nMr. Chairman, I can just ask you.\nI've talked to hundreds of people about this issue and I have not had one person so everybody\nhas said, I'd be more than willing to buy a tag to be able to say that I'm legally\non the road.\nThat is not an issue, but my understanding of the current law very clearly is that unlicensed\nvehicles are not allowed on the road.\nSo while your sheriff may look the other way when you cross the road, my understanding\nof what you're intent here is to provide a mechanism such that people that want to use\ntheir side-by-side for consistent or even inconsistent travel along the road, or I should\nsay on the road, have the ability to be on the road not worried about whether a law enforcement\nofficer is going to look the other way or not.\nIt will not require me to register my side-by-side wish I never intend to drive down the road\nBut it would give a path to make that happen.\nI think Chairman Moore, what you are saying is that you want to allow them legally to be\non the road without a license, which I think would require more than just amending this bill\nbecause you have to point out to the code around that would be more in the broader section.\nAnd it doesn't appear that this is the will of the committee anyway.\nSo if it is to be addressed, we'll address it on the floor, I suppose.\nYou know, if somebody wants to get a license plate and drive across state lines and be recognized\nthere, I think that's perfectly fine.\nBut I mean, you got to think some folks have, you know, up to 10 of these sometimes.\nAnd that's like 10 tags they got to go by, they've got to keep up with every single year.\nSo, that was the intention of the amendment, but...\nUnderstood. If you want to work further...\nThat's what we'll do, Mr. Chair.\nI think that'd be wise we'll keep this moving today,\nbecause this is your last chance to get this out of committee.\nSo, we have an amended motion.\nIs there any other discussion on the amended motion?\nAll right. With that, we will take up the underlying motion,\nwhich is a motion do pass in LC 393953S as amended all those in favor please\nsignify by saying aye all those opposed like sign motion carries unanimously\nthank you gentlemen thank you Colonel hey mr. Still did you get your what\nwere you working on today leafblowers no Feliz Navidad Feliz you had a Christmas\ntree we're making today December 25th natural holiday fantastic I understand you\nhave a lot of ornaments on your tree, is that correct?\nAll right. Well, thank you all for your service on this committee this year.\nThis will be our last meeting, congrats to our newest member, Senator Robertson.\nThis meeting is a journal. See y'all next year.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T03:08:48.995362+00:00"
}