{
  "video_id": "zSrqm2AwTf4",
  "url": "https://www.youtube.com/watch?v=zSrqm2AwTf4",
  "title": "Joint Appropriations Special Session AM - January 21, 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 260,
  "summary": "Here is a summary of the Georgia Joint Appropriations Special Session AM - January 21, 2026 session:\n\n**Overview**\nThis session focused on the Department of Behavioral Health and Developmental Disabilities (DBHDD) budget and priorities. Key highlights include the state being released from the federal consent order for behavioral health services, progress on the NOW/Comp waivers for individuals with intellectual/developmental disabilities, and plans to overhaul the waiver assessment and planning process.\n\n**Key Actions**\n- **HR1**: No description provided\n\n**Bills Introduced (First Reading)**\n- None mentioned\n\n**Notable Moments**\n- DBHDD Commissioner provided updates on the state being released from the federal behavioral health consent order after 16 years\n- Discussed progress on the NOW/Comp waivers, including enrolling over 4,400 individuals, and plans to overhaul the assessment and planning process\n\n**Votes**\n- No recorded votes mentioned\n\n**Attendance**\n- Quorum was present to conduct business\n\n**Adjournment**\n- The session time is not provided, but there are no indications it was adjourned.",
  "transcript": "All right everybody we don't need to get behind to start with. Thank y'all for being here for date too of the joint meetings on the FY27 budget and FY26 amended we're going to ask our good farmer Senator Goodman if he doesn't mind starting us off with a prayer. Better put my phone on silent before we start praying. Thank you Mr. Chairman y'all you can will please pray with me. If they're heavenly Father we just thank you for the day Lord and thank you for loving us. Thank you for the gift of salvation. Lord we thank you for the opportunity to be able to come here today Lord and decide how to allocate not only the resources of the people of the state of Georgia Lord but your resources Lord and we know that we live in a in a world of limited resources and it's our job to try to allocate those resources to get the best outcome on behalf of the people of Georgia Lord and as we deliberate we just ask for your hand and your guidance as we go about making decisions Lord that affect all Georgians and Lord we thank you for the opportunity. Jesus is name we pray. Amen. First off I believe is Commissioner Tanner from the Department of Behavioral Health and Developmental Disabilities. Commissioner welcome to the joint meeting and four years. Thank you Mr. Chairman I appreciate the opportunity to be here as always. I just think Chairman Tillery Chairman Hatch it members of the committee thank you for your leadership and your continued commitment to some of our most vulnerable citizens. When I stood here last year in 2025 DBHD took meaningful steps toward a stronger more responsive system that meets people where they are and delivers results in community statewide. Today before I walk through each budget item I want to begin with three major priorities that are included in the governor's budget proposals. The numbers you'll see today are tied directly to physical responsibility performance and accountability and results. I want to begin today with a couple of important announcements. One I want to remind you that happened right after session last year and that was in May 22nd of 2025. The federal court released DBHD from consent order provisions relating to deaf services that was called the Belton agreement and that happened in May of last year. The federal judge judge story noted that DBHD has met and in some cases exceeded requirements of the October 2014 consent agreement. So that was a consent agreement that had been in place for a number of years that we were released from last year. The state entered into the original DOJ settlement agreement that we all talk about on a regular basis in 2010. For the last 16 years the state has made significant and delivered investments to dramatically increase both the quantity and the quality of services statewide. For those of you who have been here for a while, the two chairman, others in the room, I see chair lady Dempsey here, you all have been engaged in this work, chair lady, chair patric for a long, long time. I am really happy to stand here today and tell you that at 8.04 pm last night a joint motion was filed with the consent of the U.S. Department of Justice and the independent reviewer releasing us from every single provision in the behavioral health settlement agreement and its extension. The filing reflects the progress we made as a team and the confidence of all the parties that Georgia has met its obligation. If the judge grants this motion it will be the first time in 16 years that the state has been released from the provisions of this agreement and the total the state will be released from about 60 provisions will still be under the developmental disability side and will be laser focused on that. Bottom line we are being released from all the behavioral health side of the agreement free from all active monitoring. The 60 behavioral health provisions will be replaced with a single requirement that we house 537 additional individuals in supportive housing. These will need to be provided through 404 Georgia housing vouchers and 133 supportive housing vouchers. Having that 133 we will be leveraging our partnership with DCA. I want to give a shout out to Commissioner Nguyen. He has been a great partner in this work over the last three years with me. We have the Department, our department has embedded two DPHDD funded positions within DCA and they are working solely on our population and we are able to get people house through the choice voucher program which leverages federal dollars. Commissioner Kemp's budget proposal that you are going to see today includes an additional 9.3 million for the 404 new housing vouchers. This is not just about housing. This will allow us to keep these individuals stabilized with wraparound services. With those 404 new vouchers and with the work that we are doing with DCA that will fully cover the cost of the 537 additional individuals that we are going to be obligated to house within the next three years. I will tell you as I stand here today I am laser focused on getting that done before Governor Kemp leaves office at the end of this year. This progress would not be possible without the leadership of Governor Kemp and the sustained investment of the House and Senate. I am grateful today for every dollar you have committed to strengthening Georgia's behavioral health system. The IDD division is also making historic strides with individuals with intellectual and developmental disabilities that will allow them to live more independently and with dignity in the most integrated settings. On the screen there is a summary about our now Kemp waivers. So we have enrolled 4405 people that are enrolled in now Kemp services as of June of last year. We have 9,709 individuals, 89 individuals enrolled in Kemp services and we currently have 7,891 individuals on the planning list. I am also happy to announce that the request of the Senate appropriations committee there was a DOA audit done of our now Kemp waiver work. This review has been completed and most importantly there were no instances of deficiencies or noncompliance as it stated on page 4. The results confirm that the DBS administration and oversight of the now Kemp waivers operated the highest standards and expectations. I want to thank our executive director of our DD division Ron Wakefield, Ashley Kacement our director of Medicaid coordination and the region office team and Chris Hamilton our CFO for all their hard work to be able to get this clean audit. Folks who know the DOA audit process knows that is extremely unusual. One of my priorities is to work directly with policy experts advocacy leaders and families to ensure we are moving these programs in the right direction. We recently announced that we are preparing to complete an overhaul of the now Kemp waiver assessment tool and planning list which will enable the department to better respond to the urgent needs of individuals on the planning list and better forecast future needs. The problem is the termination of need is not great at identifying urgency and helping the state plan ahead instead of reacting to those in crisis. The solution is a new assessment tool that will prioritize face-to-face home interviews with hybrid options and focus on real living conditions. The urgency criteria will now be assessed using clear categories such as losing a caregiver, complex needs, unsafe or unstable housing and gaps in services. The problem right now is just a single list with very different needs are included and does not clearly show when services are needed and it's hard to use for forecasting and budgeting. The solution is a new assessment tool. It will be broken out into three different categories. The first category is immediate list. People who are in need of services this fiscal year, the planning list expected to need services in one to five years and the forecasting list likely to need services in six plus years. The next step is to start the validation process for the new tool that has been developed and then run every single person on the planning list through this new urgency tool. I also want to thank the House and Senate for passing Senate Bill 233 last session to launch the new IDD subcommittee on Behavioral Health and Reform and Innovation Commission. This subcommittee has been working diligently and has reaffirmed our work in the direction we're heading. We have this committee in place for another year and we plan to continue this work. I also want to note that DBHCD is spending now in cop waiver services that were approved by CMS last year. These services have placed people with the most challenging needs in the right setting. This will keep people with IDD out of emergency rooms, out of hospitals, out of jails. Our crisis regents and actual alternative settings are expanding. We open two new CRAs in August of 2024 in the August area, each of those have four beds. We are preparing to open a third home that's ready to go and make in that will have four beds. We have two other CRA homes under construction in the make an area that will have four beds each. We also have identified safety net providers and all six regions across the state and will be building out additional homes over the next couple of years. These are the individuals who you all get calls about from constituents who are very challenging, very difficult to place that are stuck many times in emergency rooms, oftentimes abandoned by a caregiver because of their frustration. So very difficult to find providers to take these individuals. So we're building out a new system that we're excited that we're going to see come to fruition over the next few years. I want to transition a little bit into an area that I know you get a lot of calls about from sheriffs and that's individuals who are stuck in jails who need beds. In fiscal year 2025 along, Georgia issued more than 2,500 adult pre-trial evaluation orders and 4 over 1,400 juvenile orders from different courts. Across Georgia we are seeing a steady increase in the number of defendants that are found in competent stand trial. This means individuals whose mental health conditions prevent their cases from moving forward and FY 2023, excuse me, about 38% of defendants were found in competent. In 24, that number rose to 40%. In 25, it rose to 42%. That growth has real consequences on our system. Nearly 70% of individuals waiting for pre-trial evaluations are in local jails. Those who are found in competent stand trial are waiting on a hospital bed to open up. Today we have over 800 individuals in jail waiting on forensic placement in one of our hospitals. This place is an unfair burden on local jails to hope people who need treatment before justice can proceed. I've shared what's happening in local jails now I want to look at what's happening with our bed capacity in our hospitals. In 2023 bed capacity study identified the need for 232 more hospital beds, but we recognized early that simply adding hospital beds was not the only solution. We projected to reach full capacity by physical year 2024. This is an possibility way off in the future. This is a trend and that's what's happening right now and it needs immediate focus. We admitted 395 individuals in FY 2025. 69% of all forensic legal statuses are typically discharged within one year. Current early data from FY 26 shows that 89% of all ISTs are discharged within that year. We're very proud of this because it highlights the good work that our short term restoration program is doing within the hospitals. However, the remaining percentage combined with the increasing number of long term care is what's driving our capacity challenging. Length of stay for all patients regardless of legal status is 3.8 years. Those that have been found not guilty by reason and sanity their length of stay is eight years approximately. Now this will remind you that many of these individuals have committed extremely serious crimes, but they've been determined not guilty by reason and sanity. So these individuals are not coming to the hospital for a short period of time and getting out. The courts oftentimes keep these individuals and our facilities for many, many years possibly their entire life. That's why Georgia opened its first and alone jail restoration center in Dodge County one year ago this month. And I want to just give a shout out to represent at Mathis and to Senator Walker because they brought this to us, brought this to our attention. It was a DJJ facility that was setting in their district unused. We went in, worked with DJJ, got state properties to convert that building over to us. We renovated that. You all funded the operational cost in since January. We have, last year, 73 individuals have been admitted. 45 have already been discharged. The average time to restore competency has been just 74 days. That is the fastest we're able to restore competency in any facility we have in the system. That means fewer days in jail, fewer delays for victims and less pressure on the courts. Just as important it actually works. The individuals who are restored are returned to the court system so their cases can move forward. Those who need more intensive care can be identified quickly and early and moved to one of our hospital settings. The BHDDS spent the last two years launching programs that reduce reliance on impatient hospital beds. A lot of these individuals who have been at our hospital for a long time, who the courts are very reluctant to release. That our clinical staff believe are ready to go out into the community. So we opened up and you funded what's known as Operation New Hope. That was the state's hospital system first transitional program. We opened up our first in November of 2024. That was 30 beds that are Savannah hospital campus for vocational and life skills training. We opened up 17 beds in January of 2025 at the Allen Building at Central State Hospital in Millageville. And you funded and we currently have the finishing touches being placed on 30 beds at Columbus with a ribbon cutting schedule for February of 2025 just a little over a month away. These step down facilities offer a different solution for a different population. And we have already in the short period of time success stories. One individual that graduated from Operation New Hope was at Central State for more than 27 years. The court approved moving him to a community integration home after he completed Operation New Hope program. In 2025 that program served 43 individuals and discharge five into the community. Most importantly though, that's 43 additional impatient beds that we were able to open up to be able to use to move people out of jails into the hospital. One individual discharge from Central State into a community integration home was at the hospital for nearly four years. The most important lesson here is that where community where competence restoration happens does matter. What's next, I'm thankful that the governor in the justific budget has proposed putting 20.7 million dollars to build an additional jail based restoration facility on our Augusta hospital campus. This would again be 40 beds. It would be on some property that the state already owns in Augusta. We have workforce availability in this area, which is really a big factor for us in deciding where to locate facilities. As we have to be able to have a clinical workforce, we have that in our Augusta area. It also will have a regional impact on East Georgia and surrounding counties bringing jobs to that area. This investment will allow us to expand our forensic capacity without consuming our hospital beds. It reduces weight times in jails and it strengthens our public safety across the state. And again, this is not a new idea. This is a proven model that we've been able to prove at our Dodge facility. This facility does not eliminate our need for additional impatient beds. The only long term solution is to build a new hospital on one of our existing campuses. Also, again, going back to the release of our state from the 60 provisions in the DOJ settlement agreement and the overall how we administer the now comp waiver and building on our competency restoration or all priorities that's found in the governor's budget. So with these things in mind, I want to walk you through line by line the recommendations in the governor's budget to the general assembly. First, you have statewide adjustments. You have 21,603,202 dollars to increase funds to provide one time salary supplements. Again, you'll be seeing this in every state budget. Addictive disease is a reduction of $142,919 to replace general funds with other funds for the expansion of hepatitis C screening services at core behavioral health providers. The addition of $243,750 restore some of the funds that were removed last year from the Cobb Gelbase Restoration Facility. This will want to remind the committee that Cobb services more than just Cobb inmates. We take inmates from all over the state into that facility, including rural counties such as F&HAM, Lounds and Pickens County. So in all total, we served more than 30 counties at that facility. And that facility has admitted over 82 people from these 30 counties to be restored to competency. And their restoration rates are in line with what we would expect. Again, capital funding in the just pick budget that you'll see for $20,740,730 to build a 40 bad standalone forensic facility at the Augusta campus. That design is underway now. Our hope is that we can get that open around November of next year and build a, I add those additional 40 beds to our capacity quickly. Also, you see GTA adjustment of $84,779 just to reflect an adjustment in telecommunications infrastructure rates, GTA charges. Again, things you'll see in every budget. Also, the SHBP reduction of just over $45 million. Again, because of the rate drop from $29.454 to $20.264. A big portion of these dollars are CSB dollars because their rate will also be decreased. The TRS rate change, again from $21.91% down to up to $22.32. That's an increase of $21,733. The insurance premium adjustment for DOAS just over 1.9 million. And then the adjustment for Georgia Work Billings program of just over 218,000. Again, most of these are statewide adjustments that are going to be common throughout your budget presentations. Here you'll see a replacement of $142,919, replacing general funds with other funds. And then the $50,000 there is eliminate one time funds. It was in the budget for HOPE House. Adult developmental disabilities last year, the general assembly funded 150 additional now comp waivers. Those, as you know, have to be annualized the following year. This $3.2 million would the dollar amount needed to annualize those 150 waivers? Our adult developmental disabilities, again now comp, the governor has proposed 100 additional now comp waivers. That's just a reminder we have just over 14,000 individuals who currently receive services. We have just under 7,900 individuals who are on the planning list that we talked about earlier. And just to give you some frame of reference here, we're on track to enroll more people this year, this fiscal year than we have ever enrolled. We're in on track to enroll a total of 1,000 new now comp waiver participants. Our regional office is really stepped up efficiency. We have between five and 600 or so people roll off waiver services every year because of death or moving out of state, et cetera. So with 100 new waivers, we typically can roll between five and 600 new folks on an annual basis. We also, when we have folks roll off of waiver services, they're usually rolling off at the very highest cost level. And then new people coming on are typically less expensive for the state. So sometimes we can get more than one person enrolled when someone rolls off. Then also 2.89 million reduction to reflect adjustment. The federal medical assistance percentage from 66.4 down to 66.63. The adult forensic services, this is the annualized facility I just mentioned to you that's under construction at Columbus. This is six months of funding 1.6 million dollars to annualize that. And then already mentioned the dollars to restore to the Cobb County facility. 2.3 million to increase funds for new mobile crosses RFP. As you know, when someone calls 98, they're able to, we're able to dispatch mobile crosses anywhere in the state of Georgia 24 hours a day. That includes the license clinician that had not been rebid for a number of years. That has been rebid by Doas. And this is the number that would reflect the increase in that cost. The 2.9 million increase funds to support health crisis intervention services through the 98 lifeline. This would be to maintain 97 critical positions within the 98 system that's going to be included in the governor's budget. Just as a reminder, studies show that $1 spent on crisis care can save between $2 and $3 in hospital cost. Also in 2025, crisis referrals on our platform supported over 50,000 referrals to crisis beds average in 4,200 folks going to crisis beds per month. Total volume in 2025 at our Georgia call center. We received over 350,000 interactions through call text and chat. We're currently averaging around just over 1,000 calls text and chat per day into Georgia and our 98 system. So Georgia's obviously need this service and they're utilizing this service. The developmental health here that you see the 9.3 million dollars, that's to add the additional 404 housing vouchers for the settlement agreement that we talked about. And then a reduction of $326,481 for the federal medical assistance percentage from 66.4 to 66.63. And then 1.1 million increased annualized operational cost at Gateway. Most of you are familiar that we're building a new crisis and adolescent crisis center into the Savannah area. That's currently under construction. You all funded that. This would be the annualized number needed. This anticipated open. This fall is under construction currently. So very excited about that facility opening up in the Savannah area on the coast. It also be remiss if I didn't just mention some of the great work that we're doing on the opioid crisis. As you know, I serve as a trustee of the Georgia opioid crisis abatement trust, which is a separate legal entity from DBHD. We completed another grant cycle in 2025 and committed $42.48 million in grant funds over 109 projects across the state. Almost everyone in this room has had a project completed in their community. This brings the combined total for two years to $111 million in grant funding. Also very excited about some of the work we're doing in partnership with other state agencies. We've partnered with the Department of Community Supervision and with other agencies around the state. And recently with the Department of Education, you all pass Wesley's Law with legislative intent for Narcan to be placed in every Georgia school Senate Bill 395. We launched a partnership a few months ago with the Department of Education to put Narcan in over 2300 public schools in the state. I want to give a shout out to DBHD office of addictive disease and Georgia harm reduction along with all of our races across the state that we partnered with. The first round of schools, which is about half the schools, was completed in November of 2025. And the balance of every school will receive their Narcan in the spring of this year. And that includes a nice box just like the one you have hanging here in the capital with two boxes of Narcan gloves, etc. So really excited about that and I know our schools are. Just want to remind you that we have a regional presence around the state, regional leadership and offices all across Georgia. We recognize the state's a lot bigger than just Atlanta. We have leadership across Georgia and those are our regional office locations. If we can be of service to any member of the general assembly or a constituent, I know I hear from many of you on a regular basis. Please don't hesitate to reach out to us. So thank you for allowing me, Mr. Chairman's to be here today. It's always good to appear before the Appropriations Committee and to be able to announce a release from a settlement agreement that has been going on for 16 years now. So with that, Mr. Chairman, I'll be glad to answer any questions. Thank you, Commissioner. A lot of great information. You'll do a lot of great work. We all realize it and appreciate it. You do have some questions. Chairman and Petrie. Thank you, Mr. Chairman and Commissioner. Congratulations. Unbelievable accomplishment. And thanks to you and thanks to some of the fine leaders you have here with you today and some that aren't with you today. You all are doing great work. 30 something years ago when I started serving people in the community, everybody was institutionalized. Whether they were developmentally disabled or whether they were frail seniors. They were an institutional setting. We've come a long way and we've done that by focusing Medicaid spending on improving the people Medicaid was built for and created for the most vulnerable, the most frail. Thank you for doing that. There's one big challenge when I ask you about homelessness. And I know the governor's got making a real focus on homelessness now. And a lot of our communities, I mean, my primary constituent issues these days tend to revolve around homelessness and aggressive hand handling, et cetera. One of our challenges is having a place for local government, which is primarily responsible, to move those individuals to an endorsed location where they can get, where they can have a more humane way to live. Can you tell us a little more about the governor's program as it relates to supporting local communities with homelessness? Yeah, so I know the governor's creating a significant grant program to try to help fund local governments and help support them and their efforts focused on homelessness. And I think it's going to allow for some creativity from local communities to come up with their own individual solutions. I will tell you that in working in this work and chairing the behavioral health commission now since 2019 and being involved in government service now for actually this year, 36 years, government swings a pendulum from one side to the other oftentimes on every issue. And we did that on the mental health side, which we had too many people institutionalized. We know that. But there are some people who do need care in a hospital setting. And we just do not have the capacity in the state as a growing state that we need to give people the level of care they oftentimes need. So I think in order to help some of these individuals, I go back to parity and I go back to if someone's physically ill, sometimes you need to go to the doctor, sometimes you need to go to quick care, sometimes you need to go the emergency room, sometimes you need to be in the hospital should be individualized.\n\nthe goal of serving people in community, but sometimes people need a longer stay. And I think until we have that level of capacity, we're going to continue to have jails that are overcrowded with individuals with mental illness, we're going to continue to have individuals who are homeless. So I'm excited about where we're heading. I think it has great potential, but I do think ultimately we're going to have to look at our capacity issues. Chairman Watson. Thank you, Mr. Chairman. And thank you for what you're doing, thank you for what you are doing. Sort of piggybacking on the homeless issue. I used to say in talks that the worst place to receive mental health care was the jail, the local jail. And I tell you, my share, I spoke up one time and said that's absolutely not true because I have a mental health section. And we take care of people with mental health issues in their jails. You know, homelessness, you're on our public property, they're panhandling aggressively and so forth, so they do get picked up and go to jail. Tell me about what percentage, or do you know what percentage of sheriffs in the state have mental health capacity like the one in Chatham County? I don't know offhand exactly what that looks like. I can tell you, it's definitely a mixed bag across the state. You have a jail commander, Todd Friesman there, who is just one of the best jail commanders in the state. And they've been laser focused on really taking care of their population in a way that we don't see oftentimes in other places. So they've done a tremendous job. We have other jails that do as well, but most just don't have the resources or haven't invested those resources in those communities. So it really varies around the state. And some sheriffs are just not open to that and don't feel like it's their responsibility. So it really depends on the community. Thank you. Sounds like that's something we need to explore, maybe not with you, but with others also. Just to follow up question, as the Cobb County Facility takes care of those from around the state, just a reminder, they're three. If I remember correctly, three gateway child and adolescent facilities around the state and the one in Savannah, it doesn't take, does not take care of just of Savannah folks. It is a statewide facility. That's correct. All the facilities we find, whether it's crisis centers for children or crisis centers for adults, take folks from every community in the state is based on the need. We try to locate people in the geographical area where the need exists. So when they're released, we can do good discharge planning, but you're correct. Stateway will take folks from the entire area. Thank you. Thank you. Sure lady, Dempsey. Morning, Commissioner. Good morning. First of all, thank you so much. It sounds so easy to many people here, but I know how hard and how long you and the commissioners that have become before you and the staff and governors have all worked to help with this DOJ settlement. We have reached a historic moment in time. I have no doubt. So thank you for that, particularly. When we look at several things that are going on, though, and I know like some of the messages that have already been, the questions have already been asked, reference the need for longer term congregate care. In this settlement, what is allowed there to return us to that challenge of some people who seriously do need not only long term, but sometimes lifetime care? Yeah. So there's nothing in the settlement agreement that prohibits us from providing individuals who need longer term hospital stay, the ability to have that. But the idea is, is we don't want to institutionalize anyone that doesn't need that level of care. So my focus is on individualized care. What level of care does the individual need at this particular time in their life with the goal of moving that person to community? But you're right. There are some people who need longer term stays. And specifically are forensic population. You know, folks who have this constant contact with law enforcement, the criminal justice system, regardless of whether it's related, it's caused by the mental illness or if it's caused by some, they still have the mental illness. They still need that treatment. So we're just going to have to, at some point, the state is going to have to have additional facilities. There's nothing in the settlement agreement that prohibits that. That's great news to hear. If I may, Mr. Chairman, one more question. So this interim, we did a study on children particularly that become stuck in our hospitals and our psychiatric treatment centers, which is a very sad and difficult thing to walk through. I think we'll have some things to maybe address that soon, help it along at least. But I think each of us here have had those calls from our hospital, not only as someone in the jail that needs services, but someone in the hospital that has nowhere to go. They don't always need to go to jail, but they need care that our state is not able to give right now. I'd love to know what you think we can actually do to move that ball forward to work, particularly in a way that deals with prevention. The earlier, the better, the right time delivery of service for our youngest to make sure that they don't become that lifelong, really challenged. Right. Well, I appreciate you asking that question. I try to be careful what I say and how I say it, but I will say this about the child and adolescent space. I have providers. I had one come to my office last week from out of state that wanted to come to Georgia. And I talked to him about what type of child they wanted to serve. And I said, those are the children everybody wants to serve. Right. I got to have providers that are going to serve those that no one else wants to serve. Because those are the folks stuck in emergency rooms, those are the folks that parents get so frustrated that they don't know what else to do with that child. And the state has had resources in the past and some of those have been closed over the years. I personally am a foreign believer that at some point the state needs to operate its own child and adolescent facility, PRTF, where no one's turned away. Where we have the resources in place to serve these very challenging youth and then get them to step down. And we worked closely with DJJ, with DCH, with DHS and others looking at that and looking at the SIDF, a youth innovation campus where you could have a state run PRTF, a Medicaid funded PRTF on the same campus to step these children down to, but also home housing on the campus for the families that you could work with the whole family with the idea of integrating that family back together as a unit. Because oftentimes what we see in these cases is the whole family needs services, not just the child. So there's going to have to be some investment, smart investment over time from the state in some of these areas. But there are some real solutions out there. But I will tell you, this is not easy and no other state has solved that riddle either. They're all being faced with the same challenge. But currently we just don't have providers that are willing to take the hardest challenge children in the state. And we did a study internally with all of our sister agencies looking at how many beds are we talking about? What's the capacity we're looking at? So we're happy to share that information with you or anyone else. Thank you. I look forward to working with you on that and we'll have more discussion, Friday morning with you. Looking forward to it. Thank you. Okay, members, we've got six more questions and we are ahead to try to make your questions as succinct as possible. Yes, sirs, maybe to Chairman Tarvan. Thank you, Mr. Chairman. While I'm like, yes, roll back to slides. I've got a question, but as you know, you and I have discussed the need for this mental health operation you're doing now. And we go back to decades, probably, that we were behind and we go from the largest mental hospital in the world to where we were with a very few beds. And it's very frustrating in our areas where we see, as you and I have talked, that our jails are in half people. And I think now we've got a lot of it down below a year, but we were at two and three years people that were there, we couldn't go to trial and hadn't been evaluated. So I'm pleased to see, overall picture, we see progress. And this is something that's very dear to my heart, but I've got to get this off my mind here because my brain works different. Reduced funds to reflect adjustment there on the 326,000. Explain that to me if the percentage went up now we had a reduction. That's what I, it caught my eyes at a... The percentage that the fads are covering went up, so the other portion went down. Yes. Leader Hegelie. Thank you, Mr. Chairman. Thank you, Mr. Commissioner for all your hard work. I have a couple questions. Number one, on your planning list, I guess that's what we used to call the waiting list, but on your planning list, for those who reached the immediate category, can you tell me how long they are waiting before they are integrated and have the services? Yeah, so we currently don't have the planning list broken out that way. That's what we're moving toward right now. Everyone just lumped into the planning list, so we're not able to say to you, we have 50 people that need an immediate waiver or 500 people. That's what we're moving towards. So the tool that's been created, and I will say it's been a collaborative effort with the advocacy community, with everyone involved. We're working to get one of our academic partners to validate the tool that's been created. Once that happens, we'll run everyone through that, and I'll be able to tell you specifically this is how many people on the immediate list. Our internal folks have done some, some guesstimating on that. We probably have out of the 7,800 around 1,000 people in the next physical year, maybe more that would need a waiver services if funding was available. But we're going to be able to give you a lot more concise answers over the next 12 months. And also for the people that are going to be in the new hope step down, after they complete their time there, what do you think? What supports do they have to make sure that they continue to thrive and be able to see a community? Yeah. So, typically when they leave, Operation New Hope, they'll step down in what we call a community integration home. That's a home where they live, and we have DBHCD staff that's in the home 24 hours a day with them. They go out to public jobs, et cetera. They typically have SSI disability benefits at that point. And then from there, they can either step directly into community or they can step into a forensic apartment where they live independently with a lease in their name, with still wrap around supports. And then from there, they go into the care of our community service boards in community. So we step them down slowly so that they reintegrate into the community. Thank you. Chair Loby Crapatra. Thank you, Mr. Chair. And thank you, Commissioner, for your great work. So honored to work with you on the Behavioral Health Coordinating Council. We're doing good stuff, getting agencies to talk to each other, what a concept. The question that I have is we know that a lot of our PRTFs are highly involved with out-of-state people who need services. And I don't know what the solution to that is, but we need those beds for our Georgia people. So I just wondered if you had any thoughts about that other than increasing our rates. Well, and I will tell you, looking at some of the most recent data that percentage has come down pretty significantly, and a lot of that has to do with the funding that you all provided with the new rates. So Georgia is now very competitive with other states. So we have saw that drop drastically. The challenge is if somebody needs a PRTF, I think we can typically find placement unless they're one of those hard-to-place individuals. And then sometimes we have to look out-of-state because we have locations out-of-state that's able to provide a lot higher level care that we can sometimes find in Georgia. Chairman Hawkins. Thank you, Ms. Chairman. Thank you for all you do. Thank you. And I really appreciate it. This question is related to general health. You have served so many young adults and children. What do you do for general health? I mean, I assume you access the ADD section of Medicaid, but could you talk about that a little bit, how that works? So when individuals are in one of our state hospital facilities, we have internists that work in the hospital. We have dentists that work in the hospital. So we take care of the whole health while they're there. Obviously, if they need a higher level of care, we may have to take them out to, you know, a hospital outside of our facilities. In community, part of what we're moving toward is the CCBHC model, which is a federal model that has more integrated health care. We have three of our community service boards, I believe, that just started that process in January as approved by CMS. They're going to be able to provide a more holistic, whole health approach. We also partnered with some of our FQHCs in community to provide some of that whole health services, but you're right. One of the challenges within individual health, serious persistent mental illness, is oftentimes they also don't take care of their physical health, which adds to their whole process. Representative Alwee. Thank you, Mr. Chairman. Thank you, Commissioner. Good question. Is there anything in place through your office or any place else to train? Some police and sheriffs in rural Georgia how to respond to a crisis with the person? Yeah, I didn't plant this question, but it's a great question, because at one o'clock today, we have the new reconstituted CIT board, which is the community across the crisis training that is 40 hours of post-credit. And it's not just for law enforcement, but for the whole community. And we're going to be rolling that out through our regional offices in the spring. So we're opening that up to law enforcement all across the state, and we'll be providing the instruction, training, et cetera. And we have an advisory board made up of law enforcement professionals and other people who lived, experience, et cetera, from all around the state. We're meeting at one o'clock today, so that'll be rolled out, and it is great training. Yes. Representative Bentley, a bit stint, son. No problem. Thank you, Mr. Chair. Thank you, Commissioner. Quick comment and question. Just want to thank you and your team for coming down to Taylor County, helping me with the situation and educating our community. But you referenced Operation New Hope $20 million for a new JRC in Augusta, 40-Bit project. I'm going to talk to Harbison and I have an empty facility in Taylor County, which is why I make sure that you are aware of. But you also referenced the workforce that made a big difference and going to Augusta. So can you talk a little more about the workforce exactly what you need from workforce? Because Senator Harbison and I want to make sure we let folks in Taylor County know about what's needed in case you all want to consider coming to Taylor County. Yeah, another great question. So the facility we're doing in Augusta is going to be a jail based restoration facility. It's different than Operation New Hope, but it's 40 beds. And it requires us to have nurses, psychologists, doctors. And those are very difficult to recruit to rural Georgia, as you all know, outside of some of our key cities. Workforces are number one biggest barrier to our agency in the state. The licensing process that I know many of you in the room have championed is still very challenging for clinicians, et cetera. I have a lady that works for me that's been licensed in Florida for 15 years as a licensed family marriage counselor. It still can't get a license in Georgia. So workforce is a challenge. We're creating a lot of partnerships. I was at Columbus the other day. We're getting ready to roll out a condensed three-year medical school program for psychiatrists. They're going to go match with St. Francis Hospital and then they have to come to work for us for four years after they finish as a psychiatrist. So we're trying to create programs, but it's just that we have to be realistic that when we're looking for doctors and psychiatrists and psychologists, very challenging to get those individuals for the amount of the state pays to go to places other than some of our major cities. Commissioner, you've talked about bed capacity on several of your slides and kind of even came up just then. You've had a plan out there for a large 300-bed hospital in the metro area. Can you just touch on that a little bit and tell us where that might be or what your plans are there? Yeah. So we have a state hospital on Panther's Vel Road out next to the GBI headquarters here in DeCab County. We had met with the DeCab government to make sure they had the infrastructure, water and sewer, et cetera available there and they do. We have a place there that we looked at with an architect and an engineer that we could build a new 300-bed facility on that campus. That's the most logical place to put it for a lot of reasons. Number one, that's the only hospital that serves the entire metro and north Georgia area so the population just demands that service. Second thing is we also have a better opportunity to recruit professional staff there than we do anywhere else in the state. The second location for a future hospital would be on our gust of hospital campus. We have land there and we have a land in Atlanta. So it is definitely something that the state needs to give serious consideration to because in 2034 our prediction is we will have zero hospital beds available because we're, if you look at the trend of how many people are getting ordered to us by the court to stay long term, all of our beds will be full. So there will be zero places to bring individuals in to the hospital. So and it will take three to four years to build a facility. What do you think, Commissioner? Following up a little bit on what Chairman Hatchett said, what's the cost of that? Our estimates between $480 million spread out over three to four years. The, thank you. Congratulations on that coming out from underneath the settlement. That's something you and I have personally worked on for a long time. It's a big deal. Let me ask you about another one. So it's, you said we spent $111 million on grants. How much have we collected now in those people in so many cases? I can send that to you. We ballparked it. Yeah, it's probably about 150 or so million but I'll send you a breakdown of exact, now we're over 18 years. We're going to collect $489 million will come into the trust from the manufacturers in distributors settlements. Those dollars come in over a period of 18 years. So I can send you, I have a breakdown at the office. I can email out to your office today that it gave you a breakdown of how much we received and what settlement agreement it came in from. $489 million. I thought we were, well, I thought we were almost double that for all the settlement agreements. Some of those are not going to flow through the trust. Some are going to flow through the general assembly but over talking give you a breakdown of all of that. Some are going to flow through the general assembly. Correct. I think there's something in the governor's budget looking at replacing some funding for a service. Well, that's kind of where I was going next. I remember us having quite the debate about that and I thought that Bill got vetoed of us having control of those funds. It was surprising to me that we now will, my understanding of that map program though is that it doesn't just treat opioid addictions. Are we able to use those funds for more than opioids? As the trustee do you think that we got about $25 million of state funds we don't have to use theirs? Then are we able to use that from that? The manuf, so every settlement agreement is obviously drawn a little different. The manufacturers in the Stributor settlement agreement is specific to opioid related and it has five categories that we're able to find. I can't speak to some of the other settlement agreements. I wouldn't want to try to give them an opinion on that. Just the ones that were responsible for we are real careful how we spend those dollars. You feel comfortable though with the $25 million map? I have. Yes. If you could tell me the dollars you feel comfortable on the other settlement that might be used that way, that would be helpful. Well, I can send you a detailed report this afternoon. Thank you. Yes. Thank you, Commissioner. Appreciate the job you all do. Thank you. Oh, you got a question? I'm sorry. Can you have your staff stand up back there? You got such a good looking crew that works with you that many of us recognize. We sure appreciate what they do to keep you on the rails. Thank you. Hey, y'all let Dr. Burke come in, please. Let the man in and his entourage. All right, y'all. Dr. Burke, welcome. We were ahead until everybody started asking questions. I wonder if you're going to get all the questions today or maybe Commissioner Tanner took them off for the floor's yours. Yeah. Well, thank you, Mr. Chairman. I was about to say the gavel's yours, you're in charge. If you're tired of hearing me, you just send me out the door. Good morning, ladies and gentlemen, members of the committee. Chairman Hatchett. Chairman Tillery. First off, I want to thank my fellow health agency commissioners, Commissioner Tanner, and Dr. Brooks and Dr. Toomey for the work that they do in conjunction with us and partnership to try to continue to improve the health outcomes for the state of Georgia and of course, our partnership with you guys and the governor's office is what makes that happen and just know that it's an honor and a privilege to be standing here and having the responsibility that we have as trying to manage these taxpayer dollars and the way that they'll do the most good for the most people. And again, those, that type of pressure and responsibility is something that our agency thrives on. Again, I want to thank my team for their hard work. We've got a great team of people who work very hard every day and as everyone here knows, especially the pays not so good and so they do it out of dedication and I want to thank them for their service. First thing I want to do is just make sure that you guys have an understanding of what we've been doing for the past year and then we will move into the amended and 27 budget shortly. This is just an overview slide of some of the things that we've accomplished. The Medicare Advantage procurement was released and contract signed and that's going well. One of the things that was very important to the House and Senate last year was the SHB transitioning to NADAC pricing which was the implementation of House Bill 196. There's a lot of people in this room that had a lot of interest in that and that program went live as of January 1st and to my knowledge we're not having any significant problems with the implementation or reimbursement. Obviously the independent pharmacists are in touch with us on a regular basis if they see any glitches we hear about them fairly quickly and so far so good across our fingers. As some of you know we had Dr. Ayes with us earlier or late in the fall and he visited our on-mid program which is the telehealth station that sovereigns sloppy Floyd and he was very impressed about the technology as well as the access to care and we are hoping to increase that type of service in our rural health transformation fund that we'll be talking about a little bit later. The middle part of the slide is focused mainly on behavioral health and care for the elderly. The QRTP program was approved by CMS this year. The therapeutic care model was approved in that multidisciplinary community program to help keep kids with behavioral health problems out of institutions so it's community services that are designed to make sure they can get treatment at home for various types of diagnoses. There's some cleanup we need to do without some of the things we wanted to do in that model or going to require a waiver and we have legislation coming up this session to send to CMS so that we can finish up that piece. The main thing that waiver will do will allow us to provide respite care again for those that are taken care of those children that 24-7 are under stress and having some respite services available for them makes a big difference in the outcomes of those family units.\n\nWe also received approval for the certified behavioral health centers and those three of those have gone live as of January 1st and we have a waiting on in lieu of services from CMS. That's a big word that basically allows the CMOs, the care management organization to spend money on things that normally Medicaid won't allow. So, in lieu of services is what we're doing to help with the transition when a patient and usually these young people that are in an emergency room and are staying there for way too long because there's no bed placement. And then those that are trying to leave a setting of institutionalized admission, sometimes there's not a good place for them to go after they leave and so these in lieu of services again are designed to help support those kids. Another thing that's we're real excited about is the PACE program which is a program for the elderly that it basically allows somebody who is eligible to be in a nursing home because of the severity of their condition. It allows them to stay at home with a lot of wraparound services and that program we had our first procurement that was announced in Savannah and Savannah Hospice 1, 1 that be it and we're doing a rolling of procurement one after the other to cover all the regions that are eligible based on their populations. So we're hopeful within a couple of years we'll have those programs rolled out throughout the state and that's one of the things that on an internal basis our folks have been really excited about that because they see the need and the benefits of keeping folks out of the nursing home. Next thing I want to talk about is the Directed Payment Programs which are very important for health care finance in Georgia. We're talking about about to be in dollars a year. We submitted all of those this summer. We've had one of those approved. We got around to questions from CMS on those a couple of weeks ago and those have all been answered. So we're crossing our fingers that will get feedback and approval on those very shortly. Then a lot of discussions, especially in the media on the one big beautiful bill and what implications that has for Georgia. We've spent a lot of time since that bill passed evaluating what changes we're going to have to do because of some eligibility changes and technology changes and also some changes that will be coming in the provider taxes that fund those DPPs I was talking about earlier. The final rule on that bill is expected to be released sometime between now and May and we hope to get further guidance on the changes but we're already kind of pre-planning for what we understand this coming so that we won't be caught short when we get those final rules. Another thing that's been on a lot of people's mind because it's been in the media's rural health transformation grant that was also part of HR1. We did get our reward for that application again. I want to thank our staff, that grant for a $50 billion grant, the timing of it was unprecedented about how quickly the application had to be submitted. In our folks' work weekends and evenings trying to get that accomplished before the deadline and we're successful. We did get our notice of a war a couple of weeks ago for $218 million. We've been a little more aggressive in our ass because we want more of those federal dollars if we can get them. We had to go back and get our budget right size for the actual award and we've resubmitted that to CMS this week a couple of days ago and we're expecting that approval very shortly on those dollars should be flowing probably after the first February. As most of you know that was a national grant. Every state had the opportunity to apply and all 50 states did get an award. I think the last time I looked we were 8th or 9th and the size of our award so we're excited about that. Our initiatives are very expansive. We've got 29 I think projects that will be working on across the state and they cover areas such as sustaining health system, continuum of care improvement, access to care improvement, workforce improvement and of course technology improvements and all of those things are going to be necessary to try to stabilize rural health care delivery system in Georgia. As most of you know practice medicine in a small town for almost 30 years and have a great passion and love for that part of our state and it's exciting to be a part of this initiative to actually make a transformative kind of generational difference. One of the biggest pieces of these dollars are going towards trying to change the reimbursement model in rural Georgia to be more sustainable to make the funds flow in a way that will keep the rural hospitals financially stable while also improving their outcomes and we'll be using these dollars to kind of target on a very, very narrow basis to try to direct the funds where they will do the most good for the most people. So again we're excited about that. The other things been in the news of course has been concerns about fraud, waste and abuse in our state and federal funds and it has been very satisfying to me to learn about what we already do and so we're not way behind on this issue. As you see on this slide there were a few cases publicized in the past year of fraud that we've had with our partnership with Attorney General's Office. We were making cases as they come and have been. That being said as the saying goes, why do you rob mics and it's because that's where the money is. Medicaid in Georgia is kind of where the money is. There's a lot of funds that flood through our agency and so we're always going to be a target. It's just like all of us for targets of cybercriminals every day. There are folks that want to take taxpayer money illicitly and you do have to stay on top of that. It's not you're never going to catch them all and you're never going to be able to keep up with the transition and what they're trying to do without a lot of dedicated people and resources to stay on top of that. This slide just tells you the broad pillars that we use. Obviously the biggest thing we want to do is prevent it from happening in the first place. We use advanced data and analytics so that we get early warnings when a provider may be billing in such a way that's just outside the norm. We have investigators that go out and help with that even on the ground and also have enforcement and accountability programs that we partner with Attorney General's Office. We do waste reduction which is, you know, fraud waste interviews. Everybody focuses on the fraud part but there's a lot of waste in healthcare and duplication of services and unnecessary lab work and so forth and so on. So we always try to balance the oversight of those programs and making sure they're doing what they're supposed to do but you have to balance that with getting in the way of needed healthcare services and there's always this tension about prior approvals and some of the oversight that has to be done but I can promise you if you don't do some of that you're going to have a lot of money walking out of the door. So we, we're as a clinician myself who's had to be on the phone dealing with those issues. We take it seriously as far as not overdoing it but it's not going to go away. It is impossible. And of course I mentioned the Interagency Collaboration. We can't do this without our partners and Attorney General's Office as well as the GBI and the other folks that help us local law enforcement. We want to have an open door policy but we do have some, you know, advanced technology I mentioned the Fraud Detection. We have a vendor called Fraud Scote that uses assisted artificial intelligence to early evaluate claims that are kind of out of the norm and we use that tool and it's been very very successful in saving us money in detecting these things earlier than normal. And of course we have the third party liability which is just using the fact that on the federal government side Medicaid is a funder of last resort. So if somebody has more than one fund source sometimes Medicaid gets billed first and we have to go back and say no you didn't bill the commercial first and so that's results in a lot of money that comes back to the state because of those billing errors and that's a big piece of what we're trying to do. As you can see on that slide those are millions so it ends up over a billion dollars we're getting back from those types of services. This is my favorite slide because I know y'all can't read it. You know that usually increases the number of questions you get so you know I was just kidding policy. I did have to get them to move some stuff off of this. I did try to make it make it better but I do think it's representative of the fact that our agency is big it's very very complex. We have 50 active procurements that we're managing right now. 200 contract renewals that we deal with every year and our folks are just busy and they do a great job. We're not perfect. We're always wanting to do better and the great thing for me is I'm usually being schooled on what we need to do to do better. It's not me telling them what to do. They're bringing it to us. We could do X better if we had this that or the other and that's very rewarding and makes it fun to come to work every day. We know our technology is old. The public facing interface provides a lot of challenges when people are trying to interact with state government but we can't improve those without those procurements and unfortunately procurements and when there is large hours are frequently protested and very very frequently the go to superior court for litigation when the loser loses and it really slows down our ability to get our technology up to speed where we want it to be. Y'all have put the money in the budget and it's just unfortunate that we can't spend it timely because we're having the weight on these issues to be dealt with. So again that's just a problem we face and just want to make sure you all understand that. Now I think I'm going to let this guy with the brain speak. I'm going to turn it over to Cody, our wetlock, our CFO and he's going to go into the needy greedy on the budget itself. Thank you Dr. Bert. Good afternoon chairman members of the committee. My name is Cody wetlock I'm the chief financial officer of the department. Before we get into the governor's AFY26 FY27 recommendations I do want to go ahead in the level set with our base budget. Our current base budget is about 5.6 billion in state funds, 24.7 billion in total funds. As you can see on the slide the majority of those are the benefits program approximately 97% of our total fund relate to Medicaid benefits. The remaining 3% operate our administrative functions, departmental admin, the state office of rule health, boards of pharmacy and dentistry and our HFRD division. Because a lot of our dollars are spent on Medicaid benefits we did want to highlight our beneficiaries of the state. Our ABD population is our fee for service population, limb being our capitation within our managed care program paid on a per member per month. Obviously that breakout children and women and we also have SHBP as members of our beneficiaries as well. Looking at the budget itself with 97% of the budget being driven by benefits the largest driver of those benefits is our enrollment trends. This slide provides historic and projected base trend moving forward. It historically seen year over year growth within Medicaid prior to the public health emergency. With the end of the PHE there was a decrease in enrollment due to redeterminations. After D-Snap or disaster snap efforts in a return to regular enrollment trends we project our initial base trend forward. This trend aligns with CMS projections on a national basis as well. Moving into AFY. The first item is across various programs that the governor mentioned alluded to in his state of the state which we are very thankful for the $2000 one-time payment to state employees. From a programmatic standpoint the first item is related to our Katie Beckett case workers. Those are our only case workers within DCH. This is a $3000 salary enhancement for them. In SFY26, D-Fx case workers received a $3000 increase in order to maintain parity with eligibility workers across the state. The department decided to increase the staff raise by $3000 as well. So this $3000 is simply a backfill to maintain parity with in DHS and DCH. The next couple of items are some reductions just within departmental administration and pharmacy. What those were is just a delay in start dates for some positions. So they may have started in September, October. So they went in and took a little bit of the funds since they started funding in July one. So it's a sweeping of the funds there. Starting back up, Dr. Burke alluded to earlier, a 1915 I waiver, this is a yes item to allow additional services within the therapeutic care model. As Dr. Burke mentioned, really this is for family preservation. So maybe family caregiver, respite, things that would traditionally not be covered by Medicaid since the caregiver is not a member of Medicaid. This will have a company and agency legislation as well. What does yes item just for us to submit that waiver to CMS? The final item in AFY is some protective equipment and an additional vehicle for a criminal investigator which will be appropriated in the base budget in the Georgia Board of Dineshry. We'll put it into benefits. As I mentioned, ABD probably primarily falls under the fee for service model. So growth in ABD is really determined by utilization and cost of care. In AFY 2026, the growth recommendation at the very bottom of that ABD column is about $244 million driven by an increase in enrollment and increase in utilization within that population. The low income Medicaid population is managed in managed care which is funded on a PMPM. Because redeterminations ultimately resulted in fewer active members, people who moved out pregnant women who were no longer pregnant, kids who have aged out, etc. The decrease is about $141 million there. Our enrollment is projected to increase again but our enrollment starting point was lower than our base projection. So that's why you see that reduction. In peach care, there's about a $7 million decrease due to the lower starting enrollment as well. There's also some lines here related to high cost drugs. That's an $11 million reduction in amended. This is driven based on lower utilization than we had initially projected in base 26. There's also some items within our dual eligible populations. Medicare Part B, Medicare Part D. Those are just annual adjustments. Part D is prescription drugs within Medicare and Part B is medical services that help cover medical costs such as outpatient that Part A does not cover within Medicare. The remaining items, the reduced funds for FMAP is just a slight adjustment on two line items in FY26 related to a different FMAP used in the base budget versus what the actual FMAP is. So that's just a slight adjustment from OPB there. In the remaining three items on the provider fees are annual true ups based on revenue collections from the agency on your hospital provider fees, nursing home provider fees, and ambulance provider fees. Moving into FY27, the first table is just our statewide changes. I do want to highlight one real quick that you'll see across the entire state enterprise, which is the adjustment to SHBP. I will talk about SHBP after the Medicaid benefits portion on why that adjustment is occurring, but I did want to just kind of highlight that that is going from 29.454% to 20.264%. On the statewide adjustments, you'll see really similar things that are carrying through in the programmatic side, the annualization of that Katie Beckett $3,000 for the employees. We also have an increase of eight case workers within the Katie Beckett program. This is to continue to support the work that's being done and the increase caseload with those eligibility workers. We also received an additional position in our map division, which is the administrative function of Medicaid for long-term care. Within the final item within departmental administration is a one-time reduction. In FY26, we were provided $300,000 to assist in a submission to CMS for graduate medical education, GME slots. We have submitted that to CMS and are pending approval on that decision. In board of dentistry, the equipment and the vehicle were funded in the one-time AFY. This is the funds for the one-time criminal investigator. There's also some funds in base 26 for some protective equipment, which are just eliminating for one-time funds. Then in healthcare access and improvement, which is soared down in cordial, there were some funds in FY26 for one-time funding for certain items. Those are just being swept since they were one-time items. In Medicaid for FY27, we see increase in ABD, a decrease in limb, a decrease in peach care. This is going to follow the same trend that I was mentioning in AFY26, increase utilization, increase enrollment within the ABD population. Lower enrollment starting point than we had initially projected within limb, right-sizing that. So a slightly lower PMPM cost associated with limb and peach care, so there's slight reductions there. We do have our annual FMAP adjustment from 66.4 to 66.63. This is just a fund source swap with state and federal funds because we deal with in the billions, those small percentage points end up being a large increase in adjustment on state and federal funds. We have our annual update, our to update the skilled nursing facility cost reports, which we have here for $5 million are dual eligible population for Medicare Part B and Part D again, utilization for drugs again. These are, I didn't mention it earlier, these are very one-time, very high cost drugs associated with gene therapy is what these are, but based on projected utilization from base, we're reducing that by $11.8 million again, the right sizing of the FMAP adjustment from SFY26 for 26,029 and 5,000 respectively. And then the final three items, your hospital provider fees, your ambulance provider fees and your nursing home provider fee true up. Moving into SHBP, as I mentioned, there is a reduction across the state enterprise on the employer contribution for state payroll. The purpose behind that, and I'll have a slide in a future item, is we have fully funded our OPEV liability for the state. We're approximately at 130% funded. In order to, since we have recognized, we have fully funded that liability, the governor's office has decreased that because we don't need to continue to charge state agencies for a liability that we have fully funded. Outside of that, in the bottom kind of box, there is an increase on the school side for the per member per month. We still have an outstanding liability for the school portion of OPEV. It's funded at about 9% right now, or 11% $9 billion, so an increase there to try to cover that future liability. Moving up, there is a slide adjustment in some state funds within SHBP, Dr. Berk-Luted to earlier. We have implemented NADAC pricing, which is House Bill 196. There was a fiscal note associated with that, so that 1.2 tracks exactly what the associated cost to implement and operationalize NADAC, what that is. Then there was some one-time funds for a $3 dispensing fee prior to NADAC implementation, so we're just eliminating those dollars because NADAC is now in full effect. The next slide just shows projected expense versus revenue. The light covers the dark, your revenues are going to cover expense within each fiscal year on your state, your certified, and your non-certified with this adjustment. With that being said, we think we can start making some dents in our liability, which I have highlighted on the screen, mentioning state OPEV at 131% funded, and then that $9 billion reliability, and 11.63% funded on the school side. Dr. Berk, that's everything. There is one other item that I did want to highlight that's not in our budget. It's in the Technology Empowerment Fund within GTA. It's $35 million for IES Gateway. This is a continuation of the $35 million that was put in in the previous year to modernize IES. IES, and so I just, it's not strictly in DCH's budget, but I did want you all to have awareness that that does exist as well for the department. All right, Dr. Berk, I guess you thought you were out of the hot seat, but we do have some questions out here. I failed to recognize that this may be your first time here as serving as the commissioner, but you've been here many times. Yes, it's a little different being on the other side. I don't get a bad. I was very happy. Representative Al Williams start with you. Thank you, Mr. Chairman. You wait so patiently. You're my friend indeed. Thank you, Dr. Quick question. For years, the Attorney General has stated on the waste abuse fraud, the vast majority is found not among recipients, but providers. Is that still true? I'll tough my head, I would say it's true, and I'm not seeing it exact statistic, but I would say that's probably true. Well, according to the Attorney General, it's overwhelmingly true that that's where the fraud is. It's hard to get $3 million out of a check if you can. Leader Heagley. Thank you, Mr. Chairman. Dr. Burke, thank you for your presentation. A couple things. To take care of my hometown, people, the 105 new residency slots that you all have in this budget, I need to make sure that we have the seven psychology slots for St. France. Can you all verify that for me? It's included in that. We'll get back with you and verify that. I don't want to misspeak about that. And then the school district always complains about the non-certificated persons and how much they have to pay on the state health benefit program. And so did I understand you correctly on the state side, we fully funded the liability but on the school side we have it. And so that's why theirs is increasing. Is that correct? That's correct. That's correct. And then lastly, the redeterminations had an impact on the reductions. We all look and tell us how much was it redetermination people failing to do what they...\n\nHe did to do to re-determine as opposed to people actually falling off the system. Well, yeah, that was a guess that's been two years ago now when that process unfolded. And just to remind folks, and there's plenty of folks in the realm that may not have been here then, during the public health emergency, I think it was over three years. We did no re-determinations. In other words, normally eligibility for Medicaid is determined every year. You're either renewed or something has changed. You may be making too much money. You may have moved out of state. There's a lot of reasons why people get off of Medicaid. So that process was suspended for three years. So our enrollment increased to, I think, over three million people at its peak. And traditionally, Georgia has had around two million people in Medicaid. So that re-determination process took us 13 months. It was an extreme heavy lift just from the process standpoint, evaluating every one of those millions of people's situation and making that determination, are they still eligible or they're not. So that was accomplished like I said a couple of years ago. And that's why you saw that drop in our enrollment numbers. That slide now basically shows we're having a slight gradual increase since that time that really represent the fact that Georgia's growing. So the more people that come to Georgia, you're going to have a percentage of those people that are going to be eligible for Medicaid so our enrollment should grow. Now, there are always times that that changes with the de-snap. When we have disasters and all of a sudden there are people that are not working that used to work. So enrollment flips. We have a recession, which sounds like I didn't hear a speech, but there's some discussion from our advisors on the financial side that may be coming. I mean, we hadn't had one in Ohio and so I don't think that's a shock. But we always grow our roles in Medicaid when we have those financial disturbances like recessions and unimpy unemployment. But right now we're following the normal annual evaluation or re-evaluation on a monthly basis. If you're supposed to be re-evaluated in December, then we do that and some people come off the roles at that time. Chairman Watson. Thank you, Mr. Chairman. Thank you, Dr. Burke. We appreciate that. I'm over here. Where are you? There you are. Thank you. Sorry. In the rural health transformation, would we have gotten more money if we did not have any CON laws in Georgia? That was one of the grading criteria. We don't know the rubric of exactly what they were grading on, but that was one of the criteria. I'm assuming because of the administration in their minds, the less CON, the higher the score. So to answer your question, again, I don't know the details. We got more than our share, so it's not like it hurt us, but I don't know whether it would have been $15 million more, or $5 million more. There's no way to determine. It was a great plan that DCA submitted. It was fabulous. I just noted in the footnotes there in the comparing to other states. It seemed anywhere from $15 to $30 million more that they got when they didn't have CON in their state laws. Chairman Newton. Thank you, Mr. Chairman. Commissioner, you and your team are doing a great job. I appreciate that slide that was fairly detailed to share it with us to recognize just in one point how much you all do. A couple of things that were just unknown, are just the SHBP employer contribution dropping from 29 to 20. That was pretty impressive, and I believe that agencies across the state, correct? Yeah, the agencies themselves will have to pay less for employee. One other thing I had noticed, I appreciate that. I'm not sure that's going to ripple through and it did way through our budget hearings. The GME number of going down 300,000, I know it was a reduction because it was put in the base budget and it's zero in it back out, but my impression is that we're going to still keep our foot on the accelerator with expanding GME. Are you sure this is the time to reduce your funding or do you have enough bandwidth in the rest of the department to carry it without special one-time funding? Well, you know, as a position and note our deficiencies in the number of docs, especially in rural Georgia, I want us to keep the gas pedal down. We are benefiting from DPP dollars. We're benefiting from the rural health transformation fund. The legislature has been very generous about those one-time funds for startup money, for residential and rural Georgia. That's the money that the state of rural health has been using. Of course, the spa that we just submitted to try to increase our Medicaid funding for the slot. I feel like from a comprehensive GME standpoint, we're making a big difference and a huge difference in rural Georgia. I mean, I think in the next few years we will hit capacity of what we can train in rural Georgia because you have to have enough volume of patients and the people that oversee the residents and when those opportunities are used up in rural Georgia, when all the hospitals that could service a resident's program have one, then that'll be a great day. I don't think it's that far away, to be honest. We have more opportunity in the urban area just because of the workforce that's available to do the preceptoring and teaching and those types of things, plus obviously the population volume is higher. But GME is extremely complex. The funding sources are vast. There's little dollars that come through on different pieces of, in other words, every time you have a Medicare or patient in a hospital has a GME program. They get a little bump to their rates for that and they get a little bump in their Medicaid rates besides the slot fees that they get. So there is a huge complexity to make sure that we've got all of those boxes maximized to the degree we can again. And if you show us some love, we'll make sure they're spent wisely. Thank you for that. I know there's been some transformative agreements with health systems that have stepped into this alongside it. I just wanted to make sure if there was a team that was funded by this that we weren't telling them they weren't needing anymore. But we're going to just transfer and keep that going. Thank you, sir. And again, there's a difference between the startup funds and then the ongoing funds that go towards. So the startup is just some of these rural programs that just don't have the cash to, because with the residency program, the hospital has just to hire staff and do applications and have everything in place, usually a couple of years before they actually get the first resident there. So this was a way to, for people that just didn't have the cash in the bank, but they wanted to start a program. It's a way to jumpstart them. And we'll continue that, but they're just less of those out there than they're used to be. Okay, this is a reminder of the longer the question and the response to the last questions we get. Chairman Arbyson. Thank you, Mr. Chairman. Commissioner, thank you very much for your support. You mentioned something about wraparound service for the elderly, with a feature, a stay-at-home feature. Can you expand on that briefly? I don't quite get that about it, do you? Well, one of the things is the PACE program, which is a program for the elderly that are eligible to be admitted to a nursing home on Medicaid. And that criteria has to do with their ability to feed themselves, give themselves medications, all these things add up together to say, yes, you're eligible for Medicaid, be it in a nursing home or you're not. So this PACE program says, okay, this person is eligible for a nursing home because of their needs, but they're going to voluntarily, this is voluntary program, that individual says, okay, I'm going to go into this PACE program, and they're going to handle all those medical needs with home services. They have rehab, physical therapy, different programs like that that allow us those patients to be served in the community outside their nursing home. So the Commissioner, finally, this rural health transportation grant, just very briefly, is that widely used, points that Simon mentioned because of my early, able-bodied rural count? Yeah, yeah, it's a new program, so just getting started, and all of the hospitals and communities under 50,000 in the county will receive these funds in different buckets because there's a lot of different initiatives, but it's directed towards rural. There will be some rural, referral hospitals that also are part of the program because on a continuum of care basis, when you have a patient that's in a rural facility, but their condition worsens to the point where they need to go to a higher level of care, we want to make sure that that process is seamless and doing so, there are rural referral hospitals that are in urban areas that are also eligible for some of the pieces of this grant. Again, the total cost of care has to include that tertiary level of higher services. Okay, there's a lot of questions on the board. I'm going to take one more question so if you don't get caught on, I'm sure the Commissioner and the staff will be glad to take questions in the hall. Chair Taylor. Thank you, Mr. Chairman. Thank you, Commissioner, for being here. Appreciate all this effort and time that's gone into it. Have you got plans laid out for the rural dollars and how they're going to be spent? I know the GMA is very important to all of us and it is speaking it up. I am seeing new rural hospitals wanting to be involved in residency. Can we look forward to quite a few dollars from that bucket of money? Yeah, I mean, we're partnering with the Georgia Healthcare Workforce Board on that piece of it. And so that's Chets Bucket, so to speak. But there are funds and remember this is a five-year program, so it's not just this year. So the numbers will go up and down every year based on what we feel like is the right transition. In other words, once you've done what I would call the easy things, the first year, then you start ratcheting it up and so you might move dollars more in the technology and less into assessment. And some of the hospitals have indicated they might move on to doing some fellowships again, especially so how to get in there. Just making sure to appreciate how you're outlining how to use these dollars. Thank you. Mr. Lens, can you go back to your slide that showed the layout, the confusing one, the one that you said was two small diaries. You want to do that? How did it not go in the wrong direction? And leading up to it, the one that you just passed after was started to limb, the low income Medicaid, obviously that's our largest start population, 52% of your budget. When you get into this and the complications you're I agree with you, it's incredibly complicated. And you've got a lot that you're covering. It seems though that one of the things that the eligibility portion being separate from the contracting portion seems to cause incredible confusion. You've got the eligibility folks handling the people who have services and are getting them denied or not. And then the contracting on the other side with you guys, can we move eligibility to you or move contracting over to where eligibility is? And do you have a preference? You and the governor together, you and the general, you not just you, chairment, tillery, you know, those are agency level decisions that are above my pay grey. But I can promise you our folks, provided they get the resources can deal with whatever we're y'all think is best. You have a preference? I'm not going to state that at this time. If you don't tell us sometimes we just do it. All right. I'll be seeing you next week, I think. We have an appointment. Thank you, Commissioner. Thank you. Thank you. Thank you. Next up is Commissioner Candace Brose with the Department of Human Services. I'm not going to see you here. You can just move this here. All right. Now, I'll be right here. There, sit down before. Are you okay? I'm fine. You can do that in some way every year. All right. Let's bring the roar down, please. All right. Commissioner Brose, welcome. Thank you. And the floor is yours. All right. Good morning, everyone. My name is Candace Brose. I currently serve as the Georgia DHS Commissioner and the State DeFacts Director. Our agency has three main divisions, the Division of Aging Services, Child Support Services, and DeFacts, and we currently employ just shy of 9,700 workers statewide. So here you can see a summary of the governor's recommendations for amended fiscal year 26 and for fiscal year 27. I'll quickly cover the statewide adjustments for both of those budgets. Essentially, what you're seeing is, you know, adjustments in agency premiums, technology-related infrastructure through GTA, reduction in the employer contribution rate, and adjustments in the federal medical assistance percentage, the enhanced FMAP. I'd be happy to go through those in more detail, but for the sake of time, I'll just sort of breeze through them. Those are the statewide adjustments. Workload adjustments. I'll go through by program. And that would be for you, I believe, page 214. The governor's budget report. So under Child Support Services, the governor has recommended an increase of 2,633,924 dollars. That is for maintaining software applications through GTA's mainframe. In particular, that will ensure that critical applications like our Child Support Enforcement Platform continue to get timely updates as we move to modernize those systems. On the same page, but under Child Welfare Services, there's a transfer of $371,500 from out of home care to the Child Welfare Services Program budget. This move better aligns those activities with the budgetary program purpose. So it specifically puts all of our federal family first prevention services funds in the Child Welfare Services Program budget. And then you can see the associated transfer under the out of home care program budget on over in page 215. So still on page 214 in Child Welfare Services, there's a $50,000 reduction related to a community service referral pilot. And this adjustment just aligns budgeted funds with the contract's actual cost. Going to page 215 under federal eligibility benefit services, the governor has recommended an increase of 6,207,774 dollars for system changes so that we can become federally compliant with passage of HR1, the one big beautiful bill. We will use these funds to reduce the state's error rate in our SNAP program, also called the Food Stamps Program. And with some additional context, the state's integrated eligibility system, it's called Georgia Gateway. It's an application where people can apply for SNAP, Medicaid, TANF-funded cash assistance, and now I'm throwing out a lot of acronyms. But I can talk to you, however, afterward if you want to see our glossary, WIC, Refugee Assistance, and Child Care Assistance. The Department of Community Health controls the contract for the vendor, Deloitte, that maintains and operates Gateway. They also built Gateway. D-Facts serves as their contractor, DCHs. So we manage the day-to-day technical work, the eligibility staff, and system maintenance in terms of scheduling and testing. But DCH sets Medicaid policy as the state's Medicaid agency, and then we effectuate those terms. We are the lead agency for the Supplemental Nutrition Assistance Program SNAP, Food Stamps, and TANF cash assistance. So we set the policy for those programs. And DCH and DPH handle the policy and some of their own staffing for CAPS and WIC, the other programs in the Gateway system. SNAP supports over 1.4 million people in our state with more than 275 million issued and monthly benefits. That is more than 3.2 billion per year, and the average benefit per month is about $390. Right now, all of those benefits are federally funded. Those benefits are issued to EBT cards for eligible food and beverage purchases. I mentioned 1.4 million people on SNAP. That is actually a little over 700,000 active SNAP cases, and DPHACS processes somewhere between 30,000 to 50,000 new applications for SNAP every month. HR1, the one big, beautiful bill, increases Georgia's administrative cost share, so how we pay for technology, partially how we pay for salaries. It increases our administrative cost share for the SNAP program from 50% to 75% in federal fiscal year 2027, and it imposes cost sharing of the total amount of benefits issued. If our payment error rate is above 6%, it's a complicated formula that I can get into more detail as needed. That increase in the cost sharing of benefits will start federal fiscal year 2028 unless we meet an applicable exception. To reduce the state SNAP payment error rate, which most recent calculation has a somewhere in the 13% range, the most recent publicly reported payment error rate is little over 15%, which puts us at the top in terms of states with payment error rates. To reduce that rate, we have submitted several waivers to the USDA Food and Nutrition Service. That's the entity that oversees the SNAP program and regulates us. Those waivers would require system changes worth roughly 1.8 million in state funds. Pending federal approval, there's over 1.9 million included in the governor's recommendations for system enhancements. That will include some automatic quality checks in our processing of cases, more optical character recognition, so we're not doing as much manual work. We're doing better technology for when we have to do client interviews, we have to interview SNAP clients, it's a federal mandate, and other improvements specifically in income verification for self-employment. That's a big one where we need some enhancements. There will also be some residency checks built in the system with this funding. Finally, nearly 2.5 million is recommended for system compliance certification, and so that supports securing our federal matching funds. Alongside our tech enhancements, defects, as part of the reduction payment error rate initiatives, we're investing in our staff, so we've rolled out nesting teams, which is a model for staff to get better mentorship from more seasoned eligibility workers and supervisors. We are rolling out training hubs to improve their processing accuracy where we've reinstituted monthly case reviews by supervisors and case workers, for example. Some other quality targeted efforts include what we're calling the driver five that's designed to identify the top five error prone elements for case workers and the SNAP cases, and then we'll offer targeted micro trainings. We've also submitted a revision to our quality control sampling plan, which is how we look at our cases overall, identify errors, and work with our federal regulators to determine our payment error rate. This recommendation encompasses current deficit reduction methods, including, sorry, let me just a second. So same page for out of home care, sorry, you can see that we've got 4.4 1.5 a little over million put in the budget. Out of home care is the program budget where we fund foster care, so we're going to fund services, we're going to fund placements. There are no staff funded in that program budget. The recommendation covers our current deficit reduction methods. There's been reports where we have had in order to maintain operations within our existing budget. We've had to terminate some contracts. We've had to change the process for how we authorize services. I'll get in more detail soon. This particular recommendation reflects maintenance of those current methods, and it assumes a 25% reduction for the fiscal year second half. We will then use, in addition to, based on where we land, we will then use an obligated tan of funds for allowable expenses to cover the difference. The projected state funds deficit and out of home care for state fiscal year 2026 is 85.7 million dollars in state funds. That is a projection. There's been some confusion that's not currently dead that we have, but that is what we're looking at getting to the end of the state fiscal year. We're assuming a 25% reduction in costs. We expect that we will reduce the projected deficit overall to 48.9 million. In November, with at least 30 days written notice for the terms of our contract, we did terminate several state funded contracts with our providers for care coordination related functions and placements. It's somewhat oversimplifying, but essentially these providers we determined were not meeting the standards that we have outlined in our contracts with them or serving the populations that we sought for them to cover. Or there were duplicated existing capacity either our agency or another agency. So that is how we identified those particular contracts. We also changed how we authorized payment of services for children and parents and that process, although there's been a lot of concern for how that change occurred. It's also been very illuminating for our agency and I'll get into why. For example, despite our agency paying enhanced daily rates to providers for specialized care for children in our custody. We weren't we aren't in some cases seeing the desired outcomes. So we would pay we still pay increased rates for them to serve high needs youth in very specialized settings and we we are seeing in real time when that does not occur. Children up to age 10 for example shouldn't demand $200 plus per day in daily rates. That just there there's rarely rarely a scenario where that is necessary, but that is what we were seeing. Additionally, we don't want children in settings designed for complex teenage youth. That's just not right for a child at that age. It's not what we contracted for and clinical care coordination, which was the subject of one of those particular terminated contracts. That is already covered by DCH through a capitated rate to a mere group for managed care Medicaid. So that is a duplicated payment. And the scope of services for all these contracts that were affected it was clearly articulated in the contract. So again, that's how we arrived at those particular contracts. The governor's amended fiscal year 2026 recommendations total 50,335,000 and $34 moving into fiscal year 2027. That's your page 218. There's roughly 35,000 in our program budget child abuse and neglect prevention. That's based on a decrease in collections of marriage and divorce filing fees and that's based on the dedicated funds bill from a few years ago. Same page under child support services, you'll again see an increase of just over 3.6 million related to the mainframe technology I mentioned. Under child support services to the governor has recommended 456,374 to restore budget reductions that were made in 2021 for the DA's offices that locally administer some of our child support enforcement. Same page but under child welfare services, you see the same transfer I previously previously mentioned of $371,500 from out of home care to child welfare services. And then underneath that, the governor recommended a $50,000 reduction. It's the same as the one I described in the amended budget. On page 219 in Department of Administration, the governor has recommended 5,925,437 that is related to passage of the one big beautiful bill. This recommendation represents the state's increased mass.\n\nfrom 50% to 75% for our SNAP administrative expenses to run the program. Next on page 220 and federal eligibility benefit services, the governor has recommended $40,428,968 that again corresponds to our increased share in administrative costs for SNAP. And under that, the governor has recommended $12 million to fund our overall strategy to reduce our payment error rate. On the same page, but under out of home care, there's a $300,000 reduction for what was one time funding for clothing and supplies for foster youth. Next there's a reduction of $250,000, which was intended for a pilot project to ideally place foster youth closer to their home communities. Given our projected shortfall and out of home care, we did not pursue this particular initiative, but I will note that we do already make significant efforts in identifying placement options as close as possible to the child's home community. And we do that with judicial oversight. Should we not meet the expectations? Admittedly though, we've lost 876 placement slots since 2019. So it is more likely these days that a child will be placed further away from home. In a similar vein, we have new research. This is from UGA Professor David Gibbs that indicates a steep upswing in defects involved children with severe emotional disturbance. I'll get into that later. I will have a graph. But as you know, behaviorally and medically complex youth are harder to serve in or out of their homes. And that's due to provider shortages, network inadequacy, and similar variables. That's it. So that number is not necessarily just adopting families. It's other providers also. Those are the providers that house foster children. We've lost 867 beds, so to speak. On page 220, again, you'll see a reduction of $371,500 transfer from out of home care to child welfare services. For that, there's also a recommended transfer of a little over $6 million from the safe harbor for sexually exploited children fund commission. It's an attached entity. That money is going to out of home care. It will continue to fund the First Lady's facility for traffic foster youth, which is called Graces Place. And that is located in Gwyneth County. It has 26 beds. This move will also allow our agency to draw down more federal reimbursements for placements of children at that location. Finally, on page 220, the governor has recommended a little over $21 million in out of home care. That figure covers $19,400,000, $801 for utilization growth and increased cost. Plus $1,892,348 based on increased federal drawdown for Graces Place. Next slide, please. The governor has recommended in some attached agencies, in particular, the Council on Aging here, has recommended a personal services reduction of $56,379 in AFY 26 and 27. On page 221 and FY 27, there's a reduction of a little over $8 million. That again reflects a transfer of funds from an attached entity to out of home care to pay for Graces Place and the children that are housed at that location. And on the same page and FY 27 for the Safe Harbor Commission, there's an increase of $2,105. That reflects fiscal year 25 penalty collections from adult entertainment establishments. That is based on code section 15-21-208. Okay, specifically to out of home care. You can see here the growth that we've experienced in this particular program budget in a very short amount of time. We have under 10,000 children in foster care right now. That number has been decreasing in recent years. We don't see that decrease here. Over recent years with that slight downward trend, we still see this increase in cost. Last calendar year we received almost 121,000 reports of suspected child abuse. Out of those we launched almost 38,000 investigations. We worked nearly 24,000 family support services cases and just under 8,000 family preservation services cases. That is, we did that work with just under 2,500 case workers. So in those cases, family support services and family preservation services, we are trying to keep the family intact with community-based resources. We want to avoid those children entering foster care if we can safely do so. If we uncover abuse or neglect though, based on our report in one of those cases and the child safety cannot be assured, we will seek custody and juvenile court. To properly enter foster care, under state law, a child must be dependent. That means abuse or neglected and there are, of course, several categories for what constitutes dependency. Importantly, de-fax does not unilaterally take children into foster care. We have to have judicial approval. We have to have a court order. I'm now going to get into what we believe are some big cost drivers for this level of growth and out of home care. The first one is court ordered services. Courts are legally mandated to exhaust every alternative before ordering a child into foster care. If a judge places a child in our care, the juvenile code mandates that hearings occur as specific intervals, the child's parents get attorneys, the child gets an attorney, we have attorneys. We try to first find a relative or a family friend with whom the child can reside. That is the preference. If those are not options, we look for a foster home or a group home congregate care type setting. Those providers meet their room board and watchful oversight needs. That's what we call that particular area. The child welfare system is designed to pursue reunification of the family, but that is not always the outcome. What we're looking for at the end of the day is permanency for that child, so it may be reunification, but it could be guardianship, it could be adoption, it could be independent living for some of our older youth in foster care who will perhaps age out of the system. DeFacts pace for services in cases where we can safely keep the family intact. We're budgeted to cover per diems for providers who house and protect those kids in our custody. Local case managers and supervisors determine the referrals for services that a parent or a child needs, regardless of whether the child's in our custody, and we have hundreds of providers who do that type of work. If a juvenile court is involved, we will take our recommendations for what that parent, what that child needs to our lawyers will take it to the parents council, will take it to the child's council, will take it to guardians at Lydom, will take it to court appointed special advocates, will take it to the people actually housing and caring for the child. That's a lot of people, but that's what we do is in this partnership, try to make sure that we're providing the right things for that child and for that parent. Ultimately though, the judge gets the final say and they hold all of those parties accountable. DeFacts won't be very clear here. Does not have an opinion on whether or what to what extent juvenile judges should be permitted to order services. We don't have an opinion on if they order something above and beyond what we recommend in court. Stand-of-the-day, it's a team effort. We have great partnerships with the judiciary all across the state, but as you can see, we do have unsustainable growth and we do believe court-ordered services may be one of the primary cost drivers. Our spending choices are driven by mission, defects, policies, federal standards. We are not the only people making those determinations though. Judges will, all across the state, order defects to provide specific services and specific care. Usually we agree with what they order. Sometimes we don't. If we don't, we need to appeal, if we can, that's very rare. We need to comply because one of the consequences of noncompliance with a court order is jail for our case workers, or perhaps me, hopefully not. The code contemplates that the judicial circuit through county funding or the child's parents, if they're able, could absorb some case-related costs, but the vast majority of the time we pay for them. This law says we also need not pay for everything a parent needs to reunify with their child, but that is the exception and not the rule for how we operate. That framework is generally how it operates for dependency cases. So that's where we file the petition. We have the child in our custody. But juvenile courts may also order us to do case work and provide services and matters where we are not a party. And although it's declining, some judges will still place kids in our care when we're not present at that hearing, you know, perhaps there are safety, safe alternatives that exist. Legally there may not be dependency. We may still get those kids despite changes in state law, and they can and do order services and non-defacts cases. So to best illustrate the spectrum within which we operate, I have several real life examples. Of court orders, which can be verbal, written, they can be delayed, they could be completely missing. All right. Currently on appeal, a Chatham Juvenile Court judge has ordered defacts to pay for a behavior aid, which is essentially third party supervision for a delinquent teenager who is not in our custody and for an unspecified amount of time. Theater aids cost roughly $38.50 per hour. We spent $43 million, little over $43 million in behavior aids last state fiscal year. And through this past December, we're trending toward almost $58 million in just behavior aids. In DeCab and plenty of other circuits, it's common for judges to order supervised visitation between parents and children beyond what de fax policy outlines, beyond our recommendations. And I would say that's probably in keeping with training materials that so many judges get from national associations or their colleagues for what they believe is best practice. For children aged zero to two, de fax policy recommends at least two visits per week. For children aged three to five, we recommend at least one visit per week. But typically judges will order double or triple that cadence. And they will often order it for after hours or weekend visits. Of course, we want children to be able to regularly see their parents. That's important for their well-being. It's important for permanency. But as I mentioned, we do have fewer placements based on over 800 beds that we've lost since 2019. And thus, it's far more likely they'll be a child will be placed further away from their home community. So, that means higher costs. If a case manager, a foster parent or a foster agency cannot supervise these ordered visits or provide transportation for the parent and the children, we pay contractors. Again, that's, you know, 38 and a half dollars per hour. That's quite expensive for third party supervision. Transportation is almost $30 an hour with a child in the vehicle. It's a little over $14 an hour without them. We also pay for mileage. So we spent over $60 million last fiscal year on mileage and transportation. And we are on track to spend $70 million this year. Some more examples of court-ordered services. In Barrow County, parental drug screens are expected or they're ordered in almost every single case, even if substance abuse isn't alleged. In Henry County, there's one particular judge that will call our CPS hotline or their staff will to request parental drug screens in non-defax cases because it saves the county money. One hair follicle drug screen is approximately $137. One urine drug screen is approximately 110. They are frequently ordered together. Two or three times per week per parent. Defax funded services may be ordered despite a parent's non-compliance with their case plan. And I'm talking about minimal or no compliance in these examples. In Clark County, a judge recently ordered Saturday visitation for four hours for parents of six children and they are all in different placements. Those parents are doing some of those visits. We have to pay regardless of whether they show up. And again, they're not compliant with their case plan. Visits are the only thing that they are doing sometimes. So we'll soon file for termination of their parental rights. We have already spent $20,000 in that case. And if we want to comply with that court order, we will spend $4,000 more. In Cherokee County, one judge will not rule on appending termination for parental rights motion. But that judge has ordered additional visitation for children in foster care for over four years. Since July, we've spent $26,000 per federal standards. Children should be reunified in 12 months or adopted by 24. In nearby Gordon County, which is my neck of the woods, so I feel like I have a license to someone and pick on them. But in nearby Gordon County, to comply with an order in a case where adoptive parents have abandoned their teenage child to our custody, reunifications never been on the table, right? They've abandoned the child. And it's not clear to me that there's actual legal dependency. The parents are scared of the child. That's the expressed reason. But dependency is measured as to the child and not to the parents. We are still ordered to provide supervised visitation between those parents, abandoned, their teenager, on the weekends for several hours. And we know that he will never go home. So think about the impact that that has on the child, not just the cost. Headed south, Blackley County, we have a judge who's ordered us to place a child with a specific provider. It is named. That provider operates two locations. They are both in Metro, Atlanta. That child will, of course, then be placed hundreds of miles away from their parents and community. So transportation to and from visitation, court, doctor's appointments, that will all be quite costly. Going back to Gordon County, I'll describe what we consider, but you may not, judicial overreach. That judge recently ordered defects to help a parent create a resume and oversee submission of their job applications. She also ordered defects to help a parent write a budget and comply. Of course, we see value in these objectives, but I don't know that we're the best agency for that type of work, although we are going to do what she said. In the middle of a 3PM hearing, same judge, she ordered us to take a foster child to the doctor by 5PM. In a different matter, a defects case manager was ordered to use their personal funds, that evening to buy clothes for a child based on what was really a misunderstanding about clothing allowances. We're currently ordered to provide supervised visitation several times per week to a completely non-compliant, now out of state, mother, despite weekly positive drug screens for fentanyl. We asked the grandmother where the children are living, if she would help us, if she'd be the supervisor, to save money. She said no, she's afraid she'll be exposed to fentanyl. So we're not going to comply with that court order because I'm not going to put those children's lives at risk, but again, the consequences of non-compliance can be contempt and that can't include jail time. So what we've been asking is under what case-specific circumstances should we be allowed to cherry pick certain provisions of a court order or ignore them altogether. That is something, especially as of late, where we're asking hourly. The same judge ordered us a few weeks ago to provide in-person substance abuse treatment to an incarcerated parent. The jail does not do that. We're not really the state agency tasked with addressing that particular societal issue, if you will. We don't have the right funding or expertise, in my opinion. But again, this is one of those things where we're asking ourselves, like, does the current system reflect today's world in allocated resources? So another example is that we're regularly ordered to complete assessments in defects cases. Those are very common. They're very expensive. They can be excessive. They can be duplicative. And we're often ordered to provide assessments in non-defects cases. So when I say assessments, I mean parental fitness assessments, psychological assessments, domestic violence assessments, substance abuse assessments. Those are the types of categories. We may be ordered to provide them for the parent, the child, both. They're several hundred dollars each. Some of them can be a thousand. That parent on paper might be eligible for safety net health care coverage, perhaps Medicaid. That is very rarely explored. If the parent does have substance abuse issues, drug screens, and also some of those assessments could theoretically be covered by Medicaid instead of defects funds. I have actually found an instance as I get service authorization sent my way each day, where we paid defects funds for several assessments. We paid for drug screens. We paid for substance abuse treatment for a mother, and she had been on Medicaid for years. Children in foster care are enrolled in managed care Medicaid that is administered by a mere group. And if they aren't, they will get fee-for-service Medicaid, or they may remain on their parents plan. In that way too, I would assert that Medicaid should cover many of the assessments that get ordered and many of the tests that get ordered for our children, or that we seek independently. It is not just court-ordered services that are causing issues. We do have judges who will deny emergency custody requests, or they will send kids home too soon, in our opinion. Those decisions are costly too. It's not just related to out-of-home care growth. One judge recently sent a child home too soon out of frustration that we couldn't find an ABA provider. Child went home, dad couldn't find an ABA provider. The point is that we're dealing with this dynamic. We don't control all of our costs. They are increasing exponentially. And while we're trying to do this work, our staff can really be put through it. That will lead to turnover. We may have to change a child's case manager because that case manager just cannot be back in front of that particular judge. That causes trauma to the child, but it also has indirect costs. Juvenile court records and proceedings aren't widely accessible, understandably so. But all of those things together make it so that people may not truly realize that the care of every child in foster care is overseen by a juvenile court. So we do in fact often get blamed for decisions that we're not making. We're following a court order. Provider accountability. This is the other big area that I think is a primary cost drivers for out-of-home care. We don't have enough placement for providers. We've lost those 800 plus since 2019. We have two main provider groups for serving our children. We have the Roombaward and Watchville oversight placement providers for foster youth. We have delivered services providers. So they will serve foster youth. They will serve kids that are not in our custody. There is some overlap. Unlike placement providers, the number of delivered services providers has increased since 2019. So we have more people to pull from. There are more people generally billing our agency. Our agency's mission is to strengthen families through case work, but also frankly goods and services. So inflation hit us uniquely hard. And so in the same way it affected our providers. Some of their frustrations also include they really struggle to find just affordable insurance these days. And of course they have some concern about over regulation. That's something that we're tackling that we will safely less than if it's appropriate because it does create barriers to entry. And we need more placement providers in particular. To conserve dwindling resources, we increase state level review and approval for service requests. Court order or not. And as we're making these decisions, we're reading case plans. We're reading the court order. If it exists, we're reading provider notes. We are looking at what the case manager has documented. It can be quite tedious, but it's been very helpful. And that change in the process is different from what it was where we allowed case managers to put service authorization requests directly into one of our technology systems. To stop hoteling foster kids, we use several strategies. We did and the great resignation gutted our manpower and also that of our providers. So to bring some beds back online, we would pay for staff augmentation to get kids out of hotels or keep them from entering. We paid one time emergency grants so that providers could tailor that setting to meet their needs and ideally retain those youth in that placement instead of having multiple changes. If necessary, we would pay for enhanced supervision using behavior aids in a placement. We still do that for the most behaviorally and medically challenging children. And we increase how much we pay for the health care costs of our foster kids. The children in our care that are most at risk of being hotel have serious mental health needs. They have pending charges. They have gang affiliation. They have runaway risk or history of it. They have a history of sexual exploitation. They have fire starting behaviors. They have low IQ or some combination of all of those things. And it's well known that providers willing to serve those children have incredibly strong negotiating power. If we find one, you better believe I'm going to write the check. I don't want them in a hotel and I don't want them in an office and we're going to pay something regardless. I've asked my child welfare counterparts in other states if they're dealing with this and it was unequivocally yes. In terms of health care, we don't like our kids on Medicaid. We don't like for them to have to wait for something. So even if on paper they should be covered for certain treatment or service, we may go ahead and pay for it and then we'll just have our lawyers duke it out. That is something that is certainly embedded in this particular graph. And those are not tiny, hummel, some money. In October 2021, there were some federal changes that went into effect that kept how long we could use a certain federal fund source. It's title 4E to pay for an eligible foster child's placement at a group home. They wanted a curtailed use of group homes in favor of foster homes, which is a very noble objective and one that we agree with. But overnight it created a $15 million whole in this budget for us, which thankfully with legislative support and the governor's support we've gotten some of those funds to cover that delta. Only about 35% of foster children are even eligible for title 4E funds. And when we got those caps for how long we could even use the funds for an eligible child, we didn't have a bunch of homes that had moved into the model that would operate as an exemption. So really 4E for us has been tough to draw down the funds that we believe we should be receiving. In cases where we used 4E to fund a child's placement cost, we used TANF now. That's our $329 million block grant for the initial placement. So we'll do that, think it's six months, and then we have to switch to state funds. For those changes, there are some other reasons why 4E wasn't as readily available to us to pay for foster care as some of our neighbors, for example, but those fixes require congressional action. I'm herian. So the federal shutdown dramatically worsened existing budget issues. We didn't have access to that $329 million or TANF block grant. I'll try to just cover the last few things. Okay. I mentioned this last year in where it is still the truth that transportation and behavior aids are the two fastest growing expenses and out of home care. We are, if we were to just as simplistically as possible, explain what we believe are the three biggest drivers of our current shortfall in this program budget. It's, in addition to serving more expensive children, not having full control of remanjing those costs, it is quarter of services providers having extra negotiating power, which I'm not saying they don't deserve, right? But that is those costs are going up and accessing health care for our kids is incredibly hard. There was a recent analysis done by Professor Gibbs at UGA. So you can see the kids that Georgia is serving in foster care that have emotional disturbance is higher and it's increasing at a faster rate than the national average. So as I said this before, we didn't want to terminate contracts, but we picked the ones that we think were mandated better performance or involved duplicative services. We don't want to have to do service authorizations the way that we have, but we will, if that's necessary. We, in my opinion, are still putting children first. I know that some people have asserted that some of those requests are not reaching me. I will take every single one of those personally if you tell me about them. We've created a dedicated inbox. It's integrity at dhs.ga.gov so that people can report concerns about access to services and provider performance issues. And so with that, I will take any questions. Thank you, Commissioner. We've got quite a few questions and members. I think there's 12 buttons pressed and we'll try to get to make...\n\nBefore five I apologize because we've got it we got deadlines go ahead. I'm gonna file the first one if you don't mind Commissioner. Well I had one but good. Well you go ahead miss chairman. Go ahead go ahead. A's before beauty. A's before beauty. You go ahead. You notified us about a month ago or several months ago you did even last year of the deficit and out of home care. You told us last it was 86 million with your adjustments and what you've taken place can you give us some sort of estimate of what that deficit might be now. So if we keep the the terminated contracts terminated we keep the service authorization change and how we prove and we keep that intact. The best math that we can do is assume like a 25% reduction in cost and I think that puts us at a little under yes like 48 million dollars would be the remaining deficit and you know we have some unobligated TANF to cover some but not all because not all not even close of those expenses will be eligible uses of that fund source. Tagging on these questions we are thinking a lot you said this these kids should have been covered under managed care under the mayor group contract. Which he said you're paying for some of their sound like at least medical transport. Yes so you know we pay for transportation for example especially for kids that have really high needs. On paper right we should be able to use non-emergency transport that Medicaid covers and what the state pays to a mayor group in a capitated rate. I don't know of a time where we've gotten access to non- emergency transport so we use our own providers for that to keep the child safe. So thank you I want to preserve time. Give me an idea of how much you've spent out the DHS or the defects budget that if you can estimate it of what should have been covered by that provider because we're already paying that. My team is going to get a you know skittish but so my rough math if I'm looking at things that you know I know to be covered by the state Medicaid plan for parents like low-income Medicaid is really what I'm talking about and in children who are eligible for Medicaid out of our custody but certainly enrolled in Medicaid when they're in our custody and I'll look at the things that we pay for. Last fiscal year I would say about a hundred million dollars a hundred million dollars I think is a conservative estimate of things that we pay for in addition to what what constitutes existing programs and other agencies. Representative Smith. Thank you thank you. He had his button press first. Thank you Mr. Chairman just me have you mentioned new authorizations and I know I'm talking about my area in the act of I have people in my area that offer those services they received a letter in November they could continue with the authorizations they had but no new. I get with your staff and find out what's going to happen because these people are going to go out of business I guess and they've been in business in so to 24 years so. Sure I mean I'll take all of those and personally investigate them I will say that there there's a certain group of providers that are totally reliant on a state contract then we have other providers that have diversified they also fundraise because they're nonprofits so they may maybe credentials Medicaid provider they may be a court provider through DPHG. Those diversified providers I'm not hearing from it's the ones that are completely reliant on a contract from us to continue to exist. One short follow up. So if there were issues that they weren't doing the services that they should have been done have they been worked with before they got that letter in November or you've set down and you've worked with these people how you need to improve in this area so all that's taken place. Yes yes sir or one of them for several years. Thank you Mr. Chairman. Chairman Watson. Thank you Mr. Chairman thank you Commissioner Rose just a couple of questions so the timeline on the help me understand the the deficit I think you said 8.5 million relating to a snap or pan of okay so that was you said the end of the fiscal year does that mean by June 30th? Yes so our projection for our out-of-home care foster care budget is based on going through June 30th this state fiscal year and we may be able to say 8.9. No so I think with our current cuts that we've had to make and authorization change for services that will get that deficit down to 48.9 million and that's making some key assumptions and reduction in cost but that's probably our best math at this point we never know how many kids enter custody I mean we never know what court order may come our way so. In just transportation one of those things we're going to look at. Yes so we did in fact change what we pay for transportation we issued a memo and I'll get you a copy of that and then the you had said the biggest the biggest errors occurred in self-employment and residency what do you mean by that? Yeah so going to like snap food stamps where the big beautiful bills and there's some big changes underway for that program the state's payment error rate is a combination of underpayments that we make to people and over payments that we make to people so we'll take a sample of cases we look to see what we got right what we got wrong and then there's a compilation of that amount and it extrapolates over the total amount of people that get snapped to determine the error rate one thing that I and all my counterparts are pretty frustrated with we hope can change we also get penalized for client errors so if someone just doesn't tell us about some of their income or they don't keep their housing you know updated in our system then we can be penalized for that and it's hard to not you know be penalized for something you don't know perhaps can't know those system some of this budget will go towards system enhancements to tackle that issue. I cross references and things like that. Yes. Okay thank you. Leader Healy. Thank you Mr. Chairman. Madam Commissioner there's been a report that was $36 million in contracts that will cut and my question to you is are children being served and are we undermining the industry that we need to support the services that we have to provide for those children. So I do think that it because of the change in process right it's a it's a different way to about getting services for children. I'm hearing reports that some kids need services or parents need services. I know of a handful of times where that's been actually escalated to me and in those we've corrected them so what I would say is I need to know about them in order to address them to evaluate how we're handling our mandate to to stay in budgetary compliance but for the contracts that we we terminated again it's not going to be frankly well received but it is nonetheless the truth that those particular providers were either not doing what we had contracted for or we could take the capacity in-house or it was duplicative. So that $36 million number is correct is that correct? I don't have the number right in front of me but I'm sure that's the right. So we cut what we have determined be about eight million dollars. I don't know where the 36 million is but I can talk to you about it after we're gonna see if I can give you clarity. So one other question that is you said that most of the providers were affected or those that were completely dependent upon the contract with you so if the services that they provide in many cases are specific to what your department needs are required so I don't understand your complaint about them. Not at all a complaint right but when we're talking about budget I think it's something that's important to know and when I look at those providers for delivered services and I look at we're paying for a substance abuse assessment for a parent or a child. Maybe that judge is determined the parent can't pay for it so that's why we are right. That same assessment is going to be listed in the state Medicaid plan for adult coverage for low income Medicaid. So that's what I'm doing is I'm looking at a comparison of things that Medicaid could cover should cover perhaps versus what we're paying for with our own funds and I'm seeing that they're their ways to make improvements. By like how did we get way off track before we knew that we were this far in the hole. This has been an ongoing structural deficit if you will. Now we've had we've had flexibility because we can use some of our federal fund sources. We've started getting reimbursement from a mayor group for example when we pay for psychiatric care that they have agreed to cover but can't find a bed so like we've gotten two million dollars from them on that front. But you know the flexibility is waning because we don't have as much of some of those fund sources as we used to have and you know in the past some of my predecessors would do things like delay payments to providers. So they create some cushion maybe at the end of the year they've saved a whole month's worth right because they've delayed over several months a few days here a few days there. There have been you know hiring freezes things like that and so it's been I don't want to say sustainable but it hasn't been as apparent that we're dealing with it. With our son. Thank you Mr. Chairman. Commissioner Rose want to thank you for being here and I do want to thank you for always answer my call and take care of the problems I have in my district. Sorry about you so much. But you were talking about the issues that you're having in juvenile court with the court orders and everything else that we're carrying debt that should not be ours. There have been a formal attempt to educate the management of the juvenile system to make them aware or is is that something where you are just complying with court orders because of Judge Son. You know I've sent out some written materials and you know here and there in this role four years so a few times I've gone to a conference and sort of given like a Medicaid spiel of things that Medicaid would cover ask parents to apply you know let's make sure that our children's Medicaid providers are are coming to the table. So there have been some attempts I'm sure I could do more on that front you know and I'll commit to doing more it's just you know that's we have a lot of judges and you know and they're entitled to have their own opinion of what is in the best interest for children that we serve so we try to balance. Members this is going to be the last question. Our subcommittee hearings begin Friday the FY26 AFY26 subcommittee hearings will be or we have invited the Senate to join the House and the subcommittee meetings so there should be plenty of opportunities to ask your questions. That means chair lady Dempsey. Thank you Chairman brush I want to thank you for the work you're doing first of all it's hard I think everyone in this room has just heard how hard it is and what a big and real challenge this is just to kind of summarize a lot of the messages that I've been getting this morning there are and we can talk about these on Friday morning at the 9 30 hearing when we start that's going to be real important for everyone to pay attention to and like Chairman Hatchett said just to turn in or be here for I want to be thinking about this though the deficit and I think Chairman Hatchett asked the question with the 86 million and if the contracts are kept terminated we begin to see a reduction a big reduction there's no doubt huge challenge but what happens to those children and those families and that's the concern that's overpowering this room right now you don't have to answer it right now if you want some time to think about it and come with some of that for us on Friday morning that would be great so I will say for the contracts that were terminated we're talking about a handful so that's I think it was five four or five and how we're handling it is we we we have in house capacity to do that level of work or there's an existing program that we can better leverage I'm not saying we're fully covering everything but for some of those contracts to what we found is we weren't getting what we bargained for as well and so we may not have been getting the things we weren't getting some of the things that we'd paid for and you know there are a lot of opportunities there but we haven't cut a bunch of other contracts we just change the process for how people get access to services thank you commissioner there were probably 15 lights that were still blinking so I'm around I'll see you a couple announcements I've been informed that the lunch that the rule caucus is providing and invited us to has been moved to room 403 in the capital so if you would like to join them here in the capital at lunch they're welcome to Commissioner to me you're up all right let's get the room if you're leaving leave please if you're staying in have a seat all right members please have a seat all right everybody Commissioner to me welcome glad to have you back and we look forward to hearing your presentation yes all good I think I can catch us up almost I almost in five minutes I can do my presentation and skip all the people I was going to thank including the governor and you all for your support when when Will Bell and I started in 2019 we never anticipated the challenges we would find both budget wise and of course a pandemic what you're seeing today is a budget that reflects focus on priorities for the for core functions of public health long before we were worrying about any federal reductions and some focus on core programs and new programs that you have supported so I will make it brief to say thank you so much for your support over these last seven years let me move on to a very quick run through of our public health budget because we are very unusual and for those of you who haven't heard us talk about the budget before public health is uniquely structured in Georgia compared to any other state in in the country and it makes it in some ways a challenge but also an opportunity for us to focus some of our prevention efforts our state office supervises directly 18 health districts with physician health directors or non-physician health directors and a 159 boards of health in every single county and so we are one of the few health entities that has a presence in every single county now what I before you even asked me or I can anticipate you're gonna ask what about workforce issues you've heard from every one of the other health speakers about workforce we have a challenge in hiring both health directors as well as nurses it will continue it was a problem before the pandemic it's even more so now and we are working with chancellor Purdue as well as the technical colleges to see if we can do a career path to try to help encourage more engagement in public health by our young people coming in and growing those new public health leaders several of you ask me what are the core public health functions in all of your health support apartments some health departments have more services than others because of their size and location but this next slide shows you basically the core services available throughout the state in every one of the health departments and I think many of you are already well aware of those I won't go through them my personal favorites include environmental health which is really unique to some of the work we do and we are in on a from a clinical perspective the authorities on things like tuberculosis like rabies treatment when there's there's a potential rabies exposure so there's some clinical issues that are uniquely public health expertise I just very quickly I'd like to talk about our our budget from by funding source because I think this is something that hasn't hasn't been well recognized 50% of our budget half of our budget is federally funded and it continues to be we had even more federal dollars during covid most of those funds nearly all have been rescinded but 50% still remains federal funds these funds include things like the WIT program it's half of our federal funds the women infants and children's nutrition program and it's it's separate from other nutrition programs it's not a welfare program it's a health program it's a nutrition program for mothers and babies and children and that's something that we do in conjunction with our rather child health activities we also have all the issues related to HIV STD TB again federal funding much of our maternal and child health activities federally funded looking at our state funds the 50% of our state dollars from you into public health actually are directed to the counties to county health departments and so I think that shows you that we have a wide range of assets but much of it focused at that service delivery at the county level and so let me just move into some takeaways as we're trying to move quickly so you can get to lunch is that half of our budget is federal but half of our budget is redirected to grant aid to the counties and the federal funds pay for some of these core public health clinical programs that you have all recognized in your health departments as well as emergency preparedness I wanted to very quickly mention that emergency preparedness is something that we have done for many years and public health often isn't recognized as being part of the preparedness activities and yet we have been right there during hurricanes we've been right there during other events and you'll hear a little bit later including preparing for world events that come to hear to the state and to Atlanta getting into very quickly the governor's recommendations we are very grateful to the governor for the one-time salary supplement and this again is helping coming at a time when it's very difficult to recruit and retain staff with nurses and clinical staff other clinical staff I want to point out that this 11 million dollars is for both the state office staff as well as the board of health staff even though they are technically not state employees and you can see in the next slide how that's broken out into the individual programs that are very a lot of different names but again they are the programs that you recognize in your health departments but if you look at the arrow the majority of this is actually going to the county health departments for the staff because that's where the bulk of the staff you know five four thousand some staff are in the counties serving the people of Georgia under the under the direction of the state office the other recommendation are those statewide changes that you all have heard from the other agencies about fifteen million dollars total across our budget now the last two changes in the government governor's budget I wanted to quickly mention many of you have heard me talk about our home visiting program which is unique in Georgia it's something that we developed here in Georgia based on Georgia data based on recommendations from a maternal mortality review committee I will say that Dr. Burke who has worked hand in hand with us and so many maternal child health issues was the founding father of this program of the founding mother because he recognized that we are not going to improve maternal and child health until we get to that community level and this program has already been expanded into 75 counties and thanks to the governor's support we will be able to expand with an additional two million to 96 counties all of 19 of these counties have no birthing facility have no OB services and these will be able to fill in some of the gaps that we have in those high risk counties to those mothers in infants who are at high risk of four outcomes and I'll be happy to talk more I have a one page well actually several page handout the describes this further with some some outcomes that are really beneficial that demonstrates that we have already saved lives of mothers in infants through a home visiting program that uses community workers as well as nurses to go into the home so it's very cost effective so dr. Timmy this the the additional counties are the lighter think counties correct correct correct correct thank you sorry and just again what and what's a unique compared to some of the federally funded programs that you may hear about is that we actually provide clinical services which is unique we use community health workers as well as nurses working in partnership with our our county health offices we do care coordination we do the actual service delivery where we can in the in the home and we also make those linkages to all those other programs both within public health and outside of public health including literacy education that I've been working on as well to be able to really provide a comprehensive broad approach to improving the health outcomes for these mothers and babies and ensure that they can begin to lead healthy life moving on very quickly to the last budget item is relates to our public health laboratory and you'll see on the budget sheet that this is a no cost budget item but it really a major change for us for those of you who don't know public health has a large laboratory on Claremont Roe very near the VA hospital and another one a way cross about 140 total staff with 12 of those staff down in the way cross area but we are different than a quest or lab core we don't do those same tests we do unique public health tests and in many cases we're the only ones that do those that provide those tests perhaps most significantly is the newborn screening and newborn screening touches every child of birth we provide a a broad array of newborn screening tests which we update and in many of you are well aware of this program and know more about this program than I have because of your engagement over the years and we and it has been in place since the 1960s and has expanded as needs have expanded we are the only laboratory authorized to do these tests in Georgia and I'm very but there was only one place that we did them and it was in on the Claremont Roe laboratory and with the help of DCH we within that CMS grant have asked to have that capacity in the way cross lab as well so there'll be some redundancy as well as the opportunity to improve transport of those specimens to South Georgia so a very important program the emergency preparedness unit again you've probably never heard of this I've been working on bioterrorism issues frankly since before 9-11 after 9-11-11 quite much more intensively I recently told Chancellor Purdue the most exciting time I had during his administration was at the G8 when we were running our bioterrorism alerts on St. Simon's but this is something that our lab does and it does uniquely here in Georgia and when we are world events like the Super Bowl and coming up FIFA we have to prepare for that in a very proactive way as a silent partner and Homeland Security and I again I have a one-page document describing some of those lab preparations but this is I wanted to lay out some of the unique things we do that are different than other laboratories that you may go to when you see a physician in his office but what we have done is that we've had six different lab lines of our budget which made it very difficult to streamline to ensure we have efficiency and effectiveness to identify where there is some gaps in what we need and the majority of our lab budget is is state funded although we do have significant amount of federal funds too and by consolidating into a single budget line we'll be able to better focus our efforts identify opportunities for improvements and efficiencies and more importantly when we get new funding in like the CMS grant that will be coming we'll be able to ensure that we're using that in the most effective way so all of that it describes what is really a zero cost but extraordinarily important change to our budget a single line item that is although it looks like it should have been easy to consolidate six different checkbooks into one it took much it was a much more difficult task than I expected and last but not least the governor has included in our budget some bonds for our public health laboratories some preventive maintenance for their laboratory as well as some other buildings in Rome the district office space in Rome and in Wake Cross and although I didn't do it in five minutes I almost cut us up thank you and that's it thank you and thanks again to all of you for your support for these important programs well thank you Dr. Timmy represent our whims thank you miss chairman thank you Dr. Tumifall you do your presence in 159 counties using your considerable\n\nI didn't want to go out this state. And will you ask our co-chairs if they will cut the air condition off from freezing the death? I can't get my own husband to do what I asked him to do. Well, you don't have any questions now. The whole board is lit up. Senator Davenport. Thank you, Barry Mishmouss遮 Chair. Thank you for that report, Dr. Tumey. And thank you for always answering our questions when we call. But I do want to ask about the permanent health of direct up a Clayton County. We know you before you assign one. But we want to know when will we get another one? I know the interim is there. And when I call her for a community forum, she can't do it all. And she said there was no one else in some position that had hired anyone. Is it God's a funder? No. What's the problem there? Sure. I think it's many things. And part of it is simply workforce availability as well as funding and there are other opportunities. And I'm hoping we can grow our own public health leaders over the next several years. But you may not be aware. I was down there meeting with your County Commission Chair. And we have very good meeting and have been in touch with her over the last several weeks. And we plan to be meeting again in this new year. And so we're currently working on that. And I'll be working with the Board of Health down there. I know this is, I think when I first met you, this is what we were talking about. And sadly, seven years later, we're still talking about it. But hopefully, I think we are on the right track. And I really appreciate the support of the Clayton County Board of Health. Chair and lady Taylor. Thank you, Mr. Chairman. And to the Commissioner, I want to take this opportunity to thank you and your staff for what you do. Our study committee this past summer and fall had the opportunity to see the importance and what all the departments do. And again, I just want to express our gratitude and let everyone know how important the work that you do every day is. Thank you. Thank you so much. Mr. Klerp's and Clay's. Thank you, Mr. Chairman. Thank you, Commissioner Tully. I wanted to ask in the DPH report around cancer control, could you share a little bit about prostate cancer because actually we're seeing that go up. And we're seeing the deaths of men in Georgia die from this disease that is preventable. And so it looks like we're about 11 to 12 percent deaths from over 10,000 cases in Georgia. We've done a lot with women and breast cancer, pap smears and cervical cancers. So we've fought and done a great job around that. How are we going to continue to do work in the area of men's health around prostate cancer? I think that's an excellent point. And I think that you are absolutely right in public health. We tend to focus on women and children. And I've done an excellent job in cervical cancer and have much more to do with our breast cancer programs. But I don't know, I don't remember what is in the report now on prostate cancer, but I work with the groups that are put those reports together and I'll be happy to get back to you about some potential ideas. For the first time this year, there was children's cancer in that report. And that was because of some advocacy around children's cancers as well. So we're doing some new things and taking a different set of eyes to this problem as well. But I will also continue to work with DCH because they will be a critical partner in anything we do to do screening and treatment for men as well. Thank you for being concerned about the men represented by Senator James. Thank you very much. Thank you very much, Dr. Tum. All that you do. We've known each other for a long time. But I have been looking for a statement from you about the measles. It's almost like an epidemic now. And for the little ones and adults, I'll get any measles. So some of the things that I guess CDC does not cover anymore, that they come to your department. Are you looking at things like autism and dyslexia and things like that? They had departments looking at it. And we have had for a long time an autism program that we work together with within our child health program. And that will continue and has continued. And as far as immunizations, the state set the immunization rules, our immunization schedule is still what it has been. And so we recommend, and those vaccines are available. And insurance still covers them. And so that is the message. What I didn't know until I looked into this further is that the majority of vaccines here in Georgia are actually given by physicians, not by public health. And I think that's even more important than for me to work in partnership with physicians across the state to ensure that we are working together to ensure that every child that needs a vaccine, every parent that wants their child to have a vaccine, has access to them. Well, thank you very much. And if we can do anything, please talk to us. Thank you. Appreciate it. Thank you for that, Tim, and the police. Thank you. Thank you, Commissioner Tim, we perhaps maybe we could put some funding in the laboratories for PSA test. Interesting. Or a contract because we don't want to do that. Thank you for helping get this caught up a little bit. Thank you. Thank you so much. Appreciate you all. Next up is Commissioner Ross with the Department of Veteran Services. Commissioner Ross always takes a little while to turn the room. Thank you. Thank you, Chairman Hatchett. Thank you to this August group for having me here this morning. It is my pleasure to be here representing a million veterans here in the state. I know many of you have seen the number 700,000 that the VA publishes. That is actually the folks tethered to the VA. They say that is about 60 percent accurate. So we are a very large constituent base for you. And thank you for all that you have done for our veterans across the great state of Georgia. Going over our budget, you can see that we are on page 371 to 376 of the governor's budget. I am not going to go into too much detail on the fundamental changes across the programs that are statewide adjustments. But you can see that we have got the $2000 supplement for personnel across all four of our programs. And I will go into more detail in the next two slides. But we were notified in December that we had a $10 million grant opportunity to finally build the Augusta Veterans Cemetery. Yeah, 25 years in the making. And since we had already submitted our budget and were not yet in the budget cycle, the office of planning and budget asked us to propose the reprogramming of funds to meet the necessary design and architectural costs that would allow us to have a successful grant submission this summer. The only program that had the funds happened to be our war veterans home. So in the governor's budget, you will see a reprogramming of $800,000 from the homes to the cemeteries. And I will go into more details in the next few slides. So to provide some context for those of you who have not been on this roller coaster about the Augusta Cemetery project, again, it has been 25 years in the making. In prior years, the state appropriated $1 million to meet the matching fund costs for environmental and architectural plans. But we were told that the VA would never have enough funding for this project to ever see the light of day. But sure enough, the National Cemetery Administration received $150 million and that allowed us to go forward with this project. And so the majority of the Central Savannah River area, or CSRA, Augusta was previously considered covered by Fort Jackson as well as Millageville. VA has a 75 mile radius that they say is a covered veteran for cemetery purposes. But in this historic budget year, we were notified that we had the opportunity for a $10 million cemetery project fully reimbursed by the federal government. But we need some upfront costs, not just for the $800,000 in architectural plans, but an addition of $200,000 for the removal of debris due to hurricane Helene. The city has agreed to demolish several buildings. It's in the process of purchasing some contiguous land, which I'll show on the next slide. And along with road improvements and assisted with needed easements. I must thank quite honestly DBHDD for identifying through state properties, a portion of their Gracewood campus for the cemetery. And we do anticipate it's going to be a medium-sized cemetery serving more than 66,000 veterans in that area with over 700 anticipated burials every year. Since this is now a fast-tracked program, you can see that in our FY25 budget ask and I will get to that, we're requesting funds to bring aboard a cemetery director to be part of this design project and to ensure that they're trained not only through our cemeteries in Millageville and Glenville, but through the VA. And they need to be in place to be able to hire the rest of the team, which will be FY28. Although there are common features in our Georgia state veteran cemeteries such as Carolon, which is your belt tower or your service flags, these aren't funded by the VA. So we will be working with the CSRA to assist them in raising funds for these key ceremonial elements. So continuing with that amended at 26 budget, we are requesting the 1 million previously in our departmental budget to be restored for this project without having to reprogram funds from the veterans home program. We still need these funds for the homes. As you know, we stood up the subacute therapy unit this past fall. We're still onboarding staff, still opening the additional beds and we need to admit patients up to our fully funded amount. So we would request that 1 million dollars be returned for the Augusta Cemetery project. I'm going to discuss the Georgia War veteran homes in a few slides specifically for the 27 budget. However, while I'm able to talk about this incredible opportunity to support our veterans in the Augusta area, I'd like to show you a brief overview of what it will look like. So here's the Gracewood campus. You can see kind of that cut out. That's what the city is looking at to purchase for this project. You can see where the debris is, see where some of the buildings currently are that need to be demolished. The plan is to have the entry to the cemetery right past that little divot where there's a culvert. And so I've seen some initial designs. Like I said, we need to have this fully designed or at the 95 percent design by summer to then apply for this grant at the end of the federal fiscal year. So very excited about this finally coming to pass. The next request in the amended 26 budget is for our community referral system or the United Georgia project. And the governor's budget we received just over $1.7 million for this contract. But this number was actually based on last year's amount. And we had additional ARPA grant funds that actually matched with these funds to fund the entire grant for this closed loop referral system. So we have a shortfall of about $2 million. This is on statewide contract and we use this platform exclusively to provide additional resources to our military, to our veterans, their families across the state. We have over 800 partners that aid in almost anything you can imagine from health care, employment, education, child care, financial assistance, et cetera. And I know most of you will probably say, well, what's the return on investment? Let me show you. From November of 22 to January 18 of this very year, our United's coordination team, which solely serves our Georgia folks, have outreach to almost 5,000 veterans along with 18,000 touch points. Why is this important? Those veterans tend to be in our rural communities where they're in resource deserts. And so this team through the United's contract actually goes out and finds resource providers. So our team, the GDBS team, along with our partners with the Office of Workforce Development and your vector centers have served over 10,000 veterans, identifying over 16,000 needs with almost a 91% acceptance rate of referred cases in less than two days. With the resolution of the veterans needs in less than a week and a case closure rate of almost 95%, this is a nationwide program. We are leading the nation with our acceptance, resolution, and closure rates for your veterans. What I also wanted to point out is that that bottom corner, those 780 veterans we proactively engaged, we're in our 11th proactive campaign. So we reach out to veterans who have high social sufficiency scores, so high needs, before there's a crisis, and before they reach out to us or a trusted partner. This allows us to get upstream of needs to include our just concluded campaign of loneliness. We know that that's a key campaign during the holiday season, which we connected veterans to a variety of groups for social support, as we know loneliness is a key indicator of suicidal ideations. So the referral system is truly impacting veterans' lives and we request the full cost of the contract to continue to meet the myriad of veterans needs beyond just VA benefits. So now I'll move over to FY27. We only have four programs and only one additional ask. So for our admin program, we have the standard statewide adjustments for insurance, technology, Georgia, at work, state health benefits program. So in the interest of time, that's across all four programs, so I will jump ahead. I already gave you a preview, so for our cemetery, we do need a cemetery director for the Augusta cemetery. To quickly review the timeline, again, 95 percent architectural solution is due this summer, and we'll know by the end of the federal fiscal year that we have those $10 million in grant funds providing we meet all the deadlines, which the team is on track to do that, and we anticipate the rest of that construction will take a year, which is why in 28 we will need the rest of the staff. So that's our one ask. That's a $60,000 salary with a seven percent fringe rate, 70 percent fringe rate. So there are no changes from the governor's budget for the war veterans nursing home, and I truly, truly appreciate the increase in state appropriations to retain the same number of funded beds that we have now. Additionally, we have no changes to the Veterans Benefits Program. The two additions in the governor's budget, other than our statewide adjustments, are for increases in salary for our veteran service officers and our appeals officers. So the Department of Administrative Services, their Human Resources Agency, re-evaluated the duties of this highly specialized positions, and in the governor's budget, we're receiving just over 258,000 to bring these legal coded positions up to their minimum wage rate. It doesn't provide an increase for everybody in those job codes, just those that are under that minimum rate. So just to highlight what this amazing group of veteran service officers and appeals officers accomplish just this last year, they were directly responsible for $5.2 billion in compensation and pension to Georgia's veterans or their survivors. This expert and accredited assistance with the VA process was provided at no cost to Georgia's veterans or their survivors, and we actually ranked fifth overall in compensation and pension even though we're ninth for the number of veterans in the state of Georgia. So we're punching well above our weight class. For the appeals team, they were responsible for over 40 million in retroactive payments to Georgia's veterans. So talk about life changing events for these veterans, and these funds come right back to Georgia's economy. Additionally, we had requested two new positions because the Savannah region with its over 40,000 veterans, along with about 5,000 transitioning military, has a population that requires an additional couple of veteran service officers that the governor and his budget gave us one additional position. So just to recap, you can see the only additional request in the 27 budget is for that cemetery director. And last year, we also requested funding as a capital project for a new veterans home in South Georgia. As a reminder, the state would fund 35% of the construction costs, the federal government fund 65% of the construction costs. And so here really is the need. Based on the latest estimates from the architectural team, the cost for 120 bed facility, which is considered the ideal size to maximize beds while ensuring adequate staffing cost about 100 million. So that's a $35 million ask for a capital project in either the amended budget or the big budget. Last year, you were very generous and provided additional funding for the 40 beds bringing us up to 185 funded beds in Millageville. Just to give you a highlight of where we stand as far as our residents go, Augusta is at 124 funded beds and is working on about 16 applications for admission. And those will be filled when beds become available. Millageville actually can admit 17 more patients based on the funding. And the team is reviewing eight applications right now and working with an additional 12 families for admissions in Millageville, which would also max out our funded beds. So even with the additional funding in Millageville, we're still 1500 beds short based on what the VA says we should be providing to our veterans. And it will take about four years to complete and admit folks into a new veterans home, making over 50% of veterans over the age of 65 compared to just 15% of Georgians. There is a need for skilled nursing care for Georgia's veterans in a new home and I've committed to OPB and the governor to use another model for funding whereby the enduring operational costs for a new home are not passed on to the state. So with funded, this will be a one time cost for the matching grant and then some up-pronk cost until we begin receiving revenue from the VA and other third party sources. And so while we were looking for a home in South Georgia to geographically meet another market demographic, I will say the Albany and Dowerty County community has really stepped forward and is committed to this project. Albany of course is home to Marine Corps Logistics-based Albany, our active duty marine, military installation, over 25,000 veterans live within a 50 mile radius. So we know there's a need and the Live Learn program through Albany Tech is a great source for staffing availability as they produce all the nursing staff that we would require for this new home. And when you superimpose this 120 bed facility that would be just north of Albany Technical College and Phoebe Putney-Hot-Spital, this is the proposed site also known as the National Guard Armory. The Albany Dowerty Development Authority has executed an MOU with Dowerty County to provide this site to us for this new skilled nursing facility. And this is about what those 120 beds would look like on that site. So I know you've heard this from me before, but we need to expand veterans long-term care because our veterans needs are changing. I know I've been asked why fund a new home when we still have capacity at our existing homes. Right now that's 17 beds in Millageville is our capacity. And I do want to address in all transparency, I know I've talked to many of you one on one, happy to take questions, but there are no systemic issues at our Georgia War veterans home in Millageville. Well we of course have issues every skilled nursing facility has. We're dealing with a medically frail population, cognitive decline, bowel bladder issues among more severe clinical diagnosis. However when somebody identifies an issue to us, the contractor or our team, we fix it. And so by any metric, I could find to benchmark either off of other skilled nursing facilities in the state of Georgia or the national standards, I'm going to give you a scorecard. So we've talked about the need of our aging veteran population compared to how it ranks with Georgians. But our staffing, and though you'll hear everybody say nurse staffing is an issue, anybody in healthcare will tell you that. But our staffing is considerably higher than other skilled nursing homes. And while there is turnover across the board, our attrition rate is significantly lower. You can see that for similar sized facilities, so 100 beds are more. Our turnover is just over 33% and the rest of the state is about 53%. Also based on survey results back in July of 2023, and this past October from the Department of Community Health, which is one of our regulatory agencies, we had back to back to deficiency free surveys placing us in the top 10% of skilled nursing facilities in the state. We have a gold seal from the joint commission, which we voluntarily participated. And this summer they recognize millage bills home as meeting the highest of their standards. This inspection occurs every three years and we had it this past October. Our VA survey, which occurs annually, we've received only minor deficiencies and we're reaccredited back in July of this year. It should be noted that unlike other skilled nursing facilities who have part time physicians or nurse practitioners who visit the facility a couple of times a week, millage bill has two physicians and four nurse practitioners to include a psychiatric nurse practitioner onsite full time in the facility. So when you look at, let me do my build, when I printed it I didn't know there was a build I apologize. There we go. When you look at family satisfaction this past year, 94% of our families were satisfied with the care and millage bill compared to 86 nationally, which was the only benchmark I could find. For food preparation always something that's of interest in the skilled nursing facility, courtesy of you all we opened a dining facility back in September of 2024 and the summer purchased heated and cold food carts to make sure that the temperature was appropriate for all of the food for all of the neighborhoods. All four of our dining facilities actually received 100 on their health inspections this fall. We know that falls are always a huge concern and skilled nursing facilities. But through concerted efforts to include patient and staff education, we increased our observation and reduced our fall rate by almost 14% this year and that is an incredible metric. Certacy of the state in the VA, along with a portion paid by some residents that are not receiving VA disability compensation, the cost of care provided to our veterans is about $12,000 a month per veteran. That is what the state and federal government is supporting. Some additional ways we are different from most skilled nursing facilities is we provide transportation to and from VA medical appointments. We provide dental care, mental and behavioral health, offer physical, occupational speech therapy on site without our residents having to go to rehab facility and most skilled nursing facilities, these costs are borne by the resident. And across the board and on every metric we could objectively measure, we exceed the standards in every category. And if there is a metric I can capture and benchmark against with other skilled nursing facilities, I would be happy to do so. Again, I would be happy to address any questions you have. I appreciate the support you have given, George's Veterans and our department over the years and I look forward to taking your questions. Mr. Chairman. Thank you, Commissioner Ross. We had two lines in both of our veterans and defense chairmen's, chairman, and the bottom. Thank you, thank you, Commissioner. Thanks for all you do and your department does. Just a quick question you mentioned that the fact that George only has two or better in terms for a better in population, our size, how many should we have? 120 beds and needing 1,500 beds. I mean you're talking 10 plus. I'm happy to start with one. Great, thank you. Chairman Harbison. Thank you, Chairman. Commissioner Ross, thank you very much for what you do for the veteran and state of Georgia. That was a tough job. At the same time.\n\nCan you talk briefly about staffing and security at the facility and the problem you have with staffing if that's a problem or how you see it if you don't mind? Yes, so we have the challenge with staffing nurses and CNAs just like every other healthcare facility. If you saw on my metrics, we've turned over about a third of that staff over the last year compared to other organizations that have turned over half of their nursing staff. So while skilled nursing and finding skilled nursing and CNAs is a challenge, a village village is a fairly rural community. We seem to be doing a good job. I mean, our staffing levels are 5.0 compared to the CMS standards, which is 3.0. So we're meeting the demand and I know we are rolling out some additional programs to help with staffing across the campus. I'm talking specifically Millageville because I know that's where I get most of the questions. We do have the home in Augusta. We're able to meet the staffing requirements. Our contractor on site has brought on contracted nursing to help with that as we ramp up to fill the subacute therapy unit and those additional beds, the 17 that are remaining from the 40 that you provided funding for. So I hope that answers your question. Senator Harbyson. Yes, just one more question. I think you probably geographically misspoke just a little bit when you talk about the one better home coming up. That's Columbus, not all of them, right? Let's talk. Was that a question? Chairman Yerda. Thank you, Mr. Chairman. I just want to express my appreciation to what you're doing and bringing that facility down to Albany, Georgia and Southwest Georgia. Much needed. That will be great for the veterans and their families as well. So thank you. Yes, sir. Thank you for that. Come in, sir. I got a question. I support your efforts to make sure we have enough beds. How much money does it keep? You showed us the homes you have 209 beds and that one, yep, that's the string of it. So what would it take? Well, funding would it take to get the additional 131 beds? Oh, my. And I get it. Open it a floor is harder. It is because you have to bring staff and have enough patients to pay for that staff for a floor. You're going to make me do public math, Chairman Tillery. Goodness. About $400 per patient per day, about half of that is borne by the state. So if we're talking $2000 a day, I can get you math, but it's a considerable amount. I understand that everyone's not going to want to be in the middle of the field. Correct. You get that part. But right now that's where our beds are. So it seems like it will be more cost effective to get those. Because we're moving forward on more homes. So I want to. Yes, sir. As far as capital projects, I will tell you that we do have two buildings, the wood building that's been partially renovated, that we do need to do fully renovate the building and our Vincent building, which has not been renovated, to bring them up to kind of standards for skilled nursing facilities. We would need renovation funding for those to really be able to attract the population in the middle. I can get you those numbers. We have those. Thank you. Commissioner Ross. Thank you, sir. Thank you. Next step is Commissioner Rebecca Sullivan and the State of County, Officer to Rada voters, for being part of the county. Please thank you. Len? You ready for me to get started? I amblingaslet the hook I down, just a minute, so everybody I can hear you. Well, they're going in and out. They're being kind of quiet. So, go ahead. Thank you. Good morning, Mr. Chairman. Members of the committee. I'm Rebecca Sullivan. I'm the Commissioner at the Department of Administrative Services. Thank you for the opportunity to appear before you today. I'm very excited to be here. I will start by saying that we are not here to ask for any additional funding for any of our programs outside the statewide salary adjustments for the recommended supplement. But we do appreciate the opportunity to be here. To share updates on how DOAS has managed to maximize the investments that you've already made in our programs over the past several years. I would like to take this opportunity to thank the General Assembly and the Governor Camp for those strategic investments that you've made particularly in our risk management programs and in the state's workforce. I'll begin with a brief update on the major risk management programs, report on their program performance and financial position. And then I will conclude with several encouraging highlights on the state's workforce. And then after concluding my presentation, State Accounting Officer Gerald Ahinez will step up here and will give you a quick update on the next Gen project. I only have one recommendation to speak to today and that's with respect to the risk management program. Governor Camp is recommending a reallocation of approximately 15% or approximately 15.7 million dollars of the annual workers comp buildings to the property program. This recommendation aligns building revenues more appropriately with the excess insurance and claims cost within each program. DOAS fully supports this recommendation and I'll walk through the data supporting that adjustment over the next several slides as I give you an update on the risk management programs. Before we walk through the data illustrate on this slide, I would like to share a brief overview of the workers comp program which DOAS oversees for the state of Georgia and provide some context on its current financial position based on the investments that you made in this program over the past few years. This program ensures that state employees who are injured in the course and scope of their employment receive appropriate medical care and wage replacement benefits. This program provides coverage for approximately 132,000 state employees representing nearly $8 billion in annual payroll. DOAS self-insures each workers comp claim up to $5 million per occurrence and maintains a commercial excess policy to cover claim costs exceeding this retention level. As illustrated on the graph on this slide, the workers comp programs, buildings, program costs and trust fund balances have evolved over time and the earlier fiscal year shown on this slide, premium buildings and program costs were closely aligned resulting in a relatively flat fund balance. In the amended FY22 budget and again in the amended FY24, the governor in general simply made strategic investments in this program and because of that, we were able to use state appropriated funds to settle longstanding claims. That's reflected in the total program expenses shown on this graph. So those settlements along with some targeted efforts and return to work and initiatives resulted in a reduction of approximately $30 million in fixed program costs. So at the same time, buildings remained relatively stable and so these actions combined help improve long term claims management for the program. So as a result of all these things, the trust fund balance has grown significantly reflecting lower fixed costs and the sustained impact of program management actions. Moving ahead, we'll continue to use the available funds to settle claims and manage long term outstanding obligations within this program. The projected trust fund balance remains strong supporting the governor's recommendation to re-align buildings across the programs. I'll now explain how that shift benefits the property program. This graph here illustrates the property program's billing program cost and trust fund balance over time. From FY 16 through FY 23, program costs consistently exceeded billings, resulting in a steady decline in the trust fund balance and a negative position in FY 23. So this trend reflects increasing claims activity and rising cost of excess insurance during that period. In FY 24, billings were increased by approximately $30 million to better re-align revenues with program risk and cost drivers. As a result, the trust fund balance has rebounded, but looking ahead to FY 26, while program costs remain elevated and adequate trust fund balance really is critical to address variable costs arising from catastrophic events such as Haleem. I do think it's important to note the magnitude of this state's property program. We provide insurance coverage for nearly 14,000 state-owned facility statewide with a total insured value of approximately $50 billion. We sell for insured the first $10 million of each occurrence, so we're retaining significant risk before the excess coverage attaches. Total insurance provides coverage up to $1 billion at an annual cost of approximately $40 million. So excess insurance costs does fluctuate annually based on market conditions and loss experience. So while we're not requesting any additional funding or increased billings in this budget cycle for the property program, instead just requesting the proposed reallocation of $15 million from the workers comp program to the property program to help strengthen and stabilize that and really better realline billings in a manner that reflects the state's exposure and long-term sustainability. I know we're a little bit behind for the sake of time. We are not requesting any changes or increased appropriations in the liability program. So I'll run through this real quickly, but I do want to point out for you that the trust fund balance in the liability program is at a much more acceptable level. Strengthening the state's ability to manage claims and address our long-term obligations in that program. Now I'm going to shift quickly from risk management to a quick update on the state of Georgia's workforce. So the next several slides are going to highlight some key data related to employee turnover, recruitment and compensation and how recent policy and budget decisions have produced some measurable positive outcomes. This slide provides a snapshot of the state's workforce at the end of FY25. I will share that the state's workforce I think is overall better positioned to deliver services than it was just a few years ago. Agencies are maintaining more stable staffing levels with fewer disruptions caused by vacancies and turnover. From a policy perspective, I think the key takeaway here is not simply improved performance metrics, but increased workforce stability, allowing agencies to focus on service delivery rather than continuous backfilling of positions. I'm happy to report that the state's overall turnover rate for full-time employees was down to 17.3% in FY25 from a high of 25.3% in FY22. As Governor Kemp highlighted in his state of the state address, that is more than a 25% reduction. Volunteer return over his decline to 12.2% in FY25 down from a high of almost 20% in FY22, representing the lowest rate in at least a dozen years. The green bars just adds this graph demonstrate the median annual compensation for full-time executive branch employees. Since FY2020, median compensation for full-time executive branch employees has increased by over $15,000 or 39%. While the overall turnover has declined from a high of 25.3% to 17.3 during that time frame, I think that this trend suggests a correlation between the decrease in the turnover rate and an increasing compensation. He investments made by the General Assembly and Governor Kemp and our state workforce have clearly paid dividends and we are very grateful for those investments. We also fully support the Governor's recommendation for a one-time supplement of $2000. This slide breaks down turnover across generations. Turnover has declined for all generations of employees including Gen Z and Millennials, which historically experienced the highest turnover rates. The Gen Z voluntary turnover rate is down from 76.4% and FY21 to 28.4% and FY25. The millennial voluntary turnover rate is down from 28.3% and FY22 to 13.8% and FY25. Millennials do continue to represent the largest generation currently within the state workforce. Together, Millennials and Gen Z make up almost half of the workforce. Retaining these employees of course is critical to reducing the cost of recruiting, hiring and onboarding new staff and retaining the valuable institutional knowledge and expertise that is really critical developing a pipeline of future leaders. I'm also happy to report, while at the same time turnover has decreased the state's recruitment position has improved. The state's been posting fewer jobs each year since FY22, but application volume has increased each year. The application to job ratio has increased from 20 to 1 in FY23 to 32 to 1 in FY25, to market improvement. Looking ahead, the focus is really shifts to sustainability and this is where Georgia at work, the state's new enterprise human resource platform will become critical and you're going to hear about that in just a few minutes. But before we move on to next gen, I would like to express our appreciation and opportunity to provide these updates and the appreciation for the continued confidence that you all have placed in DOAS, our partnership with the General Assembly and our colleagues across state government is really essential to fulfilling our mission and to be a customer focused in collaborative partner and a responsible steward of state tax dollars. Mr. Chairman, I'm happy to address any questions anyone might have before we move on to next gen. I don't see a question. I mean, you covered it all. All right, we'll keep moving. Good news. Good news and heavy questions. Here we are. Still up here. The next gen project. So this project is implementing the state's new enterprise resource planning system which is named Georgia at work. We're going to share just a little bit about this project. It's complexity and how it's going to benefit state operations. A state accounting officer hides is going to provide an overview of the project activities, what we've done to date and on project costs and budget related changes specific to the state accounting office. In summary, there's my agenda. In summary, what is next gen, it is an enterprise wide digital and business transformation initiative that moves the state from a 25 plus year old people soft environment, which we call team works to a modern cloud based single enterprise platform for finance, human capital management and procurement. Georgia at work is going to streamline finance and human capital management processes, reduce the number of systems that agency and users must learn and navigate to perform their business functions. It's going to improve user use and improve user usability, create efficiencies across agencies and better allow better visibility into the state's data. We're really excited that this is going to deliver some modern functionality by automating workflows and approvals to improve consistency, transparency and timeliness in state operations. It's going to provide enhanced dashboards and improved analytics to strengthen financial and workforce decision making. This is going to help agencies and policy makers anticipate staffing needs, monitor turnover and vacancies in real time and evaluate the impact of workforce investments more effectively, paying better data to support workforce planning, budgeting and policy decisions. It's going to modernize and streamline the recruitment and onboarding process, making it more user friendly from job application on throughout the process and it's really going to, we believe it will help improve the state's ability to attract and retain talent. We're very excited that this system is going to establish a statewide learning management system, expanding opportunities for agencies to share and access training resources statewide. It's also going to automate procurement, reducing manual effort, centralizing and standardizing contract creation and storage and allow for enhanced reporting capability on state's been. And finally, agencies will be able to access real time data enabling them to respond more quickly to legislative inquiries. Overall, Georgia at work is a critical tool that will help the state manage its workforce more efficiently and proactively and it positions the state for a long time, long term operational efficiency improved data driven decision making and a stronger, more sustainable workforce. I didn't want to point out real quickly how complex this project is. More than 200 agencies are included within its scope. To support this effort, we have relied heavily on subject matter experts from those agencies who make up a project team of over 350 state employees. They're contributing critical operational knowledge and expertise to ensure that the system is going to meet the needs of employees and the roles across the enterprise. This project is made up of more than 30 work streams each focused on specific business areas. They include HR teams focused on compensation, benefits, time tracking and payroll, comprehensive finance work streams spanning billing, budgeting grants and asset management and procurement work streams addressing purchasing cards, requisitions, PAs and supplier management. To support the statewide operations, this system includes 402 integrations connecting Georgia at work with external partners such as banks, the IRS, benefit partners and more. Approximately 78,000 employees and 125,000 vendors and external users will utilize this new system in some way. So it's quite a complex project and a huge undertaking and I'm going to turn it over to Officer Highs to talk a little bit more about the activities that we've done to get to this point. Thank you Commissioner Sullivan and good morning again to Commissioner Chairman Tillery, Chairman Hatchett and members of the committee. Again my name is Gerald Daheins and I'm the state accounting officer. So I'm going to talk a little bit about some of the project activities that we've done so far and where we've been. We started this project in September of 2021 and selected a software vendor and system implementer in 2023 and the project kicked off in December of 2023. Since then our project team has been very busy and as you can see through our roadmap a lot of activities have taken place. I'll point out a few. We have worked to establish a regular and robust communications across the project starting with obtaining a point of contact that each agency to help coordinate the completion of agency activities disseminate information throughout their agencies. We have a monthly newsletter and in 2024 we created and launched the Georgia Network System Name and logo. We have posted several agency previews around the state where agencies were invited to preview the system with demos, ask questions and provide feedback. We also established a next-gen change network with representatives from each agency who are preparing their agencies as we make this transition. Our communications team has sent over thousands of emails across the enterprise to our stakeholders. Agency heads, CFOs, HR directors, IT procurement teams over the course of this project. Keep in everyone aligned on the task, project updates, shareholders meetings and ongoing activities. Last year we shifted our goal-life date from April 1st of 2026 to July 1st of 2026. The major factor here is in fine-tuning the needs of GDOT. As their business needs and processes are very complex and require some specific customizations to meet federal requirements and a federal certification. GDOT will go live separately and their team is working diligently to get the project team together. I want to point out agencies have been very involved in various activities to prepare them for the goal-life. Payroll compare and testing to ensure the accuracy as it relates to their data. Additionally, we've published an agency readiness checklist so that agencies know what's to expect, their data lines and resources need so they complete their task. Our partnerships with the agencies has been extremely valuable to the success of the project and agencies are required to sign off on different activities to ensure that their data is correct. So a little bit about the project cost. This is a project cost initial funding for the project of $108.4 million was appropriated to the technology of fund, Empowerment Fund which is overseen by the Georgia Technology Authority. Our projected total expenditures is $132.7 million with a variance of $24.3. We're not asking for appropriation as TIFF, interest earnings and reserves with the state accounting office and the Department of Administration will cover this variance. In the state accounting office budget on page 82 and 83, there are two items. The first item the governor's recommended and amended FY26 to provide one-time funds to continue team works ERP support for GDOT due to the extension of the agency's Georgia at work implementation timeline. $10,379,589. In fiscal year 2027 the governor's recommendation is to increase funds to reflect an adjustment in ERP billings to reflect projected costs of operating and maintaining the statewide which is going to be the Georgia at work system for financial and human capital management. There's a yes in the book but the amount for this is $3.5 million. So a little bit about some of the activities that are coming to get us to our go live date in July 1st of 2026. First we're going to continue to do testing. We're conducting our final rounds with selected agencies to confirm some finance and other processes that have been recently completed. Ensure the accuracy of data, integrations and confirm reports are produced in the needed information to inform business operations. Second is training. We will begin our training on March 2nd to ensure that everyone's available as ready for the first day as we deliver this training in ways based on roles and responsibilities. And then cut over. We're going to be preparing for our cut over so practice makes perfect. To ensure we have documented and necessary steps to make this transition as smooth as possible, this exercise will also allow us to our team to confirm backup plans and medications just in case we have any issues. This is one of the largest IT projects in the state with over 121 agencies participating. Significant communication campaigns will be launched to keep stakeholders informed of the cut over activities and progress. And then go live. To finish live for almost five years of analysis, design, configuration, testing, retesting and confirmation, this will be a combination of the journey to bring this transformation to life. Now at this moment I do want to thank Governor Camp, Chairman Tillery, Chairman Hatchett, the General Assembly, and also our project staff at the State Accounting Office, the Department of Administrative Services and all of the agencies that are participated in this journey. We do not want it to go unnoticed again that as Commissioner Sullivan stated, we had over 355 state employees participating in this project. And though we're not done, they have done a tremendous job to get us to this point and to get us to go live. Thank you and we can answer any questions that you may have. Officer Hens and Commissioner Sullivan, there are no questions on the board and I don't have any questions but I do want to say that y'all have led an effort that is historical transformation for every agency of state government and I thank you. I'm looking forward to going live and I know y'all are probably looking forward to and shaking and scared too but anyway we've got to do it. It's huge. I think members if you know a little bit about it this is a transformational thing that you're doing and thank you for keeping us updated throughout and I appreciate that and I'm sure Chairman Tillery might want to say a word. I'm also really proud that we're right now in Lionel budget for the most part. And then also the timeline that we've seen that hold held the timeline with one small exception but we're working through that. So for those of you who don't know this is everything from payroll to how we manage HR resources. It's a very huge thing and it will also allow the legislature a lot more insight into how spending is done on more of a real time basis almost like looking at your checkbook which is the things we've asked for in the past to try to keep you up to date too. I'd like to see a question. Sorry. Is that Liam? Is that Remstening? Okay. Yes sir. I just had a quick question. I know we took a great step forward a couple years ago with the Governor Comestor of Business Certification Program. I also know that DBE certification and speaking to GDOT is a little bit uncertain and I know that folds into NBE certification you all do. Would you just give a quick update on what the landscape is at NBE, DBE, all the BEs? I think that's the reason. Yes. So we did a roll out our small business and supplier diversity certifications. I believe it was at the beginning of last year, might have been at the beginning of 2024. So we are now certifying minority, veteran and women and businesses and small minority, small, veteran and small. We have been very successful. And...\n\nand getting those certifications issued. We've done a significant amount of outreach. We have recently partnered with G.DOT's Small Business Partner, Miles, Public Smiles and Company, and to reach out to small businesses throughout the state and help them with the procurement process and train them on that. So thank you for that question. Thank y'all. Thank you. Have a good day. We'll be right up right before lunch. Executive Director, State CIO, Sean Z. Thomas for the Georgia Technology Authority. And remember, lunches in 403, they moved it here. Thank you. It's going to be a heck of a 250th celebration for those folks. All right. Hello, Director Thomas. Hello. How are you? How are you doing? Doing good. The floor is yours. OK. Let's see what time it is before I say good morning. It is still morning. OK. Good morning, Chairman and members of the committee. I am Sean Z. Thomas. I'm honored to serve as your State CIO and the Executive Director for the Georgia Technology Authority. GTA served as the State of Georgia by, served to state of Georgia by delivering secure, reliable, cost, effective technology services. Strengthening statewide cyber security. Overseeing major IT investments and supporting agencies as they modernize how these serve Georgians. I am mindful that I'm standing between you and your lunch, so I'm going to be brief here on the Governor's recommendations. You will find GTA's budget. Underpayment for Georgia Technology Authority, you will see a request for $7.5 million to increase funds to continue the statewide enhancement and standardization for cyber security services for the executive branch agencies. These funds support one-time investments to continue strengthening cyber security across these agencies. Investments include enhancing threat detection, expanding monitoring capabilities, improving incident response, and tools that help agencies better protect and serve sensitive citizens' data. These efforts reduce enterprise risk, improve resiliency, and help prevent costly disruptions to government services. For the Technology Empowerment Fund, next, you will see a request for $35 million to increase funds for the Department of Community Health, Integrated Eligibility System. This request represents the remaining portion of the funding that DCH and DHS projected last session, which was $70 million. $35 million was given, was appropriated for FY25. The current request completes that original approval. The third item that you see is a request to utilize existing interest from the Technology Empowerment Funds in the amount of $7,930,340 for two projects. 7.5 will be used for the ERP Modernization System that Commissioner Hines and Officer Jelder just mentioned for the next-gen project. The State Ethics Commission is requesting $430,000. This addresses additional costs associated with the Ethics Commission system replacement. The original project scope did not anticipate subsequent statutory changes requiring new system functionality in NOAA, the requirement to retain 10 years of the legacy systems data. That data must be maintained, so these additional funds will go to help that. We appreciate your support for these funding requests, and that's the request for the budget. Now I want to go into some highlights for GTA. So GTA is not requesting any funds in FY27. However, through the Governor's FY27 recommendations, you will see statewide reductions administered through GTA. I think we'll list it there 151 times. Overall, building is expected to decline by $8 million, and that is a result of my team negotiating for 11 months on three of our major projects. So these reductions reflect adjustments across all agencies driving lower costs resulting from the negotiations of those contracts. Some of the key notes GTA now provides security and enterprise services for over 1,200 government entities. Agencies may experience different impacts, some will see savings, and some will see increases. And that is because it depends on the services that they're given. Overall, these changes reflect greater transparency, better cost alignment, and improve value for the state agencies. Now that we've got the budget out the way, I want to look at some initiatives that GTA has. Our AI and Horizon's Innovation Lab, you see here. I like to highlight that this lab, which officially opened with a ribbon-cutting ceremony on July 16, attended by Governor Kim and First Lady Marty Kemp, we often describe this lab as a state technology test kitchen. It's a collaborative space where state agencies and local government can bring real world use cases into the lab and work alongside some partners that we've already vetted. That's in the AI space. The key value is that we test ideas in the controlled environment and we have three controlled environments, one with AWS, one with GCP, which is Google, and one with Microsoft Azure. Allowing projects to pass or fail before they're put into production. And that's the main reason for this lab. When AI jumped on the scene, we have people ready to use AI, but we wanted to make sure we had a space where they can come in and use these tools in a controlled environment. This lab gives us a smart practical way of piloting emerging technology, designing better digital services and innovating responsibly. This next slide, you'll see we're talking about ADA and digital accessibility. GTA is leading a statewide effort to ensure that all digital services meets the DOJ ADA accessibility requirements where there's a deadline of April of 2026. We're working directly with agencies to conduct accessibility audits, remediate websites and PDFs, and track across Georgia.gov website portals. We also partner with vendors like California America and Citigroup Roundtable to help agencies identify and fix accessibility issues at scale. As a result, agencies are on track to be fully compliant and significantly improving access for Georgians with disabilities. My Georgia. My Georgia is a new way for Georgians to access services securely. And it does something pretty powerful. It eliminates the use of username and passwords. We all know how hectic that is and how we forget to, we forget our username and passwords and now you need a long username and password and sometimes we use them over and over again. Instead of users identifying their, users verify their identity with the username and password, they will now verify that by taking a live image of themselves, which is securely matched to the state issued ID or passport. That live check confirms that the right person is standing before you at the time of any transactions. Now this technology was developed right here in the state of Georgia and I gotta give kudos to the Department of Driver Services. There were the ones that started this technology. So by using pass, by removing passwords, the most common point of failure, we will significantly reduce fraud, strength and security and make it easier for people to do business in the state. And because it's an enterprise solution, all agencies can use it without building their own. Since 2018, GTA has assisted the state in deploying broadband to every location in Georgia. I'm excited to say that we are almost near the finish line of this project. Georgia received 1.3 billion in federal beat funding and September, GTA submitted the final state proposal for the beat funding. The state will allocate nearly 360 million for deployment projects to serve all 119 be eligible, unserved and underserved locations. The technology used for this project is 75% fiber, 12% hybrid and 13% low earth orbit satellites. There's approximately 930 million remaining for non-deployment funds and we are currently waiting for an update of guidance from NTIA on how to use these funds. On this slide, you will see the projects under the Technology Empowerment Fund. There are eight projects that GTA is assisting. Officer Hines and Commissioner Sullivan just talked about one of those projects and you will see the remaining 8 here. I would like to briefly discuss two of those projects. One is what we just heard about from Officer Hines and Commissioner Sullivan, the next gen ERP program. With respect to next gen, the ERP program, the Gold Live date for all agencies, excluding GDOT, has been moved to July of 2026. A key milestone was the completion of the payroll comparison and that has been successfully achieved. The project is currently in yellow, but we are monitoring risk related to benefits, integrations and grants functionality. Future planning for the implementation for GDOT is currently underway and we'll keep you posted on that. The delays is primarily due to underestimating complexity and supporting the full range of agency business processes as well as additional functionality that must be developed by the vendor workday. As of December 15th, TEPH expenditures of a little over 66 million against the 108 million and any additional costs which I don't think there will be will be paid for by the agencies. The next project I want to highlight is the State Ethics Commission Refile Replacement. This project has generated significant interests among legislators. The contract was awarded in October of 2024 and the first three modules, Campaign Finance, Lobbyist Registration, and Personal Financial Disclosure, have been successfully deployed, successfully deployed. And I hope that you guys are finding the system to be more user friendly. If not, please let me know. The system also incorporates statutory changes from HouseBuild and Senate Bill 199 that was passed during the previous legislative session. Total expenditures to date is the low over 1.8 million out of the 2.7 million allocated for this project. The remaining modules are scheduled for implementation in early 26. Through the Technology and Power Myth Fund, GTA provides strong oversight. We support agencies with technical expertise. And Governance needed to reduce risk and achieve a successful outcome on their projects. I sincerely appreciate the continued support from the Governance Office in this committee. Your investment enables GTA to strengthen cybersecurity, modernize government systems, improve IT service delivery, and expand broadband access across Georgia. We value the partnership and remain committed to being responsible stewards for the resources you have entrusted in us. My contact information is listed here along with cameras. If you have any questions, please feel free to reach out to us. And I can answer any questions about anything that I presented today. Thank you, Director Thomas. I got a couple. And it may be more for Department of Community Health than you, but the eligibility system? Yes. Where does that have a completion date? Do we have a date that's going to be done? We do not have a completion date yet. Right now, we are working with both agencies together requirements. As Gerald Hanz said, the next-gen project is going to be the biggest project we've ever undertook so far, but I think the next-gen project will be the biggest. So working with those two agencies, we're working on the requirements. And once we get those requirements to see what that looks like, we can give you a date of the live. And the other... It's my understanding that not all of our state agencies are under your purge. Correct. Don't you think it would make sense that they were from a technology security standpoint? From a security standpoint, yeah. And when we say under our purview, we really just want the visibility into their systems to make sure we understand who's in there, who has access, what is going on, what are they doing if they're dropping off anything. So the visibility isn't really what we're looking for. So what we can do by that? Represented buttoner. Thank you, Mr. Chairman. This is kind of a follow-up on that. For years, we've heard from agencies and public schools that if, let's say, a foster child is moved from Savannah to Columbus, their records, they take six weeks to get there. So you don't know their health records, their behavioral health records, other school records, whether they have an IEP or any of that until all those records arrive. The child's already moved, but the records are lagging behind. And I'm wondering with what we heard about the court requiring so much of the Department of Human Services, is there a way for there to be a secure system for all of those agencies like Public Health, Behavioral Health, Department of Human Services that may be in the court system to share information as needed for taking care of individual children. And if so, would that come under your purview? That can be done in collaboration with all those agencies coming together. Again, getting those requirements, looking at the technology stack, that will be needed to get that done, but yes, that can be done. Representative Sharper, you're not a member of the committee, and I haven't let anybody that hasn't been a member of the committee ask a question. But I was going to let you ask a question and be the first one. If you make sure it's brief because we're already... ...and it's a big problem, because we've been working on this for a long time. It's the great deal of moving forward and at that time, but that would be things for the budget to be made sure that we're in the move on. But it just will solve the problems that have... Okay, we have to get out of the town, but I don't know where else to talk about the state, but with this technology and us moving forward, that is safe. If there is an opportunity for partnerships for the more-meditation, local government, the year-a-d, the TTC, that comes to them and somehow, you deal with the more-meditation. If there is a partnership on the up-to-the-up, if we're up here and there here, it's going to be that yet, if not all of you are. So Representative Sharper's mic is not working, and his question was, for those listening, is there an opportunity for partnership with the state of other local entities? Yes, there is. Again, I mentioned that we now deliver services to over 1200 government entities, and some of those are local and counties. So yes, there is that, and that will take a lot of collaboration with those entities, coming to GTA, sitting down, looking at what technology they do have and assessments on their technology stack, their security systems, and getting them on board. But yes, we can do that. That's it. Thank you. Thank you. Have a good day. Thank you all. Let's be back here. One o'clock. One o'clock.",
  "updated_at": "2026-02-13T12:36:40.49535+00:00"
}