{
  "video_id": "zVsR_5EYQbA",
  "url": "https://youtu.be/zVsR_5EYQbA?t=2332",
  "title": "Georgia House - Day 38 (2026-03-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": "2026-03-30",
  "duration_minutes": 222,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThis session was focused on preparing Georgia for the transition to electric vehicles, with the House passing a resolution to create a joint study committee on the electrification of transportation. There was bipartisan support expressed for this effort, acknowledging the importance of developing the necessary charging infrastructure and ensuring Georgia is prepared for the coming shift to electric vehicles.\n\n## Key Actions\n**SR 463**: Resolution creating the joint study committee on the electrification of transportation\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Representatives Jasper, Powell, and Parsons spoke in support of the resolution, highlighting the need to get Georgia ready for the transition to electric vehicles.\n- There was discussion of previous work done in committees on issues related to electric vehicle infrastructure and policy.\n\n## Votes\n**SR 463**: Passed with no objections noted.\n\n## Attendance\nQuorum was present, as the House was in session.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m. House will stand at ease until 2 p.m.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you School's 2022 Star Teacher, commending Utah Mason Wu, Darlington Schools 2022 Star Student, commending Barbara Kukoff, Darlington Schools 2022 Star Teacher, commending Noah Wilson Crab, Peperal High Schools 2022 Star Teacher, commending Joel Knight, Peperal High Schools 2022 Star Student, remembering or commending, Diane Bukio-Almaris, Peperal High Schools 2022 Star Student, commending Michael Bright, Peperal High Schools 2022 Star Teacher, commending Shiven B Patel, our Merchys High Schools 2022 Star Student, commending Kevin Van Der Horn, our Merchys High School 2022 Star Teacher, and for other purposes that completes the reading with privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here is none in the resolutions are adopted. All right, we're going back to the rules calendar. Clerk, I read the caption to Senate Resolution 463. Senate Resolution 463 by Senator Gucci 51st, Council of 46th, Kennedy the 18th, and others of resolution creating the joint study committing on the electrification of transportation. This resolution I've been referred to the Committee on Transportation, that committee recommends that this resolution be adopted. Chair recognizes Chairman Jasper's to present the resolution. Mr. Speaker and members, Senate Resolution 463 will create a joint study committee on the electrification of transportation. As we all know, electric vehicles are here. We see them all around us. The one part that is lacking is the charging infrastructure in Georgia. There's $160 million coming to Georgia over the next five years for this infrastructure. Chairman Allen Powell did great work in this session, trying to figure this out, and I applaud him. And the House Energy Utilities and Telecommuting, Committee to Communications Committee, work on this very important issue. The Senate felt that we really needed a bit more work outside of the hustle and bustle of the session. So this study committee is created to carefully look at establishing a comprehensive plan for infrastructure, economic preparedness, transportation, funding, innovation, and development of a successful electric vehicle market in their state. Study commission will have, the joint commission has 11 members, four house, four Senate, the DOT Commissioner, Economic Development Commissioner, and the Chair of the PSC. I hope you'll join me in supporting this important measure. I'm glad to answer any questions, Mr. Speaker. You have a question if you care to yield. Yes, sir. Chair recognizes Chairman Powell to your right for a question. Well, the gentleman, he'll. Yes, sir. Is it not true that there was a lot of work put into that, into this issue this year, because the importance of allowing resale of power across the state is not currently allowed. Yes, sir. You worked very hard on that. Is it not also true that if the future of this country and transportation is all electric vehicles as ordained by the US Congress by 2035 or whatever it may be, we need to get our ducks in a row so that we're not in the same situation we were brought in? Yes, sir. And especially important to me and those of us in transportation make sure that we get our appropriate tax dollars off the sale of that power to further fund transportation. Is it not also further true that while I'd normally turn a blind eye to some resolutions that come from the Senate, this is actually a pretty fair resolution. Yes, sir, I would agree. Thank you. Thank you. Mr. Speaker, I thank everyone for positive vote on this. I yield the well. The gentleman has yielded the well. We have another member that wishes to speak to the resolution and the chair recognizes Chairman Parsons. Thank you, Speaker. I just wanted to come up and express my appreciation for Chairman Jasper's with this. And there was an incentive to create it in my support for it. And also by the language of the resolution, I'll be a member of the study committee, so I'm happy about that. I felt like I really needed to come up and just say that I want to acknowledge the work that not just Chairman Alan Powell did on it, but also Chairman Chokus had worked on this issue for over a year. I know the last year, this time of the session, he was working on the issue. And we had his bill and Chairman Powell's and the Energy Utilities and Telecommunications Committee. And I want to acknowledge the, not the hard work that I did because I didn't work that hard on it, but I did want to acknowledge the hard work that Chairman, vice chairman of the committee, the Jays of Gillette, and a special subcommittee that we put together. I want to acknowledge the hard work and the time they put into the issue. I think between full committee and his subcommittee, we probably put in three, three and a half, maybe even four hours of hearings on that. We heard a lot and I think was very useful. I am on a advisory committee to the U.S. Department of Energy on electricity. And some of these issues have been discussed a lot. Sometimes the people from the Department of Energy are in there, in particular, the ones who deal with electric vehicles. And I have, I've told them several times to their face that I think that their, you know, the Department of Energy is somewhat out of sync with the American people. I've told them I don't, there's, I live in a pretty large subdivision. I don't think there's anybody there that has an electric vehicle. But I do believe it's an important issue. And it's something what I told the one instructor and subcommittee with was to, even though whether we drive electric vehicles, whether we are, it's something we were necessarily advocates for. It's something that's coming and the reason I know they're coming is not only because of the Department of Energy, but because the manufacturer has, many of them have already said that they now have dates when they will stop making vehicles with gas powered, gasoline powered or diesel powered engines in them. So the time is coming. So Chairman Powell is correct. It's something we need to go ahead and do some work and get prepared for. I would just say that I want to make, one thing I want to make clear up here is that what Chairman Powell and Chairman Chocus, and we were working on in the, in the committee, was a free market issue, a free market of the mom and pop stores, the convenience stores, gasoline filling stations, we used to call them along the highways and towns and cities. If they wish to do this in a free market manner, that there's a way for them to do it. There's a way for them to sell electricity by the kilowatt hour so it can be measured and so it can be advertised, just like you have gasoline advertised on the, on the signs by the gasoline station. I just want to make that clarification that there is a difference. This, this resolution mainly deals with DOT and money that's coming, a good bit of money that's coming from Department of Energy for EV charging stations, I think primarily along the interstates. That's one issue and it definitely, you know, nothing wrong with studying at all. It needs to be studied. And I'm hoping that Chairman Jasper and I can kind of also move into the conversation, the free market aspect of it. And with that speaker, I'll yield a well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair here is none. The report of the committee has agreed to sell this resolution now be adopted. All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no in the clerk will unlock the machines. What purpose does representatives, Stacy Evans rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, isn't it true that Georgia Power has installed charging stations in our state and has crossed subsidized the cost for those stations to all rate payers, whether they have electric vehicles or not. And isn't it true that we had an opportunity to pretend up and protect those rate payers this year and to also stand up for our convenience store owners who just wanted a chance to compete fairly. And we didn't do so. And that I hope that we will study those issues as well. I'm sure those issues will be studied thoroughly. They are important. The purpose of Chairman Powell rise. Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true this may be one of the few things that me and the good lady that you just spoke of, Grion? Well I knew that your IQ would catch up at some point. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Resolution 463. The eyes were 167. The nays were zero. This resolution having received the requisite constitutional majority is therefore passed. Well purpose is Chairman Petri rise. Mr. Speaker, is it not true that some of us in this chamber thought you were fixing to get a will smith smack up there a moment ago? You see this guy with a gun over here? I like my odds. Chair recognizes Chairman Carson. Mr. Speaker, I move this House and Sist on its position on House Bill 517 at a point of committee of conference. Chairman Carson moves that the House and Sist on its position in disagreeing to the Senate substitute to House Bill 517 and that a committee of conference be appointed to clerk or read the caption. House Bill 517 to be titled an act to amend Chapter 2A Title 20 of the Fisher go to Georgia and Ted Irving Lake and Student Scholarship Organizations so it's revived for the inclusion of earned interest in the calculation of minimum revenue obligations for scholarships. As regard to Chairman Carson's motion that the House insists on its position and that a committee of conference be appointed is their objection. There is objection. The gentleman move, the gentleman moves. All those in favor of the motion to insist and put a point will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Representative Rebecca Mitchell rise? Parliamentary inquiry? State's your inquiry. Is it not true that the Southern Education Foundation found after surveying student scholarship organizations and private schools that not one could name a public school that a child using this voucher had attended in the past and it therefore refutes the claim by a KSU study that somehow the state would save money by sending an additional 100 million a year to private schools with little or no public return on investment? I'm sure the lady believes that the assertion to be true what purpose does Chairman Carson rise? Parliamentary inquiry. State's your inquiry. Mr. Speaker, is it not true? This is a very popular program because it gives the ultimate accountability not to school boards, not the deal way but to parents and that the average scholarship cost to the state is several a couple thousand dollars less than the QB funding per student, thus staving the state money on its own. The gentleman so states I'm sure he believes that to be true. Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of the motion. The eyes are ninety three. The nays are seventy three and this house has insisted on its position with regard to House Bill 517. The chair appoints as a committee of conference. Representative Carson of the 46th. Representative Erwin of the 28th. And representative Dubnik of the 29th. We'll read the caption to House Resolution 625. House Resolution 625 by Representative Gilier of the 162nd and others. A resolution encouraging the state of Georgia establish a Georgia Gulagichi has heritage society. This resolution I've been referred to the Committee on Special Rules. That committee recommends this resolution be adopted.\n\nyou you you you you you you you you you you you you you Midwifery was born as African-Americans trained in the art of childbirth, trained others to be midwives, whereby the middle of the 20th century, the 19th century, every community had a midwife in their souls. And folk were born and many of them could brag they never lost a baby. I support this resolution because it's important for the discussion and the conversation to continue an intricate link to who we are as Georgians and southerners. Thank you, Mr Speaker. Thank you so well. Did you have a question representative Kasha? Or did you have? Thank you. Does the gentleman feel- You take a question representative Williams? He'll take one. Do you recognize his representative Kasha? To my friend from the coast, I thank you for bringing this bill, but I have a very serious question. Does this bill include free language classes so that rookies like me can better understand the culture of the great coast of Georgia? I would be glad to support that if I could have a class to better understand you. If you both are teaching then sign me up, okay? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose is representative Mallow rise? I wish my grandmother would have been alive to see this created because she is a native of pinpoint Georgia and a descendant of freed slaves from Oscebaugh, Green and Skittaway Islands. I am sure that you do wish that and that is a great memory there. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the adoption of House Resolution 625, the eyes are 164. The nays are one. This resolution having received the requisite constitutional majority is therefore adopted. All right, let me listen up. I got a little housekeeping announcement here. On your desk, you either have or will have momentarily a supplemental rules calendar that is the product of a rules committee meeting earlier today. The bills are not in your notebooks but they will be, I am told by the clerk's office on the carts in the back and the carts up here to my left at the front. So here is what we are going to do. We are going to take about five minutes. If you want to get the bills, get the bills. Chair recognizes before we take the five minutes, the chairman of the House Rules Committee Chairman Smith. Thank you, Speaker, the rules committee will meet in five minutes for about a two-minute rules committee meeting. House will be in recess for, Bill, 250. Back to the rules calendar. We are on the supplemental rules calendar. Clerk will read the caption to Senate Bill 319. Senate Bill 319 by Senator Antivarthe. The 31st, Payne 54th, Thompson, 14th, Robertson, 29th, and others. We title the Actual Men Article 1 of Chapter 3 of Title 12 of the Fishercoded Georgia Antieta relaying the general provisions regarding parks, historic areas, morals and recreation. This bill I refer to the committee on public safety and homeland security. That committee recommends that this bill do pass by committee substitute. Okay, I'm advised that Senate Bill 319 is in your books, in your notebooks. So that should clear that up. The chair recognizes Chairman Mandy Ballinger to present the bill. Thank you, Mr. Speaker. Members of the House, I come before you again to present Senate Bill 319, which was sponsored in the Senate by Senator Antivarthe. Like the old saying goes, second verse, same as the first. This is the exact same bill that we voted on before. My bill, the House bill 1358, all of y'all should be very familiar with that. It just removes the fee that citizens in this state have to pay to be able to exercise. There's like an amendment right. It's all it does. I'll be happy to answer. I'll answer two, maybe three questions. I'll answer three questions if there are any. Mr. Speaker. Would you believe you don't have any? That awesome. Thank you very much. I urge your favorable consideration. Ladies yielded the well. Have a number of members that wish to be heard on the bill. But remind everyone that opponents of bills have 30 minutes total. Proponents of bills have 30 minutes total. Chair recognizes Representative McLauren to speak to the bill. Thank you, Mr. Speaker. All I did today for this bill for you is I wrote a high coup that I would like to share. Same bill many times. Georgia gun owners watching. Y'all go off, I guess. Mr. Speaker, I yield the well. Chair recognizes Representative Park to speak to the bill. Thank you, Mr. Speaker. So I appreciate the comments that have represented McLauren to bring a little bit of levity to this issue because this is ridiculous. It is not difficult to get a gun in the state of Georgia. But what issue or problem does this bill solve? We saw last year on March 16th a shooter get a gun and within a span of a few hours go on a mass shooting rampage. We know from multiple studies that.\n\nThere is a direct correlation between weaker gun laws and higher rates of gun deaths, including suicides, homicides, and accidental killings. In a moment in which so many Georgians are suffering and facing mental health crises, after such a challenging period of time, why are we making it easier to get a gun in the state of Georgia? We can do better than this. It's one thing to play politics, but it's another thing to play politics and harm those that we're supposed to serve and protect. Now I want to bring Yoll's attention to line 66 of this bill, LC-39-34-49S, that redefines lawful weapons carrier to any person who is licensed or eligible for a license or eligible. So you don't even need a license anymore or be approved by a court to get a gun in this state. All you got to be is eligible. This isn't who we are as a state. And we can do so much better, rather than continue to play politics and pass legislation that hurts the most vulnerable among us. Thank you, Mr. Speaker. You're the well. Chair recognizes representative Roberts to speak to the bill. Thank you, Mr. Speaker. Colleagues, I know you've heard from me on this issue already. I don't typically give our notorious Congresswoman from the 14th in Eoxygen, but after I spoke from this floor on H.P. 1358, she took a direct shot at me on Twitter that unleashed some nasty bullies who want to intimidate me. I know Yoll are just getting to know me, but I come from a long line of fiery Irish women and we don't back down. Members don't back down. That's why an organization is called Mom's Demand Action. And I'm standing up here today speaking again on this issue because I will not back down. Instead I will continue to use my voice to try to convince you, my colleagues, to protect our families and law enforcement. Some of you in this room have admitted you don't want permanent with Carrie and Georgia. I've received many emails from pro-second amendment and people and law enforcement officers that are opposed to this bill. Most people agree that those carrying concealed guns in public should go through a background check in order to do so. Simply put, a strong permitting system is essential part of responsible gun ownership. With rights comes responsibility. The ability means doing everything we can to make sure people who carry guns, especially in public places around our families, go through the process to obtain a permit. Because Georgia doesn't require background checks by unlicensed stillers, someone can buy a gun online with no background check. And the permit may be the only background check a person ever receives. And I told you all last time, 5,200 permits were denied in 2020 and the number one reason is criminal history or mental health history. Georgia needs more gun safety laws, not fewer. No law can stop all dangerous behavior, but why would we want to make criminals feel more comfortable carrying in public? Knowing they can now freely carry no questions asked, give law enforcement the tools to do their job. Requiring a permit to carry a handgun in public is perfectly consistent with the second amendment and no federal court has held that requiring a permit to carry a loaded concealed handgun in public violates the U.S. Constitution. And it does result in more violence. Arizona enacted permitless carry legislation in 2010, the annual rate of aggravated assaults committed with a firearm in the state increased by 8%. Since Alaska enacted a permitless carry bill in 2003, the state has experienced a 65% increase in the annual rate of aggravated assaults with a gun. So I beg you guys today, I know it's an election year, I know this is a priority for you all, but for those of you who've said you know this is a really bad idea or you want to protect law enforcement and families, please have the courage to vote with me today. The mama who's going to fight for her family, thanks. Chair recognizes the leader of the minority caucus, leader Beverly, to speak to the bill. Thank you for speaking. I wish I had more time to look at the 22 states that have allowed this bill. As my colleague just said, data from mom's demand action states that have weakened their firearms permitting systems have experienced a 13 to 15% increase in violent crime rates. But I want to bring this a little bit more home. The Ahmad Arbure killing, the killers had a gun outside their home in their truck due to open carry, which emboldened them to stock and execute him. That's a good guy with a gun. We thought it was okay to see what a bad guy quote unquote was doing. We passed this law and there will be more Ahmad Arbure killings I'm afraid. More George Zimmerman clowns emboldened by a concealed weapon looking to stalk and execute people who look guilty. Mrs. Begah and yield well. She told him to yield well. Chair recognizes Chairman Setsler to speak to the bill. He waves. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. What purpose does the minority caucus whip representative Wilkerson rise to make a motion? I'm not going to recognize you at this time for a motion. Thank you. Chair recognizes we have the chairman's time which by rule is 20 minutes. Chair recognizes the chairman of the committee. Chairman Jay Collins for the chairman's time. Thank you Mr. Speaker. I'm not going to take for just a few moments here today to speak about this bill. I made some comments earlier when we passed our version of this bill out of the house. This bill to me is about protecting your constitutional right to carry a firearm. And I want to correct something that I think the some of the previous comments that have been made here today. I don't know that anybody in this chamber thinks those two people that murder the mod outbreak are good guys with a gun. Murder is already legal here in our state last time I checked and that was murder. This has nothing to do with any case. That's a very unfortunate and I think it's an unfair assessment to this piece of legislation here today. I would just like to say to you is this chamber goes on in the days to come. It's going to be some late evenings ladies and gentlemen. I would say on Monday that when we adjourn, signing die, many of you are traveling on your way home. Should you have to break down, happen to break down on the side of the road? Maybe your cell phone doesn't work. Maybe you've had your cell phone on all day. Maybe you you break down and you have to turn around and walk down the road. Maybe you didn't renew that permitless carry permit or that you're you're you're a carry permit. You want to protect yourself. Why should you have to go to a court and get a permit to be able to carry a gun to protect yourself? That's all this bill is about ladies and gentlemen. That's all this bill is about. I'll ask for your favorable consideration and I'd like to yield the balance of the chairman's time to a couple of other members who wish to speak. Chair recognizes chairman Alan Powell for a portion of the chairman's time. Thank you, Mr. Speaker and ladies and gentlemen of the House. I didn't think that I would need to come up but since there's been several comments that's been made, I'd like to say just a couple of them and I'm going to be very brave for this. I heard a couple of comments was made and one was are you kidding me that we're hearing this bill again? Well, quite frankly, I don't take constitutional rights as a joke or invited to be kidded with. Then I heard someone talk about criminals. Well, criminals are going to carry weapons regardless. This law is for law-abiding citizens because the genesis of this bill and what it says is that you can carry if you're a citizen of Georgia, if you're here in this state, you can carry weapon if you qualify under the current concealed weapons permit statute. So if you're a law-abiding citizen, you can carry a weapon and that's what this says. There's nothing that you can do that's going to stop criminal. When a law-abiding citizen is restricted, criminals have no restrictions, ladies and gentlemen. And then, just as a matter of clarification, I heard the comments about the Arbery killings down on the coast. That was done with a shotgun, ladies and gentlemen. Let me tell you, right now, without any changes in law, nor has it ever been, you can carry a long gun without a permit, never had to have a permit for that. So just something to think about. When you get into the emotions, those who want it, those who don't, those who believe in their first amendments, second amendment, those who don't believe in it. At the end of the day, it's all about your rights to protect yourself. Unfortunately, weapons are used in offensive capacity for different times. But these are supposed to be for a defensive purpose. There's no excuse and the law will tend to those people who violate the law. But in this day and time, probably more than ever. And we see it. And if you don't believe it, cut on the news every morning, whether it's whatever part of the state, there is a certain level of lawlessness and there'll never be enough law enforcement officers to protect you nor your family. So that, ladies and gentlemen, is what this bill does. Does it do anything other than take care of the second amendment rights of the law abiding citizens? That, Mr. Speaker, is what I've got to say on the matter. And I would certainly appreciate your favorable consideration the second time on this bill. Chair recognizes Chairman Rich to speak to the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House. I had not planned to speak to this bill, but some comments that I heard here earlier nudged me pretty strongly here to the well. First of all, I want to emphasize that this bill has nothing to do with obtaining or purchasing a gun. It has to do with whether one is required to obtain a permit to carry. Secondly, I want to emphasize the irony of people coming here to this well, speaking against this bill, that they're the same ones who voted no to Senate bill 479 yesterday, which pertain to punishing criminals who commit a subsequent crime with a gun. I also want to point out that criminals carry guns right now. We know that. We watch the news. I've spoken with my authorities that the killings and the assaults with guns are committed by people who don't have carry permits. Why? Because they would pass a background check. Now I want to tell you about my personal story. In 2008, children were four and six years old. There was a convicted child molester who knew us personally and who was harassing me, sending me mail, sending my child by name, gifts and notes and letters in the mail. And he was due to get out of prison. I, of course, wanted a gun. I have never, I had never at that time held a gun in my hands or shot one. But I can tell you right now, I was prepared to shoot that man. This mama bear, this is the only thing that gave me any, any power in the situation to protect my children. A gun. I couldn't have taken on that 280 pound man and saved my two preschoolers. The problem is that I couldn't get my carry permit before he got out of prison. So I stayed home with my children because I was terrified to go out by myself without my equalizer. Mr. Speaker, I yield the well. Chair recognizes for the remainder of the chairman's time, chairman Ballinger. By the way, she waves. What purpose does the minority caucus whip representative Wilkerson rise to make a motion? State your motion. I move that we table Senate Bill 319. Representative Wilkerson has moved that Senate Bill 319 be tabled. All those in favor of his motion to table will vote I. Those opposed to tabling the bill will vote no and the clerk will unlock the machines. The board will vote no. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion. The eyes are 66. The nasor 101. The motion to table has failed. The previous question has been ordered. Is there any objection to adopting the committee substitute? Chair here is none in the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote I. Those opposed will vote no and the clerk will unlock the machine. What purpose does representative McLeod rise? Parliamentary. Is it true that the constitution already gives us the right to bear arms and is it true that guns don't kill people? People with guns kill people. What purpose does representative Rick Williams rise? Parliamentary. Is it not true if I was any more pros second amendment my last name would be Winchester? What purpose does representative Mary Francis Williams rise? Parliamentary inquiry. Is it not true that while I was moved to tears by the testimony of my fellow House member representative chairman Rich that I wish I had the constitutional right not to constantly be surrounded by guns and be just as afraid in a different way. Thank you. Okay we're going to do one more here what purpose does representative Holly rise? Parliamentary inquiry. They turn inquiry. It's not true Mr. Speaker that the main reason we can show our support for the Georgia Sheriff's Association is not by simply putting those nice tags on our car but probably the past legislation that puts would be folks who would ambush them in serious situations getting those people before a judge and that if those offices further happen to lay down their lives and the years going ahead they can look back to this 2022 legislature that put those persons who harmed them away from a judge a constitutional officer that could have better given them the permit. I'm sure that the gentleman believes that to be true just don't remember all of it. All right I said one more but now that we are going to final one what purpose is representative Hagen rise? Mr. Speaker isn't it true that when I ask what purpose are you rising? Parliamentary inquiry. Stay true inquiry. Mr. Speaker isn't it true that when I ask my sheriff how he felt about concealed carry that he fully supports the citizens that he represents to be able to defend themselves? I'm sure that the lady is speaking the truth. Okay have all members voted? Have all members voted? If so the clerk will lock the machines. On the passage of Senate Bill 319 the eyes are 100 the nays are 67 this bill having received the requisite constitutional majority is therefore passed what purpose does Chairman Bershit rise? Make a motion. State your motion. Make a motion that we immediately transmit to the governor's office. Or to the Senate my apologies my apology. I cannot. I'm not going to I can't recognize you for that because the clerk tells me we automatically immediately transmit on the last three days of the session. So we had one more. Well purpose is representative Kannon rise. To make a motion. State your motion. Checking to see if it's possible to make a motion to move on reconsideration. Are you sure? The lady has the right to ask for reconsideration. All those in favor of the motion for reconsideration will vote aye those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will lock the machine on the ladies' motion for reconsideration. The eyes are 65 the nays are 101 and the motion has failed. The clerk will read the caption to Senate Bill 361. Senate Bill 361. Senate Bill 361. Senator Walker the 20th. Harveston of the 15th. Most of the 53rd. And others being tall enough to amend chapter 7 to the top of 48 of the fiscal to Georgia and said it relating to income taxes. So as to enact the law enforcement strategic support act. Miss Bill ever further committee on ways and means that committee recommends that this bill do pass by rules committee substitute. Chair recognizes chairman gains to present the bill. Thank you Mr. Speaker. Proud to present House Senate Bill 361 this afternoon. This measure is an important one that will help us support our law enforcement across across the state as we've seen increase in crime and you know last year we passed an important bill in this chamber and signed by the governor that ensures we don't defund the police across our state. This legislation will further that effort to make sure we're providing the resources there are law enforcement agencies need across across Georgia. Senate Bill 361 is a priority of the Senate and lieutenant governor to provide additional resources to our law enforcement agencies the less crime act. This allows citizens to support their local agency through a tax credit program. The less crime act provides a state tax credit for individual taxpayers and corporations they contribute to a local police department or a sheriff's office of their choice through an affiliated law enforcement foundation. Contributions can be used for raises for law enforcement officers training and equipment and the costs for setting up co-responder teams which is legislation included in House Bill 1013 and an additional Senate bill that's on our rules calendar later this afternoon. The program is capped at $75 million in total and each foundation will be able to accept $3 million to ensure that these resources are being spread throughout the state. Individuals can contribute up to $5,000 per year through the tax credit program and married filers can contribute $10,000. This program has significant transparency features to ensure through the Department of Revenue to ensure transparency in the program. Let's help our law enforcement community by passing Senate Bill 361 it passes unanimously in the Senate and proud to be here today to present this afternoon. Mr. Speaker if there are any questions I'll take them. You've got a lot of questions. I'll yield for a lot of them. I'll yield for a couple. Okay or maybe one or more. One or more. Chair recognizes representative Al Williams to your left for a question. I think I'm speaking to the gentleman yield. I will. I found some very good things in your bill. The only thing that eluded me is all the money. Is there anything in there to pay these poorly paid deputy sheriffs? Well this legislation would allow for if a sheriff's department had a foundation set up it would allow for bonuses for deputy sheriffs and other law enforcement officers across the state. Thank you sir. I think that's more needed in a lot of gadgets we're requesting to pay folk a decent livable way to risk their lives. Well we certainly are grateful for our deputy sheriffs all of our law enforcement agents and anything we can do to support them I think is very important. The speaker I'll share. Chair recognizes representative Yasman Neal to your left for a question. Thank you Mr. Speaker. That's a gentleman yield. I will confirming this allows for businesses to donate to these foundations as well. Corporations that's right up to 75% of their tax liability. So just confirming this also makes it where it will reduce taxpayer dollars being spent on police costs. That would essentially say the taxpayer's money correct. It would say the tax well it would be a credit so their their tax dollars would be they would have the choice to use those tax dollars to support their local law enforcement agencies. Okay thank you it's a good bill. Thank you. Chair recognizes representative Debbie Buckner to your\n\nfor a question. Does the gentleman yield? I will. I think we had a similar bill to this in committee and we had some concerns about transparency being a problem in that it could be misunderstood that money was given to this foundation in exchange for some kind of labor. So in lines 114 to 117, where will that lead names addresses and donation information be housed? Who will have access to that? The Department of Revenue. So we did through the concerns of the committee that was one of the changes in the house that made sure that that information wasn't publicly disclosed because that was a concern and that has been addressed in this measure. Thank you. Thank you. Mr. Speaker, I'll yield for one more if there is one and then I'll yield the well. Let's um, Chair would like for you to answer a few more questions. Chair recognizes representative Wolenski to your left for a question. Thank you. Does the representative yield? I will. Just with this law enforcement foundation, can that foundation represent multiple police departments or no, it would be one foundation per one law enforcement agency. That was another change in the house to clarify that you could only have one foundation per law enforcement agency. Thank you. Chair recognizes representative Rick Williams to your left for a question. Paul with Judge gentleman you. I will. Thank you very much for this bill and in response to our representative Al Williams question. Didn't I introduce a bill requesting that all local law enforcement that their salaries be state tax exempt and we want to help our local law enforcement officers and hope we'll continue to do what we can for them. Thank you. I'm certain that is true. Thank you. Thank you. Chair recognizes representative Becky Evans to your left for a question. Does the gentleman yield? I will. Yes. Isn't it true that during the public safety hearings on crime through this summer in fall that we learned one of the problems was that many criminal jurisdictions had not entered dispensations into their systems and many departments were behind on that issue. And is that is that true representative? I'm sure if I'm sure it is if you believe that to be true that that was they come out of hearings but yes and is my question to you is is will all this these grant these donations will law enforcement be able to use that to supplement their personnel so that they can take care of this these database requirements. So the program will allow for the three qualified expenditures that I mentioned which would be raises because you know it is a year-to-year program so you wouldn't know for many given year how much money is going to be coming in the following year so you wouldn't want to base in a salary on that because you're not guaranteed that same amount the following year so it will be allowed for bonuses which up to two per year equipment training and then the co-responder program so that's that's the qualified expenditures in the program. All right thank you. Chair recognizes representative of Nullowicz to your left for a question. Thank you does the gentleman yield? I will. My question has to do I know with with civil asset forfeiture for example there have been many incidents of abuse arguably with that you know you've had sheriff spying souped-up Dodge Chargers and the like there's now we have a process in place in the state from where accountability and transparency what's going to keep these funds from being spent on things like souped-up Dodge Chargers. Well I think that the language in the in the in the bill makes it clear what the qualified expenditures are and you know I believe that again when you're limited three million dollars per single agency that law enforcement agents agencies will use the money wisely and and in ways that will help their communities stay safe. Chair recognizes chairman martin to your right for a question. Jim and Neil. I will. I don't mean to be pulling you straight. No no no. No serious question. We've made some changes to this bill when it goes back and I guess I have a question it's three million dollars per foundation correct regardless of the size of the law enforcement agency isn't that true that is true and I understand we're trying to be equal but isn't it also true that like here in metro Atlanta you could have a a floating county sheriff or floating county Marshall Atlanta police department floating county police department and right here within you know 40 miles of the capital we could we could use 12 million dollars of the 75. Each agency would have the opportunity to raise three million dollars the cap would open at the same time and so I you know obviously would want agencies across the state to to to and everyone would have equal access to apply for those funds certainly and I mean I mean this is an a positive way if the gentleman would would bear with me and to do that but isn't true also in the hearing we heard from the senator carrying the bill senator Walker that part of this was to help our smaller police agencies that is true and that's that's part of the reason why the house lowered the cap from 5 million to 3 million which I think you know is a is a is a good positive change to the bill to make sure that more law enforcement agencies have access to the 75 million dollar cap so I would I would go here then and say I and I have to if you would if you'd allow me this one and then I find one it wouldn't it be if if this goes over and comes back to us would it be reasonable to in the discussions with the senate further perfecting this bill to maybe put a tie a size on it so that a large metropolitan area doesn't have the same amount can't eat a larger amount in the in a certain area to take it away from our smaller department if there's if there's language available whether in this bill or we could come back next year and look at that change I certainly think that's in the last technical question I would ask I know there's an individual and a limit for a married couple in the corporate limits can that be split amongst different foundations so could I as an individual as long as I didn't exceed the 5,000 could I split that to agency a bcd a thousand dollars each is the bill allow for that that's my understanding that you would be able to give up to five thousand dollars but you could do a thousand dollars to five different agencies thanks thanks joman I'm ready to keep on going okay chair recognizes chairman chelka's to your left for a question thank you mr speaker does the gentleman you I will isn't it true that some of the the issues that face rule georgia are crime and that we don't have as large a tax base in rule georgia to be able to support law enforcement as much as we would like to and wouldn't this allow corporations within those communities to be able to give to their local law enforcement officers organization that would make the community better but also improve our opportunities for economic development absolutely no I think it's important measure that'll help law enforcement agencies across the state and particularly a rural georgia to provide that necessary funding thank you for the question great bill thank you chair recognizes representative gravely to your right for a question so gentlemen you I will I have a serious question line line 19 of the bill for instance where it says law enforcement foundation means any domestic nonprofit corporation with the sole function of supporting one local law enforcement unit through a formal relationship recognized by such local law enforcement unit so in Pauling County we have organization called Pauling Public Safety Appreciation which is a non-profit spending it's been in operation for the last 10 years but if you go down further so does the bill allow for this particular nonprofit my understanding is if there's an agreement between the local law enforcement agency and that nonprofit it could be the foundation so that the foundation but that law enforcement agency would have to agree you know that they would have to agree to do that because you can only have one per law enforcement agency okay so one foundation one foundation in my community that could agree or create with the share of the sheriff's office that's right if the sheriff's office chose one non-profit in the community could let's say the higher-on-police department choose that same one or would they have to choose another one I believe they could use the same one or they could do separate that's my understanding but they could one law enforcement agency could only be attached to one foundation okay if that if that answers the question one further question if you'll yield sure online 35 a qualified expenditure I'm just proud that you're able to you know read through the bill well I'm listening that's it you know I've been known to pull out of funny every now then I'm waiting for for your monthly you know a zinger on the floor so if you'll center McGloren has them every day but he usually kind of old amounts but before we get to that if you'll tell me where you buy your deer your beer deer die I'll buy the same one and we'll have the same that's a top secret for going forward with a qualified expenditure means the spenders made by okay for salary supplements are you saying that this non-profit could provide a salary supplement to the sheriff's office under this agreed upon relationship correct it could not be a salary but it could be a bonus salary supplement it's written in the bill up to two times per year and again the goal there is is in terms of salaries you don't want to have a have an expenditure that's going to be year after year when you don't know how much money is going to be coming in from the foundation so you want to make sure that you're not having it recurring expenses you could do raises or bonuses excuse me okay thank you chair recognizes representative Tyler Paul Smith for a question to your right would and please representative speak where I can understand what you're saying yep yes sir mr. Speaker does the does the gentleman yield highwill if I could direct your attention to lines one fifty three three one fifty seven you'll find on page seven of the bill okay does the gentleman agree that this is a good response to the representative from it is you know Cobb County area that asked about the Dodge charges and such that how they that's right they have to disclose how they're spending and how much money they're taking in that tribe yes and with the gentleman further you I will would a red man day must not lie if they were trying to buy them sleep the Dodge charges with this funding I would trust my lawyer friend on that one thank you thank you for being a professor well I appreciate the time that the body is given us and I'll ask for the house is favorable consideration and yield the well is there any objection to the previous question being ordered that chair here's none the previous question is ordered is there any objection to withdrawing the committee substitute that chair here's known the committee substitute is withdrawn is there any objection to adopting the substitute offered by the committee on rules the chair here's none the rules committee substitute is what adopted is there any objection agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. If all members voted have all members voted. If so the clerk will lock the machine on the passage of Senate bill 361 the eyes are 153 the nasor 5 this bill having received the requisite constitutional majority is therefore passed. I am pleased to announce the state Senate has just passed. House bill 1013. 54 vote nothing. I still got to come back over here. So you get to vote for it again. And we'll have it printed soon and we'll take care of that. So I can read the caption to Senate Bill 403. Senate Bill 403, the Senate of Watson, the first albert is 56 cows into 46 Roberts. In the 29th and others, we get a title of Act of Amendment. Title 37, the Fisher go to Georgia, and it's related to mental health. It's just an act that Georgia behavioral health and peace officers are co-responding at. The committee on Health and Human Services and committee recommends that this bill do pass by committee substitute. Clerk will read the caption to Senate Bill 403. Senate Bill 403, the Senate of Watson. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. This truly is a historic day and I am proud to bring you Senate Bill 403, better known as the co-responder bill. One of the problems that we have with the mental, with people that have mental illness is that to get them into care, they have to commit a crime, and usually. And that's why our sheriff's facilities and our prisons are full of people that have mental illnesses. And one of the things that we have wanted to do as we've worked on this major mental health bill is to change that. How terrible to have a true mental illness to be treated, to get better, and then face having to do with our, and have to be in our court system. So they have developed a co-responder bill. What this means is that our police, if they want to in the individual areas that they represent, our sheriff's can set up on their own co-responder model, or they can work with our CSBs. And what they do is they get training on how to deal with people with behavior problems. And then they answer the calls that are deemed to be those of people in mental crisis. Usually, and what they do is, usually the police will go out, and they're the first responders. And if it looks like this is a mental health crisis, they will call the co-responder team. What happens then is that a trained policeman, a trained sheriff, will join with a trained mental health worker. There'd be a psychiatrist, if somebody's fixing to jump off a bridge, or it could be a social worker. And they will then go and relieve the police, or the sheriff's that got there first, and try to de-escalate the situation, using good mental behavior techniques, and be able to get the person to calm down or to respond in a positive way, and to then decide where they need to go to get the proper care without being charged with a crime. We've got great examples of this down in the Savannah area in Chatham County. They have put this into action, and the number of arrests have gone from 90% to 10%. One of the other nine areas that have set up these co-responder teams went from 208 arrests to two arrests. This is the way that we should be dealing with our mental health people. Here again, no one is requiring police to do this, but hopefully they will work with our CSBs across our state, and we'll all 23 of them, and set up these co-responder units. So this is what it does, and I will be glad, Mr. Speaker, to answer any questions if I have them. If not, I will yield well and ask for your posse vote on Senate Bill 403. We have two members that wish to be heard on the bill. Chair recognizes representative Cannon to speak to the bill. Thank you, Mr. Speaker. I'm rising in support of Senate Bill 403. I wanted to make sure that everyone understands. The main reason that many of us are supporting this is because it does finally define behavioral health co-responder, something we've been wanting to do for a while. This is a person who can respond to a 911 call and make the choice whether or whether or not to arrest someone, and that person who is going through a mental health episode. We want to be clear that we believe this will help to actually save Georgia taxpayer dollars, because we will reduce the number of people with mental health episodes in our prisons. And just locally, I want to speak to what Atlanta and Fulton County has done. We've had pre-arrest diversion programs, which have been able to help co-responders, even though they have not been able to be defined by the state code to do this great work of determining if someone needs to be incarcerated or not. So I'm standing in support. Thank you very much. Chair recognizes representative Neal to speak to the bill. Thank you, Mr. Speaker. Today, I rise to speak in support of House Bill, pardon me, Senate Bill 43, as a former police officer who has been involved in a variety of emergency situations to include responding to a number of mental health 911 calls. I understand the need for this bill. As a former officer, former detective who like many are, and now, with the passes of 10-13, and now Senate Bill 403, we did not have this bill, and we did not have proper support in the mental health space to assist us on 911 calls. This changes everything in conjunction with House Bill 10-13. This changes everything. So for me, I met with my chiefs in my county, and now we do have this program as of last year, and across the state, the individual cities or counties who have implemented this, implemented this thus far, has demonstrated wild, wild success. So I urge you to support Senate Bill 403 for the betterment of our citizens and for the betterment of our state. Thank you, and I yield the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair, here's none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The Chair, here's none. The report of the Committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. What purpose does Chairman Dubnik rise? Parliamentary Secretary. Secretary inquiry. Mr. Speaker, is it not true that over the past three years, members of the Gainesville and Hall County community through public and private partnerships have worked to seek and secure grant funding to put a mental health worker and clinician on staff with the Gainesville Police Department and that the success that they are seeing in our community is overwhelming. And I applaud this House for the passage of Senate Bill 403. If the gentleman so states, I know he's very knowledgeable about his community and the issue. What purpose is representative Sharper rise? Parliamentary inquiry. Statue inquiry. Is it not true in the over 30 years that I've been in the medical field and been on some of these things where we have law enforcement and mental health patients that this is going to be a great bill. It is something that we need it for a long time. Instead of having these people placed in jail, or even at the ER for hours and hours, they will be in a program like this. They will have possibly facilities that they can go to and also be taken care of. And is it true that we had some great presentations from some places across Georgia that have some type of model like this already set up and they are already seeing great benefits? Thank you. Okay. Have all members voted? Yes. Have all members voted if so, the clerk will lock the machine on the passage of Senate Bill 403. The eyes are 165. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 374. Senate Bill 374 by Senator Tillery. The 19th of statler, the 52nd, work of the 11th of Kennedy 18th, being titled an act to amend Part 3, Article 4, Chapter 12, the Title 45, with the official code of Georgia annotated, relating to the Georgia Data Analytics Center, so to provide for definitions. This bill I refer to the committee on judiciary, that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Dempsey to present the bill. Thank you, Mr. Speaker. It is a great day in the Georgia House and the Georgia Senate for the moment at least. Let's celebrate that for sure. I bring to you Senate Bill 374. There are two measures in this actually. The first requires that all state agency fees be paid into the state treasury on a monthly basis. It requires a reporting mechanism to increase transparency of all funds collected, that that report be on August 1st annually to the OPB, the House and Senate Budget offices. The second part of the bill deals with a measure that some of you were here when we passed HB 197, back in 2019, to establish the all in the office of planning and budget, the Georgia Data Analytics Center, to make sure that agency information can be transferred between one another. This measure, though, will allow GDAC to be implanted into each and every state agency to allow for that cooperation and to receive or access data, necessary data. Certain federal rules and regulations require that state entities be designated as holders of certain data. For example, DCH is the holder of Medicaid data. But if a child is in defects, custody, and we're trying to determine all those assessments, DHS has to run diagnostic tests, sometimes those exact mechanisms that are already run by DCH and by Medicaid, because DHS doesn't have the ability to see the DCH assessments. This bill uses GDAC as a conduit to meet federal rules and regs and still share information so Georgia taxpayers aren't dealing with duplicative payments and Georgia citizens aren't subjected to unnecessary duplicative assessments.\n\nThe piece of any confidential or privilege information is protected and maintained throughout. Mr. Speaker, that is what the bill does. If there are any questions, I'll be glad to take them. Or step away. I know we have another speaker that wishes to speak to the bill as well. You have no questions. Thank you. I ask for your favorable support. Chair recognizes the majority caucus whip. Representative Hatchett to speak to the bill. Thank you, Mr. Speaker. I know the hours late, so I'm going to be very brief. Section one and two are about the collection of fees by all the different agencies and departments of our state. Back in 2006, the state auditor did an audit of all these fees that are collected across our government and found that hundreds and hundreds were either not adequate, shouldn't be being done. We're collecting fees for the same thing at different rates. So what this does is it makes sure that all of these fees, unless they're otherwise designated, they come to the general fund, the general treasury. That way, we can do our constitutional responsibility with the budget and make sure that we are controlling and making sure where all these appropriations are made. Thank you, and that's what Section one and two do. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. The Chair here shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 374. The eyes are 163, the nasors zero. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to Senate Bill 379. Senate Bill 379 by Senator Strickland of the 17th, due to the 30th Thompson of the 14th, mill of the 49th and others being titled an act to amend Chapter 4, titled 20, the fiscal to Georgia Antietta, related to vocational technical and adult education. The Chair here is the chief executive of the state board of the technical college system of Georgia to establish a program to promote the creation expansion of registered apprenticeship programs. This bill, having further committee on higher education, that committee recommends that this bill do pass. Chair recognizes Chairman Martin to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the caption speaks for this bill. This allows the TCSG to create a program in conjunction with the U.S. Department of Labor to encourage apprenticeships here in Georgia. It has various definitions that tie back to the U.S. Department of Labor to ensure that all of the participants are abiding by state and federal law, regards to employment and ability to work in the United States. It lets the state board create a list of high demand workforce jobs that will be part of this. It limits the amount to be spent on each internship at $10,000 and there is in the current budget a bit over a million dollars to support this. So this would help at least 100 people get started into an internship. I should say a print is ship program to help Georgia get to work in trades or high demand areas. With that, Mr. Speaker, if there are technical questions about the bill, I would answer them and ask the House's favourable consideration on Senate Bill 379. Well, I can't judge if they're technical or not. I just call on them, okay? Yes, sir. I'll assume they're good ones. They're recognized as Chairman Petrie to your left for a question. My other left. Yes, sir. Mr. Gentlemen, you? Yes, sir. This bill refers to employer sponsors. Does that include, I hope, also our trade unions? It can. The trade unions have ongoing apprenticeship programs. The way the program is set up, there would need to be a contract with an employer, but how the monies are then distributed to that apprentice through that employer, they could work an agreement with the trade unions. Yes. Chair recognizes representative Bentley to your left for a question. Thank you, Mr. Speaker. There's a gentleman here. I do. Mr. Chairman, is it not true on lines 30 of this bill? It states any entity operating in the apprenticeship program and the funeral homes operate apprenticeship programs? Is that not true, Mr. Chairman? If the ladies states they operate them, I'm sure you're familiar with that business. And is it not further true, Mr. Chairman, that I am going to support this bill, but I do want this body to be aware that funeral homes do require students to be a part of an apprenticeship program for over 3,000 hours and those students do not get paid to participate in that apprenticeship program. Is that not further true, Mr. Chairman? You have made that a, you have made the chair of the committee when we were in committee aware of that and spoke highly of that. And I would say, and I don't mean to, I don't mean to be joking where I say clearly that field is a high demand field. We need people in that business and that the training requirements are so intense, I would think they could be a part of this high demand workforce. Yes, ma'am. Thank you, Mr. Chairman. Mr. Speaker, there are any other questions? I'll try to catch them off the floor. No further questions. Thank you very much. I ask favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 379. The eyes are 166. The days are one. This bill, having received the requisite constitutional majority, is therefore passed. We're going to take a break until 4.30. This house will be on break until 4.30 p.m.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you agree with you to disagree with the Senate, right? On Chairman Workhizer's motion that the House disagreed to the Senate, substitute to House Bill 1425, is there any objection? Chair here's none, and this House has disagreed. Chair recognizes Chairman Rhodes. For a motion. Thank you, Mr Speaker. I move that the House agree to the Senate, substitute of House Bill 1147. Chairman Rhodes has moved that this House agree to the Senate substitute to House Bill 1147, the clerk will read the caption. House Bill 1147 to be titled an act to amend chapter 3, title 27, if it's good to George Antitt, really, in a wildlife generally since the authorize hunting and trapping of raccoons in a possum year round. Chair recognizes Chairman Rhodes to explain his motion. Thank you, Mr Speaker. This was a great bill when it left here and it's a great bill coming back. The only thing to change is we will be able to hunt and trap raccoons in possums year round on private property only. WMAs in all state lands owned by the state and least by the state will state just the way they are. I ask for your favor consideration. Wait just a minute. Wait, wait, wait, wait. Representative Al Williams, do you bless this motion? Bless you, my chairman. Thank you. Thank you for the blessings. On the gentleman's motion that this House agree to the Senate substitute to House Bill 1147, all those in favor of the motion will vote aye. Those opposed will vote no and the clerk will unlock the machine. Thank you. Thank you. Thank you. All members voted have all members voted if so the clerk will lock the machine on the gentleman's motion. The eyes are 155. The knees are 10. This House has agreed to the Senate substitute to House Bill 1147. What purpose does chairman Newton rise to make a motion? I move that SB 342 be moved from the Health and Human Services Committee to the Committee on Access to Quality Healthcare, both chairman and our in agreement. Chairman Newton has moved that Senate Bill 342 be moved from the health and human. What purpose does chairman Cooper rise? Mr. Speaker, I didn't agree to that moment. Thank you all. I have a discussion. You want to withdraw your motion for now? I withdraw my motion. Motion is withdrawn. What purpose does chairman Hitchens rise? Make a motion. State your motion. I move that the rules be suspended so the bill can be read for the first time in the Senate Committee. Chairman Hitchens has moved that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a sign to committee. Clerk will read the caption. A resolution creating the House study committee on Georgia driving under the influence law. All in the gentleman's motion is their objection. Chair, here's no objection. It is so ordered. It will be assigned to the Judiciary Committee. I will have some local bills that have come over from the Senate. Chair, will ask for unanimous consent that the rules of this House be temporarily suspended to allow these bills to be read for the first time in a sign to committee. Is there any objection? Chair, here's none. And it is so ordered. They will all be assigned to intergovernmental coordination. Chair recognizes Chairman Todd Jones for a motion. Sorry for the delay, Mr. Speaker. I move that the House agreed to the Senate's substitute to HB 1013. Chairman Jones has moved that this House agreed to the Senate's substitute to House bill 1013. The clerk will read the caption. To be entitled to amend, Todd will 15, 20, 31, 33, 37, 45, 49. And the fiscal to Georgia annotated related courts, education, health insurance, mental health. Public officers and employees, social services, respectively, chose to implement the recommendations of the Georgia behavioral health reform and innovation commission. Chair recognizes Chairman Jones to explain the Senate's substitute. Good afternoon, colleagues. The second time in my success is that I'm speechless. The other time was as for us presenting the bill with Mary Mark, our part of me, Chairman Oliver. First and foremost, I'd like to thank the speaker for the opportunity to work with Chairman Oliver to be able to pilot or co-pilot this bill. I'd also like to thank the Senate and the work that they did with us and the collaboration. We knew that it would be a process and the process allowed us to be able to really refine the bill. And I think what you have in front of you now, all 70 some odd pages on your desk, I think really represents, I think, a great step forward in mental health and substance abuse for our great state. I'd like to just highlight some of the things for you that I think you'll find very important. First and foremost, we can say, emphatically, that upon the passage of this and the signing by the governor, that the state of Georgia has parity. Loving left noses us our human arise. You know what I'm saying? Thanks for being there, let's pick a seat, everyone, breeze the breeze on snail, you need to resolve that. Hi-he- unanimously and accept your applause tonight, thanks. is to the state health benefit plan and it is also to Medicaid and peach care. I think that's important because hopefully we will now see that the disease of the mind is going to be treated equally as a disease of the body and we hope that that is something that every citizen, all 10.7 million citizens, not just appreciate but are able to finally get the help that they need. MLR, medical loss ratio, also known as medical spend ratio, Dr. Newton, and that's so important that has remained in the bill at 85% or whatever is contracted for higher. Workforce development has remained in primarily with a key around cancelable loans. Several of you have asked me why is this so important? Just remember this statistic. 59 out of 159 counties in our state do not have a mental health or behavioral health specialist. It is hard to implement parity and it is hard to execute to the MLR standards if you do not have the professionals to be able to help our citizens around mental health and also around substance abuse. Co-responder, thank you for the unanimous support of SB 403, but the funding mechanism for co-responders is in this bill and I would like to thank the entire appropriations committee from the House for that. Finally, there is proper reporting and also the accountability courts and you'll see that in sections 5 and section 6. This is important because of the fact that we've seen the success that the accountability courts have had in other areas and we believe that same application across our entire state will be so important in terms of our ability to be able to really assist mental health and also substance abuse patients. Finally, the reporting, if you don't report on it, you don't know what's happening, you don't know the standards. We were able to refine with our senate colleagues, the amount of reports, the data that will be collected so that we will have a better understanding in terms of where we have actually improved, where we have an improved, where we're seeing parity, where we're seeing proper MLR, etc. I think that is something that is members of the General Assembly, you'll appreciate that level of accountability. Mr. Speaker, that is essentially the very quick summary of the substitute and I would ask for the body's favorable consideration. Thank you. On the gentleman's motion, that this house agree to the senate substitute to House Bill 1013, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the gentleman's motion. The eyes are 166. The nasor zero. This house has agreed to the senate substitute to House Bill 1013. If y'all indose me just for a moment, I can't let this moment pass without saying just a few things. First off, today, hope won. Countless Georgians will know that we have heard their despair and frustration. We have sent Georgia on a path to lifting up and reforming a failed mental health care system.\n\nAnd once again, this house has led. We are. We are reminded again today that truth is a powerful force. Many people are responsible for today. Chairman Mary Margaret Oliver and Chairman Todd Jones have through their work enabled me to see something I have not seen like this before. I saw an R and a D disappear. And a Georgian take its place. I saw Chairman Sharon Cooper remind me again what an amazing committee chair she is. I even had the courage to go to her committee and testify. Everybody should do it once in their life. And I've done mine. I want to thank Senator Ben Watson, Senator Dean Burke, and Senator Brian Strickland from the Senate who devoted much time and put aside our chamber rivalry to make choices that we had to make. The members of the Georgia Behavioral Health Reform and Innovation Committee, two of those members are in this body, Chairman Oliver and Chairman Don Hogan. Most especially, I want to thank a former member of this body and the commission chair, former representative Kevin Tanner. Representative Tanner, it was his vision of a new innovative way to approach mental health care. Which inspired me and his leadership on this issue over the past two years has been extraordinary. And finally, and last only because I may not get through this. A lady who has a beautiful heart and a giving spirit who takes the problems of those who are hurting to heart and refuses to believe that there is no path to help. She is my protector, my defender, my rock to lean on, and the light of my life. And had it not been for her, I probably would not have invested as much as I have into this bill. I know I wouldn't. So I love Sheree Ralston for these and for so many other reasons. Come here, everybody. Thank you. Members of this house, you have given this bill a huge push and you can be very proud today. Few of you will ever cast a vote as consequential as your vote to pass House Bill 1013. And today it was you who gave hope to many, many Georgians. God bless you and thank you for this bill. You You You You The chair recognizes Chairman Sutsler for a motion. Madam Speaker, I want to make a motion to for unanimous consent to move Senate Bill 53 from the Committee on Science Technology to government fiscal affairs and oversight. The chair has moved Senate Bill 53 from science and technology to budget and fiscal affairs. Is their objection? Is their objection the chair here is none and so moved? The chair would ask the body to help the chair in recognizing representative and chairman Matt Dubneck on his birthday today. The chair would also like to recognize another special birthday represented Pedro Maric. The House will not be in session tomorrow and so the chair would also like to recognize another special birthday tomorrow. The chair would like to recognize another special birthday presentative Martin Mom to him. If you have an announcement make your way to the front if you have an announcement. Chair recognizes Chairman Parsons for an announcement. Thank you Speaker. Energy utilities and telecommunication will meet right up on a German. Chair, we can get over there to cover the legislative office building 506. We have one measure and we can be in and out as quickly as you want to make it. So need you over there. Covered billed in 506. As soon as we get over there, one measure. Thank you. Chair recognizes representative McLean for an announcement. Thank you Madam Speaker. Please join us tomorrow for our last working family caucus Zoom meeting. It will be Thursday at 12 o'clock. And you can also go by room 307 to pick up your food and lunch. It will be hybrid tomorrow so it will be Zoom and will be in the room and will also be honoring Dean Smarrick. Thank you Madam Speaker. Chair recognizes representative Anula Weds for an announcement. Thank you Madam Speaker. If any of you all from down Vadeleu way knew Hugh McNat, you know he passed last summer but his legacy lives on through the bird supper. That is tonight you all received an invitation. There will be gumbo, there will be quail, there will be biscuits, there will be sorghum syrup. It is a great event. It is 630. It is not the trolley barn. Thank you. Chair recognizes chairman Matthew Ack for an announcement. Thank you Madam Speaker. We will have a state planning and community affairs meeting right nearly 9 o'clock tomorrow morning 506. Thank you. Chair recognizes representative Davis for an announcement. Thank you Madam Speaker. We invite you to attend a press conference tomorrow at 9 a.m. on the south step concerning three deserts. Which are credit and banking desert, pharmacy desert and food deserts. Thank you Madam Speaker. Chair recognizes chairman Newton for an announcement. Thank you Madam Chairman. The subcommittee on tax revision will meet on adjournment and 403. Our subcommittee will meet then and tomorrow morning the special committee on access to quality health care will meet at 10 a.m. Chair recognizes chairman Collins for an announcement. Thank you Madam Speaker. The House Public Safety and Homeland Security Committee will meet tomorrow from 10 to 12. 406 CLOB. We got some important pieces of legislation. We are going to be taking a look forward to seeing you there. Chair recognizes chairman Knight for an announcement. Thank you Madam Speaker. Just a, I know it's been a late day but a good day. Remind you that the the sportsman's caucus shooting event is actually started a few minutes ago at starters. Ranging guns as midtown and I hope we'll all get over there and enjoy and exercise our second amendment right. Chair recognizes chairman Mitchell for an announcement. Thank you Madam Chair. The Democratic caucus will not meet tomorrow morning as been previously noticed to you. They will meet Friday morning. Please expect information regarding that meeting. Thank you Madam Speaker. Chair recognizes chairman Rich for an announcement. Thank you Madam Speaker. The majority caucus will meet tomorrow at 4 p.m. and room 403. The House majority leader is now recognized for a motion. Thank you Madam Speaker. Madam Speaker I move that this house stand adjourned until 10 a.m. Friday. The first day of April 2022. On the motion of the majority leader that this house stand adjourned until 10 a.m. on Friday April 1. All those in favor will say aye. And all those opposed will say no. The eyes clearly have it and this house is now adjourned until Friday. The House majority leader is now recognized for a motion.",
  "updated_at": "2026-02-14T00:11:37.257981+00:00"
}