{
  "video_id": "zxs6Uug6Rqw",
  "url": "https://youtu.be/zxs6Uug6Rqw",
  "title": "Georgia House - Day 26 (2026-03-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 26,
  "video_date": "2026-03-03",
  "duration_minutes": 123,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview**\nThe session featured a scripture reading and prayer by Pastor Darrell Summy, who provided words of wisdom to the House members on the importance of knowing and serving God wholeheartedly. The main legislative action was the introduction of HB 586.\n\n**Key Actions**\n**HB 586**: No description provided\n\n**Bills Introduced (First Reading)**\n- HB 586\n\n**Notable Moments**\n- Pastor Darrell Summy delivered a sermon emphasizing the importance of fully knowing and faithfully serving God, drawing from 1 Chronicles 28:9-10. He encouraged the lawmakers to have a personal, intimate relationship with God rather than just knowing about Him.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nA quorum was present, as all members reported to their seats for the morning roll call.\n\n**Adjournment**\nThe time of adjournment and date of the next session were not provided in the transcript.",
  "transcript": "They are convening having arrived. All members of this House will please report to their assigned seats. All members of the House will please report to their seats. The clerk will ring the bell. All members of the House will please report to their seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. And the clerk will unlock the machines. All members voted. All members now voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Good morning. Hope everybody is in a great mood today. What a beautiful day out there, huh? Sun shining. We will begin our day today with scripture reading and prayer by the chapel and after which we will pledge allegiance to the flag of our country. Our chapel in this morning will be introduced by the gentleman from the 149th House District Representative Robert Pruitt, representative Pruitt. Thank you, Mr. Speaker and good morning, friends. I come to you this morning and I'm privileged to introduce you my pastor, pastor Darrell Summy. Darrell is a native originally from Panama City Beach, Florida. He's been with the first Baptist Church Eastman with us for a little over 20 years now. But Darrell's wife, Leanne, they're with us outside there and his seven children are at home. But Darrell is a special kind of preacher. He still preaches that teaches the gospel that you and I know. But he's a little bit different from the standpoint of his target audience. So he has been faithful to the ministry of youth. So I've yet to hear anybody introduce a youth pastor here. So I bring to you a little bit different flavor of a pastor and he has done an amazing job with our youth in Dodge County. Well attended groups and has been a great faithful following from that. So without any ado, I'd like to introduce you to and welcome, please, Pastor Darrell Summy. Well, good morning. I want to begin by expressing deep gratitude to Speaker David Walston for the invitation to be here this morning and to my representative from District 149 Robert Pruitt for extending such a gracious welcome to me and to my family. It is truly an honor to stand before you here in this place on this day. I tell you the truth, I never thought I would have an opportunity like this in my life. And so thank you so much for that. Please accept greetings and well wishes from the good people of Dodge County, Georgia. And please accept the same from my brothers and sisters, the family of faith at Eastman First Bab Disturge. And although I was originally born in North Carolina and raised in Panama, I said before that I've lived in Georgia longer than anywhere else and Georgia has become my home and I am proud to say that. Thank you for each of you, for your service to the people of Georgia. Please know that I am praying that God would bless you, my lady, as you lead this great state. You know success in life often requires going through a certain process. That's true when it comes to filling out your taxes. That's true if you're defusing a bomb. That's true if you're raising children or building a house. It's true if you're baking your grandmother's cookies. You better follow her recipe especially if she's going to eat them. I'd like to share with you today from first Chronicles 28 because I believe success in this life requires following the correct process as well. And we're going to pick up in this narrative where Solomon is having his inauguration day. David is old, he's not going to be around much longer and he is passing the reins on to King Solomon. King Solomon was going to take the reins that day. And David knew this was going to be a hard task. It was going to be a difficult task for this young man to fulfill. And so he wanted to pass along some last minute truths, some words of wisdom that would help him to be a success. And I am convinced that the instructions he gives Solomon would benefit each and every one of us. They are foundational for success in politics, for success in ministry, for success in life, whatever arena you find yourself. And so let me read from first Chronicles chapter 28 verse 9 and 10. Scripture says this, as for you, my son Solomon, know the God of your father and serve him with a whole heart and a willing mind for the Lord searches all hearts and understands every intent of the thoughts. If you seek him, he will let you find him. But if you forsake him, he will reject you forever. Consider now for the Lord has chosen you to build a house for the sanctuary, be courageous and act. Father, I thank you that your word is truth and you have given us your word that we might not just have information but we might have transformation. And so I pray now that you would give me grace to preach, give us grace to hear and give us grace to apply these words to our lives and Jesus, name my prayer. So what is this process for success that we can find in these scriptures? Number one is to fully know God. King David said, know the God of your father. David wanted Solomon to know God. He didn't want Solomon to simply know about him. He wanted Solomon to know him personally, deeply, truly. You can almost hear David saying, son, I want you to know my Jehovah God, the one who has been my shepherd, the one who has given me victory in battle, the one who has forgiven me and cleansed me of my sins. This God whom I have known, he can be known by you too. And that's what I want for you son. David knew that the task ahead was going to be way too much for Solomon to handle on his own. Solomon would need the Lord. You know what? The truth of the matter is we're the same way. All of us need the Lord. None of us were designed to live our lives apart from him. God created each and every one of us with the express purpose of knowing and being known by him. And even though our sins have cut us off from God, he made a way for us to be made right with him. The Scriptures teach that Jesus came and paid the price for our sins. He came, the God man who took on flesh. He lived the perfect life that you and I could not live. He died the sacrificial death that you and I deserve. And he rose again victorious over sin and death so that we can have a right relationship with God. First Peter 3 verse 18 says, for Christ also suffered once for sins, the righteous for the unrighteous that he might bring us to God. We had no way of getting to God on our own. The Scriptures teach, the bad news of Scripture, is that there's nothing we can do to change the fact that we are separate from God because of our sins. But the Scriptures also teach the good news is that it's not about what we do. It's about what Christ is already done. As David did with Solomon, I plead with you. If you do not already know the Lord, get to know him. Don't settle for just knowing about him. Know him personally and intimately through Jesus Christ the Lord. There's nothing more important. David knew that until Solomon got that right, he wouldn't get anything else. Right. And the same is true for us. You know in baseball, it doesn't matter how far you hit the ball, it doesn't matter how fast you run or how well you slide, or even how pretty you look doing any of it. If you don't touch first base, none of the rest of it counts. And the same is true with knowing God. That's first base in life. Until you've done that, nothing else matters. You're not going to make it home and you're not going to win without knowing him. So that's the first thing we need to know God. Number two, David says, you know what? Serve God faithfully. David tells him, serve him with a whole heart and a willing mind for the Lord searches all hearts and understands every intent of the thoughts. David didn't just want his son to know God. He wanted Solomon to put him first and to serve him faithfully. Did you notice that David doesn't tell his son to serve the people? Well, why not? Shouldn't he do that as a leader? Yes, of course. But David knew that the best way for Solomon to serve the people well was for him to serve God with a whole heart. And the same is true with you. If you will serve the Lord with all your heart, you can guarantee that you will serve your constituents well. David also tells him how to serve the Lord. He says to serve him with a whole heart. You know, we are often guilty of giving half-hearted treatment, half-hearted effort to some of the things we do in life. However, God deserves and God expects nothing less than our whole heart. There should be no aspects of our lives that aren't surrendered to the Lordship of Jesus Christ. He is either Lord of all, who he is not Lord at all. We must remember too that we can't fool God. We can't put on a mask. We can't do, go through the motions and fool God. Because God doesn't look at the outward appearance. He looks at the heart. He knows our every deed, our every word, our every thought, our every motive. You can't pull the wool over his eyes to make sure you serve the Lord with a whole heart. Number three, seek the Lord fiercely. David says if you seek him, he will let you find him. Know him, yes, serve him, yes. But don't stop there. Keep seeking more of him. We should seek to see him more clearly, to love him more dearly, to follow him more nearly every single day. You know, some things in this life are so good that you just can't get enough of him. Whether it's donuts, a football, or laughter, or vacations to the Bahamas, or barbecue, hallelujah, whatever it is, there's things that we just have an insatiable appetite for. So let me ask you, how can we settle for just some of God, for just a little bit of Jesus? He is so amazing, so wonderful, so delightful. He is our treasure so that we should never be satisfied with what we already have of him. We should always want more. We should constantly hunger to know him and follow him more and more and more. The good news is that when you seek him, truly seek him, you will be rewarded. You will find him. And when you find him, you'll find everything you need for this life. Don't stop seeking him. And finally, David tells him obey God fiercely. Verse 10, David continues by saying, consider now for the Lord has chosen you to build a house for the sanctuary. Be courageous and act. God had great plans for Solomon. He had personally chosen Solomon to build his temple. Can you imagine being chosen as the one to build a house for God? What a great honor. But it was also a formidable undertaking. How was this young rookie of a king going to succeed at such an incredible job by simple obedience? See in the next verses that we didn't read, we see that David gave Solomon the plans for the temple, the plans that God had given to David. And by simply following God's words, step by step, Solomon could not fail. You know what? We've been given plans by God too. In the Bible, we have the very blue plants for life. Second Timothy 3, 16 and 17, all scripture is inspired or breathed out by God and profitable for teaching, for approval, for correction, for training and righteousness that the man of God might be thoroughly equipped for every good work. He hasn't left us to try to figure out life on our own. We can be equipped for success by simply living life according to his work. God desires to accomplish significant things through each of us. It might not be leading a country, but he wants to accomplish great, eternal kingdom things through each and every one of us. And so whatever he calls you to do, be courageous and act and act, step out in obedience without hesitation, without compromise and see what great things he will accomplish through you. David knew that Solomon did these four things. Solomon and the whole nation of Israel would be just fine. Knowing God fully, serving God faithfully, seeking God fiercely and obeying God fearlessly, that's our recipe for success as well. Let us pray together. Heavenly Father, I come to you with praise and honor and thanksgiving, I praise you for being the only true God, for being our creator, for being our sustainer, I praise you for being holy and righteous in all your ways. Thank you so much, Father, for saving my soul. I thank you for making yourself known for me to me. I thank you for rescuing me from myself, for transforming my life from the inside out. And I pray, Father, that you would forgive us for our sins both individually and corporately. I pray that your kindness would lead us to repentance and that you would heal our hearts, our homes, and heal our land. I thank you, Father, for this great state, for this great nation and the freedoms that we have as a people. I thank you for the men and women who stand before me today and the work that they do to represent the people of Georgia. I pray for these representatives, Father. I pray that you would draw each of them to know you personally through Jesus Christ our Lord. I pray that you would grant them wisdom from on high, that they might be able to discern what is good and right and best as they lead our state. Your Word says that righteousness exalts a nation, so I pray that they would walk in righteousness so that they might lead us down that good path. I pray that your Holy Spirit would guide them into all truth that they would abhor what is evil and that they would cling to what is good. I thank you for your Holy Word and I pray that we would know it. And I pray that these gentlemen and ladies would know it so that they might serve as a lamp unto their feet and a light unto their path. I pray that you would guard and protect them, especially from the evil one who seeks to steal and kill and destroy in our lives and in our society. Bless this, Father, bless them with your provision, with your protection and most of all your presence. May they know you, serve you, seek you and obey you so that they might have true success in this task that you have appointed them to. May your kingdom come, Father, and you will be done on earth in the United States of America, in the state of Georgia, in this legislative body and in our lives, even as it's always done in heaven. Be honored and be glorified in us. I pray in the name above all names, the name of Jesus Christ the Lord in them. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation, under God, indivisible, with liberty and justice for all. Thank you. Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous Legislative Day and found it to be correct. Mr. Speaker, in the 50s or early 60s, out of the swamp, Oki-Fanoki came an individual, an animal that was escaping Oki because he was tired of fighting with the Alligators. He resides today with a painting on a water tower in Wakecross. His name was Pogo and he says his fame statement was, we have met the enemy and the enemy is us. Chairman Hogan, the Chair of the Committee on Information and Audits, reports that the Journal of the previous Legislative Day has been read and found to be correct as there any objection to the confirmation of the journal. The Chair here is none and the journal is confirmed. The clerk will read the resolution establishing the Order of Business for the Day. Mr. Burns, on 59th, following the establishes the Order of Business, the first part of the period unanimous consensus between the Bill's and Resolutions, first reading and reference of House Bill's and Resolutions, second reading of Bill's and Resolutions, reports of standing committees, first reading and reference of Senate Bill's and Resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the Order of Business for the Day? The Chair here is none and the resolution is adopted. First reading of Bill's and Resolutions, the clerk will read. House Bill 680 by the Reps. The Green and the 151st Bill will be titled an act to amend the act creating the Board of Commissioners to Stuart Cannon. The Intergovernmental Coordination. House Bill 681 by the Reps. The Year to the 122nd Chocus, 138th. The Chocus, 111st, Dickie, the 140th part of the 5th and others, Bill's and the Act to amend the Act to the 6th, the Act to the 222nd Chocus, 20th. The E. Fischkot, Georgia, Antietta, relating to the Competencies and Core Curriculum. House Bill 682 by the Reps. The 11th Bill's and the Act to the Reconstitution, reestablished the Board of Elections and Registration for Pickens County. The Intergovernmental Coordination. House Bill 683 by the Reps. The 11th Bill will be titled an act to amend the act to create a Board of Elections and Registration for Pickens County. The Intergovernmental Coordination. House Bill 684 by the Reps. The next is the 69th and Smith and 133rd Bill will be titled an act to amend the act to create the Board of Elections and Registration for Troop County. The Intergovernmental Coordination. House Bill 685 by the Reps. The 11th Bill will be titled an act to re-incorporate and brought in a new charter for the City of Jasper, Georgia. The Intergovernmental Coordination. House Bill 686 by the Reps. The next is the 87th Bill will be titled an act to amend the Act to the 48th, the Federal Court of Elections and Registration for Pickens County. The 11th, 17th work, heyes of the 157th, wheat hour of the 119th Bill will be titled an act to amend Article 2, Chapter 3, Title 35. The official go to Georgia Annotated relating the Georgia crime information. House Bill 690 by Reps. The 23rd, the 11th, the 13th and the 11th Bill will be titled an act to amend Code Section 265, 48. The official go to Georgia Annotated relating the pre-wecocets from licensing narcotic treatment programs. Halton Human Services. House Bill 691 by Reps. The 138th, the 113rd, the 134th, the 132nd, the 122nd, the 169th and the 129th Bill will be titled an act to amend Chapter 7 and Title 50. The official go to Georgia Annotated relating the Department of Economic Development. House Bill 692 by Reps. The 78th, the 118th, the 118th, the 119th, the 119th, the 115th and the 117th Bill will be titled an act to amend Title 30, the official go to Georgia Annotated relating the handicap persons. Halton Human Services. House Bill 698 by Reps. The 118th, the 134th, the 133rd, the 93rd, the 174th and Wilson, the 80th Bill will be titled an act to amend Chapter 131, the 134th, the official go to Georgia Annotated relating the general provisions. Relative, Delaboring Industrial RELATION. The Industry and Labor. House Bill 699 by Reps. The 118th, the 118th Beverly bones 43rd, the 74th Kendrick, the 93rd, Wilson, the 80th and others, the 134th Fiscal Jo. Jeans Antiter relating the labor and industrial relation. industry and labor. 700 by represented. Fry the 118th, Beverly, 143rd, Smiley, 135th Kendrick, 93rd Wilson, the 80th and others. Bill B. Toddl and Acta Menarkley, chapter nine, a tunnel 34. The official go to Georgia, annotator relating to compensation for occupational disease. And industry and labor. House will 7-0-1 by reps. And Fleming of 121st, the building title, act to men chapter two, title 21 of the physical to Georgia, annotator relating elections and primaries generally. Special committee on election integrity. House will 7-0-2 by reps. I'm gull of the 19th building, title, act to men, go to section 43, one, two, the official go to Georgia, annotated relating to appointment and general powers of division directors. Governmental affairs. House of resolution 269 by reps. I've demptied 13, scog of the 14th, lumped into the 12th. Resolution honoring. I like that Mr. Carl Evans in dedicating intersection in his memory. Transportation. House of resolution 270 by reps. And I've tarved into the 2nd, Cameron of the 1st. Bill of the 3rd, lumped into the 12th, smith, the 18th and others. Resolution dedicated to Georgia, groan, trail 27. Agriculture and consumer affairs. House of resolution 280 by reps. I dupes the 154, Stevens the 164th, green in the 151st, probably the 143rd, Martin of the 49th and others. Resolution creating a house, study committee on hope for the future. Higher education. House of resolution 281 by reps. I'm Clark the 98th, resolution proposing an amendment to the Constitution. Rules. Senate bill 80 by Senator Karpatrick, the 32nd, Berk of the 11th, Watson the 1st, Walker the 20th, Harveston the 15th and others. Bill B. Tottel, an act to amend Tottel 33, the fiscal to Georgia, and Tator relating to insurance. Insurance. Senate bill 82 by Senator, how are the 48th? Watson the 1st, Berk of the 11th, Karpatrick of the 32nd. House of resolution 50 second and others. Bill B. Tottel, an act to amend chapter 11 of Tottel 31, the fiscal to Georgia, and Tator relating emergency medical services. Insurance. Senate bill 112 by Senator Harveston, the 16th, Berk of the 11th, tops in the 14th, Walker the 20th, Summers the 13th and others. Bill B. Tottel, an act to amend chapter 25, Tottel 33, the fiscal to Georgia, and Tator relating to life insurance. Insurance. Senate bill 114 by Senator Robertson, the 29th, you've been in the 30th, Gouge the 51st. Kennedy the 18th, Berk of the 11th and others, Bill B. Tottel, an act to amend chapter 1443, the fiscal to Georgia, and Tator relating the general provisions relative to professions and businesses. Regulated industries. Senate bill 140 by Senator Mollos, the 53rd hatch, the 50th Miller, the 49th Harveston, the 15th, Walker the 20th and others. Bill B. Tottel, an act to amend chapter 350, the fiscal to Georgia, and Tator relating the state flag. State properties. Senate bill 169 by Senator Walker, the 20th Strickland, the 17th, followed the 55th Miller, the 49th parent of the 42nd and others. Bill B. Tottel, an act to amend article, and chapter 10 and Tottel 13, the fiscal to Georgia, and Tator relating the general provisions, regarding contracts for public works. Judiciary. Senate bill 185 by Senator Hatchley, the 50th Kennedy, the 18th cows of the 46th, for Patrick of the 32nd, I'll start with the 52nd and others. Bill B. Tottel, an act to amend chapter 2, Tottel 48, the fiscal to Georgia, and Tator relating the state administrative organization. Judiciary. Senate bill 209 by Senator Jones, the 10th Jackson, the 41st. Down the port of the 44th, Harold of the 40th, Anderson the 43rd and others. Bill B. Tottel, an act to amend an act, creating established in the Cab County, Georgia. Intergovernmental coordination. Senate bill 235 by Senator Watson, the 1st cows of the 46th, harborson of the 15th, Kennedy the 18th, Goodman in the 8th. Bill B. Tottel, an act to amend, Article 2 chapter 11, a title 16, the official to the 16th, the official to Georgia, and Tator relating the offenses against public order. Judiciary non-civil. That completes first readers. Second reading of bills and resolutions, the clerk will read. House Bill 653 by Representative Jasper's of the 11th, the events of the 164th green of the 151st night of the 130th, Powell of the 32nd. Bill relating to definitions relative to the Georgia Pharmacy Practice Act. House Bill 654 by Representative Hatchett of the 150th and Jasper's of the 11th. Bill relating to local five mill share funds. House Bill 655 by Representative Wilson, the 80th, all over the 82nd, Evans of the 83rd, welcome to the 81st. A bill to amend and act to incorporate the city of Brookhaven. House Bill 656 by Representative Houston of the 170th green of the 150th, the hood of the 175th, tankers leave the 160th, Wilson of the 80th, the bill relating to commerce and trade.\n\nHouse Bill 657, by Rebson Crowe, the 110th, with our 119th Hitchens of the 160th First Lums, and of the 12th gravely of the 67th Ability Bill relating to employees retirement system of Georgia, House Bill 658, by Rebson Powell, the 32nd Ability Bill to amend an act to be an entity Franklin Hart Airport Authority, House Bill 659, by Rebson Roberts, of the 52nd Blackmen of the 146th Ritch of the 97th Couch of the 50th Clark of the 108th Ability Bill relating to elections and primaries, House Bill 660, by Rebson all over the 82nd Carson of the 46th Blackmen of the 146th Drier of the 59th Matthews of the 73rd and others, the Bill to amend the Metropolitan Lanter Rapid Transit Authority Act of 1965, House Bill 661, by Rebson Washburn of the 141st Dickey of the 140th Mathes of the 144th, a bill relating to joint county municipal sales tax, House Bill 662, by Rebson Lopes of the 86th frustration of 104th McClaurnd of the 51st and Lehmeth of 99th, the Bill relating to bonds and recognizances, House Bill 663, by Rebson Beverly of the 143rd, Mitchell of the 88th, Canada of the 58th Thomas of the 39th Bay of the 63rd and others, Bill relating to general provisions regarding the lottery, House Bill 664, by Rebson Maynard of the 56th Mow of the 133rd Stevens of the 164th, Duke of the 154th Gailer of the 162nd and others, a bill relating to units designated to be affixed to foundations of existing buildings, House Bill 665 by Rebson Beverly of the 143rd, Mitchell of the 88th, Bruce of the 61st Canada of the 58th Thomas of the 39th and others, a bill relating to education, House Bill 666, by Rebson Beverly of the 143rd, Mitchell of the 88th, Bruce of the 65th Canada of 58, Thomas of the 39th and others, Bill relating to income taxes, House Bill 667 by Rebson Beverly of 133rd, Mitchell of the 88th, Bruce of the 61st Canada, the 58th, Thomas of the 39th and others, Bill relating to income taxes, House Bill 668 by 143rd Mitchell the 88th Bruce of the 61st Canon of the 58th Thomas of the 39th and others bill relating to income taxes House bill 669 by Reptile of Everly of the 143rd Mitchell of the 88th Wilkerson of the 38th Canon of the 58th Thomas of the 39th and others Abil relating to direct loans to students on basis of Neon Merit House bill 670 by Reptile of Beverly of the 143rd Mitchell of the 88th Bruce of the 61st Canon of the 58th Thomas of the 39th and others to bill relating to taxes on tobacco and vaping products House bill 6676. Chapter 71 by Reptile of Beverly of the 143rd Mitchell of the 88th Bruce of the 61st Canon of the 56th Thomas of the 39th and others to bill relating to Imposition rate and Computation of Sec measuring tax House bill 672 by Reptile of the 143rd Mitchell of the 88th green of the 61st Thomas Of the 39th Cannond operate at Another 50th and others abilual in to Imposition rate and Comp Freedom of Intencions from income taxes House enormous 673 by Reptile of Beverly of 143rd Mitchell of the 88th Bruce of the 61st Canon of the 58th Thomas of the 39th and others others available to income taxes. House bill 674 by Representative Kirby of the 144th. Workhies are of the 157th Scofield of the 60th. The bill will be laid into financial institutions. House bill 677 by Representative Gunter of the 8th. Anderson of the 10th. Scott guns of the 14th Smith of the 18th. Pro of the 110th and others. The bill will be laid into education. House bill 678 by Representative Wilkerson of the 38th. Allen of the 40th. Scott of the 76th. Scofield of the 60th. McLean of the 51st. The bill will be laid into medical services for inmates. House bill 679 by Representative Cameron of the 1st. Charvard of the 2nd. Abilal of the 18th. Edgelhorn taxation of property. House bill 693 by Representative Meeks of the 178th. Washington of the 172nd. Dickie of the 140th. Bentley of the 139th. Park of the 155th. The bill will be laid into operation. Farm use vehicle. House bill 694 by Representative Smirie of the 135th. Hughley of the 136th. The 133rd. Buckner of the 137th. Abilal of the 182. Regulation of hospitals and related institutions of programs of protection for children and youth. House bill 695 by Representative Hughley of the 136th. The 133rd. Buckner of the 137th. Smirie of the 135th. Abilal of the 182. General provisions. Related to drug abuse treatment and education programs. House bill 696 by Representative Buckner of the 137th. Smirie of the 135th. Smith of the 134th. Hughley of the 136th. Smith of the 133rd. Abilal of the 182. Counseling special purpose local option sales tax. House bill 697 by Representative Newton of the 123rd. Hatches of the 150th. Jones of the 25th. Cooper of the 43rd. House bill 170th. Abilal related to health care data collection. House resolution 248 by Representative Stevens of the 164th. Resolution designated. The Savannah Logistics Technology Innovation Corridor. As an official technology innovation corridor in Georgia. House resolution 249. I represent the gravely of the 67th. Douglas of the 78th. Corb the 174th. Gal out of the 19th. Clock of the 147th. Another resolution urging the United States Congress to enact legislation in the state of Georgia to coordinate regarding financial services insurance, investment, taxation related to cannabis. House resolution 268. I represent the Neil 74th. Park of the 101st. Lopez of the 86th. More of the 95th. Resolution urging the Congress of the United States to abolish the practice of involuntary sterilization women and custody of the United States. Immigration and customs enforcement agency. House resolution 282 by represent the Gunter of the 8th. And Ralston of the 7th. Resolution honoring the life and memory of Miss Sydney Grace Jones in dedicating an intersection in her memory. Senate bill 28 by Senator Hatchett of the 50th. Strickland of the 17th. Dixon of the 45th. Paying of the 54th. House of the 46th. A bill relating to juvenile code and domestic relations. Senate bill 85 by Senator Albers of the 56th. Strickland of the 17th. Miller of the 49th. Kennedy of the 18th. Huffton of the 52nd. And others. Bill relating to Hazling. Senate bill 115 by Senator Robertson of the 29th. Albers of the 56th. Harbor of the 7th. Paying of the 54th. House of the 46th. A bill relating to general provisions regarding drivers licenses. Senate bill 116. By Senator Robertson of the 29th. Anderson of the 24th. And the 35th. Paying of the 54th. Thompson of the 14th. And others. Bill relating to children and youth services. Senate bill 1574 by Senator Gute of the 51st. Melissa of the 50th. They're walking the 30th. The 28th. Cows of the 46th. Pass of the 28th. A bill relating to general provisions regarding bonds and recognitions. Senate bill 198 by Senator Harper of the 76th. Robertson of the 29th. A bill relating to the Department of Public Safety. Senate bill 201 by Senator Huffsetler of the 50th. I can be able relating to the administration of revenue and taxation. Senate bill 2115 by Senator Walker of the 30th. The 20th. Barca of the 11th. Barca of the 55th. The. The. Kennedy of the 18th. A bill relating to regulation of hospitals and related institutions. Senate bill 21 by Senator. Melissa of the 50th. Miller of the 49th. Duggan of the 30th. Future of the 51st. Kennedy of the 18th. A bill relating to ethics and government. Three second readers. Reports of standing committees. The clerk will read. Senate bill 193. The. Representative Newton on 23rd district chairman, look at on the special committee access to quality health care. Subitone the following report. Respect your committee on special committee on access to quality health care. That's that on consideration. Following bill of the House and the instructor meeting report the same back last following recommendation. House bill 697 do pass. Respectfully submitted. Representative Newton the 123rd district chairman. Representative. Robert Dickie the 140th district chairman of the committee on that culture and consumer affairs submitted the following report. The speaker committee. And that culture and consumer affairs. Has had on the consideration following bills of the House. Instructor meeting report the same back the last following recommendations. House bill 696 do pass by committee substitute. House bill 693 do pass. Respectfully submitted. Representative Robert Dickie the 140th district chairman. Representative Dave Belton of the 112th district. Secretary the committee on education submitted the following report. And to speak to your committee on education. Senate consideration following bills of the House, instructor meeting report the same back the house, the following recommendations. House bill 606 do pass. House bill 545 do pass by substitute. House bill 517 do pass by substitute. House bill 589 do pass by substitute. Respectfully submitted. Representative Dave Belton, 112th district. Secretary. Representative Don Parsons, the 44th District Chairman of the Committee on Energy Utilities and Telecommunications submitted the following report. Ms. Speaker, your committee on Energy Utilities and Telecommunications has done a consideration to following bills of the House. The Struct Committee reports the same back to the House, the following recommendation. House will file a 20-do pass by substitute, respectfully submitted Representative Don Parsons of the 44th District Chairman. Representative Rhodes, the 120th District Chairman of the Committee on Game Fishing Parks submitted the following report. To speak to your committee on Game Fishing Parks, is done a consideration to following resolution to the House, and the Struct Committee reports the same back to the House, the following recommendation. House of Resolution 183-do pass, respectfully submitted Representative Rhodes, the 120th District Chairman. Representative Don Lene Taylor, the 173rd District Chairman of the Committee on Governmental Affairs submitted the following report. To speak to your committee on Governmental Affairs, is that a consideration to following bills of the House, and the Struct Committee reports the same back to the House, the following recommendations. House will 465-do pass. House will 148-do pass by Committee substitute, House will 92-do pass, House will 579-do pass, respectfully submitted Representative Don Lene Taylor, the 173rd District Chairman. Representative Cooper of the 43rd District Chairman of Committee on Health and Human Services submitted the following report. To speak to your committee on Health and Human Services, is that a consideration to following bills and resolutions of the House, and as the Struct Committee reports the same back to the House, the following recommendation. House will 316-do pass, House will 340-60 pass by Committee substitute, House will 377-do pass by Committee substitute, House will 450-do pass by Committee substitute, House will 567-do pass by Committee substitute, House will 591-do pass, House resolution 188-do pass, respectfully submitted Representative Sharon Cooper of the 43rd District Chairman. Representative Petrie of the 166th District Chairman of Committee on Human Relations and Aging submitted the following report. To speak to your committee on Human Relations and Aging, is that a consideration to following bills and the House, and Struct Committee reports the same back to the House, the following recommendations. House will 290-do pass by Committee substitute, House will 605-do pass by Committee substitute, respectfully submitted Representative Petrie of the 166th District Chairman. Representative Bill Workhyes with the 157th District Chairman of Committee on Industry and Labor submitted the following report. To speak to your committee on Industry and Labor, is that a consideration to following bill of the House, and Struct Committee reports the same back to the House, the following recommendations. House will 532-do pass by Committee substitute, respectfully submitted Representative Bill Workhyes with the 157th District Chairman. Representative Lomston, the 12th District Chairman of Committee on Insurance submitted the following report. To speak to your committee on Insurance and Senate Consideration, the following bills and the House and the Senate, as the Struct Committee reports the same back to the House, the following recommendations. House will 514-do pass. Senate Bill 4, due pass by Committee substitute, respectfully submitted Representative Lomston, the 12th District Chairman. Representative Jan Tankersley, the 160th District Chairman of Committee on Intergovernmental and Coordination Local submitted the following report. To speak to your committee on Intergovernmental and Coordination Local, is that a consideration to following bill of the House, the Struct Committee reports the same back to the House, the following recommendations. House will 582-do pass, respectfully submitted Representative Jan Tankersley, the 160th District Chairman. Representative James Pritchett, the 170th District Chairman on Committee on Judiciary Non-Civil submitted the following report. To speak to your committee on Judiciary Non-Civil, is that a consideration to following bill of the House, the Struct Committee reports the same back to the House and the following recommendations. House bill 601-do pass, respectfully submitted Representative James Pritchett, the 170th District Chairman. Representative Lynn Smith, the 70th District Chairman of Committee on Natural Resources and Environment submitted the following report. To speak to your committee on Natural Resources and Environment, is that a consideration to following bill of the House, the Struct Committee reports the same back to the House and the following recommendations. House bill 647-do pass by Committee substitute, respectfully submitted Representative Lynn Smith, the 70th District Chairman. Representative Allen Powell, the 32nd District Chairman on Committee on Regulated Industries submitted the following report. To speak to your committee on Regulated Industries, is that a consideration to following bill of the House, the Struct Committee reports the same back to the House and the following recommendations. House bill 364-do pass by Committee substitute, House bill 369-do pass by Committee substitute, House bill 645-do pass, respectfully submitted Representative Allen Powell, the 32nd District Chairman. Representative Carson, the 46th District Chairman of Committee on Retirement submitted the following report. To speak to your committee on Retirement, is that a consideration to following bills of the House, the Struct Committee reports the same back to the House and the following recommendations. House bill 173-do pass by Committee substitute, respectfully submitted Representative Carson, the 46th District Chairman. Representative Smith, the 134th District Chairman on Committee and Rules submitted the following report. To speak to your committee on Rules and the Struct Committee reports the same back to the House and the following recommendations. House bill 675-do pass, respectfully submitted Representative Smith, the 134th District Chairman. Representative Mike Chokus, the 138th District Chairman of Committee on Small Business Development submitted the following report. To speak to your committee on Small Business Development, has had under consideration following bill of the House and the Struct Committee reports the same back to the House and the following recommendations. House bill 611-do pass, respectfully submitted Representative Mike Chokus, the 138th District Chairman. Representative Gerald Green, the 151st District Chairman of Committee on State Properties submitted the following report. To speak to your committee on State Properties, has had under consideration following bills and resolutions of the House and the Struct Committee report the same back to the House and the following recommendations. House bill 482-do pass by Committee substitute, House bill 619-do pass, House of Resolution 204-do pass, respectfully submitted Representative Gerald Green, the 151th District Chairman. Representative Rick Jasper's of the 11th District Chairman of Committee on Transportation submitted the following report. To speak to your committee on Transportation, has had under consideration following resolutions of the House and the Struct Committee report the same back to the House and the following recommendations. House of Resolution 140-40 pass by Committee substitute, House of Resolution 282-do pass, respectfully submitted Representative Rick Jasper's of the 11th District Chairman. Representative Shaw Blackman, the 146th District Chairman of Committee on Ways and Means submitted the following report. To speak to your committee on Ways and Means, has had under consideration following bills and the House and the Struct Committee report the same back to the House and the following recommendations. House bill 160-do pass, House bill 428-do pass by Committee substitute, House bill 451-do pass, House bill 469-do pass by Committee substitute, House bill 498-do pass, respectfully submitted. Representative Shaw Blackman of the 146th District Chairman, that completes the reading of the Reports of Standing Committees. We are about to go on to morning orders. We are about to go to morning orders. This House will come to order. Please give attention and respect to the members in the well. Reminder again that we have a 10-minute limit for morning orders. And at the end of the 10 minutes, we will move on to other business. The chair recognizes for a morning order, Chairman Darleen Taylor and Representative Joe Campbell, and also they're joined by Representative Duke's and Chairman Gerald Green. Thank you, Mr. Speaker. Members of the House, it is with a heavy heart that we stand before you today. This past Monday, we lost one of South Georgia's finest, Lieutenant Justin Bedwell of the Decatur County Sheriff's Office. Lieutenant Bedwell succumbed to injuries and curd over the weekend. He was wounded and his life was lost in the line of duty. He was a 19-year veteran of the Decatur County Sheriff's Department. He served as a patrol commander, training officer, and valued member of the command staff. He was one of the many heroes after Hurricane Michael. Lieutenant Bedwell will be truly missed and the community mourns his loss. Please join us for a moment of silence for Lieutenant Justin Bedwell, his family, and our communities. Thank you, Mr. Speaker. We yield a well. Chair recognizes Representative Gaines and Representative Deloche for a morning order. Thank you, Mr. Speaker. Yesterday, we lost a former member of this body, a truly great Athenian and an outstanding Georgian, Louise McBeat. Thank you, Mr. Speaker. Yesterday, we lost a former member of this body, a truly great Athenian and an outstanding Georgian, Louise McBeat. As a long time University of Georgia Administrator and a legislator, Louise McBeat made a profound impact on our region and the entire state. Before serving in the House, Dr. McBeat was one of the most influential administrators at UGA. Having started in 1963 as the Dean of Women in Retiring in 1988, is acting vice president of the University of Georgia. The second highest serving position at UGA at the time, she was widely admired by students and faculty alike. McBeat used her experience to improve higher education when she came to the state house in 1992, where she served for six terms, including as chair of the House High School, and the state's highest serving position at UGA at the time. She was widely admired by students and faculty alike. She was widely admired by students and faculty alike. She was widely admired by students and faculty alike. She is a teacher of the House High School, which served for six terms, including as chair of the House Higher Education Committee. The legislature, McBeat established the successful governor's teaching fellow's program, helped ensure the hope scholarships financial stability, and strengthened the school breakfast program for low income children. This Women's History Month, we honor the path that she paved for women in higher education and leadership. the 2017, just when I was making the decision to run for the house. I'll always cherish that time with Dr. McBeat. She was a kind, caring, and truly remarkable woman. McBeat's work will continue to change and inspire lives. Let's all take a moment of silence in honor of Louise McBeat. Thank you, Mr. Speaker. Thank you, Representative Gaines. An official university of Georgia told me yesterday that she had been cut off from her family and friends for many, many months. Very, very sad. Chair recognizes Representative Crow for a morning order. Thank you, Chairman. One, thank you. Thank you, Mr. Speaker. Colleagues, we rise today to announce the passing in honor of the life of Henry County Commissioner Gary Barham. He was hospitalized from much of February because of complications from COVID-19 and died yesterday morning to Tuesday, March 2nd. A native of Henry County Commissioner Barham grew up in McDonough and attended Henry County High School and Griffin Tech. He had served district three on the commission since 2013 and prior to that spent 31 years with the city of McDonough, including a stint as a city's director of public works. He served as a volunteer firefighter, was on the committee for the Olympic Torch Relay and the Paralympics Torch Relay. He served as president of the Kiwanis Club and was a member of first families of Henry County, the Henry County Moose Lodge, delivered from Meals Own Wheels and helped bring the first Veterans Day program to the McDonough Square. Commissioner Barham was also heavily involved in sports, playing baseball himself and coaching Little League, Youth Baseball, Basketball, and Football. He unpowered the first Roberto Clemente World Series held in McDonough and was later inducted into the Henry County Recreation Hall of Fame. He married for 34 years to his wife Becky, a pair of two sons, Josh and Adam, and five grandchildren. Gary was a great man and friend and a true public servant. I ask that you join me in a moment of silence to honor his memory. Thank you. Chair recognizes for a morning order the dean of this House of Representatives, Dean Summary. Mr. Speaker, ladies and gentlemen, a House, when I got to call that Vernon Jordan had passed, it was a very, very difficult moment for me and for a lot of people in America. When I chair at the Columbus Urban League, Vernon Jordan was the executive director of the National Urban League and he has been an inspiration to so, so many people. And I just want to come. We just want to come this morning. He's a native Georgian. He's a person that has been involved in a lot of civil rights activities throughout his lifetime. He was a tremendous business executive with a lot of major corporations in America. President sought him out for advice. He was an advisor to every president since Lyndon Johnson and he worked very, very closely with Bill Clinton and Barack Obama and President, both of the Bush's presidents, and Ronald Reagan and Jimmy Carter. He was just a tremendous, he was a giant of a person. He was absolutely. And when you got him, it was always a joy. He was always amicable. He was just a person that always wanted to share and always wanted to lift up other people up. Thank you, Mr. Speaker, for giving us this time this morning to acknowledge a great Georgian of Vernon Jordan. If we take a pause for a moment to celebrate his life. Thank you, Mr. Speaker, and ladies and gentlemen, the House. Chair recognizes representative Stephen Meeks for a morning order. Thank you, Mr. Speaker. Monday, March 8, would have been Amriss Bedford's 11th birthday. Two years after Amriss was diagnosed, a two years of age, Amriss was diagnosed with a rare aggressive form of brain cancer. One of life this precious child lived in her short time here on this Earth. She was an amazing little girl who brightened the room and encouraged everyone else, even while she was fighting her own battle. Her family stood steadfast, an example to me, and to all of us in the way that we should carry ourselves throughout these kinds of journeys. You see, they know that this old world is not our eternal home, and now Amriss is healed, whole, and eternally happy at home with Jesus. Please join me in a moment of silence for Amriss's family, and please pray for her family in the days to come. Thank you, Mr. Speaker, all you're the well. Chair recognizes Representative Gloria Frazier for a morning order. Thank you, Mr. Speaker. Tomorrow is a committee day, but it's also be the match day here in Atlanta. More than 400 Georgians, patients, turned to be the match, searching for a cure last year. For patients battling deadly blood cancers like leukemia and lymphoma, or life threatening blood diseases like sickle cell disease, A-plastic anemia, there is a cure. So many people do not realize that their blood stem cells could hold the cure for a patient battling these diseases. Please join Senator Tanya Anderson and myself on tomorrow Thursday, March 4th, on 12 p.m. to 3 p.m. over in Liberty Plaza as we commemorate March 4th as be the match day. I encourage all of you to come and listen to donors who have had the cure from citizens like you and I who have donated their stem cells. Tomorrow from 12 p.m. to 3 p.m. in Liberty Plaza, and you will also be able to witness actually a person swapping to join the registry. Chick-fil-A lunch will be served, and I'll see you there. Thank you. Time for morning orders has expired. Those who were not reached, if they wish to sign up for tomorrow, may do so with a messenger. All right, we're going on now to the rules calendar. Going on to the rules calendar. What purpose does Chairman Stevens rise? To make a motion. State your motion. I'd like to move that the substitute to House Bill 86 go back to the rules committee for a little fine tuning. Clerk will read the caption. House Bill 86, by representative Stevens, 164th and others to be entitled back to men. Chapter 27 of Title 50, the fish put a Georgia annotator relating the lottery for education, so it's required for the lottery game of sports wagering in this state. On the motion of Chairman Stevens that House Bill 86 be recommitted to the rules committee, is their objection? Chair, here's none, and it is so ordered. What purpose does the Chairman of the Rules Committee rise? Let's speak, or make a motion. State your motion. I move the House Bill 675 be recommitted to the Rules Committee. Clerk will read the caption. House Bill 675, by representative Cantrell of the 20-second to be entitled back to amend. Code section 2818, in article 1 of chapter 7 of Title 45. He fished go to Georgia annotator relating the salary and allowances of members and officers in general assembly. On the motion of the Chairman of the Rules Committee that House Bill 675 be recommitted to the rules, is their objection? Is their objection? The Chair, here's none, and it is so ordered. Clerk will read the caption to House Resolution 185. House Resolution 185, by representative Ralston, the seventh and others, a resolution reauthorizing the House Rural Development Council. This bill, this resolution, I have been referred to the Committee on Economic Development and Tourism. That committee recommends that this resolution be adopted. Chair recognizes Chairman Sam Watson to present the resolution. Thank you, Mr. Speaker. I just want to first say what an honor it is to carry this bill on your behalf and how great it has been to be a part of an idea and a concept that you developed and that you came up with to start with something so small, but yet create such a large ripple effect across this great state in this Rural Development Council. And for those of you that are not aware, four years ago, the Speaker charged this body in the Rural Development Council.\n\nto go out and implore the motto of this great colony of Georgia when it was established in 1733 by our trustees and General James Orgothorpe. And that is not for yourself but for others. And that's what this council has done. If you remember we've had major broadband expansions and growth in the broadband areas. We've had huge issues in healthcare. We've had tremendous conversations around education. And those all stand from the Royal Development Council as it may be across the state. And even some small things with just us going out into our communities and hearing from the locals and hearing about their problems. Sometimes it was just us coming back here making some phone calls. And we were able to get a lot of things accomplished for rural Georgia. But we still got a lot of challenges and we still got a lot of things we need to do to move this state forward. And I hope that you will agree to allow us to renew this council for another two years. And Mr. Speaker just thank you for all of your efforts and the work that you put toward this. And look forward to serving on this council again. And I'll be glad to take any questions. You do not have any questions. Thank you. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The chair hears none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Understood? Have all Members voted? have all members now voted? Yes so the clerk will lock the machines on the adoption of House Resolution 185. The eyes are 164, the nays are zero. This resolution having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 593. House Bill 593 by reps of black men in the 146 to be titled an act to men are due Chapter 7 and Title 48. The official go to George Ante, who relate in the imposition rate computation and exemptions from state income taxes. This bill I refer to the committee on ways and means that committee recommends that this bill do pass. Chair recognizes the chairman of the House Ways and Means Committee chairman blackman to present the bill. Thank you Mr. Speaker. We bring before you House Bill 593, which would raise the standard deduction on singles from 4600 to 5400 and married to from 6,071. So a modest measured increase gives George and some tax relief and affects the most number of George and allows them to keep some of their own money. Mr. Speaker, I'd be happy to answer any questions but that is generally what the bill does. You have a couple of questions if you care to yield. Yes sir, be happy to yield. Chair recognizes the minority caucus leader leader Beverly to your left. Thank you Mr. Speaker. It is gentleman you. Yes sir. Is there a fiscal note associated with this bill? Yes sir. It's in the $140 million range. Thank you very much. Yes sir. Do you further yield? Yes sir. Chair recognizes representative Carpenter Do you write for a question? Does the gentleman yield? Yes sir, do. Is this hopefully a first step in reducing taxes for all Georgians? Well, it certainly reduces taxes for majority of Georgians all working Georgians and I think it's a modest first step. Yes sir, in the right direction. Thank you. I appreciate you bringing this measure. Thank you. Take one more, Mr. Speaker, if there is one. Chair recognizes Chairman Martin to your left for a question. Chairman Blum, you'll for question. Yes sir. Isn't it true one of the things that this bill does is provide this for the standard deduction? Isn't it true because of the federal change a couple of years ago more Georgians are filing for the standard deduction because they increased standard deduction at the federal level. And this will given that change a few years ago at the federal level and this change today it will affect the most Georgians possible and that $140 million will be scattered over a wide path across Georgia. Yes sir, if I understand you, Chris, question correctly that does move us in the right direction, Chairman Martin. Thank you for the question. Mr. Speaker, if there are any further questions, will you have some, but you know it's up to you. I'll answer one more if there's. Chair recognizes the minority caucus will represent it to Wilkerson to your left for a question. Thank you, Mr. Speaker, does the gentleman yield? Yes sir, to the web. You had mentioned working families, isn't that true? That this benefits those that do not itemize. So we would go to working families, that correct? Yeah, that correct. It is for just those that take the standard deduction. Yes sir. If there, I think Mr. Speaker, we've talked about this probably a good bit. I would certainly think this is good for Georgia and appreciate the opportunity as for the body's favorable consideration yield the well. Gentlemen has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of House Bill 593 will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 593. The eyes are 171. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 587. House Bill 587, my representant Williamson, the 115th and others. Meantime to amend title 48, the physical of Georgia, and tentative related to revenue and taxation. So it's to provide for a tax credit for medical equipment and supply manufacturers and pharmaceutical and medicine manufacturers. This bill I refer to the committee on ways and means. That committee recommends this bill do pass by rules committee substitute. Chair recognizes representative Williamson to present the bill. Thank you, Mr. Speaker. Fellow members, I bring for you today for your consideration House Bill 587 LC43197. Zero S by committee substitute. This bill is known as the Georgia Economic Renewal Act of 2021. It's basically a week of binding five different bills into one bill with intention of not only being able to discuss this and being able to tell our constituents. This is a major package of business job incentive tools that we can all go home and be proud of. But so bear with me I'm going to try to walk you fairly quickly through the moving parts of this bill. Section two of the bill establishes a new tax credit for medical device and pharmaceutical manufacturers, which will be available for new qualified jobs created on around July 1st, 2021. It's the intent of this legislation to try to not only grow our pharmaceutical manufacturer in Georgia, but also grow medical device manufacturing as well. Importantly, taxpayers can take either the PPP, the personal protection equipment credit or the medical advice of pharmaceutical manufacturers' tax credit but not both. Section two, three of the bill allows the existing Georgia Port Activity Credit to be used against income or withholding taxes at 100%. Most of you know that Georgia's tax code does not tax the income on manufacturing goods from Georgia that are sold out of the state or out of the country. So thereby we've got a lot of people that have grown jobs, maximize the use of the income tax credits against their state income already. This will allow them to flexibility use these earned income tax credits which are always already accounted for from a fiscal standpoint against their payroll with holding taxes. Section two, four removes the 4500 job cap on the mega project tax credit for qualified projects and quite frankly, the more I studied that, I could never figure out why we had a cap of 4500 jobs on the kind of high paying jobs with benefits that we were trying to attract to Georgia. So this just removes that cap because we want all the high, good high paying jobs we can get in the state of Georgia. Furthermore, the new zone that establishes that this is important for all Georgians, the high impact aerospace defense project criteria, which include the investment tax credit with the bear women we get from the minutes here. It actually defines the qualifications to be recognized as the high impact arrow dispense project, which is going to allow the manufacturing investment tax credit to be coupled with either the mega tax credit program or the quality jobs tax credit program but not both. The manufacturing tax credit program requires a minimum of 1,800 jobs and 1,800 million dollars investment and it does have a cap on the credit of $100 million. Importantly, this project is a major importance for the next generation programs in Georgia for our aerospace industry and think next generation fighter jets, hypersonic aircraft, scum works programs such as that to recruit these kind of jobs to Georgia and grow it. And again, we expect the generational impacts should this project come to fruition. Part three of the bill simply re-ups the Georgia Aggrabices and Rule Jobs Act. It re-ups it for another $100 million as program hasments particularly successful for rule Georgia. The numbers in the bill say $100 million but I will remind the body that it's actually only $60 million in state treasury and it's only the third year that the state starts paying out and it's limited to $15 million a year or a four year period. And finally, and importantly, section four is going to extend the sunset on the very successful short line rail maintenance tax credit program that was authored and carried by Representative Patty Bentley a few years ago. I describe that short line railroads as being the fingers going to our class one railroads and these fingers extend into towns that would not otherwise have railroad access and that means most of rule Georgia and towns all across Georgia. So with that overview of the program, Mr. Speaker, I'd be happy to answer any questions and you don't want to remind the body that this is a bipartisan bill and be happy to answer any questions. Thank you, you know, for questions. Yes, sir. Chair recognizes Representative Bentley to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? They might honor. This is a serious question. Although you referenced my legislation back in 2018, I wanted to for the sake of our new members. Is it not true that back in 2018, the General Assembly session that I authored House Bill 735, which was a part of the rule Georgia Development Council's agenda for class three railroads? That is true. You did a great job. And it's not further true that the late Jay Powell assist in representing to Jay Powell assist and drafting up that legislation. He did a marvelous job and I think he was the best ways he means chairman we ever had, but the others following him were pretty good too. But thank you for your assistance on this measure. And thank you for your work on this bill. Thank you. Mr. Speaker, I'll yield the will and ask for the body's favorable consideration. Gentlemen, as yielded the will, Chair recognizes Representative Reeves to speak to the bill. Thank you, Mr. Speaker. Folks, I want to talk real briefly about the Defense Aviation Project piece. And that's something that some, myself and some of my Cobb County delegation members and chairman Belton and others have been working on for some time. And it was filed as a separate bill in House Bill 41. And we're very fortunate and happy that it was put into this piece of legislation that Chairman Williamson is carrying. But folks, this is really a generational opportunity. The military is going to be rolling out three aviation projects in the next three years. And that is going to represent the next generation of military aviation for the entire country. And Georgia has an opportunity to be the epicenter of military aviation defense with this. Georgia has a historic role in this as a Lockheed Martin, as probably everyone in this room is aware, been involved with aviation projects for our military for a very long time and have produced C-130, F-22, and many others. A lot of those have been phased out. And there is capacity at Lockheed Martin. They're turn key ready right now to be able to take on these projects. Now, this option would be available for anybody that's capable of bidding and capable of taking on these projects. But I will say that I believe Lockheed will certainly bid whether it's Lockheed or a competitor. If we can land these contracts at Georgia, then this is a game changer. And again, we can become the epicenter of the future of aviation. It's literally thousands of engineering jobs come with these. And I know you all get tired of hearing me talk about Georgia Tech, but my gosh, we've got aerospace, mechanical, electrical, industrial engineers that we are putting out that would love the opportunity to go work on projects like these. But they're going to Washington State, the work at Boeing, and they're going to California. Let's keep them here in Georgia. Let's keep our talent here. This is generational opportunities. I ask you to please support this bill. Thank you, Mr. Speaker. Gentlemen, is yielding the oil? Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? Is any objection to adopting the substitute offered by the committee on rules? The chair hears none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. What purpose does representative Anola Witt's rise? Parliamentary inquiry. State your inquiry. Thank you, sir. Is it not true that the district I represent that is home not just to our Atlanta graves, but to Lockheed in the Georgia National Guard. But the aerospace defense industry there is home to nearly 5,000 jobs, most of whom are members of IAM Local 709, and that this bill could mean security not just for those high paying defense jobs, but could ultimately mean more than 3,000 additional jobs and additional $1.7 billion in investment in Metro Atlanta, and would absolutely help maintain the critical importance of Dobbins's home, not just to Lockheed, but to the Georgia National Guard and the Georgia Tech Research Facility there. The lady said a lot in that parliamentary inquiry. However, the chair believes her to be accurate in everything that was stated. We'll do one more. Chair recognizes representative Smith in room 331 for what purpose does he rise? Parliamentary inquiry. Mr. Speaker, isn't it true that the gentleman from the 18th's father is a 34-year-plus employee of Lockheed Martin and that the effects of this act will far surpass just Cobb County, but has far reaching effects in the other states as well? Absolutely. I know that to be true. I'll go over Georgia. Thank you, Mr. Lee. Have all members now voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 157. The eyes are 157. The nays are 14. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 586. House Bill 586, by the way, wants to the 170 second and others to be entitled back to a men part one of Article 1848. The fiscal to Georgia and Tate relating the general provisions regarding sales and use taxes so as to extend the sunset date with the exception for projects of regional significance. This bill ever referred to the committee on ways and means that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Watson to present the bill. Thank you, Mr. Speaker. I do bring before you members of the House HB 586. This is also another great bill that will literally call some ripple effects across our great state. But it's better known as the Georgia Economic Recovery Act of 2021. I'm just going to walk through it real quick, but starting in section 2, basically what we're doing there is we're extending the sunset on the sales tax exemption on materials used during construction projects of regional significance. This is a declaration that's made by our state to be an added tool in the toolbox to bring major projects to our state. It's only been used nine times since 2012. So, it's not used unless it is very necessary and is secured over 8700 jobs in our state. And it's a great tool to have in the toolbox when it comes time to bring jobs to our state. And we're just extending the sunset there so we can continue to have that tool in the toolbox. Article 3 is a sales tax exemption on the performing arts venues across our state. Obviously, due to COVID, many of our performing arts, opera, symphony, poetry, dancing, many of us have these in our communities and they're very important to the quality of life. And so they've been really hit hard by COVID. And so we're just trying to have something that they can use in their communities as a very short term tax exemption. If you'll see the sunset is December 31st, 2022. So we're just going to work with them on this and hopefully it will be something that will help them long term to kind of fill in some holes from their loss of business due to COVID-19. Section 4, we are clarifying the definition of what a manufacturing plant is. We've already passed this bill previously in this house dealing with our concrete trucks that are basically manufacturing plants that move. And so we're defining it and clarifying it for a DOR so that they know what these are. These are used in construction of economic development projects. It's been a great tool for them. These trucks still pay TABT. They still pay motor fuel taxes. They're heavy use fees. But they also generate sales tax revenue from the actual sale of concrete. So it's a very beneficial tool for them as they continue to build projects across our state. Final piece of this bill is dealing with renewing the sunset or removing the sunset. I'm sorry. On the sales tax exemption for boat parts that are retrofitted or repaired in our state. And this is big projects like half a million dollar type big yacht projects. Some of you may have some of those back home. I'm not sure but don't have those in my district. But we're doing this basically to provide some consistency and some long term benefit to the people that are in this business. Obviously we're wanting this to happen on the coast and we're wanting these big yachts to come to our state to be retrofitted and repaired. And so that's what this bill does and allows us to continue to do that and move forward with that economic development. Mr. Schmeger that's what the bill does and I'd be glad to take any questions and I would appreciate your support. You got a few questions if you care to yield. Yes sir. Chair recognizes the dean of the house being smiling to your left for a question. Gentlemen well do you yield? Yes sir. I mean I heard you talk about tax credits and it's a relates to the film. But do you recall we passed a bill that gave a half a million dollar tax exemption and tax credit to those of the former North Center that had reduction you know anything that they had that they would get a tax credit. On your recovery act does tell me a little again about the recovery part that you just mentioned. So this is just dealing with the sales tax on the sale of the tickets so that they can retain the local and state portion of the sales tax to go back to all of the money goes to the facility that's having the performing of our arts event and that's all we're doing in this bill. Strictly on sales tax instead of them remitting that money to the locals and to the state we want them to keep that money so they can put it in their pockets and hopefully help with their bottom line. And I'm not convinced of that because because during the pandemic like the theater we have in Columbus the performance of the it's shut down the springer which is to take state theater shut down. But when we passed that threshold bill of half a million dollars for production purposes the only theater that was able to benefit under that factor was the Fox theater. Those that are smaller theaters in performing arts centers when they have the production of 250,000 and 100,000 that they bring to their respective cities they don't get a tax credit for that. And we a lot of us are talking about lower net threshold because it's just the only person only performing center that is able to qualify is the Fox and I'm told one time the qualifier was when Hamilton came and it was more than a half a million dollars so but but I think what you're doing is it's going to be a great benefit to those theaters and performing arts centers because they are very important to the cultural aspect of all of our respective cities. So thank you very much. Yes sir. Thank you. Mr. Speaker if there's no further questions I'll yield the will. Billman has yielded the will. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to adopting the committee substitute the chair here is none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here is none. The report of the committee is agreed to shall this bill now pass all those in favor of the passage the bill will vote aye those opposed will vote no and the clerk will unlock the machines. What purpose does representative Kenner dries parliamentary inquiry is it not true that HB 586 offers significant relief to our nonprofit community theaters that have been decimated by the pandemic and gives them a path forward to get back on their feet. I believe the gentleman is accurate in that statement. Have all members voted have all members voted. If so the clerk will lock the machine on the passage of House Bill 586 the eyes are 164 the nasor 6 this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 363. House Bill 363. By rep's and the hood of the 175th to be titled an act to amend the official code of Georgia annotated relating crimes and offenses so as the revised definitions relative to the protection of elder persons this bill that refer to the committee on judiciary non-civil that committee recommends this bill do pass. There are recognizes representative of hood to present the bill. Thank you Mr. Speaker and members of the House. House Bill 363 is about abuse of access. It's a type of exploitation against elder adults. And this bill is brought to me by the prosecuting attorney's counsel and became a priority as a result of a work group between prosecuting attorney's counsel also DCH, GBI and other departments. And the reason this bill is necessary is because when someone is charged and convicted of a crime involving abuse of access without this bill they can because of the rural lenity the court is sentencing people the lesser sentence. And so this bill will clean that up and make sure that we're tough on crime against elders. This bill went through three different judiciary hearings and pass unanimously every time. That's all I have Mr. Speaker. If there's any questions I'll be glad to take some. You do not appear to have any, well you do have a question to you. Yes sir. I recognize this representative Holly up in the gallery to your right for a question. Does the gentleman you? Yes. Is it not true that it's not true that it's for a simple assault that the person actually receiving the harm has to be a reasonable fear of their safety? I believe you know what you speak.\n\nBut if a measure is put forward through this house, which allows for folks to be able to visit their loved ones, will maybe diagnose with COVID-19 into a hospital setting that quite possibly they may be placing these doctors in a position of being victims of simple assault. When there is an intention to come into that area, one is already know that they could possibly harm them. Not aware of anyone that has that intention. Thank you, sir. Mr. Faker, I yield the well. If any further questions, gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no. And the clerk will unlock the machines. On the passage of House Bill 363, the eyes are 171. The nasa zero, this bill having received, the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 248. House Bill 248, members and Apollo, 30 second and others to be entitled to enact to amend Code Section 40, 1418, the fiscal to Georgia, and the enforcement of speed limit in school zones with recorded images. This bill then referred to the committee on public safety and homeland security. The committee recommends that this bill do pass. There recognizes Chairman Powell to present the bill. Thank you, Mr. Speaker. The ladies and gentlemen of the House bring to you. You know, we always talk about a sample bill. Well, this is a pretty sample bill. It might not be the subject you like to deal with. This deal is with the school's own cameras with speed detection. Past a few years ago, we've been on a pretty successful project. Slowed a lot of people down in school zones. The criteria was always set when the bill was originally passed. One of the things it said was that the school that the schools themselves had to sign for the permit to the Department of Transportation. But there was a lot of y'all who hadn't been around here for a while to know whether it be radar or whether it be school cameras or any type of a camera. They have to be permitted by the Department of Transportation under certain criteria. Well, when that bill was passed, it said the schools had to sign for the permit to do the school cameras on in speed enforcement. And there's been some kind of problems. And for the life of me, I don't know what because it seems to be like it must be some money or something involved because if you're protecting children and making a safer environment for folks, then that ought to be what we're after to keep some of these children from getting around over. What this bill does, ladies and gentlemen, it says that the governing authority, whether it be a county or a city, the city police or the sheriff's department, then they can do the application for the permit from the GDOT. That's what it does. Moves it from the school to the law enforcement agencies that are enforcing this to start with. I would ask for your support. You can achieve the police and your sheriff's departments that they'd appreciate you also because they all stood up in favor of this. And that, Mr. Speaker, is what this bill is. And I would ask for your favorable consideration. Do you yield for questions? I will. Chair recognizes Representative Wolenski in room 341. Thank you, Speaker. Does the chairman yield? Yes, sir. Chairman, I, first of all, want to thank you for carrying this bill. The camera's getting to me. There I am. Thank you so much for carrying this bill. Is it not true? This bill is incredibly a great bill that's going to help cities and more importantly help the safety of children in our communities at all schools, whether it's elementary, middle school and high school. Well, since you put it bill does like it, I'm sure you would think so, and it is. Thank you, Chairman. Thanks for everything. Thank you. Mr. Speaker. Do you have another question or two, but it's up to you. Well, I don't see any argument. I'll be glad to answer questions because it's a pretty simple bill, but we can do it on a flavor of the point because somebody might be ready for lunch in a little while. Maybe a quick question. Chair recognizes Representative Jasmine Clark in the gallery. You're left for a question. Yes, ma'am. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. So in this bill, if we take the authority of the schools themselves to apply for the permit, could law enforcement potentially choose not to put cameras in a place where a school does want their to be cameras? Well, I guess they could, but hopefully in that situation, since the law enforcement or the ones that have to enforce it may have to scrutinize the tapes, hopefully they have a closer relationship between their school system and the law enforcement. Thank you. Mr. Speaker, I think that's pretty well the bill's self-explanatory. It has a good bill and it's something to help move these forward so we can protect these school children a little bit more. And I'll yield the well and ask for your favorable consideration. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 248. The eyes are 133. The nays are 35. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 334. House Bill 334, my resident of color, the 19th to be titled an act to amend Article 2 of Chapter 6 and Title 15 in Article 1 of Chapter 17 of Title 45. The official bill to join the annotated relating to clerks' spirit courts and general provisions regarding notaries public. This bill I'm referred to committee on judiciary that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Gullet to present the bill. Thank you, Mr. Speaker. This bill has to do with remote online notarizations. It dropped a similar bill last year. It was House Bill 785. When you drop a bill related to notarizations, I'm an IT guy. I think it's an IT type of bill. But it turns out two years later that you learn that notarization is an integral part of numerous legal transactions. And that attorneys throughout the state all have very surprisingly strong opinions on the matter. Who would have guessed, I guess, probably, right? We've had hours and hours of video calls to hammer out the details in the language of this bill to make sure that we're doing the right things for Georgians. Our primary objectives was this. One, create a Ron system, Ron stands remote online notary. System that will work in practice with enough flexibility to adapt, but firm enough to firm, but enough firm rules in place to protect the integrity of the process. Under this bill, an online notarization will include security measures and record keeping that go far beyond what happens with paper notaries today. So not only will we get more convenience, but will get more security and better integrity with remote online notary. Number two, we wanted to do absolutely nothing that threatened the role of the attorney in conveying real estate in Georgia. You say that one more time? We wanted to do absolutely nothing to threaten the role of the attorney in conveying real estate in Georgia. The system has served our state well, and I'm pleased to say that we put language in this bill that strengthens closing attorneys from being threatened by unlicensed practice of law in Georgia. For the first time, our real estate closing attorneys and our citizens are getting an appropriate remedy to seek if consumers are damaged when nonlawyers illegally convey real estate and record documents here in Georgia. Number three, one of the build consensus among dozens of specific industries who are interested in this process and wanted to see them protected. For this new idea to work, we needed a strong buy-in from both the Superior Court Clerk's Authority, the court clerks will administer the system in the lawyers and businesses who will have the opportunity to use it. Number four, we wanted to make sure that we kept the system open to all Georgians from mom and pop notaries to giant corporations. Here again, we worked carefully to make sure this new tool is accessible to everyone while also building in safeguards that are needed to protect our consumers. I am pleased to report that this bill has achieved those goals. We have carefully thought out this bill, and it was a result of hours and hours of work to find middle ground and make good policy. It has support from the governor's office, banking and insurance communities, major business associations, the State Bar, Georgian, and many others. Georgia has a chance here to make a little legal history as we go, being the first attorney closing state to pass a consensus bill and give our citizens the ability to notarize documents without driving to a room and standing in front of a notary. This is convenient, smart, and in many ways much more secure and verifiable than an eak notary. Most importantly, we're going to solve a real world problem for folks that we represent. We won't have to stand in a room to perform a simple legal function or wander around town trying to find a notary. They can do this process from the comfort and safety of their own home or office, which is particularly important in times like we're in now. For our folks who need notarize something but suffer from age or disability or even don't want to get into a pandemic world, and this makes it hard for them to go places. Mr. Speaker, members of this body, I ask for your favorable consideration of this bill, and I will yield for any questions. Chair recognizes the vast chairman of the majority caucus representative gravely to your right for a question. Thank you, Mr. Speaker, Jim and you. I do. I am sure along with all these members, I greatly appreciate you reading the entire bill for us. No problem. Just before lunch, too, I might add. That sounds like a good plan. This is an important measure. I thought you wanted to know what was in the bill. The gentleman further you. Maybe I will. Is it not true that, and I've talked with the early on in this process that a lot of the lot of the individuals attorneys that frowned upon this process early on had to experience COVID and were some of the same individuals that came back to say, how can we help you on the bill because they saw the need for it. That's correct. Yeah, that's absolutely correct. That's a good bill. Thank you for bringing it. Thank you very much. Do you know for further questions? I'll do one more, Mr. Speaker. Chair recognizes representative Moore in the gallery to your left for a question. Thank you, Mr. Speaker. Does it, John Manu? I do for my friend. To follow on representative Graveli's comments, isn't it true that as a member of the legal community, I can attest that the vast majority of lawyers in this state have enjoyed the possibility of using remote online notary as a result of the governor's emergency order. And isn't it further true that Georgia is not unique in now moving to offer remote online notary, but is rather following other jurisdictions that have been using this practice for many years. Yes, you are absolutely correct. And you've spoken to me a number of times asking, where's this bill at and how can we move it forward? And I appreciate that support and your help with that. And I think it will be the 30th state to adopt remote online notary if this passes through the body and sign by the governor. Thank you for bringing this bill and being patient enough to propose it even prior to the pandemic. Thank you. Thank you very much, Mr. Speaker. Remember, the body asks for your favorable consideration. I yield the will. Gentlemen, as yielded the will, is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 167. The I, I'm sorry, 334. The I's are 167. The Nays are two. This bill, having received the requisite constitutional majority, is therefore passed. Erick will read the caption to House Bill 322. House Bill 322, by the way, dour of the 119 to be entitled, an act to amend Article 1 of Chapter 11 of Title 15, Title 19 and Article 2 of Chapter 5 of Title 49 of the E. Viscotta, George Antony relating the general provisions regarding the juvenile code, domestic relations and child abuse records respectively, so as to revise the death edition of sexual exploitation, this bill ever referred to the committee on juvenile justice, that committee recommends a disbilled do pass. Chair recognizes representative Weedower to present the bill. Thank you, Mr. Speaker. Members, I bring before you, House Bill 322, it is from the Department of the Child Advocate. This is a cleanup to the definition of sexual exploitation, since prostitution has been rendered mute for juveniles, we are removing it from the definition of sexual exploitation. I'll stand for any questions. You do not have any questions. I yield the well-banking for your favorable consideration. Is there any objection to the previous question being ordered on House Bill 322? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 322? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 322. The item of the I's are 169. The nasor zero, this bill having received, the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 548. House Bill 548, by the way, I'm going to say, the 13th and others to be entitled to an act to amend Code Section 495, 41 of the fiscal to Georgia and 10, relating to persons and agencies permitted to access records, so it's required for reasonable access to records concerning reports of child abuse to the administrative offices of the courts. This bill ever further committee on juvenile justice, that committee recommends that this bill do pass. Chair recognizes Chairman Dipsy to present the bill. Thank you, Mr. Speaker. Although a very short measure here, one paragraph made up of two sentences, this is very impactful language. It's a compliance bill requested by the division of family and children's services, authorizing the administrative office of the courts to facilitate data sharing agreements to ensure three things. That the court orders are upheld, that we remain in compliance with HIPAA, an additional federal regulations governing the disclosure of protected health information, and that federal funding is not put in jeopardy so that we receive all eligible reimbursements from the federal government. Mr. Speaker, if there are any questions, I will take them. If not, I will yield the well and ask for your favorable consideration. You do not have any questions. Thank you. Please support this measure. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Councillors, in adjourned metal draw time panelhoes. Please vote aye. Yourド K cant leave. clerk will lock the machines. On the passage of House Bill 548, the eyes are 171. The days are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 303. House Bill 303, but was it flattened of the 75th B. Toddl and act to amend. Toddl, 33 of the fiscal to George Antenna related to insurance, skills to revit and motor vehicle, permit motor vehicle insurance companies to offer a reduction in premium to qualified active duty military service members from motor vehicle insurance policies. This bill I have referred to the committee on insurance. That committee recommends a disbilled do pass. Chair is honored to recognize representative Al Williams to present the bill. Wow. I come up so often. Thank you, Mr. Speaker. It's not often you get the majority leader hand you the top off of your spray. Thank you, Mr. Leader. I come to present House Bill 303 on behalf of representative plan. It's a very simple bill. This bill allows insurance companies to provide discounted plans for active members of the US military. And to qualify, this person must be a Georgia resident, active member of the military and supply the proof required documents that are required by the insurance company. And this bill applies to individual and family auto insurance plans or renewed own or after July 1, 2022. I'll stand for any questions. If not, I certainly ask for your consideration passage of this bill. You do not appear to have any questions. That's what I call presenting. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. You shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 170. Or I'm sorry, 303. That's twice I've done that. 303. The eyes are 170. The nasi are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 355. House Bill 355, our representative, we'd hour the hundred and nineteen. The title of the act to amend Article 5 of Chapter 6 and the title 12, the fiscal to Georgia, and the Georgia carbon sequestration registry, so it's to provide for the inclusion of building products and construction on the registry. This bill never refer to the committee. Natural resources and environment that committee recommends that this bill do pass. Chair recognizes representative wheat hour to present the bill. Thank you, Mr. Speaker. Colleagues, today I bring to you House Bill 355. Nature is the living visible garment of God and this innovative measure will have Georgia leading the way on developing a voluntary market driven solution in addressing carbon offset and sequestration. This measure will expand Georgia's carbon registry to include an array of sustainable building products which will be verified and validated. The rigor of this process will have Georgia producing carbon credits and offset whose value will further incentivize innovation throughout our state. As the number one state for forestry in the union, this is not just a win for Georgia-grown products, but for all the Georgia businesses who choose to use materials that increase carbon sequestration and destruction. I'm excited to bring this legislation as it utilizes a private market solution that puts the state of Georgia at the forefront of this issue. I ask for your favourable consideration on this measure. Mr. Speaker, I'll yield for any questions. You have a few questions if you're here to yield. I yield. Chair recognizes Chairman Setslor to your right for a question. Mr. Jim and you. I do. Appreciate your quick run through. Could you give a little bit more detail on this? Forgive me. I've not studied this perhaps as I could have, but are there mandates in this about products? Sorry. There are no mandates in this whatsoever. What this does, it creates a commission that will review the carbon credits and how they're going to, if you'll turn, to me, the biggest portion of this is online 173174. When we establish a carbon baseline, additional evaluation, verification, permits and COVID-19, those six categories will produce a high-quality carbon credit that will be recognized on the global market to incentivize people and the state of Georgia to utilize these credits, but it will also benefit the Fortune 500 companies that are located in this state that choose to be involved in this process, as well as the little guy who wants to buy and utilize any of these products. Mr. Jim, would you further yield? I do. So, this allows our companies to participate in this program, which may be in other places, what I'm hearing you say. This is, as it's obviously talked about very much these days, being carbon neutral, delta being a purchaser of said credits as a perfect example. No one in the states currently has a program like this of this quality that would drive the market to be incentivized to be part of this, completely voluntary. So there's no, this isn't a cap and trade circumstance where there's caps that people would be, or help me understand what limitations folks would have that would incentivize them to participate in these credits. I'm just concerned there may be some caps to this and I'm not wrong about that. There's no caps, no sir. So what this does is it goes through and identifies construction building materials as what's being added to the carbon registry. So that might include carbon infuse concrete or actually studying and verifying and validating how much carbon is sequestered into a two by four. So with those, with that measure being put in place, they have the voluntary option of utilizing those products to earn carbon credits that then are sold on the global market. Okay, thank you. Do you further yield? You've got a lot of questions. I'll yield for one more, sir. Okay, let's see. In the interest of fairness, to recognize this representative, Kausha, and to your left in the gallery. Thank you, Mr. Speaker. That's a gentleman yield. I do. Do you think this bill will incentivize people who love their lawns that take up a lot of work to plant more trees and forests instead? I believe the year accurate, yes, ma'am. Thank you so much for this bill. Thank you for the question, Mr. Speaker. I yield a well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill, or vote aye, those opposed, or vote no, and the clerk will unlock the machines? If all members voted, have all members voted, if so, the clerk will lock the machines on the passage of House Bill 355. The eyes are 169. The nays are three. This bill, having received the requisite constitutional majority, is therefore—\n\npast. Chair recognizes Chairman Sam Watson for an announcement. Thank you, Mr. Speaker. Uh, rule caucus will meet over at 20 hours, uh, upon a German. Uh, we've got Jimmy Lewis with hometown health to talk about our state of a rural hospital and also got Nick DeGioan with them to talk about their side of it as well. Look forward to seeing everybody there. Thank you. Chair recognizes the chairman of the House Rules Committee, Chairman Smith for an announcement. I hear some more booze. Um, yeah, yeah, they're booing back here. Rules will meet at 145, 145. Chair recognizes chairman work eyes are for an announcement. Industry and labor will not meet today. We've been, we're counseled, but tomorrow at 10 o'clock at CLOB 506. And we're going to meet meeting from 10 to 12. Thank you. Chair recognizes chairman blackman for an announcement. Thank you, Mr. Speaker. The full ways and means will meet immediately upon the recess here, the 12 o'clock meeting in room 341. Thank you very much. Chair recognizes chairman Martin for an announcement. The speaker due to the house schedule today, the higher ed committee meeting originally scheduled at 1 p.m. Today will meet will be postponed. We will meet at noon tomorrow. You'll get an announcement. Thank you. Chair recognizes chairman Collins for an announcement. The public safety Homeland Security Meeting schedule for today has been canceled. However, the subcommittee meeting will meet upon the chairman in room 406 at CLOB if we're able to. Thank you. I have an announcement to make at the request of the clerk's office. Please those members that have tablets, please turn those in as you leave for lunch so they can be charged over lunch because they may need a lot of battery for the remainder of the day. So turn those in as you leave for lunch. This house will be in recess for lunch until 2 p.m. Rules committee meeting at 145.",
  "updated_at": "2026-02-13T11:01:37.457312+00:00"
}