{
  "video_id": "zyKbp5fexFk",
  "url": "https://www.youtube.com/watch?v=zyKbp5fexFk",
  "title": "11/14/2023 - Senate Study Committee on Truck Driver Shortages",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 105,
  "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Truck Driver Shortages session:\n\n## Overview\nThe session focused on the issue of truck parking in Georgia and nationwide. The committee discussed the current supply and demand of truck parking spaces, the challenges faced by the industry, and potential solutions.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The committee chair noted that they aim to keep the meeting short, around an hour, to make it easier for senators and the public.\n- The chair opened the meeting with a prayer.\n- The committee discussed statistics on truck parking supply and demand nationwide and in Georgia, highlighting the significant mismatch and challenges faced by the industry.\n- Georgia DOT presented an analysis they conducted on the state's truck parking footprint and potential solutions.\n\n## Votes\nNo recorded votes were taken.\n\n## Attendance\nThe chair noted that some senators were stuck in Atlanta traffic or may join virtually, but a quorum was present to proceed with the meeting.\n\n## Adjournment\nThe transcript does not indicate when the meeting was adjourned or the date of the next scheduled meeting.",
  "transcript": "I hope everyone is having a great morning. We're going to get started. I know Senator Jones is on the way stuck in Atlanta traffic. And I see good morning, Senator Dozal. I know Steve Gouge will be joining us and I'm not sure about Senator Islam. So we'll see if she joins virtually. We have four presenters today. I expect to be done probably in about an hour. As I was joking earlier, I don't know, you know, if we don't have long study committee meetings, I'm sure everybody in the stream is okay with that. No offense to the senators that has six hour ones. But just want to kind of get to the point, get out of here. And then if anyone has recommendations or ideas they want to share with the study committee. We'll accept those basically through today. And then we'll put together a report and then we will schedule. I don't think we put it on the calendar yet. The next meeting, which will be the final meeting where we'll vote on the report. And talk about the recommendations made to the public. So I think we're working through. Seeing if we can do that during the special session, if possible, just to kind of make it easy on the audience, the senators, everybody involved since we'll already be here. Working on other matters. So I'm going to open us up in prayer. And then we're going to get to the first presenter. Dear Heavenly Father, thank you for bringing us all together today. Safely in Atlanta. I pray for everyone in this room, their families, I pray for the senators that leader communities every single day. Back home. I pray that our work here is an honor of you that you guide us to provide wisdom and grace when needed. And as you bless and watch over our state and our nation during these times, we pray for the people of Israel. We pray for the conflicts and the people who are fighting for peace around the world. And that you hold in your hand and be there for those that need you right now. Amen. Thank you for being here. Thank you for being here. Thank you for being here. Thank you for being here. Thank you for being here. Thank you for being here. Thank you for being here. Thank you. Thank you so much. So first to get started, I wanted to provide a little bit of kind of a tale of the tape, if you will, about truck parking nationwide in the state of Georgia. And then we will talk about our private, private-owned spaces versus public spaces and places such as rest areas. And Georgia, that number is around 27,000. This isn't ever moving number just to be clear. So that 27,000 was as of 2022. And so that's, you know, frequently as new, as new facilities come online and places change. So that's average number for the state of Georgia. And while truck parking supplied does not keep up with demand overall Georgia relative to the nation is doing pretty well related to truck parking as of 2019. So that's the top five states and the nation, the total number of public truck parking spaces. So that's, that's, it's not enough. It's not sufficient, but it is relative to the, to the rest of the nation, something that we're working on. And truck parking is one of the top concerns within the industry, the top five challenges. By according to the American Transportation Research Institute, which, which researches the stuff very thoroughly. Based on their annual surveys, it's one of the top concerns among drivers in the industry, among, you know, nationally 98% of drivers report having trouble finding parking. This is a significant workforce issue. It's a significant recruitment issue, especially among women drivers, making sure there's adequate and safe parking as we try to grow. Both men and women into the industry. It's a, it's a specialty a key concern there. And so just looking at, you know, the couple of other statistics, well, there's related. You know, for every one available parking space, there's 11 trucks looking for that parking space. So you see that there's a definitely a mismatch between supply and demand. And the average driver spends nearly an hour of available driving time looking, looking for parking, which is a significant, you know, loss of time, which equals loss of money. And so these challenges are important to the industry in all aspects. And so these are the solutions and contributors to the truck parking. One hours of service regulation that are monitored by electronic locking devices now make it, you know, more of an acute need to stop when your time is up and to be able to find a safe place to stop is an important needs that drivers will have to build that into their into their day and into their plans. And so just in time delivery staging for delivery windows can cause challenges for looking for for for parking, making sure that you're timing your delivery to be in the window that the distribution center deliver once you to and then just overall growth. And so this is going to be a significant and a significant amount more need for for freight movement, which includes more trucks, which includes more drivers includes more vehicles looking for looking for spaces. So just an overall increase in demand based on our growing economy and a growing number of freight vehicles that'll be on the road. All that as a backdrop, Georgia DOT started in 2020 we concluded in 2021 and rolled it into our state freight plan, which just recently came out. We wanted to do an analysis of our state footprint when it comes to truck parking really to understand the supply on the ground and then the potential demand for truck parking as it is in Georgia. So we we included a lot of best practices and information and that we got from partners in other states from data and research and findings that we were able to incorporate through our national partners and research and use that to help us really get a look at that that supply picture and that demand picture. So we looked at all of our our the national freight network, which is all of our interstates our state freight network, which includes grip corridors last mile connections, the strategic highway network, which also includes, you know, the major corridors from Department of Defense purposes. We also used a 30 mile buffer into adjacent states around as we all know, freight does not stop at the state border. So we really wanted to make sure we understood what are neighbors doing right across the border that have an impact on what we're doing in Georgia as well. And then looking at the existing conditions, the parking supply. So that's public spaces in Georgia that's rest areas visitor centers, waste stations, which account for only about 6% of the spaces in the state of Georgia as I mentioned at the beginning of the vast majority of the spaces in the state and in the nation are privately privately owned and operated 94% of those here in our state example of things like flying J and loves and pilot and those that operate those as well. And then we also wanted to get a bit of an understanding about what we would call unauthorized spaces. So that's the ones that people understand, obviously, is the problem right the part the trucks parked on the interstates that on the ramps places that aren't in a designated space and help us to see where we're seeing those more acutely potentially and help us understand where my priorities be where my opportunities be to help address those challenges. So from a from the state standpoint from a public public parking standpoint, we have 47 truck parking locations. And again, these are just the Georgia locations I mentioned we did do a scan of spaces in bordering states around, but this is just the state spaces 1700 and one spaces and again that that constitutes about 6% of the overall truck parking spaces. So when we think towards solutions and we think towards what are ways to address these challenges, we understand that there's a limited ability just from a public sector to be able to truly impact it ourselves will have to definitely engage private sector partners and really understand how can we enable them to be successful in addressing these challenges as well. private truck parking, 481 locations about 20 25,000 spaces. Again, these numbers change. There's actually more like 27,000 is the last year that numbers are kind of a moving ticker as well. So just to give you a sense of scale of where spaces are within the state. And we looked at ranking these in two ways. One is primary spaces that those are like we said, loves pilot, flying Jake, etc. places that their primary business is truck parking. That's what they provide as a service and as their business model. And then also looking at secondary parking, which are the places that it's not their primary business, but they are truck friendly so it could be like a Walmart or big box retail places like that that allow truck parking, but it's not necessarily their primary business. So we wanted to make sure to understand those those as well. So that was giving us a sense of the supply that we have for the state. And so now we wanted to turn to the demand side and get a get a sense of what the demand picture would look like. And one of the first things wanted to do is understand, okay, where is the freight going? You know, what are those freight intensive businesses and where are the concentrations of them to help us understand where are the trucks going and where might they then have a need for additional parking because that's where they're moving to. And not surprisingly, you can see through this through this heat map concentration. It's primarily metro Atlanta up the I 75 corridor north, I 85 corridor northeast. And then of course, down in Savannah near the port as well, but just seeing some of that concentration of where some of those those areas where we're seeing potential future demand based on the businesses. We also used access from battery, the American transportation research institute that I'd mentioned before getting truck movement data through GPS to help know where trucks are moving where trucks are stopped. So this represents truck parking clusters of six hours or longer. So it's where trucks are registering no movement for six hours or longer, which gives an idea if that's where they're where they're staging. You know, this is not necessarily unauthorized. This could be in a parking space. It could be in a distribution center. But it's the idea of where the concentrations of parking. And again, not surprisingly, metro Atlanta is a strong strong concentration and up north along the 75 and 85 corridor and then down towards the coast where the where the port of Savannah is as well. So I'm really equate this data here, which is interesting. This is based on as the truck drivers are logging hours or how how do we know that like they're just pulled off to the side of the road and they can't find a spot. So this is not necessarily based on it. Okay, they can't find a spot. It's GPS data is having not there's either right or stationary. And for this, we actually were able to do using that same GPS data, but doing additional deeper dive of location. To get this sense of where are those that are part of what we would consider unauthorized parking. So where are they parking that would be on an interstate court or more on an on an interstate ramp. So it if use that data to determine more precise location near a ramp. So it gives you this helps to begin to paint a tour picture of a KWIR is additional demand highest and areas that that trucks for whatever reason they may be parking on the ramp because the lot is full they may be parking on the ramp because they don't want to use pay for a private facility. So we don't know a reason why they would be using it, but this is just a location. And so you do see clusters along Northwest on 75 and further up in Northeast Georgia. And then down 75 in the Griffin Spalding but county area on that that quarter just south of Henry County. And as anyone is driven down along that corridor, seeing trucks along all of these as well. Let me ask you this question because it feel like in a man living Northwest Northwest Georgia travel that part of the state all the time. And this heap map maybe kind of is demonstrating this, but it seems like there's the beginning of a once explosion, but. And it's an I don't think it's necessarily because of all the logistics and supply chain companies that are, you know, the carping manufacturers expanding facilities, the growth, all those things that are happening. But as some of this indicative of going back to the slide before where you know if you're analyzing data of where trucks are parking, you know, 30 miles into the next state. I mean, at least, you know, I think to the average person is probably not recognizable that in and around Chattanooga, once you cross Tennessee state line, I mean there, there is no place for trucks to park and I don't know the state of Tennessee is necessarily addressing it. Maybe they are, but I'm not aware of that. So is this kind of a symptom of especially as trucks may be traveling north into Tennessee. It's kind of loading up in Georgia because they know when they cross over. It's kind of Newman's land to either get to the other side of Montego or up towards Knoxville. So I think it could be, if we think about the entire network and then what is that load place and on Georgia. It could be some of that. I do think part of this is probably trucks preemptively stopping before they get into Atlanta. And then they're going to get in and hit traffic or there may be closer to their hours. And so they don't want to risk having to find that in Atlanta. It may not be able to meet their window. So I think there's a couple of double it's sword, maybe, but it could be going north as well. I think a lot of that. As you're seeing it move a little further out from from the city. So I think it's going to be a lot of things that are seeing some of that. Playing into it. Okay. And again, this, I mean, it's good that you're asking those questions because that kind of leads into sort of, I guess our conclusion sort of our next steps. This data doesn't tell us why they were there. It just tells us that they're doing it. That it's likely in, you know, on ramps and it's likely because there's not sufficient parking in that area. That's where they would likely want parking if it were available in that area. So it helps us understand where it doesn't give us that picture of why it doesn't help us to get a more detailed understanding of what the between the truck driver, the operator, the car owner, the county or you're seeing her. Yeah, understanding why that picture is the way it is and what then might be a solution to address that that why. So we do have a lot of different public data. I know there's all kinds of data out there, but do you all collect data or collaborate with public safety, murder vehicles in terms of the data in terms of understanding some of these stories of you know how this comes about, is there any cross sectionality between that are not really. We do share with them what we can. I'd have to find out more specifically what we might have from data, but we do try to work with all of our state partners. And I mean, you mentioned Tennessee, we do try to work across state and understand what's going on in other states where we can to understand it. Again, it's a national challenge. And what happens right over the border, especially from a public parking standpoint, is it impacts our state. So we do want to make sure we're talking to each other and understand what the situation is right over the border. Got it. So anyway, so that kind of leads into, again, we can see based on inventory of supply and inventory and looking at the GPS data, just sort of understand where the demand, then we have to see what might be strategies that we can do as DOT to help support the growth of truck parking in the state. And again, a lot of it's going to have to be private sector driven. And so in any way that we can partner the authority, you know, the P3 models that we already have existing or understanding policies that might support truck parking, we want to make sure that we, you know, working with the private sector and know that it's going to be their growth first. And then we also have a role to play both from the potential for technology to be able to make the lots operate more efficiently and provide more information, as well as to where we can, if we can increase the number of spaces we have that are publicly owned, we look to try to do that as well. We, you know, allowed back in 2020, we started allowing truck parking at the waste stations, which is, you know, increased supply by allowing trucks to park at those, at those waste stations. And another way we're looking at potential truck parking expansion. So we're actually looking through all of the lots that we own and operate to see where we might be able within the existing footprint without having to do, you know, massive amounts of right away purchase or too much engineering where we can add more capacity. It may be repurposing under utilized car parking spaces for truck parking, adding more truck parking spaces along, especially along some of these key corridors. And so that's a way that we want to want to try to provide additional spaces where we can and the public lots. So we've been, we've been going through and doing some scoping analysis of our different lots. And we do see that there are some potential opportunities where we may be able to add spaces. Some of that will, you know, comes with a, comes with a cost. So we have to understand how we can prioritize within those, in those spaces themselves on what we might be able to, to provide funding for, to expand before we could others. But we are looking at those, those opportunities. Also, I mentioned technology. We do want to make sure that where technology itself doesn't add more spaces on their own, but it does help make them potentially operate better, provide more information. There's a couple of ways that the technology could do that. You could either use in the ground like that left picture is a, you know, one of those like sensors actually on the space that can help monitor the number of spaces, help you understand utilization. Camera technology, that's evolving a good bit quicker. It's probably more likely that we would install something like that as opposed to the physical infrastructure. But, but using that technology to monitor the spaces to help understand what's available and then be able to share that information, whether it's through our 5-1-1 system, that goes out publicly. Wastation or a signage on the interstate pointing to the number of spaces that might be available. So, as a driver, like we mentioned, along 75, as they're heading potentially towards Atlanta or, you know, away from Atlanta, and they need to get to a space to have an understanding of what might be available ahead. And so they can think, okay, if I know there's spaces available, I don't have to pull over on this ramp or have to, I can make it, you know, up there to that space. And then in cab notifications, potential, I mean, I show that yellow screen. That's a drive-wise company that provides in-cap technology. G.Dod is already partnering with them on a pilot project down near the port of Savannah. It's not on truck parking, but it's on in-cap technology for signal preemption and for notifications about gate operations at the port to help provide real-time traveler information for truckers going in and out of the port. So something like that might be a way to expand upon that and share that information more broadly to improve that. And then lastly, as I kind of mentioned before, sort of our next steps is, we're looking to provide sort of a deeper dive on some of these aspects of the supply and demand. And really, we mentioned that private sector inside is really to understand from the truck drivers, from the shippers and carriers, to understand some of the, what's the future demand look like? What are some of the motivations or some of the trends and the things that they're seeing to help us be more intelligent about how we prioritize the work that we can do at G.Dod and then how can we best support the private sector as they look to grow and to meet this challenge as well. So anyway, thank you very much for the opportunity to share this little bit of information. I'd be happy to take any more questions and thank you. Thank you, Matt. Is there any questions, Senator? Does all or anybody on the museum have questions? I'd none for me, Mr. Chairman. I was very thorough and informative. Thank you. Thank you. A couple of questions I had to follow up. This may seem like a silly question, but when it comes to infrastructure for truck parking or anything around this, are there more friendly counties or communities in terms of partnering or are there communities that say, don't build this or don't bring loves off our exit, off the highway or anything like that, are there communities that say, go somewhere else? Does that ever come up just curious? So I will say, I think even the local communities that have interstates going through their community recognize the challenge with truck parking. Land use decisions are a entirely local decision, so we don't get involved from that standpoint. But I will say, I think most everybody understands the challenge from truck parking. I think that everyone would prefer a safe option versus an unsafe option. But again, those are up to the locals as far as it when it comes to placing private operators. And one other question, I mean, outside of land, what are potentially policy deterrence or what are barriers that you think the flying jays or the loves may be encounter in terms of opening more facilities in Georgia? Is it financial? Is it regulation? What? If they have barriers or challenges of maybe opening new facilities, what would those be? I mean, I think part of what we're hoping to gather from this next level analysis we're going to do is answering those questions more completely. I think there's, I couldn't speak for them about how their business model would work or how it impacts decisions on where to locate or the size of their facilities. But we're hoping to gather some of that insight so it can help us. If there are barriers or burdens or challenges that the state might be able to address, maybe there's something that could be shared. I think it could work both ways, both from a is it a regulation that might need to be trimmed back or they are some sort of on a positive standpoint or some kind of incentive to incorporate additional parking opportunities when people develop a site or facility to see how we can address challenges that way as well. Yeah, I think some people have near-ity addresses, but I think some people probably have the misconception that GDoc can solve all the truck parking problems in the world. And I think the only way we really tackle this, I think it's through the private sector interventions and being strategic about these different kind of nodes or growth areas like 75 or 20 or wherever they are up 85 up through the state. Because I think there is, just speaking for truck drivers, there is a quality of life and we're issue and we already don't have enough drivers to fill, I think positions, but then I think the other thing too for the smaller companies, the zero to five owners, owner operators, the toll on family costs, other aspects of their business, to kind of keep their doors open if they can't basically get rest and do just basic things or security. Some locations, it's pretty bad. We've heard some of those stories. Well, thank you for coming, Senator James, welcome to the CSR. No, you're good, you're good. We're just talking with DOT about truck parking. Do you have any questions? Just on the topic of truck parking for DOT while they're here. Okay, cool. Matt, thank you, thank you. Tell the commissioner, thank you. Oh, well, thank you very much. Next on the agenda, we have Grant Smith, partner Adenis, Corey Smith, and Dixon. I want to Mr. Chairman. Good morning, ladies and gentlemen, the committee. I'm here to talk about a litigation issue. And I think Georgia has two statutes that we call the direct action statutes that put motor carriers in Georgia at a tremendous competitive disadvantage to other states and it's incredibly unfair. So what the statutes are is Georgia is one of the minority states that says that if a plaintiff has a lawsuit against a trucking company, the plaintiff can name the trucking company's liability insurer as a defendant in the lawsuit. And the reason that's incredibly unfair is there was a 1959 study done at the University of Chicago. And they gave potential jurors some facts and one group got facts with just a regular defendant. The other group got a fact with a defendant that included the insurance company. And across the board, jurors tended to give not only more money on cases where the insurance company was named as a defendant, but they also tended to ignore facts about liability. So even if the trucking company or the defendant in that study was not liable, the jurors' attitude is, well, it's insurance. Let's just give them more money. So it's incredibly unfair. And to sort of highlight how it's unfair, I've spent my 36-year career defending trucking companies and it's small and big. But for instance, on the other side, if a plaintiff has health insurance, our rules of evidence don't allow me to show that the plaintiff has health insurance and that health insurance usually only pays about 40 or 50% of what the doctor bills and the various reasons for that. But to allow a plaintiff to join a trucking companies, I'm sure, is completely unfair. And again, because jurors...\n\nwas 10 to not use it. Now, our Supreme Court has looked at the issue and the sole reason for allowing a plaintiff to join a trucking company is insurer and a personal injury lawsuit is to ensure the collectability of the judgment. Like, call that a solution for which there's no problem. I've been doing this for 36 years. And in every case I've ever seen, if the case goes to a verdict, either the insurance company pays the judgment or they appeal it and at the end of the appeal they pay the judgment. And there's good reason. If they don't, we've got bad faith laws that say if the insurance company owes a judgment, they don't pay it, a plaintiff could get punitive damages, attorneys fees, expenses, litigation and post-judgment interest. So it's not really even a problem. And let me just give you three examples. I've tried a number of cases over the last four years. I think I got one of the first what we call nuclear verdicts down in South Georgia in February of 19. And we had a single wrongful death case and my research in that case indicated there had never been a verdict in Georgia for more than $10 million for a single death. And we tried the case and the jury came in at more than twice of what the plaintiff demanded in the case. And in that case, the insurance company was a party to the case. And I can tell you, I don't know what's happened. But my client told me after that verdict, they were very strongly considering pulling out of the state of Georgia because of that verdict and because of the insurance company being involved in a case. I tried another case in North Georgia a couple of years ago. I think the verdict was about five times what the plaintiff expected the verdict to be. Again, insurance company was a party. The jury's, you know, kind of bought into that. The last one, I tried a case in a very conservative North Georgia county a couple of years ago. The jury came back with a verdict that was about eight times what the plaintiff expected it. And not only was the factor that the insurance company was a party to the case, but the plaintiff's attorney, their main argument in closing was not only was it an insurance company, it was a California insurance company. And again, this is really an improper use. And the reason we know that is under the federal rules of evidence. Every federal court in the United States rule 411 says that you can't argue liability insurance. If you do, it's generally grounds for a mistrial and it goes back to that University of Chicago study. Law schools have been teaching this for years and years and years that jurors tend to misuse liability insurance information. And that's why we don't let them know that. So I can tell you, in 36 years, I've represented anything from a single owner, mom, and pop up to the biggest trucking company, some of the FedEx companies. But the vast majority of my clients are those, you know, one to five to 10 truck companies. And it has a tremendously detrimental impact when they have an accident. And if the insurance companies are party and they have to pay multiples of what the case should be worth, then what happens is when renewal time comes up, their insurance rates go up. And as you well know, these companies are operating on a very, very thin margin. And if their insurance rates go up 20 or 30%, that puts them out of business. I mean, they're out. And then what happens is those loads that the smaller mom and pop companies were doing go to the midsize cares to the bigger cares, they've got pricing power. They can raise their rates. Well, what ends up happening is we all pay for that. Everything in this room, everything we're wearing was delivered by truck. And if you're driving up rates unnecessarily, then it has a detrimental impact not only of putting small companies out of business, but it's inflationary. So it's just, it's a solution without a problem because again, the insurance companies pay the judgment. If they don't, they're going to get popped and they know that. So there's really no reason for it. So there's a very, very simple solution to this. Instead of having these two statutes that allow plaintiffs to join the insurance company as a party defendant, all you have to do is say, okay, let's take the insurance policy. We could admit the policy into the record. Meaning it'd be a part of the court's record. But the jury doesn't know about it. And you don't send it out with the jury to consider when they consider the case. And then if there's a judgment against the insured, then the judge just makes the judgment against the insurance company up to the policy limits. It's a simple solution. It absolutely meets the Supreme Court's stated purpose of ensuring the collectibility of the judgment. But it takes away this terrible, prejudicial impact that you have on these motor carriers. And again, it impacts every motor carrier in Georgia. But I think it has a disproportionate impact on the smaller clients, which I think. Thank you. We've got a questions. Then I'll ask my question. Senator Jones, did you have a question? You might get many. I believe this law was changed somewhere in the early 2000s. Is that correct? Yeah, it's I think what was the reason behind? Well, there were some technical reasons. The older law said that if if the motor carrier didn't file the proof of insurance with a department of revenue, then the plaintiff could not make out their case. And our legislature said that's a little harsh. They wanted to make it so that as long as the motor carrier had coverage and what what would end up happening is if you had a motor carrier that didn't actually comply with the law and file, they would get the benefit of getting the insurance coming out. And that's kind of not fair, even on the defense side. So that was the reason that they changed it. How do we avoid that this time around? Well, again, all we have to do, the jury doesn't have to know about the insurance company and think about it. Every other personal injury case in Georgia, whether it's an individual motorist, if you're in an accident and somebody sues you, the jury doesn't hear that now they know we have mandatory insurance, but they don't know that your insurance company is there and they don't know the policy is there. And that's what that university Chicago study dealt with, product liability, any kind of personal injury toward every other case insurance is not a part of the case. And so again, if you take the company out of the case, so the jury doesn't hear about it, you can put the policy in the record. The court can have the policy. And then if there's a judgment up to the limits and then the way it would work is let's say the limit, you know, a lot of my clients have a million dollar, you know, comprehensive, combined single limit. Say there's a three million dollar verdict. What would happen is because of the policy limit, the court could enter the judgment against the motor care up to the policy limit. And then the individual would have the verdict for the rest, but it's an easy solution. Again, it's a solution without a problem because I've never heard any plaintiff lawyer complain to me, oh, I got a judgment against my client and the insurance company refuse to pay. I mean, unless there is a coverage question that just doesn't happen. So it's not a problem. And again, the Supreme Court said the only reason for these statutes is to ensure the collectibility of the judgment. Todd, what is it, Jim? So in today's environment is the court able to award three and four times what the policy limits are? The way it would work is the jury decides what the judgment is. Let's say there's a million dollar limit and it's a five million dollar verdict. So what would happen is the insurance company would only owe the million dollars and then the driver and the trucking company would be on the hook for the remainder. And so it really doesn't change anything. Again, the purpose of the statute, the idea was, well, if a member of the motoring public is injured, we don't want them to have to sue the insurance company to collect the judgment. Again, it's not a problem. But again, if you put the policy in the record, it's still short circuits that would eliminate any need for somebody to follow lawsuit. It gives them a direct judgment against the insurance company, what solves a problem. But it takes this terrible prejudice that impacts our trucking companies. And by the way, I tried to do some research and I've read it somewhere. I believe there are only about well states in the United States that have this direct action statute. We're in the vast minority. Most other states don't have this. And again, I think for the stated reason of that University of Chicago study. And would the insurance company still continue to provide the defense for the insured 100 percent wouldn't impact anything. Everything else would be exactly the same. I'm still trying to understand how that would put downward pressure on some of these outlandish claims. Because I remember there was a claim in Columbus a few years back for $19 million out of them. Well, I should have been a carrot. I would care that kind of insurance. I was actually the 27 million four months later. There was 120 million. Then four months later, there was a 280 million. The 120 was a premises liability case. So there was no insurance in that. So you're right. That was a big number without insurance. But the 280, I believe that was a direct action case. So again, at the end of the day, verdicts are up to juries. But the consensus, law schools have been teaching this for 100 years. The plaintiffs don't get to argue liability insurance because juries tend to misuse it. Their attitude is right, wrong or indifferent. Hey, that's what insurance is for. Oh, look, look at this nice plaintiff over here. Even if the big bad trucking company didn't do anything wrong, let's just give them money. And I'm just trying, I'm advocating to try to take that out of the mix. And again, my solution in it, and it absolutely, I don't believe a plaintiff's lawyer could argue to me that other than collecting the judgment, that's the purpose of it. So you're not taking anything away other than the prejudice of this liability insurance argument. Everything else is the same. They get to argue liability. They get to argue damages. Jury hears everything else. So it's just taking this one prejudicial thing out, again, a solution without a problem because I haven't heard anybody ever advocate to me that there's some problem that if they get a judgment against and insured that the insurance company doesn't pay, it just doesn't happen. Thank you. Thank you, Senator Jones. Senator Gooch. Good morning. Can you hear me? Yes, sir. My hand was raised for the previous speaker Matt, but I'll ask this gentleman a question too. Sir, I didn't catch your name, but have you looked at our legislation that the Senate introduced this past session? We failed to pass due to the lack of 29 votes that we think will have better luck next session. Have you looked at that legislation? It's dinner. I have not, but I believe I talked to you at a meeting this summer, and I think I've sent a proposal to somebody. So I don't know if that would be my proposal, but I'd be glad to take a look at it and give the committee my input. I'd love to have your feedback feedback on that piece of legislation because I anticipate we'll get some movement on that this coming year. Thank you. Thank you, Senator Gooch. Senator, does all do you have any questions? No, thank you, Mr. Chairman. Okay. Mr. Smith, one question I have, I guess just broadly is whether you own 200 trucks or you own five trucks, is there any distinguishing difference between insurance, Georgia law or anything in terms of liability of how the small trucking company should be treated differently than the company with 200 trucks just on its face? No, that, that, I mean, it's a detrimental impact to everybody, but it's just the bigger boys can absorb the hits better than the small ones can. It's more of a practical problem than a legal issue. And this is more anecdotally after 30 years of experience, thousands and thousands of cases with mostly small trucking companies. So basically the pathway that if I own five trucks and I get sued for whatever the situation is, it's really no different. Even if I own two trucks, basically I'm still faced with the same insurance requirements. My insurance company has to pay out all those basic things. Well, I've never seen any research on this, but I mean, for instance, I've represented a number of the FedEx companies. The idea that if a jury is going to misuse liability insurance and say, oh, well, it's a big company, let's just pay. Well, frankly, if FedEx is a defendant, the jury knows they got lots and lots of money. Right. So I've always advocated anecdotally, I don't think the direct impact, the direct action statues impact the big boys as much as the little guys. But if you've got John Jones trucking company and the jury doesn't know anything and they hear Cypress Insurance company, I think that has a much more disproportionate impact on the smaller businesses than it would necessarily on the big one. Now that's that's not based on research. That's just my impression based on experience. Yeah, it just seems to me, I mean, I don't know, you can comment and this or not come on this, but it feels like the smaller the smaller companies, the mom and the pops, I don't want to say they're sometimes preyed on, but it seems like there's a different class standard in terms of kind of what they're able to absorb, not absorb in the standard just gets ridiculous. Based on what we've seen in the courtroom. So I know we, from time to time, we'll hear fictitious stories from attorneys or other senators that want to make everybody believe that there's a different standard, but I don't know that that's really true. At least I've not seen evidence about. I haven't seen that either. Well, thank you for coming. I don't, are there any other questions? I don't think so. Senator Jones, you're good. Thank you for being here today. Next up, we have Steve Siphon with Siphon logistics. One in sir. Good morning. Good morning. Thank you for being here. Thank you for allowing us. I'm going to use much smaller words than the two previous speakers. Our family's been in trucking for 38 years out of Gainesville, Georgia. I'm blessed to be in the state of Georgia. Thank you, by the way, for opening prayer. A lot of their topics are my topics and maybe I can bring it into from a small company's perspective. We started in 84 with four. My dad, my brother and myself, my mom, and one truck. And we've been through some tough years and a lot of good years. And we've grown to about 450 people in the office. We got about 500 trucks to clarify 400 of those roughly or yard terminal tractors that stay within DCs. So it's a kind of a different animal. So, less than 100 trucks on the road and about 500 trailers. We also have a third party logistics company, which I'll be glad to give a red neck definition of that if you'd like. But it's much like a stock broker taking, if you need a stock, you've got a stock broker. They get it for a fee. Well, we match shippers and our carriers with carriers, primarily small carriers. And we charge a percentage. And it helps them get loads and helps the shipper move more fraid. So for us, the number one thing that we can do to make Georgia a more driver-friendly or maybe the number one state in the country like it's been for 10 years in business, as far as a driver-friendly state is help with with the gentleman, the prior to me mentioned, and I'll call it tort reform on insurance. I've got some figures that I'll throw at you. So just our general liability. A lot of our shippers, the larger shippers require you mentioned FedEx and UPS and so forth. Five million liability. In 2018 for a 19 policy, our cost was 1.2. The next year was 1.5. In 2021, it was 2.8. 2022 is 2.2. And then projected for 2023, projected to 24 is 2.3. So you can see the increase in just liability insurance. I'll break down on the number of trucks and this is data that, you know, might confine a more accurate but out of the 430,000 fleets in this country down the state of Georgia, 87% of them are one truck. Then it goes to 2% at 2%, 7% at 11 to 100. And then the big, the big carrier is very good carriers, by the way, are about 7% to 1% with over 100 trucks, which would be 2,800 companies. So as we all hear, small business pretty much runs this country and therefore runs the state. A lot of small good companies. And with the information we just heard on lawsuits in the settlements, what we're finding is the carrier will have a million dollar liability. And then we'll get it, whether it's the trucks fault or not, we'll get a suit in the mail. In most cases, and what they ask for disclosure, they want everything from emails to text policies, they'll sue for a million, they find out you have 5 million, they change it to 5 million. And they also sue the shipper, we have to identify the shipper, meaning represent them. And it just goes on and on and on and on. And I agree, Jerry's good people, but they know very little about trucking other than they get their car dirty and swatched their phone them and they're always in the way going slow. The common folks, that's what we think about trucks. And there are some not so good truck drivers as a rule, I think, a higher percentage obviously are more cars on the road, more trucks on the road, the demand for JIT deliveries. So the insurance is probably the biggest hurdle we have is the largest cause we have, secondary to pay roll for our lack of words. The gentleman with the DOT parking, also a problem, the numbers he gave, we're above what I thought, but if you take the number of trucks coming to and through first, somewhere between 70 to 80% of the trucks picking up are delivered and Georgia aren't domicile here. So they're not as familiar with these locations and I was even with GPS, they're not as familiar with traffic flow and the staging of trucks for deliveries of where do I need to stop prior to I delivery. And I don't want the government to take over our parking, I don't want to take over insurance. I would like to see more emphasis on there is no price for a life, there is no price for a extensive injury, life altering injury, I agree with that. So if there is no price, 100 million, 150 million, 20 million, if we bring that in line, that will allow the smaller carriers, which is the backbone of the country to thrive. They go out, they go after the midsize companies, they get from us, when they get, then they go after the shipper, they get what they can get from there. So it's just a vicious cycle. Another thing that well-intended hours of service in electronic logs or ELDs, I don't know if y'all from the year probably are with that, but well-intended changes not bad. Go ahead and explain it for those that may watch this later. A lot of hours of service is the number of hours a driver can legally drive within a 24 or seven day period. And it's roughly 14 hours on duty with 10 hours drive time. And it's well-intended, but with the ELDs which are electronic logs, which I agree with, just some tweaking, some more conversation about how we can make it better, because what we've found since 19 when they came into effect is we have X amount of hours to drive a day, we get through traffic, so we're on duty time. Maybe that adds an hour. We get to the shipper, it takes two or three hours to get loaded, average about two hours. So he's got seven and a half hours left. After eight hours from when he starts on duty, he's got to take a 30 minute break. Well, the fellow with the DOT said it takes about an hour to get off, get parked, and get back home. So that 30 minutes turns into an hour, the ELDs, and then by the time he gets back on the road, he's got two hours left, then he has to shut down for 10 hours. So he has to find a parking place, has to plan for that, take that 10 hour break. So what has done is taken overnight delivery, and in a lot of cases, they made it a two day delivery, which just increases the cost of the transportation, which increases the cost of what we purchase stuff, because it's a pass-through. So more work on the ELDs and hours of service. Again, I well-intended safety is number one, but basically they tell our drivers, in a lot of cases, when they can drive and when they're tired, and their body actually tells them when they can drive and when they're tired, just because of delays. That's affected. I don't know, we'll be redundant, but other people have already talked about. So let me ask you this, so while you're looking at your notes, so your truck drivers or families you work with, I mean, talk about a little bit more about quality of life, being a trucker on the road away from family, but the dynamics that these, we'll call them supply chain barriers that happen in that eight, 10 hour window, I'm on the road trying to find parking, all these different things, but also the economic pressures that it puts on that individual, which falls back on the family. Obviously, it falls back on you because you're trying to manage all this stuff. But what does that mean for the individual, knowing that I'm under pressure constantly because I'm worried about getting from point A to point B safely, I'm trying to keep costs low. I need to make sure I don't get in a car wreck because a truck wreck, because that's going to be a cost probably back to me as a driver or user owner. But also too, the next phase of this is, I think just constantly worrying over your head while you're going to get sued. But, you know, sued fairly or, you know, kind of indiscriminately just being, you know, taken to the whatever, just because, you know, I'm driving a truck. I mean, it just feels that's kind of what truck drivers I represent in my district or around the state. My dad worked in the trucking industry his entire life, you know, being a young kid in the shop, that's kind of the stories, you know, we would we would hear that my dad was servicing some of his truck, you know, would hear when they walk in the door. And I don't think after 40 years, 30 years, 40 years, that dynamic has changed kind of in our culture, but it seems like it's amplified, kind of where we're at. But talk a little bit about what families are feeling or individual drivers are feeling, you know, kind of as they're going through all this. And then I'm going to send it to John's. He has a question. Sure. Well, it's a tough career. There are a number of people that that's what they want to do. They love being on the road and seeing the country and that's their passion. With technology and with more distribution centers, strategically located, we have more and more what I'll call day drivers, shorter routes. And that's a good thing continuing to shorten the routes and get people home with their families. It more than every other week or even once a week. It is not a gloom in doing tough job, but it is a tough job. They're not always the bad guys, but they're always in the way because they're so big. And finding Park in the Dubai Discuss that is very difficult. The the shippers, again, I don't want this regulated by the government, but the shippers and receivers, they have limited space on their DCs. So they don't want the drivers there more than an hour early. They don't, if they get there an hour early and a lot of cases, they're fine, $250 to $500 for early delivery, because it it chokes down the other trucks coming in. If they miss it by more than 15 minutes, then you've got to call and reschedule. And they may lay over a day, they may lay over two days. There's no compensation for that, because they miss the delivery. Well, try to get through Atlanta and predict the two or two hour, one hour, three hours. So it is challenging. They're very resilient. I mean, there's a lot of proud truck drivers in this country and there's been a lot retired. COVID took a lot of drivers out. A lot of them are coming back. It's a little ironic. And our industry released, I feel like we see the trending about two to four months before the media ever picks it up. We see the turn in the market from a transportation, whether it be the volume or the rate structure. We don't have a driver's order right now from our approach. We got excess drivers today. How long is that going to last? Probably months, not years. And it's because of the slowdown inflation. Obviously, as a part of that, the slowdown economy is just not as much moving. The ports have gotten back up a lot of that stalling, minimizes the number of shipments, even though the ports making record high port is anyway shipments. So it's just the the commutative all of that coming together. But again, they're very resilient. So we'll keep finding a way. So if we can just get some help on the insurance, maybe tweak the EODs and and that was a service to be a little more accommodating to the normal life circumstances, whether it be traffic, you can get 15 minutes from delivery. And if your bell goes off for a lack of definition, you have to stop. You can't go that last 15 minutes to make delivery. The FMCA dings your score and what your score gets to ex you your own conditional rating, which means the shipers can't and can't afford to load you for liability reasons. And it's very hard to get that score back up. Only get it back up is by moving and you've got to have loads to move. So it's kind of redundant. That doesn't help. Thank you. Senator Jens, thank you, Mr. Chairman. And I'm trying to figure out how soon in the goons, you're going to get the majority to get it as 29 votes. So we can carry this legislation next year. But you're going to vote with this Senator Jones? I voted last time. Vote for these truckers. There you go. But I have a question. We kind of think of if we're taking something away, what else can we give? And I use this hypothetically, by the way, if there's an opportunity to repeal direct action, what reforms do you think the industry, the trucking industry can make in its change for this kind of action from the general body? That's a good question. I mean, where we're headed, you know, deregulation started in 1980 as far as what we call for the transportation world. There was a monopoly of the handful of carriers and the wisdom of our leadership in this country said, no, that's not right. We're headed back towards that. If the small to medium, we don't even show up on the map that we're 400 and whatever million dollar company. We still don't show up in the scheme of things. So the ones that 87% that are one truck, two trucks that they're obviously way down, then you're going to end up there was a carry, a analyst speaking at Tyson's carrier meeting in Arkansas a few weeks ago and he predicted by 2030 or 35, there'll be 15 carriers in this country. Not disagree with that. But his reasoning is all above that they're self-insured. They don't have the deepest pockets in the world, but they do have pockets. And we don't want to get back into that monopoly. We won't create a much of what carriers we can use and the flexibility at least.\n\nThat's my view of how we get our freight moved and more efficiently. When I think of reforms, are there any say addition to safety devices, technology, education, drug testing, with crack parking spaces and then distribution centers have been built? And those are, is there anything along those lines in reforms that we can consider? Direct as well. We have to. I'm not all solid, at least from our view, very thorough and very much needed, especially in a lot of ways, but the way we're headed. Again, I don't like mandates on private business, but those DCs, if you'll watch, they have a massive, beautiful building and very minimal parking. And it might be a thought to say, okay, if you're going to, if you're going to do, you know, 250 loads a day, staging those trucks. You're required to have X amount of space for those stage trucks, because if they're not parked there, they're going to be in the neighborhoods all around it or trying to find their own side, they illustrate a lot. That's a lawsuit because it's a cancel all over there there, they're there every time you up down the road, you'll see them. They got nowhere to go, so they're going to park right there. So, so maybe increase the parking square footage and, and I know UPS does this. We stage trucks there, we do a good bit with them and FedEx as well, where they have a staging area, because they don't want to miss delivery to your house. So, if it's 30 minutes down the road and get stuck in, they stage them on the yard, at least for that shift and then bring them in and they get it off the truck. So, that's, that's a good angle to look at. Any technological, logical advances, you think the industry needs to make or. And the ways helps a lot. I mean, that's not the government and that's okay, but, but, you know, I don't know about you all, but I'll be a games with Georgia. If I don't put it in ways, I mean, it's my plane sometimes and all I had to do was listen to go around what doesn't make sense, but it's right there. Yeah, the technology is, is coming in here. Just the predictability of what's ahead of you and knowing that which used to be the CV back in the day, but, you know, I think the, the, the ways type apps are really help and transportation, especially if you're not from the area. I'm just trying to anticipate what some questions that would be asked by those that will be opposed to repeal indirect action. So, anything that the industry can offer up and if there's anyone else out there that has any suggestions, by the way, that would be helpful. As we consider a legislation from Senator go to would be extremely beneficial and trying to move. I think that if you take a number of carriers, enough cares out of the market, because the can afford it. How you going to get your product. So we got to protect these small companies in a fair way and allow them to afford to be able to do business or we may be waiting a few more days on our product. And I agree small companies certainly not 87% that you mentioned certainly needs to be protected, but is there anything that 87% can offer in this change for these kind of actions that the general assembly would take. That's I guess that's depressing question that some of the members in my car is we have they perform a service that we have to have. And we should allow them a way to do that that's fair for both sides. So hopefully someone else in you any. Yeah, somebody light on it will be certainly beneficial to me. Thank you. Thank you for your presentation. Thank you, sir. Just question. We got a couple more questions. Oh, let me let me I want to explain on Senator Jen's question and Senator Guch. I'm coming to you. What I mean, in your opinion, I mean, running a logistics company, what what are maybe a couple of the top two myths that are out there that you hear either attorneys or others say about your industry that when you hear it or your drivers here, it's kind of like, you know, that's that's not true or that's kind of. You know, inflating what what's going on with reality in terms of cost or insurance or lawsuits. The data is hard to get accurate for the average person. The vast majority of accidents are not caused by the truck. They just aren't, but they get sued anyway, because of the big truck. And and in my view, they're not really after the truck. They're after the deepest pockets. They can fact, you know, and you've got a personal top of a truck. The one call that's all and I'm not it is what it is. They're strictly going after as much money as they can get. And again, I've already said there's no price on life or or devastating injury. But some kind of moral ethical way of saying, yes, you made a mistake. Yes, you should pay for it. Should it put you out? Sometimes, yeah, you know, a lot of times no. And being able to determine that, you know, Jerry's decided a lot of things and we got the greatest legal system in the world in my opinion. But educating them is really difficult and a short court case on what what the responsibility of the driver is, what the responsibility of the three PL is and what the responsibility of the ship is. If if MCA says this is a safe carrier, if our government tells me this carrier is qualified and I load them and then they prove or try to prove I'm negligent in loading this carrier. You know, what I'm for. Can I go? You know, so it's a basically I'll paraphrase what you're saying. So basically a truck driver sometimes is the means to an end of somebody maybe making profits or becoming rich off of a situation, especially if it's documented off their safety tests, everything documented. A truck driver or the company is safe, but the truck driver at the end of the days, the means to end to basically open the insurance companies pocketbook. I don't know the divorce attorney that says you don't know me anything unless you lose. If you win, it's when you're paying. So I haven't heard of a truck accident where the truck and company sued the the the document of the car for $20 million. Yeah, they get the truck fixed and maybe there's a civil case of an injury, but in most cases, it's just get the truck fixed to move on. The reverse is almost always the case when it's a truck because they see it as an opportunity. I got a really good friend that was in the legal system for criminal and the voices and he's out. He's strictly an injury cases now. And his exact words, he wouldn't believe the money in this and I said, well, I have to sleep at night. I appreciate that. Senator Goods, you have a question. Yes, morning, Steve, I hope your dad, Jim's in the audience and as well. He and I talked about this issue quite a bit over the past year or two and I think we're moving in the right direction on direct action. And some of these other issues with truck parking and I like some of the ideas you you've talked about, but there was a conversation he and I had a few weeks ago. And if you don't want to talk about it, it's fine, but we were talking about how difficult it is to get these new trucks permitted in license and on the road once you take possession of them at your business. So if I remember correctly, you were purchasing 50s or 100 brand new trucks at a time and it may take months before you were able to use them. So you're basically tying up all that capital and you're not being able to put those trucks in service for quite a while. You're waiting for the either the Department of revenue or motor carry or some other state agency to get those approved to where you put those on the road. Can you expound on that for the committee? Maybe we can learn a little bit more about that this morning. Well, I don't have the exact happy Ferguson. He's been with us for 30 years, obviously, to speak to this on the number of days, but I know pre COVID. It really wasn't a problem. We understand what COVID did and getting the big machine crank back up is difficult. This great country, but it is taken months longer than normal. So we purchased the last 10 that came in the last week or two. We anticipate it'll be sitting there for 60 to 90 days before we can get them on the road. And we're already paying for them. So the next 10, the next 10 is it is hopefully getting better, but just getting the tags and everything. The permitting done. It still has a glitch. And we're talking about brand new trucks with zero miles on them. Correct. These aren't used trucks with a million miles of record service. Yes, sir. We only bought new right. That's that's troubling to me that it would take 60 to 90 days for the government to authorize you to use a truck that's been built to state and national standards. And you have to let them sit on a lot while you're paying the mortgage on them. So we need to do a little bit more digging into that, Mr. Chairman, in my opinion, I think this is an area we could probably help the truck and industry in a great way. One thing I left out I apologize is for us. There's a lot of drivers available, but but our insurance because of what we've already discussed requires three years experience. We've been with the same insurance company for 37 of the 38 years. And they require three years experience with the right safety schoolers for us to be able to hire driver. And nothing against the big trucking companies. They have their own schools and they should and they can take those new drivers and and cover the liability better than medium or small size company like us. So if it's true for us, then if you take the one or two or five or 10 trucks, they have to go through multiple drivers before they can find one they can actually ensure. Let me ask you a, if you don't mind another question. What is your experience been, I mean, as a logistics company, I mean, obviously every driver has to have a driver's license or renew a license or anything like that. What, what is your experience been in terms of new drivers, current drivers and their experience in getting the CDLs or anything like that with the driver's license. And I think that's like that with the department of driver services says there been any thing you would change if you had a magic one in terms of making it easier less cumbersome. The last date is very good. Okay. I know they presented the last meeting and provided a ton of data. And I think there was a lot of questions. It's in terms of just trying to move people through the system and get them on the road. And I think that's like getting our drivers license is more documentation required, but that's a good thing. You know, get your documentation as long as you have a documentation is very smooth. Okay, at least in our experience. So anything that we can do to help streamline or support DDS and streamline processes really, which we wouldn't be in something we would legislate, but just rulemaking or regulatory is good. And then we're going to have a discussion for our area. So right. There's other areas that may may not agree with me and some wood. So cool. All right. Any other questions? Sarah does only do you say you have a question or did an I apologize I skipped over you. No, sir. Thank you. Steve, thank you. Thank you. All right. Thank you. Is we wrap up Dennis Keane with partner with Boohan. Totally going to mess us up. Valigan. And attorneys. Go ahead. Thank you very much. I appreciate the opportunity to think for being here and traveling so far. My pleasure. I know Mr Smith already has testified a little bit about direct action. I'm going to do my best just not to rehash everything he has said, but I certainly want to add a little bit to some things and maybe touch on a few other. Please. If I may, so appreciate it. I think I think that's always central and hopefully helpful to study committees like this is to understand where the information is coming from. I think that's really important. I think that's really important. And so I thought it'd be important just to a little bit about myself and in my background. And how it kind of fits into I think where you folks want to go with things. I am a defense attorney for the most part of practicing now for 30 years. And a little bit shorter than Mr Smith. He's at 36. So he's got me there. But I've been working with trucking companies just like him and drivers for about 23 of those years. And I'm going to work with a company like you, I think it's really important to be able to get a lot of money from these people. So I'm going to give you a little bit of a look at that. So I think I want to represent it tank drivers for a number of times in other folks and come and also folks who drove a lot of trucks. Some of those young soldiers who ultimately got out and turned into becoming a commercial driver. So I'm very proud of that and kind of like what commissioner King, I think, may have testified and one of the earlier sessions that you had, he's got a soft spot for veterans and I do as well. speak up and do what I can about that. One of the other companies, the type of things I represent are the insurance companies, like you heard that are impacted by the direct action statute. And I make that well known and I know Mr. Smith did as well because in representing these insurance companies, they're my client that is a source of revenue. By me advocating that this direct action statute should be repealed, I want to take business away from myself. And I think I want to do that because it's the fair thing to do. And I think it's the right thing to do based on what the effect that the statutes have had. It's not all about, and I think you probably have heard this for a number of sources. It's not all about big corporations. Mr. Siphon testified about how it impacts him and the vast majority of companies that I represent are these small type companies. And I have a statistic I think I'll get to in a little bit with respect to the type of carriers who are really impacted. But when we look at the statute, it's very, I'll say narrow, if you will, but it only impacts four higher motor carriers, which is a little bit different than just anyone out there. If you're hauling your own goods, you're not subject to the direct action statute. And when we look at the numbers, some numbers that I had from the federal motor carrier safety administration in Georgia, there's roughly 82, 3000 four higher motor carriers. Private motor carriers, there's I think roughly 25, 30,000. So overall, we're looking at over 100,000 motor carriers within the state of Georgia itself. So the direct action statutes impact those roughly 82, 83,000. And one of the things I've always noticed about the direct action statutes is this disparity. Well, what's the difference? And I'm going to talk a little bit in a few moments about the proponents arguments that have been raised from what I have seen over the back when I think it was Senate bill 191. If I'm not mistaken from the previous session, that had come up. And I do want to address some of those. But the disproportionate impact on these four higher carriers, the vast majority of who are these smaller carriers that have maybe the one to five power units up to 50 power units will say for argument sake, that's the the large majority of the type of motor carriers who are out there. And the fact that it only impacts them, I think really undercuts the number of the arguments as to why we still need the direct action statutes. And I use the term, some of these motor carriers are victims of this. And Senator Jones, I think you had asked a question about what is it? What perhaps can motor carriers do in response? Because I'm sure it's not an easy battle to have to talk to other legislatures and whatnot. I say, I'm blessed I've never been in your shoes. They have to do that type of thing. But the the term victimization is something I use for some drivers. And I think there's victims of crimes. I think there's victims of legislation. And I see it motor carriers and particularly the drivers, the mom and pops that we're talking about that are subject to this and feel the impact of it. I think they're victims. So and with all due respect, Senator Jones, my my answer to the question is, we don't always make the victims pay or give something in return for the protections that perhaps they need. And that's how I viewed it with a number of drivers. And I think certainly there's certainly ways to change things within the motor carrier industry. And I'll leave that to you smart folks to figure out how to do that. But I did at least want to mention that. The impact we see. It also creates this this this sense of excessive litigation. I think Mr. Smith has commented on that as well. I've I've have given anecdotal example, a very well respected plane of satirney in the Atlanta area. It could be anywhere in the state. This one happens to be there speaking with him. And he said, he referred to trucking cases with the insurance company as quote unquote easy money. And that's truly how he saw it. He says this is it's just like a windfall. And they know it. And they appreciate that. And there's quite this. I think a number of reasons they advocate what they do to keep these direct action statutes. And I know there's been some presentations already to the study committee here that relate to what plaintiffs firms advertise. I think it was Commissioner King who had one quote. And I think quite frankly it's worth looking at. And I've got another one. And I want to discuss them very briefly. But the quote from one website of a personal injury firm that does some trucking law is as follows, even though a defendants insurance company, including insurance coverage technically should not affect the value of personal injury verdict. People are impacted by the circumstances of the case. No person wants to bankrupt a small family operated trucking company. This is why direct actions and extremely important tool for truck accident victims. When a jury understands that a giant commercial insurance company is responsible for the damages, they are far more likely to issue a larger award. Well, that I think really sums up why they do it. Another firm boasts we know every direct action is an opportunity to present evidence of insurance to the jury, which frees the jury to feel more comfortable to allow a full just award for our client. When you really look at the purpose of it, it boils down to dollars. I mean, it really does. We take an example and Mr. Smith was unfortunate enough to be on the receiving end of one of those large verdicts. I say, but for the grace of God, there you go. I every defense council can. You just can't control facts or what juries do sometimes. But if we look at in the context of take a $25 million verdicts since those are becoming a little bit more popular in the state of Georgia, unfortunately, and at $1 million coverage that an insurance company provides. And, you know, we all have our own insurance. We all drive vehicles. And we can decide what amount of coverage we have. Million dollars based on the premiums that exist for a lot of them today, it should be a lot of coverage and it used to be more than enough coverage. But I think it was Mr. Smith and perhaps someone else say also testified that balance of a verdict if it's a $25 million verdict that $24 million technically has to come from the driver, it has to come from the motor carrier somebody or doesn't get collected at all. Some judgements just aren't worth the paper that they're written on. But I would hate to be that driver have to go home and sit down with my wife and or children or husband and children and have to explain why maybe we have to get rid of our home, why we have to do something because I have a very personal verdict against me in X dollars. The money does come from somewhere and it's not about the insurance company. So the go back to the website that I had now quote that, you know, the giant commercial insurance company, they're only up for the policy limits, whatever that might be. And they've received a premium to pay that. And I fully agree with Mr. Smith when he testified that there's never been an issue when an insurance company that I'm aware of has ever not been willing to pay a judgment for someone they insured. It just doesn't happen. It does impact these good, hard work in families that went all of your districts or everybody who's here listening today. And it does go well beyond the truckers and their families as well. Federal Motor Carrier Safety Administration has statistics to be back from 2017 that about 64% of the total weight of freight is moved by motor carriers. Earlier we heard this furniture, these chairs probably got here from a truck. And that's we have to look at the truckers not being there. We have a trucker shortage. Well, how's that impact? We've all seen supply chain issues. I think Mr. Chairman, I think you joked at one of your meetings about I think Senator Islam had a supply chain issue with her wedding dress. I'm not mistaken. So that that truly we all feel it. We feel it every day. And certainly anything I think that can help truck drivers and help small mom and pop motor carriers is certainly worth looking into. So why are there? And it wasn't that Mr. Smith, I thought that an excellent job. He was just wrong in the number of direct action states. And there's four of them that we're looking at. We're one of four, meaning 46 other states within our nation do not have have these kind of laws. And I think there's a very good reason that he touched upon and probably has been touched upon before. You know, Georgia jurisprudence is pretty clear. I won't cite the rules of evidence that were cited earlier, but clearly insurance evidence is generally not admissible. That is a very general rule across just about every state, even the states that have direct action statutes, including Georgia. It's generally not admitted. So I think that the appropriate question is to ask, well, if we admit it against four higher motor carriers, why isn't it admitted for private motor carriers? How about against doctors? How about against lawyers and lawsuits? How about against senators if they were to be sued in their individual capacity? Why isn't it? And it's because of this policy. Very good public policy, by the way. You don't need the insurance. We've heard information the how juries react to that. And that's very accurate. Just it impacts them. And it does. We're all human jurors or human. They take what they have been raised with biases in everything that they have. They take into the jury room. And knowing insurance is one of those pieces. Like you said, FedEx is every juror knows you're going to have, oh, they've got a lot of money. We all see their trucks. UPS. We see their trucks. Coca-Cola bottling company where I think you had one of your folks's meetings. Just you know the name. You're going to know they have insurance. I think I couldn't put it better. It's the small companies. That same assumption, I think exists. Hey, they're a truck big trucking company. They should be able to pay. But instead of treating everybody equally, it's basically you're setting up an entirely separate class of individuals. Yes, they're basically prey on. That's exactly. And that's why I use the word victims. I really thought it's an appropriate term when you look victims of legislation sometimes. And I think this is one of those scenarios. So we have these longstanding public policies. The disparity I think I've already discussed and many other folks have already discussed. And one of the questions I've had is, so why does Georgia either not see the disparity or not see or recognize what 46 other states already do? And that's where I mentioned a little earlier. I think looking at the proponents of the direct action statue is important. And we certainly know it's not the insurance commissioner, commissioner King. When he testified, and I believe he was probably very active last session as well on it, as he said, he does not have a dog in the fight. And like I said, I don't feel like I've got a dog in the fight because I'm losing business by the lack of direct action statutes. But there is a group that does benefit very well from it. And there's a group of folks who donate a lot of money and lobby hard to try to keep them. And some of the arguments that the proponents have made to try to keep these direct action statutes in place that I think may have come up in the last session. One driver's like to know their insurance company is backing them. Again, I've represented hundreds of drivers, hundreds of motor carriers. I've never had one express a concern, hey, is my insurance going to be there to pay it? That's why they pay premiums. They know that. They've got a contract with the insurance company. If the insurance company breaks that contract, they've got a whole different issue in another remedy for the truck driver or for for anybody else who has an insurance agreement quite frankly. So I've never put a lot of stock into that argument because it's never been an issue with a judgment anything else. Now certainly there's times when an insurance company can reserve rights to pay perhaps because they don't think it's covered, but a coverage issue is something completely different. And these type of lawsuits, it's usually pretty, I'll say vanilla. There's an accident. There's an insurance policy that provides liability coverage. It provides coverage in 99% maybe 99.9% of the cases. I can't think of a claim that insurance company in my personal experience has ever said, yeah, we don't think we're going to cover this accident. It just doesn't really have. I think there is outliers. I'm sure. And I didn't mean to interrupt you, but I think there are in testimony last session under SP1 I know when we asked the opponents of the bill to provide proof of that since there were a million, a million attorneys in the building and the number of times we saw was zero. Yes, sir. Well, that doesn't surprise me. Another argument that I've heard is that direct action statues make it easier to find and sue the drivers and insurers. I think Mr. Smith may have commented a little bit on this earlier and I agree with it. One of the things I wanted to also point out I don't know if it's in the record. Every time there's an accident, obviously law enforcement's involved and fills out police report. Every driver's name address, phone number, is listed on a police report, including obviously for a truck driver. Also below for a commercial case is the motor carriers information listed to us, DOT number that's assigned to them. It lists their address. Very easy to find. I'm not sure if this goes back to maybe somewhere in the 1930s or something where it was a different 1950s, a different set of laws and it was a little bit more difficult to find somebody. In today's day and age, it is not difficult to find a driver, it is not difficult to find a motor carrier, it's not difficult to find an insurance company. Federal motor carrier safety administration requires that motor carriers register with them to have their insurance on file. I have yet to have a plaintiff's attorney in my career come and say, hey, we're having trouble finding somebody. Just doesn't generally happen. Another argument that I thought was very surprising and I want to discuss a little bit. The defendant driver has insufficient resources, resources, insurance companies going to step into their shoes and pay for it. We've discussed that to some extent that well, no, the liability coverage only goes up to the limit of the contract itself, which is fine. There's a different type of insurance that you folks may have that I have for myself is called underinsured or uninsured motorist coverage. That's to protect myself and that's to protect yourselves if you happen to have it. The way that generally works is if you get into an accident, somebody, it's their fault.\n\nThey maybe have the state minimum amount of coverage. Let's say they have 25 or maybe even $50,000, but you've got $100,000 in medical bills alone. Well, how's that get paid? Sometimes it doesn't. If you have your own underinsured or uninsured motorist coverage, that applies or it should apply. But that's you protecting yourself with that level of insurance. Ironically, even if you are to bring a claim your underinsured or uninsured motorist coverage, that insurer is not named a party. They cannot be named. You're actually naming the individual who's at fault. So I think that's another very interesting disparity, even when there is coverage for this other part that you might be able to collect on, that company does not come in. So not to make you repeat all that again. Can you just say that one more time to put a finer point on it, just so for the record? Certainly, I will try to do so. I probably was winded to pay by word. You're good. Generally speaking, if you have coverage outside of your liability coverage in the form, maybe they're under insured motorist coverage or uninsured motorist coverage, some drivers don't have insurance at all. That's where your uninsured motorist coverage can kick in if you individually have it yourselves. Those insurance companies, which is your insurance company, they are not allowed to be named as a defendant. Jury's never hear that. It's the at fault party who's the defendant still. They just, they technically step into the shoes of the defendant up to their policy limits as well. Okay. Is that sufficient, Mr. Chairman? Perfect. There was an argument I understood that had come up regarding if an insurance company is a named party, it's easier to conduct discovery in a civil case and it's easier into the civil practice act to conduct discovery if they're in insured. I'm sorry, I'm sorry, if they're named party to the case and I know all you folks have probably been dealing with this for a while and you probably have some understanding of the civil practice act and the discovery process and a civil litigation. But very generally, part of discovery is the investigation each side will do. What information can I get from the defendant? What information can I get from the plaintiff through written requests or other forms? Those same rules apply, it's a different rule number, 9-11, OCGA 9-11-34, that governs non-party requests for documents and information you want from non-parties. So the same type of document production requests that you can send to a party in the case, you can send to a non-party, you can issue a subpoena, send that to the party, you can take a deposition, a full written court reporter, everybody, present, the testimony will be the same, you don't need an insurance company. Do you know how many, excuse me, insurance companies? I have ever seen being deposed, even though there are party and a lawsuit zero it. They don't care, the plaintiff's don't, they need them for another reason, they don't need information from them. Other than a copy of the insurance policy, that's about the effect of it. I'll pass on also, I think, I agree with what Mr. Siphon had said about demands and policy limits. Once the policy limits are made known and every party is entitled to know that, and that's certainly no problem, I think that's good. Historically, that number, the demand that is made, say here's what I want from my client, coincidentally happens to match the insurance policy limits. And I've had the exact same experience where you realize, oh, there's an excess policy that maybe it provides additional coverage. I could have a demand for a million dollars. My motor carrier says, oh, I've got this other excess policy that provides more coverage. I provide that to the other side. I get a new demand for whatever the top limit is. Very standard, very standard. And in fairness, I will say they may have to do it to protect themselves too, from legal malpractice. They don't want to undercut and they've got concerns as well too. But I just find it very coincidental, perhaps, why the limits of insurance usually match with the value of their claim often is. What does the repealing statute actually do? Well, it only removes the insurance company from the caption of the case and from being told to the jury, here's another defendant in the case. That's it, zero impact on the underlying insurance coverage, which I think you folks have already heard. It does not change the insurance company's obligations and I think that's very important. If they've got a contract that says they've got to pay up to X, that's what they have to pay up to. End of story, it's a very simple scenario. And motor carriers and drivers, of course, still required to have those minimum, at least the minimum amount of insurance coverage. And I know many carriers that have much higher than that as well. And short, really, you know, lawsuit against the trucking company is just like any other lawsuit as if either of you folks were defendants in the case. There is literally nothing different about the process. It's the same other than if you're not a corporation, you get served perhaps differently and whatnot. But that's like any other corporation that gets sued. The only distinction with the direct action statutes is as we know, defined to this group of, let's say roughly 83,000 motor carriers in the state who may be subjected to it. The rest of the state is scot free. They don't have to deal with such an issue. Briefly, I know George has been ranked as the number one state for conducting business. And I applaud the state for that and all its efforts in encouraging business. I think it's an honor that we should be proud of. I don't know if it's been brought to the study committee's attention. We're also the number one ranked state on the judicial hellhole list, which Senator Jones, I see you nodding your head. I'm sure everybody may be avert of that. That's fantastic. And what I think, I'm sorry, sir. Oh, excellent. Very good. I suspect you may have American Torture Forum Foundation as it puts out an annual list. And I'm not proud to say that George is at the top of it right now. What I think is sort of interesting is who's number three and four, number states three and four, California and New York respectively. And I look them up under the area development magazines, business ranking. California is not even in the top 20. New York's number 16. My point being, I think these direct action statues have a direct correlation to being ranked number one in the state. And I don't know how long that can continue quite frankly. When we see the type of nuclear verdicts, when we see the type of, I'll say, unfriendly business litigation that exists in the form of a direct action statute. And the Georgia Supreme Court does have some limitations in what it can do. It's come out with a number of opinions, including as late as I recall one from June of 2022. That said, some of these issues that relate to trucking in other areas, policy, public policy concern that legislation needs to take care of, or not the judiciary. And I don't disagree with that. And that's why I think it's so important that you folks do do something about it because the courts can't. And they've told us all of that. I'm here as also as a board member of the Georgia Motor Trucking Association, wonderful organization. And I know Ed Crowell has testified before you folks before as well during one of your meetings. And I know they strongly support legislative efforts to try to rid the state of the direct action statute. And I know they were also very involved in the Senate Bill 191 process from one understand as well. With that, I'm very open to questions of any sort, be glad to take them. And thank you all for your time. Thank you for the very thorough presentation, Senator Jones, you have questions. Well, I can make some up. I can do whatever you want to do. Well, Senator. I really have to go back to the question I asked, the last presenter, and he was very gracious in his comments. And I'm just trying to think of how do we move the needle here at the General Assembly? This issue has been around by as long as I've been around. And that's 19 years at his body, by the way. So what is it that the industry, if you will, can offer up in terms of reforms? And I guess another issue is, as I think about this, I know there are some minimum levels of insurance that I'm assuming by the insurance commissioners office. What if, as a result of repeal in this legislation, I do apologize, by the way, that we looked at doing something with those minimum levels? Yes, sir. Very good question. And I appreciate it like I had mentioned earlier. I did ponder that while when you asked Mr. Siphon about it. And I don't have a definitive answer quite sure. I did mention, I truly do feel that sometimes when you have a scenario that just needs to be corrected. I don't know or understand or care to know enough about the politics behind how it gets done. I'm very frank with you about that. Try and educate you a little bit, by the way. I'm getting that. I'm getting that. But I think what I do also think is important. And if we looked at insurance premiums, I'll say, I'm sorry, insurance limits, which I think is a completely different topic, but I think it's, I understand what you're saying about it. And I'll say this, you take out the insurer from being a name party in a lawsuit. I think it helps with a lot of issues. Jurors, maybe they will award more. And then insurance companies will be on the hook for more. On the flip side of that, I will say, increased liability limits come with extremely high premiums, which based on, I remember hearing a figure perhaps 17,000. And what if we were able to tamp down the amount that's been awarded, by the way, I think, hopefully the impact would drive those premiums down, rather than up. Well, that's the reform is successful. Yeah, yes, sir. And perhaps Commissioner King might be a better person to talk a little bit about that. But I will say they may. It might very well. I think that's one of direct action statutes, one of many reforms, tort reforms that insurance companies look at. I know it's a little bit beyond your scope, but there are countless others that I think a lot of you folks have explored from phantom damages. A lot of different issues. And I think phantom damages quite frankly, is it, is one of the larger issues when I see what medical providers are doing in terms of costs of coverage for individuals involved in litigation, but I think that's perhaps another committee and another day. Does that answer your question? Senator Jones, I'm sorry. I'm sort of. And I think there's no secrets around here that generally my caucus is opposed to action like this. Yes, sir. But with something that I could share with members of my caucus that tend to lean more on the GTLA side. Yes, sir. And I don't have a very good answer for that. I don't know enough about some of the insurance issues that you raise. So I'd hate to make a suggestion that perhaps is not founded. Thank you. That's limits on lobbying and that's short. That would both. That would. Yeah, I appreciate that question. Senator James, I think. I think. Yeah, I think my my argument to Tony's testify. Yeah. I think my argument to your caucus, Senator James would be I think, you know, we have several thousand, you know, working Georgians, you know, many of them are, you know, their blue collar workers are probably some of them are, you know, even receiving, I think, especially the four hires and some of those families are borderline poverty. I think some of them are they're all working class individuals. And I think, you know, all we're doing is having a conversation about how do we treat this population of Georgians and treating them with the same perspective and equally as all Georgians and not as some other subgroup or sub, you know, class is being victimized by high profile plan of certainties that want to make money. And I think at the end of the day, I believe your caucus would would agree with me, at least in terms of, you know, wanting to support working class Georgians and protect them from frivolous lawsuits. I'm not too sure about that. I've made those arguments before. No, we're on the same page. Well, Senator, thank you for being here. Yes, certainly. I know the other senators, they had a good other meetings, but thank you so much and we'll follow up with you. Thank you much for your time today. With that, we are done. Anna did remind me our next meeting is November 29th at 4 p.m. and room 450 of the Capitol. So that'll be on the first day we adjourn on the 29th. We'll have the study committee report. And at that time, we will vote on it in terms of the recommendations. If anybody has questions, follow up. Let me know or Anna know and thank you. Many adjourned. Thank you. Thanks, Senator. Thank you.",
  "updated_at": "2026-02-14T03:50:55.933029+00:00"
}